{
    "How to Wheelie on a BMX Bike": {
        "description": "A wheelie is one of the oldest BMX tricks there is. To pop a wheelie, you pull your front wheel off the ground while in forward motion and (unlike manuals) continue pedaling, using the speed created by your strokes to maintain balance. With a bit of practice, you'll get more comfortable doing a wheelie on a BMX bike and be able to use it in combination with manuals to link together some of the morecomplex BMX tricks.",
        "content": {
            "Practicing the Basics": [
                " Start biking at a slow to medium speed in an open area. Find a flat, open area that you can practice biking in without any obstacles. After gaining speed, your bike should be able to travel 40 to 60 feet (12 to 18 m) without the need for pedaling.  If your bike is difficult to control and you're feeling off balance, you're going too slow—increase your speed.   ",
                " Place your dominant foot forward before lifting your front wheel. Get used to the positioning your feet properly prior to your wheelie. Before lifting your wheel, position your non-dominant foot down—at the bottom of the circle created during the pedaling motion—and your dominant foot up—at the top of the circle—ready to be pushed forward.  Always keep your knees in-line with the pedals—if you turn them outward too much, you will throw off your balance.  ",
                " Pull back on the handlebars and lift the front wheel from the ground. As you move around, stand up slightly and practice popping the wheel from the ground by pulling the handlebars back until the wheel is about 2 to 3 inches (5.1 to 7.6 cm) from the ground. Keep doing this to get a sense of how heavy your bike is and how much force is required to bring it slightly off the ground.  Right before pulling the front wheel up, get your feet into position and stop peddling.  ",
                " Practice manuals before progressing to wheelies. Pull on the handlebars, stand up slightly, and shift your weight back to lift the front wheel about 2 to 3 inches (5.1 to 7.6 cm) off the ground. Push forward with your feet gently to counter the backward force created by pulling, but don't pedal. This is called a manual and is the precursor to a wheelie.  Keep your arms vertical throughout the manual. Bend your legs slightly so you can easily extend your buttocks outward and inward to maintain balance. For example, if you feel the bike falling forward, extend your buttocks outward behind you to pull the weight of the bike backward. Practice until you can manual for about 5 to 10 feet (1.5 to 3.0 m). Aim to keep your bike about 40 to 45 degrees off the ground.  "
            ],
            "Popping a Wheelie": [
                " Shift your bodyweight back as you ride in a straight line. To prepare for your wheelie, move your buttocks to the back of your seat into the direction of the back wheel. Once your pop your wheelie, you need to maintain this position for balance. Keep your arms straight, vertical, and parallel to each other.  ",
                " Thrust forward with your dominant foot while pulling back on the handles. Position yourself so that your dominant foot is forward—at the top of the circle created during the pedaling motion—and your non-dominant foot is down—at the bottom of the circle. Afterwards, thrust forward with your dominant foot. By simultaneously thrusting the pedal with your strong foot and pulling back, you can enter a wheelie position.  Maintain a greater pulling force than your push, but maintain enough of a forward push that you don't fall backwards. Keep your knees level with the pedals before making your forward thrust. Keep your arms straight with a slight bend in your elbows. As you pedal forward, move the handlebars forward and backward as needed to maintain balance. For example, if the bike begins to fall forward, bend your arms backward and pull the handlebars toward you.  ",
                " Pedal continuously and apply torque to keep your front end up. Continue pedaling and be sure to thrust and create enough torque (the force that causes your wheels to rotate) to maintain your position. At the same time, keep your back end balanced to maintain a straight position and avoid tilting to one side.  Remember to keep your buttocks on the back of your seat to give yourself balance.  If you're starting to flip backwards, stop pedaling and let yourself coast in a manual. Tap your rear brake (not the coaster brake on the hub of the rear wheel) to bring your front wheel down slightly. If you start falling forwards, pedal harder and faster.  ",
                " Disengage from the wheelie by slowing down your pedaling. By slowing down your pedaling, the front wheel of the bike will lower to the ground. Be sure to gradually slow down your pedaling to ensure a smooth landing. You can also hit the rear break to bring the front wheel to the ground, but this is a more abrupt method that should be reserved for emergencies. If you're going to fall backwards, remove your feet from the pedals and jump backwards onto the ground. Keep hold of the handlebars so your bike doesn’t get away from you.  "
            ]
        }
    },
    "How to Do BMX Tricks": {
        "description": "Have you ever watched others do bicycle motocross (BMX) tricks on television and wanted to try them yourself? Now is your chance. It might seem unnerving but when it comes to it, you'll see that it can be great fun. The following is a guide on how to do BMX tricks.",
        "content": {
            "Bunny Hop": [
                " Start riding at a slow pace.   ",
                " Lift up the front tire by pulling up on the handlebars.  ",
                " Push the handlebars forward while in the air. This will raise the back tire.  The entire bicycle should be in the air at this point.  ",
                " Land the bicycle.  "
            ],
            "Barhop": [
                " Ride at a fast pace.  ",
                " Raise your feet on the pedals.  ",
                " Balance the bicycle with your body.  ",
                " Jump over the handlebars.  "
            ],
            "X Jump": [
                " Jump a ramp with your bicycle.  ",
                " Lean back.  ",
                " Center your knees on the seat.  ",
                " Turn the handlebars until your arms make an \"X. \"  ",
                " Straighten the handlebars before landing.  "
            ],
            "180": [
                " Ride at a moderate speed.  ",
                " Lift up the front tire by pulling on the handlebars.  ",
                " Push the handlebars forward while in the air.  ",
                " Twist both shoulders and your head toward the back tire.  ",
                " Land the bicycle.  You will be facing the opposite direction.  "
            ],
            "360": [
                " Ride at a moderate speed.  ",
                " Lift the front tire by pulling on the handlebars.  ",
                " Push the handlebars forward while in the air.  ",
                " Turn your head and shoulders toward the back tire.  Keep your knees bent while doing this.  ",
                " Land the bicycle.  You should have completed a full rotation in the air.  "
            ],
            "Bar Spin": [
                " Allow your bicycle to begin rolling.  ",
                " Slightly pinch the seat with your inner thigh.  Keep the pedals flat while you do this.  ",
                " Pull on the handlebars to raise your front tire.  ",
                " Spin the handlebars while the front tire is off the ground.  ",
                " Catch the handlebars once they make a full rotation.  "
            ],
            "Front-jam Endo": [
                " Ride at a moderate speed.  ",
                " Lift up either foot.  ",
                " Jam your foot in the fork at a 50-degree angle.  The fork is the area between your front tire and the frame of the bicycle. Your back tire will raise, which completes the trick.  "
            ],
            "Wall Ride": [
                " Ride towards a wall at a moderate speed.  ",
                " Do a small bunny hop onto the wall.  ",
                " Pedal the bicycle as you head towards the wall.  ",
                " Lean away from the wall and land the bicycle on the ground.  "
            ]
        }
    },
    "How to Barspin": {
        "description": "Whether you’re riding a bike or a scooter, the barspin is one of the first tricks you should learn. Although it’s only a little more complicated than a traditional bunny hop, it can add a lot of extra style to your regular tricks. By knowing the right hand movements, practicing often, and having confidence in yourself, you can learn to barspin like a pro.",
        "content": {
            "Doing a BMX Barspin": [
                " Perfect your bunny hop . Start riding your bike at a comfortable speed. Using your arm muscles, pull the front wheel of the bike upwards. As you do, shrug forward with your shoulders and use your leg muscles to lift the back of the bike up as well. Take some time to practice getting both wheels off the ground before you add in any bar spinning.  A bunny hop can be broken down into a front pull and a back hop, both of which involve lifting one wheel off the ground. Practice each of these before trying to do a full bunny hop. The higher your bunny hop is, the more time you’ll have to do a barspin. Work on getting your bunny hops as high as possible. Try and keep your wheels roughly level when you do a bunny hop. This will make the landing easier and give you more control as you do tricks in the air.   ",
                " Practice spinning the bars on the ground. Sit on your bike and press the back wheel against a wall to keep it from moving. Raise the front wheel off the ground slightly so that it can move freely. Lift one hand off the handlebars as you use the other to pull one side of the bars towards you, setting them spinning. Let the handlebars spin a full 360-degrees before catching them with the opposite hand on the opposite handle.  It’s much easier to practice this on the ground than it is in the air. Get the motion of the handlebars and your hand movements perfect before you combine it with the bunny hop. If you ride with your right foot forward, you should use your right hand to start the barspin. If you ride with your left foot forward, use your left hand. This will reduce the chance of the bar hitting your knees as you spin it. Practice doing a barspin in both directions to see which method is most comfortable for you. Whichever one feels best is probably the best way to go.  ",
                " Start riding along the ground at a comfortable speed. Unlike some other tricks, the barspin doesn’t need a lot of speed. Start pedaling until you reach a speed that you’re comfortable with.  If you’re worried about crashing, practice your barspin on a soft surface, such as grass, instead of on pavement or concrete.  ",
                " Do a bunny hop as high as you can. Once you’ve reached your desired speed, wind up and do a bunny hop. Once you're in the air, begin leveling out your bike. Try and keep the front wheel slightly above the back wheel, as the front will drop slightly when you spin the handlebars.  ",
                " Spin the bar. Using the same movement that you’ve practiced, pull one side of the bar towards your body as you lift your hands slightly away from the bar. As you do so, stay focused on the bar so that you can catch it as easily as possible.  Always pull the bar towards your body, rather than pulling it up or pushing it down as you spin it. Pulling it towards you will keep the bike level, where anything else will throw of your trick. Spin the bar as quickly you can after getting the bike level. The sooner you spin, the more time you'll have to regain control of the bars before landing the trick.  ",
                " Catch the bar and land the trick. As the bar spins back around to its original position, catch it and drop both hands back onto the handlebars. Bend your knees slightly to soften your landing and push the back wheel down slightly so that it hits the ground first. As you do, straighten the front wheel to prevent your bike from swerving to complete the landing.  Let your knees bend naturally as you land, before standing back up slightly on the bike. This will absorb some of the shock of hitting the ground. Pulling off the landing is the most important part of a trick! Hold on tightly to the handlebars and bend your knees slightly as you land. This will help make sure you maintain control of the bike after it hits the ground. Keep your hands hovering over the handlebars as you let them spin and wait to catch them. You’ll only have your hands off the handlebars for a second or two at the most, so don’t move them too far away.  "
            ],
            "Barspinning on a Scooter": [
                " Practice spinning your handlebars. Keep the scooter still and lift the front wheel off of the ground to practice the barspin. As you stand on the scooter, lift your non-dominant hand away from the handlebars and spin them towards your body with your dominant hand. Keep rotating the bars as far as you can move them.  To keep your scooter still while you practice, you can put the back wheel up against a wall. Alternately, you can just stand on the brake on the back of your scooter to keep it from moving. You could also position the scooter so that the front wheel is over a curb and isn't touching the ground.  ",
                " Learn to catch the handlebars. Once you have rotated the bars as far around as you can with your dominant hand, reach your non-dominant hand under the dominant one to grab the other handle as it comes. Keep spinning the bars towards their starting position, rotating your dominant hand back to a normal, forward-facing grip as you do.  Keep on practicing until you can do this one smooth motion. It’ll be much easier to do the trick when you can spin your handlebars without thinking about it. Once you’ve got the movement sorted, you can practice spinning while the scooter is moving. Stand with your legs shoulder-width apart and swing your scooter between them so it moves front to back. When the scooter reaches it’s highest point in front of you, try and spin the handles. This is the best way to mimic a real barspin without you having to leave the ground.   ",
                " Practice the perfect bunny hop. In order to do a barspin, you’ll need to get some air with a bunny hop. Start riding your scooter at a comfortable speed and then jump straight up in the air. As you do, hold onto the handlebars of the scooter and lift it up with your body. Practice doing a bunny hop until you can jump easily and as high as possible.  The higher you jump, the more time you’ll have to get your barspin perfect and regain control of the handlebars before you hit the ground. See how high you can bunny hop. Make sure you keep your feet firmly planted on the deck of your scooter and keep your front wheel straight when you land your bunny hop.  ",
                " Combine a bunny hop with a barspin to complete the trick. Start riding on your scooter at a comfortable speed and do a bunnyhop, keeping your scooter level. As you reach the highest point of the hop, use the hand movement you practiced to spin the bars around and catch them again.  Hold on tightly to the handlebars and bend your knees slightly as you land to give you more control over the scooter when you’re back on the ground. If you’re worried about crashing, you can practice on a softer surface like grass first. You don’t need to be moving to do this, just practice jumping and spinning the bar until you’re ready to try it while moving.  "
            ],
            "Adding to the Basic Barspin": [
                " Try hopping over obstacles as you barspin for an extra challenge. Put down a small box or another obstacle to practice jumping over while doing a barspin on your bike or scooter. Start riding towards your obstacle, and jump at the last minute to pull off a barspin directly over it.  This will add a little bit more of a challenge to the trick and make it look much cooler. Try jumping over cardboard boxes, off of curbs, or over anything else you see in your path.  ",
                " Barspin out of a jump or a ramp for some more airtime. Rather than using a bunnyhop to get the air you need to pull off a barspin, try going over a jump or out of a quarter pipe to get the wheels of your bike or scooter off the ground. As you reach the highest point of the jump, spin the bar and straighten it up to land.  This might take some more practice to do perfectly, but keep at it! After all, practice makes perfect.  ",
                " Spin your bar around more than once to do a double barspin. After you’ve gotten the hang of the barspin, see if you can spin the bar around two times or even more while your scooter or bike is in the air. Make sure you practice this and get plenty of air before trying to do a double barspin!  If you get your air off of a big enough jump or out of a quarter-pipe, you might even be able to spin the bar more than twice. See how many spins you can do, but make sure you always put your safety first.  ",
                " Let go of the bars completely as you spin to add more difficulty. If you’re doing a barspin on a scooter, practice spinning the bars without holding onto them. Use your dominant hand to pull one side of the bars toward you and start it spinning before catching them as you land. This might take more practice, but it will be even more impressive.  "
            ]
        }
    },
    "How to Tail Whip": {
        "description": "Tail-whips can be done on both scooters and BMX bikes, and it's a great starter-trick that you can use to build skills and improve, regardless of your ride of choice. It takes balance, technique, and practice, but the tail-whip is both flashy and relatively straight-forward. With the right approach, you can do it. See Step 1 for more information.",
        "content": {
            "Tail-Whipping on a BMX Bike": [
                " Practice your jumps and airing out. To do a BMX tail-whip, you'll need some serious air. It's hard (though not impossible) to tail-whip from the ground, so practice on a quarter-pipe or other jump that you can get up off the ground high enough to whip the bike around safely and have a chance of landing it. Practice getting big air and turning around clockwise to aim forward as you land.  One good exercise when you're trying to learn is to kick off your far leg. If you're turning to your right, practice lifting your left foot off the pedal and bringing your knee up while you picture yourself tail-whipping. Then, bring your foot back to the pedal for the landing. This will help you get the timing right and practice your form.  The steeper the transition, the easier the trick. For some BMXers, it's easier to transition between a quarter-pipe and a wedge to land more safely. Do some experimenting and perfect getting good air before you try to tail-whip.   ",
                " Wait until you've completed a quarter-turn to kick the bike. As you're transitioning, it's usually good to kick the bike when you're just starting to turn around in the air, not quite to parallel, but in between your jump and your transition. It'll take some work to get the timing right, but you want to make sure you've got enough time to get the pedals controlled under you before you come crashing down.  ",
                " Kick the bike with your turn. If you're transitioning to the right, you'll kick the bike with your right foot, and vice versa. Usually, the best place to kick the back is on the frame, right under the seat. It's also less of a \"kick\" and more of a push, using your motion and gravity to follow through and ease the bike around. Most of the \"whip\" is done then with the wrists.  ",
                " Do the \"washing machine. \" Keeping the corny dance-move called the \"washing machine\" in your mind is actually a good way to get the proper arm motion down for doing a tail-whip. You want to rotate your arms around in the direction of your turn (clockwise, if you're going right) and, keeping a firm grip on the handles, whip the bike around as quickly as possible as you continue turning in the air.  ",
                " Catch the pedal with your left foot. The hardest part of the trick is catching the bike under you and getting your feet back on the pedals. If you can catch it and push it down, you'll also be able to quickly find the other pedal with your other foot.  Ideally, you'll get the pedals under you for the safest and most comfortable landing. If you want, though, you can try a one-footed landing if you can't get it situated in time, and you can use the seat some if you need to. If you need to bail, just letting go of the bars should usually lets gravity do its work. The bike will continue on it's trajectory away from you, and you can use your knee-pads to land safely and  ",
                " Guide the bike where you want it to go. When you're trying to wrangle the bike back into position, use your arms as much as possible to fight gravity. Make it go where you want it to go to ensure a successful landing. Bring it back and under you to position it correctly and nail it. Keep practicing, and you'll get it eventually.  "
            ],
            "Tail-Whipping on a Scooter": [
                " Practice bunny-hops first. If you start immediately with the tail-whip, chances are you'll hurt yourself. It's important to practice the little things first to build the skills necessary to complete a tail-whip. It'll be much easier to teach yourself slowly, practicing the steps leading up to a successful tail-whip.  To do a bunny hop, stand on your scooter and bounce straight up, keeping your feet on the board at all times, and landing safely on two feet. Practice landing smoothly to get used to the feeling of landing on the wheels and controlling it. To land a tail-whip, you'll have to be able to do this in your sleep.   ",
                " Practice kicking the scooter out. Another good skill-building exercise is to practice stepping off the scooter and kicking it as you would in a tail-whip, except that you'll be standing on the ground.  To do this, ride the scooter slowly and then step off the board with your right foot on the left side of the board, and kick the scooter around (counterclockwise) with your left foot. Practice stopping the board with your kicking foot to get a feel for how to control the spin with your wrists, and how to stop it safely.  ",
                " Practice jumping and whipping, but land on the ground first. The next step in slowly learning to tail-whip is to combine the two skills you've already practiced, but basically bail-out and land on the ground. It's harder than it seems like it might be to jump and whip at the same time, so don't force yourself to try to nail the landing in addition to learning those necessary skills.  Scootering at a slow speed, do your bunny hop and kick the scooter around with both feet, holding onto the bars and controlling the spin with your wrists. Land flat on the ground with both feet and practice bringing the scooter down firmly in front of you, in the proper position for you to land on it. You might start trying to land with one foot, or at least stopping the scooter with one foot before you try a full-on landing.  ",
                " Try to land. It'll take a lot of practice to put it all together, but you can start by trying it standing still, doing a bunny hop and tail whipping around to try to land, but it's actually a little easier to do it in motion. Go at slow speed and don't be afraid to bail if it doesn't quite work out.  ",
                " Keep practicing. This is the foundation for lots of scooter tricks, so it's worth sticking it out and trying to learn it, no matter how long it takes. Don't give up!  "
            ]
        }
    },
    "How to Roll in on a BMX": {
        "description": "How to do tricks on a BMX, such as rolling in, bunny hop, and manual.",
        "content": {
            "Roll In": [
                " Once on the top of a quarter pipe get at an approximate 45 degree angle to the quarterpipe.   ",
                " With your pedals level, roll at a fairly slow speed into the quarterpipe.  ",
                " Lean into the quarter but not to far as you will feel yourself begin to nose manual.  ",
                " As you roll down the quarter pull back slightly to avoid crashing over the bars and tasting dirt.  ",
                " If the specified angle does not suit you try a different one. But avoid going straight into the quarter as it is very scary and difficult. "
            ],
            "Bunny Hop": [
                " Put your feet on your pedals and level them out.  ",
                " Bend your knees and your elbows.  ",
                " Lift up and forwards on the handlebars.  ",
                " pull the back of the bike up by tucking your legs so that your butt is close to your seat (it helps to have a low seat).  ",
                " Land flat or on the back tyre - NOT on the front tyre as this is more painful and less controllable.  "
            ],
            "Manual": [
                " Start at a speed you like.  ",
                " Pull up on the bars and lean back, making sure your legs are slightly bent and one or two fingers feathering the back brake. If you feel the front end going down you should push off the pedals (pump) the bike to keep the front wheel off the ground. To counteract this, use the back brake to bring the front end of the bike down. ",
                " Car parking spaces are a good way to keep track of how you've progressed.  ",
                " Find the \"balance point\" of the bike by pulling up harder and harder until you have to put your feet down to stop yourself from falling off the back.  ",
                " The faster you go the more stable the bike will be.  "
            ]
        }
    },
    "How to Do a Surfer on a Flatland BMX Bike": {
        "description": "This is the easiest way to learn a trick that really looks cool, and is really fun and easy to do.",
        "content": {
            "Steps": [
                " Ride at a medium speed. The faster you ride the easier it is to balance. The slower you go, the harder it is to get up to the surfing position, but easier to bail the trick if something goes wrong.  ",
                " Stand on the back pegs. This is just to get your feet off the pedals. ",
                " Use one foot to rotate you pedals to a horizontal position. This will make it easier to get out of a surfer. ",
                " Place the foot of the weaker of your two legs on the top tube of the frame. Near the seat is best. ",
                " Put the other foot on the handlebars. It should be parallel to the handlebars, with your heel close to one brake and your toes close to the other break. Imagine how it would be if you were skateboarding. Your feet wouldn't be pointing forwards. ",
                " Bring the other foot that was on the frame onto the seat.  ",
                " Make sure that you have the confidence to continue. This trick is 90% guts from here on out. ",
                " Let go of the handlebars with your hands, as hard as it may be.  ",
                " Straighten yourself out and enjoy the view.  ",
                " Coast for a while.  ",
                " Put your hands back on the handlebars to get down and find the pedal that is forward.  ",
                " Put the foot that is on the handlebars and place it on that pedal.  ",
                " Take your other foot off the seat, and place it on the other pedal. If all went well, you just did a surfer. ",
                " Ride away.  "
            ]
        }
    },
    "How to Do Pogos on a Flatland BMX Bike": {
        "description": "This is an easy way to learn how do pogos. Pogos aren't the coolest tricks to watch, but they help with techniques that are essential for flatland BMX.",
        "content": {
            "Steps": [
                " Ride at a slow speed.   ",
                " Put the pedal of your strong foot forward. This will help when you are done with the trick. ",
                " Put both of your feet on the back pegs.  ",
                " Squeeze the front and back brakes at the same time. This will make you do a small endo. ",
                " Lean back as the back of the bike is on its way back down and yank on the handlebars. This will make the front end come up. ",
                " Start hopping when the front end is high enough off the ground. You keep your balance by hopping slightly in the direction you are falling. For example, if you are falling back, hop back a little bit. ",
                " Put the front back down and put your foot to the pedal you put forward at the start of the trick.  ",
                "Push down hard, or you may fall over before you go anywhere ",
                " Ride away.  ",
                " Add some fun elements in the trick to make it look interesting. Some of the things you may like to try are: Add a bar spin. This means take your hands off the handlebars and spin them between two hops.  Jump the front pegs while the bike is being let down and start hopping in them. After you are done, put your feet to the pedal and ride away.   "
            ]
        }
    },
    "How to Do a Wheelie": {
        "description": "Popping a wheelie is a great way to impress your friends or look cool on a bicycle or motorbike. Although it's one of the easiest tricks to learn, if you don't have your balance right it can be a difficult one to master. By accelerating quickly, pulling up on your handlebars and knowing how to position your weight for balance, you can learn to pull off a wheelie on almost anything with two wheels.",
        "content": {
            "Doing a Wheelie on a Bicycle": [
                " Set your seat to a middle position. One of the biggest problems when trying to do a wheelie is overbalancing and falling backward off of your bike. Set your seat so that it is at a medium height or in a middle position, to help adjust your center of balance and make the trick easier.  As you get more practice at pulling off a wheelie, you can adjust the seat height to whatever you want. Keep in mind that this may change your center of gravity and mean you need to relearn how to balance your bike.   ",
                " Lower your gears as far as you can. When you're first learning how to do a wheelie, you don't need to be going very fast at all. In fact, it'll be much easier to do your first wheelie if you are going slowly. Set your gears to a low gear, between 1-1 and 1-3 to practice.  As with the seat height, you can adjust the gear whenever you want. You should be able to do a wheelie no matter what gear you're on. It's much easier to learn on a lower gear, though.  ",
                " Find a large area where you can practice. It'll be much easier to get the right build-up and pull off a wheelie if you can find a large space to practice. Go to a local park or a large field so that you can practice doing wheelies without having to turn around too often.  Local parks will be great as they are both large and grassy, which will mean you're less likely to get hurt if you fall off your bike. If you don't have a big park nearby, you can also practice on an empty sidewalk, a very quiet road, or anywhere that you can safely ride a bike. If you can, try practice your wheelies on a very gentle uphill incline. This will make leaning backward and balancing the wheelie more natural.  ",
                " Start cycling at a slow to medium pace. Get on your bike and start pedaling to build up a little speed. You should aim for something slightly above walking pace, which will give you just enough speed to pull off a wheelie without going too fast.  Once you gain more confidence, you can start doing wheelies when traveling at a higher speed. Start slow and gradually get faster as you practice doing a wheelie.  ",
                " Hold the pedal with your dominant foot at the 2 o'clock position. As you're cycling, work out which is your dominant or stronger foot. Cycle that foot around until it is at the 2 o'clock position on the rotation of your pedals so that you can easily push down on that pedal to quickly accelerate.  If you don't know which is your dominant foot, try doing a few wheelies leading with each foot and see which way feels more natural. Your dominant foot is the foot that you put forward when you feel yourself falling over. While standing straight up, get someone to give you a light shove and see which foot you put forward to stop yourself.  ",
                " Push down on the pedal sharply and lean backward. Use your dominant foot to push down on the pedal, quickly accelerating the bike and lifting the front wheel slightly. As you do this, hold onto the handlebars and lean backward to pull the front of the bike off the ground. Once you've done this, you've done your first wheelie!  Start with small wheelies at first and slowly try and bring the front wheel higher and higher off the ground as you get a better sense of the balance of your bike. It's much safer for you to undershoot the wheelie and let your bike land back on the front wheel than it is to overshoot it and fall backward of the bike. If you feel like you're going to fall backward, pull on the rear brake. This will stop the back wheel from moving and set you back down safely on the front wheel.  ",
                " Shift your weight around slightly to find your point of balance. Once you've lifted the bike off of the ground, start shifting your weight back and forth on the bike to try and find a point of balance. It might take a long time to work out the best position to be in to keep your wheelie going. Keep at it, and eventually, you'll get it right and be able to hold your wheelie for longer.  If you feel yourself falling backward, tap on the rear brake to lean forward slightly. If you start falling forward, pedal a little faster to gain some more acceleration and tilt backward a little. Keep in mind that you'll also need to maintain your balance side to side. Try and keep your weight centered down the middle of the bike to prevent yourself from tipping over. If you feel yourself tilting to one side, slightly shift your weight to the other side or turn the handlebars the other way.  ",
                " Tap the rear brakes and straighten the front wheel to land the wheelie. Once you start losing balance, you see a shift in terrain coming up, or you just want to stop, hold down the rear breaks to end your wheelie. As you do, make sure that your front wheel is aligned with the rest of the bike. If it's slightly off or facing another way, your front wheel will swerve when it touches the ground and you could fall off.  Try not to land on your front wheel too harshly. While front suspension will cushion some of the blow, you don't want to put the wheel under any unnecessary stress.  "
            ],
            "Doing a Wheelie on a Motorbike": [
                " Wear full protective gear. Riding a motorbike can be dangerous enough without trying to do tricks on it as well. Always wear full protective gear when riding a motorbike, and especially when practicing tricks.  Full protective gear includes a helmet, face shield, gloves, jacket, pants, and proper boots. Make sure everything is covered to prevent serious injury if you fall off.  ",
                " Find a quiet stretch of road to practice. In order to pull off a wheelie, you'll need space to get up to speed, do the wheelie, and land it safely. Try and find a long, flat stretch of road that won't have many cars on it. Take some time to practice riding up and down this road to see how your bike rides and brakes on it.  Make sure the road doesn't have any big potholes, cracks, or anything that could throw your wheelie off unexpectedly. Find the smoothest, bump-free road that you can when first starting out.  ",
                " Start riding on first gear at around 25 to 30 kilometres per hour (16 to 19 mph). Start riding your bike and get it into first gear. You don't need to reach a very high speed when first learning how to do a wheelie. Aim for something around 25 kilometres per hour (16 mph), which will let you easily pull off a wheelie without going too quickly.  ",
                " Snap the throttle back when you reach 6000rpm. Keep riding your motorbike until you get to a comfortable speed and your torque is high enough that the RPM meter is around 6000. In a quick, singular motion, pull the throttle back to quickly accelerate your bike and lift the front wheel off the ground slightly.  As you do this, lean backward on your bike to lift the wheel up further and get a higher wheelie. This will take a little practice to avoid getting too high, so start small at first. Rotate your hand slightly forward and around the throttle before you pull it backwards. This will make pulling back on it sharply much easier, as well as naturally bending your elbow to help you lift up the front of the bike slightly.   ",
                " Move around on the bike to balance it. Once you get the front wheel off the ground, you'll need to maintain the balance in order to keep your wheelie going. Shift your bodyweight backward to lower the center of gravity, and use the rear brakes and throttle to tilt the bike slightly forward and backward as you need to.  If at any point you feel like the bike may start “looping” and fall back onto you, hold down the rear brakes immediately. This will stop the wheelie and set you back on the ground.  ",
                " Lean forward to bring the front wheel back down. The final part of a perfect wheelie is landing it. Lean forward to bring the front wheel toward the ground, staying on the throttle until you have landed. Once both wheels are on the ground again, ease off the throttle to begin slowing down.  If you need to bring down the front wheel very quickly, shut the throttle off and don't accelerate again until the wheel is just about to touch the ground. Tap the throttle just before the front wheel touches down to soften the landing slightly.  "
            ]
        }
    },
    "How to Bunny Hop on a Bike": {
        "description": "A \"bunny hop\" is a bicycle trick that involves jumping both the front and back wheels off the ground at the same time. The trick will allow you to launch your bike into the air to avoid or jump over obstacles. The bunny hop is really a combination of two moves, the front pull and the back hop, which you must master individually before combining them to execute the bunny hop. With a little bit of practice, you'll be bunny hopping in no time!",
        "content": {
            "Mastering the Front Pull": [
                " Ride at a slow to medium speed and lean back slightly. Stand up out of the bike seat while keeping your pedals parallel with the ground. Keep your elbows and knees loose and slightly bent, and bend at the waist so that you are positioned above the bike seat rather than behind it.  When you stand up, position your head directly over the front wheel.   ",
                " Sink your weight into the front wheel and then pull your handlebars upward with your arms. Use the momentum you get from shifting your center of gravity back to explode straight upward. While you are pulling up with your arms, push your feet into the pedals, applying an even amount of pressure to each one.   ",
                " Lift the front wheel off the ground by pulling with your arms. Once you've gotten the bike as high as you can by just leaning back, pull it up with your arms until the bike is standing up, and you're standing up with it.  Keep your pedals level through the whole maneuver.  ",
                " Drop the wheel gently back down to the ground. You haven't mastered the front pull until you can place the front tire down with carefully controlled motion, rather than just let it snap back to the ground.  "
            ],
            "Executing the Back Hop": [
                " Shift your weight forward. Do this quickly, but not so quickly that you \"throw\" yourself forward and shake the bike. ",
                " Snap your heels up quickly and then pull the pedals up with your feet. Pull them up so that your feet are almost vertical.  ",
                " Press back against the pedals as you push your legs up. Your feet will make a scooping motion backward. The pressure you apply to the pedals, with your feet in a horizontal position, will keep your feet on the bike as you pull the back end up with your leg muscles. ",
                " Use your leg muscles to lift the back wheel up and off the ground. Shrug your shoulders and then push or roll the handlebars forward as you do this.  ",
                " Drop the back wheel gently back down to the ground. Just like with the front pull, you haven’t perfected the back hop until you can delicately place the back wheel down, rather than drop it sharply to the ground.  "
            ],
            "Combining the Front Pull and Back Hop": [
                " Maneuver into a front pull to begin. As you’re doing this, shove your mass into the ground through the back wheel. This will give the rear wheel a bit of \"bounce\" to help you take off when you move into the back hop.  Pull the front wheel up to maximum height before transitioning to the next part of the maneuver.  ",
                " Snap your heels up quickly and then pull the pedals up with your feet. Once you’re front wheel is in the air, snap your heels upward so that your feet are almost vertical.  ",
                " Press back against the pedals as you push your legs up. Point your toes and then push back with your feet, “scooping” backward. Use the push/pull motion to get the back wheel up (while the front is still in the air).  The pressure you apply to the pedals, with your feet in a horizontal position, will keep your feet on the bike as you pull the back end up with your leg muscles.  ",
                " Shrug your shoulders and push the handlebars forward. You will do this at the same time as scooping back with your feet, creating a motion almost like a gear shifting.  Try to stay focused on technique rather than worrying about the speed you’re traveling as you bunny hop.  ",
                " Level your bike in the air. Squeeze your legs together while you are in mid-air to get a more defined looking bunny hop. Remembering to level the bike is an important habit to establish for when you eventually start bunny hopping onto higher surfaces.  ",
                " Lower your rear wheel back down to the ground first. It stabilizes your landing and makes controlling the bike easier immediately after landing. Only land with your front wheel first when you need to regain front wheel control and traction immediately, such as when you need to make a turn immediately after the hop.  Practice this in grass before you try it on pavement or out on the trail. If you feel like you are about to start falling during a bunny hop, try to fall uphill and onto grass for a softer landing.   ",
                " Practice bunny hopping over various obstacles. Bunny hopping is a bike trick, but it’s also a very useful maneuver when it comes to avoiding or jumping over obstacles in your path when you’re on a ride.  Set up obstacles to practice bunny hopping over, starting at a height of about 6 inches and increasing the height as you get comfortable with each hop.  ",
                " Experiment with bringing both tires up at the same time when hopping over obstacles. This is an additional technique that involves jumping, just like you would on the ground, except during this you are one with your pedals.  Simply jump while twisting forward on the handlebars of the bike, but don't let your feet come off the pedals. If you keep your feet on the pedals and jump, the back end will come up. Then bring up the front end at the same time as the tires. You will be pulling up without pedaling.  "
            ]
        }
    },
    "How to Ride No Handed on a Bike": {
        "description": "Riding without hands can be a fun and exciting thing to do, but it can also be dangerous if you don't practice and stay alert!",
        "content": {
            "Steps": [
                " Try riding one-handed with each hand. You may find that one hand is easier to ride with than the other.  If you practice enough it will become easier.  ",
                " Once you get the hang of riding one handed, try taking your hands off of the handlebars for a few seconds at a time. Keep them close so you can grab the bars again and not fall if you get nervous.  ",
                " When you're ready to give it a try, find somewhere with lots of open space that slopes downhill slightly. This will let you coast downhill and maintain your speed without pedaling. ",
                " Keep your center of gravity low. Focus your weight on the seat and pedals before taking your hands off the handlebars. ",
                " Take your hands off of the handlebars, but only lift them about one inch above the handlebars at first because then you can easily regain control of the bike by grabbing the handlebars if necessary.  ",
                " Practice going in straight lines, eventually you will become comfortable enough to try making turns by leaning.  ",
                " To turn while riding no-handed, move your lower body in the direction you want to turn, but try to keep a grip on the bike with your knees and keep your upper body straight. Pointing your knees in the direction you wish to turn helps.  "
            ]
        }
    },
    "How to Impress Your Friends on Your Bicycle": {
        "description": "Have you ever been riding bikes with a friend, and wanted to impress him or her? Well, even if you haven't, this guide will  show you how. So take out your bike, put on a helmet, and get ready to have some fun. The following guide will show you how to do a few tricks.",
        "content": {
            "Steps": [
                " Ride No Handed: This is a pretty easy trick to master.  When you are starting out, find a stretch of flat road without any cars. Slowly lift your hands a few inches above the handlebars. If this is too hard, you can first lift one hand, and then the other hand. Once you do this often, you will master it easily. Note that some bike frames are not built with a relaxed enough geometry for this to be possible. Riding no-hands is more dangerous on these bikes, as their ability to right themselves and ride straight is reduced, or absent. This is true more with older or more expensive road bikes. Cruisers and mountain bikes are good candidates for this trick. Another way is to ride at a slightly fast speed,like going downhill,and let your right(or left) foot to make the pedal go down.At this rate your right(or left) foot is balancing the other foot so now you can lift your hands until you got the hang of it.   ",
                " Ride No Handed (another way).  Start coasting, and stand on your pedals. Lean forward until your thighs are resting on the handlebars. Stand up straight and lean back, keeping your body behind the front axle. It feels sketchy, but you can coast like this and even turn. Don't use your front brake too hard or you'll faceplant. With long enough legs and a small enough frame, you can even pedal in this position, but if not you may hit the stem. Watch out for the family jewels when attempting this!  ",
                " Do a Wheelie.  Think about jumping high in the air. Do this while holding on to your handlebars, and tilt back a little. Some people can do this for a second, while others can go down a whole street on their back wheel.  ",
                " Do an Endo.  When you're going to stop completely, and want a bit of a flourish, use only the front brake, gradually adding more and more pressure (too much and you faceplant, don't lock it up at once). Lean forward and brake on the front. Soon you'll be balanced on your front wheel.  ",
                " Stand on your bike. (Very dangerous!) Get decent speed on a flat or slightly sloping road. Then put one foot on the seat while coming up. Take the other foot and put it on the seat. Gradually loosen your grip on the handlebars. Stand or crouch for a few seconds no handed and then drop back down.  ",
                " Stand on your pedals.  Raise your rear end up off the seat. Stand up and pedal!  ",
                " Skid.  slick pavements are best for this, and don't try this on a bike that has really skinny tires get decent speed see your target roll towards them then hammer on the back brake turn your handlebars slightly to one side let the bike slide if it goes too far, get off the back brake then roll away normally NOTE this is really bad for your back tire, only do this when looking good is really important. make sure your tires are properly inflated before attempting  "
            ]
        }
    },
    "How to Manual a Mountain Bike": {
        "description": "A Manual is a technique in which we manually lift the front wheel and roll along the rear wheel without pedaling. Manuals are useful in every sort of riding like street, trial, 4X, mountain.",
        "content": {
            "Steps": [
                " Start by rolling along in medium pace. You should not be slow as balancing becomes difficult at slow speeds.  ",
                " Shift your body weight in front of the bike gently. Don't do it aggressively; as it is only used to create forward momentum.  ",
                " And in fluidity shift your body weight at the rear of the bike and gently pull on the handlebars.  ",
                " When you are on the rear wheel try to find the balance point using your brakes and legs.  ",
                " When you feel you are going too high you could just bend your knees a little bit or tap the rear brake gently.  ",
                " When you feel you are going too forwards, immediately straighten your legs and pull on the handle bars until you reach the balance point.  ",
                " Adjust your sideways balance by using your knees and handle bars (if you are going to the right side stick your left knee out and turn your handle bars to left and vice versa).  "
            ]
        }
    },
    "How to Do a Manual on a Bicycle": {
        "description": "A manual, also known as a coasting wheelie, is similar to a catwalk. The difference is that manuals do not require pedaling. The lack of pedaling means that manuals can be done at much higher speeds.",
        "content": {
            "Steps": [
                " Master the wheelie before trying the manual.   ",
                " Get up to a reasonable speed. You want to go fast enough to provide momentum, but not so fast that you can not control yourself.  ",
                " When you are ready to manual, get your pedals parallel to the ground.  ",
                " Load the front wheel.  ",
                " Pop the front wheel off the ground and shift your weight back on the bike in one motion. Your arms should be straight when you lean back. You are not holding the front wheel up with you arms. You are shifting your body weight to balance the front wheel in the air. Your center of gravity should be right over the rear axle. Make sure to have your legs strait so its easier to stay up.  ",
                " See how long you can keep your balance.  ",
                " Pull your body forward and the front wheel will drop.  "
            ]
        }
    },
    "How to Do a Wheelie on a Bicycle": {
        "description": "A \"wheelie\" is a maneuver performed by pedaling a bicycle while balanced on either the rear or front wheel. This sounds complicated and can be quite difficult to master. This guide illustrates some basic steps necessary to perform a wheelie.",
        "content": {
            "Steps": [
                " Find a gear that can comfortably and quickly accelerate the bike from a walking or jogging pace.   ",
                " Pedal and pull back on your handlebars simultaneously.  ",
                " Keep pedaling aggressively and smoothly, leaning back with your arms fully extended.  ",
                "Accelerate quicker if you find yourself having difficulties getting your front wheel off the ground ",
                " Pedal more slowly if you are tending to fall backward.  "
            ]
        }
    },
    "How to Ride a Bike Down Stairs": {
        "description": "Have you ever watched teenagers ride down a set of stairs, and wondered \"how do they do that?\". The truth of it is,it's not that hard. You just need to learn a bit of technique.",
        "content": {
            "Steps": [
                " Find a short set of stairs with small steps to begin with.   ",
                " Pick up a little speed. Go too slow and you will bounce your way down the stairs. Too fast and you're likely to end up airborne. Ideally, you should be going about jogging speed.  ",
                " Ride straight toward the stairs, standing with legs and arms relaxed and slightly bent and eyes looking past the bottom of the flight of stairs.  ",
                " Slide your rear off the back of the seat as your front wheel begins to descend. This moves your center of gravity rearward, making for a smoother and safer ride.  ",
                " Relax, and ride down the stairs using your bent arms and legs to absorb the bumps. If you need them, apply your brakes slowly and softly ; otherwise you will take an alternate route to the bottom of the stairs via a flight over your handlebars.  ",
                " Finish the flight of stairs, slow down, and look toward your next obstacle.  ",
                " Locate a larger and steeper flight of stairs once you are comfortable riding down the short one, and apply the same fundamentals to a larger extent. Get back, relax, look past the bottom of the stairs, and have fun! "
            ]
        }
    },
    "How to Wheelie on a Mountain Bike": {
        "description": "Wheelies can be fun to attempt, and of course they are a sure way to impress your friends. You can do two basic types of wheelie. The pedal wheelie is usually done as a trick, and should be learned first. The manual wheelie or \"coaster\" wheelie is generally considered more difficult. It can be useful on the trail for whenever you’ll need to lift your front wheel over obstacles in your path, such as rocks or tree roots. Whether you choose to attempt one wheelie or both, they'll help you to improve your reflexes on the trail and in the city, plus your overall balance on the bike.",
        "content": {
            "Attempting the Pedal Wheelie": [
                " Wear a helmet. You should wear a helmet just when doing general riding. So it is especially important to wear one when attempting a trick like a wheelie, where you're more in danger of falling than usual. And you'll get the respect of your friends and fellow riders for showing that you're not reckless, and are taking bike riding seriously.  ",
                " Choose the terrain that best fits your ability. You might want to begin practicing on a level grass field in case of a fall. Test the flatness of the field by riding through it once before beginning. Otherwise, if you're confident enough, find a slightly uphill dirt or concrete path.  ",
                " Adjust the seat to a low position. You'll be sitting down for the whole trick, and the lower you sit the better-positioned your center of gravity will be. But make sure you're able to sit firmly on the saddle without slipping off the back. Test this by lifting the front wheel at a standstill and leaning back on the seat.  ",
                " Start off in a low-to-medium gear, at a little faster than a walking pace. If you start in too high or too low a gear, it will be difficult to pedal with enough force to lift the front wheel.  Adjust the gears higher or lower as you find the right speed for your ability and the terrain.  ",
                " Set the cranks at the 11 o'clock and 5 o'clock position. This allows you to put as much drive as possible into your initial pedaling. You'll want to initiate the first thrust from 11 o'clock with your strongest leg, which should be the leg you usually begin pedaling with from a standstill.  ",
                " Shift your weight forward. Bend your arms and move your upper body over the front of the bike in a crouch position, but stay sitting.This will help you to \"load the spring\"--you're positioning your body toward the front at first in order to create more force for the sharp backward movement that will follow.  ",
                " Lean back quickly over the rear wheel. This should be done with a sharp movement, giving a strong pedal stroke at the same time. Let your arms straighten without pulling the handlebars back (the front wheel should pop up without your needing to pull back). Continue pedaling at a consistent rate. If you stop pedaling, the front wheel tends to fall back down. Keep your fingers on the rear brake--this is your safety in case you feel yourself losing balance and tilting too far backward.   ",
                " Control sideways and vertical balance at the same time. Feather the rear brake (to lower the front wheel) or pedal (to lift the front wheel) to adjust the vertical balance. To help balance sideways, flare your knees or arms out, or turn the handlebars in the direction opposite to the side the bike is leaning to.  ",
                " Straighten the front wheel before bringing it down. Lean slightly forward and let the front wheel land softly back down. Be careful not to lean too far forward, just try to shift your weight back to center.  "
            ],
            "Learning the Manual Wheelie": [
                " Wear a Helmet. You'll be going faster while doing the manual wheelie than when doing the pedal wheelie, making a potential fall more dangerous. You'll feel more at ease wearing a helmet by knowing that if you make a mistake and fall, you'll be well protected. ",
                " Start on a slight downhill slope at medium speed. It will be easier to coast with this wheelie on a decline once you've figured out your balance. Since you won't be pedaling, the downhill slope will help keep the bike moving at a steady speed. ",
                " Position your feet and hold the pedals in place. Set the cranks level with each other at the 9 o’clock and 3 o’clock position, and stand up on the pedals with your knees slightly bent. Your weight should be just back of center. The cranks will rotate slightly as you move backwards, but otherwise you won't need to pedal.  ",
                " Lean forward over the handlebars, then lean back quickly. The front wheel should be lifted mostly by the shift of your weight backwards, and only slightly by lifting the handlebars. Lock your arms straight, keeping your feet level with each other on the pedals. Your rear end should be behind the seat at this point, and your body should have a “U” shape, with the arms and legs straightened.  ",
                " Center your weight over the rear wheel. To be able to coast with the front wheel off the ground, you’ll need to find a point of balance over the rear wheel and hold it there. As your arms straighten and you lean back, push forward on the pedals with your feet (but don’t pedal) to adjust your balance.  ",
                " Keep the front wheel 1 to 1 ½ feet off the ground. Steady your balance and coast for as long as you need to. If you feel yourself falling too far backward, feather the rear brakes to bring the wheel down. If the front wheel begins to fall forward, rock your hips in a backward motion while pushing outward on the pedals.  Most obstacles on the trail won’t be much higher than a few inches (tree branches, rocks). But in order for you to be able to coast with the front wheel off the ground, you need to fix your center of balance over the rear wheel, and this should bring up the front wheel at least one foot.  ",
                " Bring the front wheel down steadily. Either feather the rear brakes or shift your center of gravity forward to bring the wheel softly down. If you're avoiding obstacles on the trail, make sure the path is clear before finishing the wheelie--bringing the wheel down directly onto a rock or branch could cause a fall. "
            ]
        }
    },
    "How to Jump a Mountain Bike": {
        "description": "Mountain biking is a type of cycling where bikers ride off-road through varied terrain. One popular subset of mountain biking called dirt jumping features cyclists who perform various jumps and tricks, launching their bikes off of ramps made from compressed dirt. However, learning to do a proper jump can be useful for all categories of mountain biking. If you are interested in this sport, consider mastering correct jumping form and safety.",
        "content": {
            "Getting Ready": [
                " Make sure your bike is in good condition. This is an important part of mountain biking in general but is essential for you to safely jump. Your landing will place much more force than usual on its frame. Additionally, malfunctions become much more dangerous if they happen while you are airborne. Do a safety check before every ride.  If you're not sure your bike is in good condition, visit a bike shop to get it checked out.   ",
                " Be ready to jump. You should practice biking for a while before trying to jump. If you are inexperienced, you are likely to fail the jump and get yourself injured. A successful jump also requires a certain amount of general physical fitness. Keep your body in shape before jumping.  Consider lowering your saddle below its normal level before trying jumps. Otherwise, you may hit your crotch on the saddle during your jump, which can be very painful.  ",
                " Visualize your jump. Before you attempt any kind of jump, look at your ramp. Plan your route to it and picture landing on the other side. A general rule of thumb is that if you can't see yourself landing safely, the jump should not be attempted. If you see a lot of rocks and debris along your route and on the other side, find a different place to jump. Practice jumping using a man-made ramp that is gently sloped and low to the ground. This will allow you to perfect your jumps in a safe, simple environment.  Once you have mastered safer jumps, you may choose to use more challenging ramps. Popular ramps for mountain biking are man-made dirt jumps and natural outcroppings.  "
            ],
            "Starting Out": [
                " Bike towards your ramp. Keep your bike at a moderate speed, riding out of the saddle. You don't want to go so fast as to make a mistake, especially when you're first learning. On the other hand, if you go too slowly you will not be able to clear the jump.  ",
                " Compress your bike once the front wheel reaches the lip of the ramp. Stop pedaling. Push down on the front suspension through your hands on the handlebars. Crouch slightly forward. However, don't lean past the handlebars, which may cause your bike to pitch forward. Do not return to your seat until after you've finished your landing.  ",
                " Explode as the back wheel reaches the lip of the ramp. \"Exploding\" is the term used by cyclists to describe when they stand up straight after compressing, pulling the front of the bike up as they jump. You will be shifting your weight from your hands backward to your feet and subsequently the second wheel. Shift your posture from one that is bunched up to one that is nearly standing. Keep your hands on the handlebars and your feet on the pedals at all times.  When you do this, you're basically jumping up from a crouched position and pulling the bike with you.  ",
                " Enjoy your flight. If you have properly compressed and exploded, you should now be airborne. Take a moment to experience one of the most entertaining parts of biking. Keep your body loose and avoid stiffening up. If your bike did not leave the ground or you got off balance and fell, review the steps and try again. "
            ],
            "Landing Safely": [
                " Return to your ready position. The ready position is the default stance you take while cycling. Keep both your elbows and knees bent and out while riding out of the saddle. Do this before you land.  ",
                " Land on both wheels simultaneously. Make sure your bike is straight with the wheels parallel to the ground while you are still in the air. Shift your weight to level out your bike. Landing with both wheels at once will help absorb the shock better and keep you from washing out.  ",
                " Push the bike towards the ground. Pushing the bike into the landing will create more traction, allowing the wheels to rebalance and grip the ground more easily. Use your arms and legs as your bike's primary suspension. Keep them loose and ready to soak up the impact.  ",
                " Roll out of your landing, rather than braking. Jumping your mountain bike produces a lot of momentum, so it's important that you don't brake right after you land. Otherwise, you may flip over your handlebars. To safely come out of your jump, keep rolling forward to a slow stop. After the jump, your momentum can carry you pretty far.  "
            ]
        }
    }
}