{"How to Keep Bees": {"description": "Raising honeybees can be a fun and rewarding pastime that provides you with all the fresh honey you can eat.  Maintaining just one hive can even provide you with a side source of income, but many people are intimidated by the prospect of keeping a few thousand bees in their yard.  However, honeybees are surprisingly docile and modern beekeeping methods make the process extremely non-invasive and bee friendly.", "content": {"Setting Up Your Hive": [" Buy a home for your bees. While honey bees can create hives in all sorts of spaces, most naturally occurring hives don’t respond well to having honey harvested from them.  Store bought hives are designed to allow you to collect the honey with minimal effect on the honey bees.  Langstroth Hives are the most commonly used in the beekeeping industry because they provide movable frames that won’t interfere with the bees inside when removed. Langstroth Hives will not stick together because they were designed to provide passage for the bees in the gaps between the movable pieces. Top Bar Hives are designed to be more shallow and sit higher for people who have trouble bending over and may be a good choice for people with back issues. Ware Hives are shaped a bit like a house and can be difficult to manage large colonies in, but are great for small hives.    ", " Find a place for the hive. You can keep one colony in most typical sized housing lots.  While many people think that means their backyard may be big enough to house a hive of honey bees, there are some other things you will need to consider before placing your hive.  Find out if there are any zoning requirements for keeping a bee colony in your local area. Make sure no one in your family has a bee allergy. Let your neighbors know about your hive to see what concerns they may have about their families or health.  ", " Make or purchase a hive stand. You will want to keep your honey bee hive off of the ground to make it easier to access and prevent the wood from rotting.  A good hive stand will stand about eighteen inches off the ground to protect the hives from wild animals as well.  A typical hive stand is made of treated 2x4 pieces of lumber laid across stacked cement or concrete blocks. Consider putting down mulch, gravel or stones under your hive stands to limit the mud you will have to deal with.  ", " Purchase protective gear. Honey bees are not the most aggressive species of bee, but their sting can still be quite painful.  You will need to purchase honey beekeeping protective equipment to prevent them from stinging you as you check on them and harvest the honey.  A simple hat and veil is often enough protection for most beekeeping activities. A light jacket offers additional protection and is often enough for regular beekeeping needs. A full suit with gloves is advised for times when the weather is rather windy or the bees seem aggressive.  ", " Get a smoker. A smoker is a cylinder with bellows attached that houses a slow burning fire.  As the fire burns, you squeeze the bellows so smoke comes out the nozzle.  This smoke is an excellent way to calm bees down as you work around their hive.  Burning pine needles, old burlap, wood or purchased smoker fuel are all effective methods of calming bees down. Smoke tricks bees into thinking they need to escape a fire and interferes with the pheromones they use to communicate within the hive.  "], "Getting Your Bees": [" Catch a wild spring swarm. A wild spring swarm is a cluster of bees that have left their hive.  You can usually find them temporarily hanging from a tree or bush during the springtime.  During that time of year, the swarms will be relatively docile while they prepare to establish a new hive.  This is the least expensive, but most dangerous method.  With beekeeping gear on, you can gather the bees and their queen into an empty hive. Place a box below the branch of a tree or bush the bees are currently swarming on.  You may be able to shake the branch, causing the majority of the bees to fall in the box but this could anger the bees.  Instead, simply cut the branch they are swarming on off the tree and place it in the box for transport.  This method is not recommended without support from an experienced beekeeper.  ", " Purchase an established hive locally. You may be able to purchase an established hive from a local beekeeper.  This can be the easiest way to get started as well as a great way to provide you with a contact that has beekeeping experience.  These hives usually only cost between $50 and $100. Make sure the hive you purchase has been formally inspected by an apiarist or the state department of agriculture.  Either test is free to have conducted and can prevent you from having to destroy colonies with communicable diseases.  ", " Order bees by mail. The easiest and most common way to make sure you can establish a hive of healthy honey bees is to order your bees through the mail.  The U.S. Postal Service will actually deliver your bees right to your door.  A beginner order would usually cost about $30 and entail the following:  A 3-pound box with 10,000 worker honey bees One mated queen that is ready to start laying eggs Sugar water to feed the colony during shipment  ", " Place the bees in their new home. It’s surprisingly easy and safe to transfer your bees from the package they came into their new hive that you purchased for them.  This process is detailed in instructions that often come with the bees as well.  Simply place the separately caged queen into the empty hive Pour the bees out of the box onto the queen The bees do not currently have a hive to defend and will be disoriented so there is very little risk of being stung during this process. These colonies will take the first year to build up the number of bees inside and will not yield honey until the second year you have the hive.  "], "Working Your Bees": [" Start with a friend that has experience. It’s important that you learn the proper way to behave around a beehive from someone with experience.  An experienced beekeeper can provide you with wisdom and guidance that may be difficult to find online. A seasoned beekeeper’s poise will show you how to remain calm if you get nervous around the hive. Having support can make the situation less frightening until you are accustomed to working with bees.  ", " Check on your bees. You will need to check on the status of your hives more often than you will be harvesting honey.  When checking on your hive, simply wearing a hat with a veil is often considered enough protection, but you may also choose to wear a jacket.  Visit the bees on a sunny day when flowers are in bloom so the majority of the bees will be out and working. Wash any clothing bees may have stung previously when visiting, the residual pheromones could incite another attack. Use a smoker to fill the hive with smoke and keep the bees docile when opening it to inspect.  ", " Inspect their honey-making progress. Once you have approached the hive, you’ll need to open it and remove some of the interior frame to check on your bees progress in developing the hive and making honey.  Remember to liberally use your smoker throughout this process to pacify the remaining bees.  Use your hive tool (a small crowbar) to pry up the corner of one of the interior frame walls, then slide it up slowly. In different frames you slide out you will find honey or even frames filled with the queen’s larvae. Frames that are capped in beeswax are full of honey and ready to be harvested.  ", " Harvest your honey. It’s finally time to reap the reward of beekeeping, a harvest of fresh honey!  You may choose to wear your full beekeeping suit to protect yourself during this process, though if you’re careful, it may not be necessary.  You can purchase a “bee escape” which is a bee trap that allows the bees to enter a container but not leave.  As you smoke the hive, most bees will enter the bee escape, allowing you to harvest the honey safely with most bees temporarily displaced. Use a pocket knife or small blade to cut the honeycombs out of the frames.  The beeswax honey making up the hexagons is also edible. A centrifuge specially designed to separate the honey from the honeycombs can also be purchased at specialty stores if you would prefer only the pure honey.  ", " Treat bee stings. It’s inevitable that you will get stung at some point while working with bees.  Most experienced beekeepers have been stung many times, but eventually learn to avoid most situations that may result in getting stung.  If you are stung, treating a bee sting is fairly easy: Remove the stinger as quickly as you can and wash the area with soap and water. Apply a cold compress and keep an eye out for signs of an allergic reaction. If signs of a moderate allergic reaction arise, take an antihistamine and apply a cortisone cream to the site of the sting. If a more severe reaction seems evident, use an epinephrine pen if available and seek medical treatment immediately.   "]}}, "How to Feed Bees": {"description": "It’s usually best to let bees gather their own food. However, you can create your own feed for the bees if for some reason there are inadequate sources of honey, abnormalities in the environment, or for any other reason the bees are not able to feed on their own. There are many types of feeders, sugar combinations in feeds, and times of year to think about when feeding.", "content": {"Choosing a Feeder": [" Pick a frame feeder. This is the most common feeder to use. These can be wood or plastic. You want to pick a feeder in the 1-2 gallon range. Some models come with coarse siding to let the bees climb along the sides. Other models have features such as floats to prevent the bees from drowning if water collects inside. You can also find models that are portioned into multiple frames that allow access for multiple hives. Look for ease of access for yourself including the ability to open up the feeder to change spoiled feed.  If you go with the frame feeder you’ll need to fill it correctly. Get a funnel (metal or plastic) or make your own funnel out of thick paper. Hover the funnel over the chambers, and slowly pour the syrup feed until the brood chambers in the feeder are just short of full.    ", " Try a Boardman feeder. If you’re worried about bees drowning, then use this instead of the frame or Miller feeders. These wood feeders are shaped roughly like a large box. They hold an upside-down mason jar full of the feed you intend to use. You put the jar in the entrance, and the bees wander up into the jar for the syrup. These are easy to monitor, but you will have to shake off the bees from the jar to refill it.  ", " Get an inverted feeder. These are watercooler-sized wood feeders that work with inverted mason jars or metal cans full of feed. You place the jar of feed into the top entrance upside-down so the bees can fly into it. You can cover the entrance rim in #8 hardware cloth to prevent bees from hovering around the jar when you need to refill it.  This feeder poses less of a drowning risk to the bees.  ", " Set up a Miller feeder. If you are interested in handling more bees than the other feeders, then use this model. These are plywood feeders named after C.C. Miller. These feeders are much larger than average feeders with feed capacities typically up to 5 gallons. Miller feeders can have open access so the hive can fly throughout the feeder, or partitioned access so the bees can only get to the syrup. These partitions are really just trays with slots for bee access. But the trays need tight seals so foreign bees don’t drown in the syrup. You can pour the syrup into the trays at the ends, center, or all frames.  These feeders can stack taller to hold more syrup, but may get used less by the bees leading to spoiling of the feed.  "], "Preparing to Enter the Feeder": [" Wear a beekeeper suit. You’ll need to purchase a cotton-based suit for comfort. It will need to have several features to allow you free range of motion, but keep out bees. Look for a suit that has leg zippers, knee pads, gusseted crotch, elastic wrists, and a double-ended main zipper. You’ll also need the suit to come with plenty of pockets including a holster for hive tools. The suit should have metal D-rings to tie down the mask or veil tie. Most suits are sting resistant, and not completely sting proof.  Suit prices can vary depending on features and fabric quality. Some models can be $20 if you buy just a jacket and head covering. Some full suits can be upwards of $100.  ", " Smoke the bees before opening a feeder. Light the smoker with a standard cigarette lighter or match applied to the kindling in the main container, but don’t let it get excessively hot. Puff only one or two spurts of smoke in entrance and along the top of the feeder to disarm the bees’ alert pheromones. Wait one full minute after the puffs before opening the hive. If you notice the bees are still agitated, only then use an extra puff or two.  Some models come with liquid fuel, and a bellows attached. Follow the model’s instructions for lighting. You’ll also need a metal prying tool to open the feeder.  "], "Mixing up Syrups": [" Mix one part sugar and two parts water to stimulate egg laying. Combine 1 pound (0.45 kilograms) of sugar with 1 quart (0.9 liters) of water, or 5 pounds (2.2 kilograms) of sugar with 5 quarts (4 liters) of water. Stir the sugar into the warm water until dissolved.  Use this when there is enough honey available for the brood to feed on.  ", " Mix one part sugar and one part water to promote honeycomb building. You can feed this to bees in the spring or summer. Pour 1 pound (0.45 kilograms) sugar into 2 cups of water (0.47 liters), or 5 pounds (2.2 kilograms) of sugar with 2.5 US quarts (2,000 ml) (2.4 liters) of water. Bring the water to a boil, and turn off the heat source. Stir in the sugar until dissolved and let it cool.  ", " Mix two parts sugar with one part water to save food for the winter. Do this in the autumn. Combine 1 pound (0.45 kilograms) of sugar with 1 cup (0.23 liters) of water, or 5 pounds (2.2 kilograms) of sugar with 5 cups (1.15 liters) of water. Boil the water, and stir in the sugar. Stir the sugar until the crystals dissolve. Remove the mixture from the heat, and let it cool.  "], "Planning a Schedule": [" Set up supplies for winter first. Winter is the time that will be hardest to help bees that are starving. Start preparing and feeding the syrup recipes in August or September. You can wait until October, but waiting until December is risky. Though you should still attempt to feed the bees rather than allow them to starve.  The amount of feed to store for winter is something you should ask your local beekeepers.  ", " Mix spring recipes. Use the seasonally mixed syrups for longer term feeding or to boost the life of a new hive. Prepare 2-4 gallons of syrup early so you can start these syrup feedings in May. Introduce this syrup at the start of a new hive.  Once the hive is well underway, don’t over feed.  ", " Feed in times of need. Extra feeding should generally be done only when the hive is undersized or starving to begin with. Your batches of syrup may spoil if you’ve prepared much more than the bees need.  For example, if you have a hive that is supposed to weigh 150 pounds suddenly weighing 75 pounds, then it may be time to feed.  "]}}, "How to Get Started Beekeeping": {"description": "Beekeeping can be a very fun and rewarding activity for you, your family, and friends. Not only does it let youeat fresh honeycomb, but it can also benefit your garden through pollination. It can take some time to put together a bee community, but once you do, beekeeping is relatively easy. You can get started beekeeping by putting together your hive, introducing the bees to the hive, and caring for the bee community.", "content": {"Making Arrangements for Your Hive": [" Ensure that you have at least 1/10th of an acre land. Consult the documents related to your property to find out the size of your yard. A typical city-sized lot is about one-tenth of an acre and can accommodate one bee colony. Make your determination of how many colonies to have based on the size of your yard.  Make sure the space has a clear flight path for the bees so that you don’t interrupt their ability to thrive.    ", " Check local laws. Ask local officials, a county extension, or a beekeeping association about ordinances related to bee colonies. Ask questions about regulations on things such as how many hives you can have and the minimum amount of space between hives and your property line. This can prevent you from violating city codes or having to pay fines.  Find your local beekeeping association through the websites of national or state groups such as the Florida State Beekeepers Association or the British Beekeepers Association. County extensions have offices in every state of the United States. You can find your local county extension at .  ", " Start beekeeping projects in the autumn. Bees’ behavior is entirely dependent on climate. Use the fall and winter to consult books on beekeeping, gather your supplies to build the hive, and find a source for your bees. Introduce your bees to the hive only in the spring as the early flowers appear. Beginning your project during the autumn months ensures your bees can collect nectar and pollen to build a strong hive in the spring and summer.  ", " Purchase a top bar hive if you want something lightweight. Find a local beekeeping supplier that sells 10-pound (4.5kg) top bar hives. This type of hive can make beekeeping fun and easy if you:  Want a hive that weighs less than 40 pounds (18kg) Want one or two hives Are willing to perform regular maintenance  ", " Get a Warre hive. Visit your local beekeeping supply store to look at Warre hives. Ask the salesperson any questions you have about Warre hives or if it is something best suited to your needs. Warre hives are good choices for hives if you:  Are ok with lifting 40 pounds or more Want one or two hives Want to perform occasional maintenance Want to see your bees in action  ", " Buy a Langstroth hive. While you’re at your local store, compare Warre hives with Langstroth hives. Ask the shop staff if a Langstroth hives may be better suited to your needs and wishes for beekeeping. Langstroth hives are a fun and great choice if you:  Are wiling to lift 40 pounds or more Want many hives Want to perform occasional maintenance Don’t necessary want to see your bees in action  ", " Construct a hive stand. Purchase a hive stand or build one with concrete blocks to keep your hive off of the ground. Measure to ensure that the hives are at least 18 inches off of the ground. This can protect them from critters such as skunks or raccoons and make it easier to check the hives. It also protects your back from having to lift heavy hives.  ", " Get hive tools. Having basic protective clothing and tools can help you maintain your bee colony and protect yourself. Get the following hive tools and articles to wear while beekeeping:  Bee suit with gloves or simple hat and veil and lightweight jacket Smoker to calm the bees when you’re working in the hive Hive tool, which is a mini pry bar specifically used in beekeeping  "], "Placing Your Hives in the Optimal Location": [" Expose your hive to the morning sun. Put your hive in an area that gets sun in the mornings. This ensures that your bees get out of their hive early to forage for pollen. Place the hive in a spot that gets the full sun if you live in cooler climates such as the northeastern United States. Put the hive in a place with afternoon shade if you live in warmer climates.  ", " Protect your hives from direct wind. Keep your hive away from open spots that are exposed to direct winds or breezes. Instead, set it next to wind breaks such as fences, shrubbery, trees, or bushes. This can ensure the health and vitality of your bees and minimize the risk of the hive tipping over.  Place hive entrances facing south or southeast if you live in the northern United States or Canada to protect it from winter winds.  ", " Space your hives at least one body width apart. Set the hives so that you can easily walk between them without grazing yourself. Spacing your hives comfortably apart will allow you greater movement while you work. It also minimizes the risk that bees perceive your presence as a threat.  ", " Face hive entrances away from foot traffic. Position your hive entrance facing away from people or animals that may walk past it. Keeping your bees away from foot traffic minimizes the risk that your bees perceive animals or people as possible threats.  "], "Introducing the Bees into the Hive": [" Source your bees early in the year. Select a local beekeeper, gardening or pet store where you can purchase your bees by January or February. Contact several different sources so that you have backup bees if anything falls through with your chosen supplier. Making sure you have a source for bees ensures that you can introduce them to the hive when plants start blooming.  ", " Purchase a “nuc. ” Ask your supplier to provide you with a “nuc.” This is a queen bee and a bunch of workers that are ready to place in the hive once spring starts. If this isn’t an option, buy a confirmed queen bee and about 10,000 individual workers, which equals about three pounds of bees. Introducing a nuc into a hive is easier than searching for an individual queen bee and thousands of workers. ", " Put on your beekeeping gear. Once it’s spring and you have a nuc, put on your beekeeper suit, gloves, hat, and veil. Make sure anyone else who will handle or be near the bees is also wearing protective beekeeping gear. This can ensure you, your loved ones, and even your bees stay safe and happy when introducing the colony or performing regular maintenance.  Have spare beekeeping gear on hand if you have interested friends or family members.  ", " Smoke the bees out of the nuc. Puff your nuc with two or three wafts of cool smoke. Then place the nuc next to or on top of your hive. Using cool smoke and moving the nuc near the hive can wake up your bees and ensure a quick transfer into their hive.  ", " Release the bees into the new hive. Remove the outer and inner cover of your hive body. Then take off the frames from the nuc and gently center them in the hive body. Allow your bees to populate their new hive before replacing the inner and outer hive body covers.  Check for any lingering bees in the nuc container and release them into your hive. Shake your nuc into the hive if you prefer a faster and easier transfer of your bees.  "], "Caring for Your Bee Community": [" Ensure your bees’ safety from critters with barriers. Winnie the Pooh and his bear friends aren’t the only animals who like honey. Protecting your bees from predators can ensure the vitality of your colony and a fruitful harvest. Use the following solutions to keep bee predators at bay:  Put up electric barriers or chicken-wire fences to keep bears, opossums, and away. Elevate hives to keep opossums and skunks out of the hives. Place birdfeeders away from hives.  ", " Feed your bees as necessary. There may be a slight gap in time between when you introduce your bees to their hive and plants begin producing nectar. During these few weeks, feed your bees with a 1:1 mixture of water and sugar. Punch holes in the top of the hive and hang small food jars with the mixture from them. This can ensure your bees have nutrition until they can access nectar.  ", " Monitor the hive at regular intervals. Check the hive as often as you like. This could be once between spring introduction and fall harvesting or every day if you prefer. This can ensure your hive is flourishing, building a strong comb, and doesn’t have any pests or other problems.  ", " Watch for potential problems. During your check-ups of the hive, look for signs of illness, parasite infestation or other animals accessing your hive. This can help you nip potential problems in the bud before they affect your hive. Some signs of issues with your hive include:  Misplaced bars Weakened colony Visible hive beetles or wax moths on the comb Lack of larvae Deformed wings  ", " Harvest Honey . Take out the long, flat hive frames in the fall. Scoop off the honeycomb and wax into a container or bucket with a hot knife. Then allow the honey to gradually sink to the bottom of the container and remove the wax cappings that remain. This will give you delicious, raw honey to eat and wax cappings you can turn into candles or other items.  Set the wax capping on a sieve or filter to strain out bits of the capping from the raw honey. Get an extractor if you prefer to strain your honey into a spigot and keep the wax separate.  "]}}, "How to Make a Honey Bee Box": {"description": "People who have gardens and appreciate the importance of bees in the natural environment may seek to keep bees of their own. Bee boxes, or hives, today are designed to encourage the health of the bee society as well as make it easy for the beekeeper to remove the honey from the hive with the least disruption possible. A honey bee box is made up of a hive stand, bottom board, hive bodies (brooder), smaller boxes called honey supers, and a cover. The lower hive body is separated from the supers above by an excluder. Learn how to make a honey bee box to begin the beekeeping process.", "content": {"Understanding the Parts": [" Hive Stand. This is the stand that lifts the hive off the ground, and may have an angled landing board for the bees. While you don’t need a technical ‘hive stand’, you will need a stand of sorts to prop your super off the ground. A small table or bench built to fit your honey bee box will work, if you’re looking for a home-made substitution.  ", " Bottom board. This is the first section/layer of your box. It is a flat piece of wood that serves as the base for your super. The bottom board can either be solid or screened, the only difference being that screened bottom boards are better at keeping out pests and have an added bit of ventilation. Your bees will come and go from an entrance in the bottom board. ", " Entrance reducer. This is a small piece of wood that blocks off part of the entrance in the bottom board. Entrance reducers help small colonies by preventing the entrance of large pests and robbers. ", " Slatted rack. This is, just as it sounds, a flat panel of wood that is crossed by other small strips of wood, forming a flat rack. This is layered between the bottom board and the brood chamber, to provide ventilation, make access of the brood chamber easier, and prevents the bees from forming ladder comb. A slatted rack is an optional addition to your box, but it is well worth adding if you’re able.  ", " Deep super. The deep super is the large box that the bees build their hive into. A deep super is the largest section, and you will use 1-2 for a single honey bee box. Each deep super comes with either 8 or 10 frames. ", " Deep superframes. These are the frames that are individually inserted into the deep super. The frames hold foundation, which is the wax and wire base that the bees use to start their own wax building. You will need 8-10 deep superframes, depending on the size of your deep super. ", " Queen excluder. Because you don’t want the queen bee to lay eggs in the honey, you add a queen excluder to your box. This is a flat rack that has small holes for the worker bees to use, but which are too small for the queen to use. ", " Honey super. The honey super, like the deep super, is where the bees will store their honey. This is a large box placed on top of the deep super, with the queen excluder sandwiched between the two. It is normally easiest to work with shallow or medium-sized honey supers, otherwise it can become too heavy to lift the box full of honey. ", " Honey superframes. Honey superframes are panels of wood or plastic that are inserted vertically into the honey super. These are where the bees build their wax and honey and can be removed from the super. Frames are either ‘shallow’ or ‘medium’ to match the size of the honey super you are using, and have a foundation similar to that in deep superframes. ", " Inner cover. This is the final layer in your bee box - a type of lid with an entrance that is placed over your honey super. Inner covers have two sides - one for fall/winter, and one for spring/summer.  ", " Outer cover. This is a metal lid that is used to keep adverse weather conditions from interfering with your bee box. This is the lid that tops off the box, over the top of the inner cover.  "], "Building Your Box": [" Purchase your supplies. You have three choices when it comes to getting a honey bee box: buy a complete box for a lot of money, buy separate parts and put them together for less money, or build all your parts from scratch and save over 50% of your money. Regardless of which option you choose, you should always purchase your supplies from an esteemed bee seller. Buying cheap supplies not only will not last very long, it may also cause damage to your bees (and your honey!). Always use untreated wood - typically pine or cedar.  None of the boxes/supers have bottoms, so you’ll only need to purchase enough wood to create the outer edges for you multiple supers. Some supplies - like your frames and the outer lid - can’t be made easily, and you’ll have to buckle down and purchase them.  ", " Build your deep supers. There will be 2 short sides that are 16.25-by-9.56 inches (41.28-by-24.28 cm) and 2 long sides that are 20-by-9.56 inches (50.8-by-24.28 cm). All 4 sides will have tongue-and-groove or dovetailed ends. Cut your wood to meet these measurements, and create the proper joints along the edges. ", " Build your honey supers. The size of your honey supers will vary depending on if you desire ‘shallow’ or ‘medium’ supers. The length/width of your honey supers will be the same as your deep supers (long side: 20-by-your height of 5.75 or 6.625 inches, short side: 16.25-by-height of 5.75 or 6.625 inches). The height will vary. For a shallow super, your box should be 5¾-inches high; a medium super will be 6⅝-inches high. Just like the deep super, use a tongue-and-groove or dovetailed joint on the edges. ", " Assemble your supers. Use waterproof wood glue to put your supers together. Put a small dab of the glue on each of the interlocking joints, and slide the slats into place to form your boxes. Then, use a system of vices to hold the boxes in place while the glue dries. When the glue has completed drying, use a few small nails to finish off building your supers.  ", " Buy or build the bottom board with an entrance reducer. The bottom board is the first layer of your box and is just a flat piece of wood with raised edges. The board will be the same length/width of the supers, but the height of the edges is only .375-inches high. Attached to the front is the entrance reducer; the entrance reducer needs to be .75 inches (1.91 cm) for the summer entrance and .38 inches (.95 cm) for the winter entrance. Entrances that are larger may encourage an infestation of rodents. Some commercially bought bases are reversible for the correct seasonal entrance. This reduces the cost of the setup as well as circumventing the need for the storage of 1 base during the off-season.  ", " Paint the exposed parts of your box. Although you don’t have to paint your box, many beekeepers prefer to paint the exposed parts of the box white in order to reflect sunlight. If you decide to do so, use a white, non-toxic outdoor paint which will withstand the weather. Never paint inside the supers though, as this can be harmful to the bees and your honey. ", " Buy an excluder for your bee box. This fits on the top inside of the deep super and prevents the queen from moving into the honey supers. This is an item that can’t be made at home, and will have to be purchased for your box. ", " Buy your covers for the box. There are two covers that are required for your honey bee box: the inner cover, and the outer cover. The inner cover is wood and has a hole at the top as an entrance, while the outer cover is metal and covers the top of the box. The outer cover should telescope out over the sides of the hive bodies and fit snugly. ", " Get the frames for your supers. The frames are the portions of the box that the bees use to form their hive and wax. You can’t really make your own frames, unless you go through a long process of assembling the wire/foundation (which beginners shouldn’t do). Frames are made out of both wood and plastic, but both serve the same purpose. You’ll need 10 frames for each deep super, and 6-8 frames depending on the size of each of your honey supers. Slide these into each super vertically until they lock into place. ", " Assemble your box. Now is the time you’ve been waiting for! To put your box together, you’ll need to layer all of the parts on top of your stand. The bottom board goes first, followed by the slatted frame (if you have one), then the deep super(s), queen excluder, honey super(s), and the cover. The hive stand can keep the beehive up off the ground to help keep the bottom dry and to insulate the hive. The hive stand can be made of anything that holds the hive up, or you can use a commercially purchased one.  "]}}, "How to Work With Bees": {"description": "Working with bees is the responsibility of every beekeeper. A beekeeper may work with his or her bees to feed them, medicate them, or to remove the honey for the year. Beehives also need to be prepared for the changing seasons, re-queened, or protected from bacterial or insect infestations. Learning how to work with bees successfully and adhering to specific beekeeping techniques involves accomplishing the task at hand with the least number of stings and without disturbing the colony too much.", "content": {"Steps": [" Wear beekeeping apparel to protect yourself from stings. This could include a commercial bee suit, but at the very least it should include a hat with a veil and bee gloves. Wear thick, long clothes, tuck your pants into thick socks, and wear sturdy shoes. You may want to put rubber bands around your ankles to prevent bees from crawling up your pants.  Bees are more aggressive to dark colors. Wear light-colored clothing when working with bees.   ", " Choose a sunny day around mid-day to work the bees. More bees will be away from the hive working during this time. Cloudy, rainy days should be avoided. Many bees will be at the hive, and they seem to be more apt to sting on these days.  ", " Obtain a 5 gallon (18.9 L) bucket to place your bee working tools in. This will allow you to keep everything together and transport them easily when going out to work bees. Place in the bucket a smoker, a hive tool, burning material, matches or a lighter, and any feed or medication needed for the bees at the time you work them. ", " Fill your smoker with your chosen burning material. Common choices are burlap, pine needles, corncobs, wood pellets, dried grass, or mulch. Smoking bees calms them by causing them to gorge on honey. The smoke masks the alarm signal from the guard bees.  ", " Light the smoker just before you reach the hive.  ", " Approach the hive from the back, out of the landing path of the heavily laden bees. Come around to the front, and blow a few puffs of smoke into the entrance of the hive. Move away, and wait 3 minutes.  ", " Open the top of the hive, and blow smoke into the inner cover. Use the hive tool, if needed, to remove the inner cover and blow smoke between the frames as you remove and inspect them. The hive tool is useful for breaking the propolis, which is the resin-like material bees use to glue areas of their hive. Give the bees plenty of time to eat.  ", " Pull out the frame closest to the side of the bee box, and lay it on the ground. Move the other frames into that place after you have inspected them. Gently lift the frames up, and allow the bees to let go and move out of the way.  ", " Move downward into the brood box. Look for the queen and sealed brood, and make sure that you have ample frames for the colony to work with. Check on any abnormalities and pests, such as mites or moths.  ", " Remove honey-loaded supers, and replace with a fresh super and frames. If you're preparing the bees for winter, reduce the entrance to the hive and remove any extra supers. This will force the bees down into the brood boxes to store honey for the winter.  ", " If you choose to do so, feed and/or medicate the bees as needed.  ", " Replace all hive components, and quietly leave the area.  ", " Clean all hive tools with disinfectant.  "]}}}