{"How to Plan a Birthday Party": {"description": "Planning birthday parties is both fun and stressful. There are many elements of a good party to take into consideration, and the responsibility of the party being a blast falls on you. There are some fail-safe steps to take in order to plan a fantastic birthday party that will have everyone involved and having fun. Make sure thatyouhave fun along the way!", "content": {"Deciding When and Where to Have the Birthday Party": [" Choose a date for the birthday party. The sooner you choose a date, the sooner you can get started with planning other elements of the party. Consult with the person whose birthday it is to determine a good day for the party. Check their schedule and take note of any holidays around that time. Keep in mind that many people travel for different holidays. It is advisable to host the party on a weekend. More people will be willing and able to come if it is on a weekend, because many people do not have to work on the weekends.    ", " Select a time for the party. Appropriate times will vary based on who the party is for and the age of that person. If you are throwing a birthday party for a child, host it in the late morning or early afternoon. This is most convenient for families. If you are throwing a party for an adult, then an evening party is appropriate.  ", " Decide on a budget for the party. Parties can easily consume a great deal of money, so it is important to come up with a budget and stick to it.  Come up with an overall budget, meaning a total amount that you want to spend on the birthday party. Most people believe that a budget up to £200-300 is reasonable, and many feel keeping party costs under £150 is completely doable.  Break down each element of the party (e.g. invitations, food, drink, decorations, venue) and decide how much should be spent in each area.  ", " Create a guest list for the party. There are a few reasons for doing this. A guest list will help you ensure that no one is forgotten when sending out invitations. It will aid you in deciding where to hold the party. A guest list of 12 people means you could host the party in someone's home, if you wanted to do so, but a guest list of 50 people will likely need to be held somewhere else. This will eliminate the risk of people the birthday person does not want attending showing up to the party. Having a number of guests in mind enables you to determine how much food and drink will need to be provided, if you are doing that yourself or having it catered.  ", " Consider where to have the party. This involves knowing the individual for whom the party is being thrown. Take into consideration what the birthday person wants. If he/she wants a more elaborate party, then work to plan the party in a venue that enables that. If he/she is into small gatherings with close friends, then aim for that instead. You will need to decide if you want to have the party in your home or someone else's home in order to keep the venue cost-free. Think about making a reservation at a restaurant if your party is of a reasonable size. Most restaurants can accommodate up to about 25 people without too much issue. Another idea is to host the party at a party or banquet hall. This will be a more expensive option, but it can easily accommodate more people. Think about the guest list and keep in mind if any guests need accommodations. Be sure that wherever you choose caters to people who need certain accommodations, like wheelchairs.  "], "Planning Out the Party Details": [" Decide if the party should have a theme. Themed birthday parties can be a lot of fun, but they can also end up being more costly when you consider buying everything to match the theme.  Weigh the pros and cons of having a themed party based on the person whose birthday it is. Would they like a themed birthday party? Consider whether it is a kid's party or an adult's party. Choose a theme that is age-appropriate, if you decide to go this route. For example, appropriate themes for children would be based on kid-friendly television shows or movies, circus, movie theater, a children's book, or carnival. On the other hand, appropriate themes for adults might be a black-and-white affair, casino, a decade theme, or an adult movie or television show.  ", " Purchase and send out invitations. Once the earlier details are decided upon, then it is time to send out invitations to the guest list. It is best to send out the invitations about 3-4 weeks in advance of the party in order to give people enough time to plan for it. Be sure to include RSVP information on the invitation. Sending out the invitations after you have decided on the earlier details ensures that you have the guest list secured and that you have decided on whether to have a themed party, making you more organized. Be sure to reach out to some of the invited guests for help. They can help set up, clean up, provide food, decorate, and more. It is not necessary to do it all by yourself!   ", " Create a plan for the food and beverages. Based on what you have decided for the party, you have different options for these aspects. Decide what type of food will be best for the party. If you chose a theme, then make sure the food flows with that theme. For example, a would work great for an army-themed party, but it would seem out of place for a princess-themed party. Know whether any of your guests have food allergies. If so, be sure to provide options that are safe for them to eat or let them know that they are welcome to bring their own food. Be realistic about how much food and drink to provide based on the length of the party. A party that is planned to be an hour or two might only require refreshments and birthday desserts, while a party that is meant to last for several hours will need more of a meal.  Make sure that you plan for enough food and drink to cater to all of the guests. Err on the side of too much food rather than too little.  ", " Know your obligations for providing the food and drinks. You may or may not be responsible for providing these things, based on your decision about where to host the party. If you are throwing the party in your home or someone else's, decide if you will make all of the food yourself. If not, then reach out to others and ask for their assistance in providing the food and drinks. A potluck is a great idea! If the party is going to be held at a restaurant, then no real planning needs to be done in this area, as the restaurant will take care of that for you! If the party is going to be at a party or banquet hall, then you need to check with their staff about catering options. Find out if you can bring the food, if they will cater the food, or if they have particular vendors they use to cater food for parties. Decide whether alcohol should be provided, if it is an adult birthday party. For example, if the birthday person does not drink and has many friends and family who do not drink, then alcohol would be unnecessary.   ", " Gather decorations for the party. This is one of the most enjoyable parts of the planning! If you decided on a theme for the party, then this will be easy, as you will simply buy decorations to match the theme. If you did not decide on a theme, then think about what the birthday person would want. Does he/she like a lot of decorations, like balloons, streamers, and confetti? Or is he/she more of a laid-back person who is not interested in decorations? Purchase decorations accordingly. Decorations are not as important for an adult's birthday party, but they are quite important for a child's birthday party. Kids are imaginative, so even household items can contribute to the decorations if you want to save money in this area.   ", " Choose entertainment options for the birthday party. This could involve several different types of entertainment. For a child's birthday party, there are many options. Games are great, but they often require supplies, so keep that in mind. You could have a story time, if it goes with the theme. Another idea is to have music playing. You could also hire an entertainer, such as a clown, a magician, or a scientist, if it is in your budget.  An adult's party can just as easily include games. It would also be helpful to have music playing in the background, either via a disc jockey or via a homemade setup with a computer or smartphone and speakers. If the party is going to be out on the town, then the entertainment could come in the form of a live band or an activity, such as a comedy show.  ", " Choose what dessert will be. For many birthday parties, this is the most important part! Most of the time, the birthday person will want a cake, especially if it is a child. Decide whether you are going to make the cake yourself or purchase one from a bakery. Know what kind of cake the birthday person likes, and take into consideration any food allergies of the guests. Have an alternative dessert ready if they cannot have the cake. If the birthday person does not want a cake, then provide what they do want! Cupcakes, brownies, pies, cookies, and ice cream are all perfectly acceptable substitutions for birthday cake.  ", " Create a back-up plan in case of weather, especially if the party is outside. Have an alternative location prepared and a system for notifying the guests if the need arises. "], "Getting Ready for the Party": [" Arrange your organized help to assist you in setting up the party on the day of. This is why you asked them to help, so make sure they are there to help you! Set up the decorations and food, if necessary. If you are providing the food to the party venue, then be sure to get it to the venue on time. Give yourself enough time to set everything up. Rushing will result in mistakes. Have everything you need in one place, or have dedicated helpers be in charge of what supplies they are helping to provide. Know where everything is to streamline the process.  ", " Have a plan for keeping the food hot or cold, depending on what it needs.  If the food is being catered or provided by the restaurant, then that will be taken care of by that business. If you are providing the food in your home or someone else's, then be wary of putting the food out too early. Food can spoil if it is not kept hot or cold.  ", " Notify your guests if you have to move the party to the back-up location. If you had an outdoor party planned and the weather is poor, then your guests need to know where to go instead. ", " Be prepared for mishaps, because they most likely happen. Take them in stride as best you can. Have a dedicated cool-down area if a child gets upset during the party. It is best if it is away from the rest of the guests. Have a first aid kit and anything else that you think might be necessary in case someone gets injured during the party. If you have pets, keep them secured away from the guests for the duration of the party. Unless your pets are very well behaved and trained, an issue could arise there, from someone being afraid of them to the pets getting loose.  "]}}, "How to Host a Birthday Party": {"description": "Hosting a birthday party, whether for a child, teen or adult, requires more than just showing up and smiling, though both are certainly required. It involves laying the foundation for a successful party by determining the type of party you’re going to throw and planning the details, such as the food, drinks, entertainment and decorations. It also involves knowing proper party-hosting etiquette, which starts with the invitations and ends with the \"thank you\" cards, so your guests leave happy and excited to attend your next party.", "content": {"Deciding Party Type and Style": [" Create a budget and stick to it. Knowing how much money you have to work with will help determine the location of the party and how much you can afford to spend on entertainment, food, drinks, decorations, party favors and supplies. Without a budget, you run the risk of overspending and not enjoying the party, both of which you certainly want to avoid. To help create your budget, use free spending tools that can be found at Manilla.com, apps such as Party Budget Tracker, or go to evite.com/app/party/calculator for help. With teen parties, be prepared and budget for friends of friends to attend.   ", " Decide upon a location, date and time. Choose a location that the guest of honor would most enjoy or feel most comfortable being at. This might be at your home, another’s home or a place in the community, such as a restaurant, country club, bar, park, gymnasium, etc. If you’re thinking about hosting it at your home, ask yourself if you’re prepared for the responsibility that entails, particularly if it’s a children’s birthday party. An entire first-grade class running around your two-bedroom bungalow is a lot to handle! After you’ve chosen the location, decide on a date and time after confirming that it will work with (a) the location, if it’s not at your home; and (b) any special invitees. If it’s a children’s party, keep it short. Two or three hours is plenty of time, especially for younger children, and plan toddler parties in the morning when they’ll be in better spirits.  ", " Pick a theme for the party. Children’s parties typically have themes, and the invitations you send will relate to this theme. You’ll need to decide on the theme first, and involve your child in picking a theme for his or her birthday party. If it’s an adult birthday party, a theme is also appropriate and even desirable. Attending a party as an adult often requires getting a babysitter, buying a new outfit, booking a car and so forth. Incorporating a fun theme is a great way to entice people to come to the party, and it's a conversation starter once people arrive.   ", " Create the guest list and sent out invitations. The guest list will be determined in large part by how many people your location and budget can accommodate. Make sure to determine these things before writing down names. After you’ve written the guest list, check with the guest of honor to make sure you haven’t left off anyone he or she particularly wants there. The next step is to send out the invitations, whether paper or digital, at least three to four weeks in advance. Here are a few more tips on both guest lists and invitations. If it’s a children’s party, don’t exclude just one person from a whole group (boy scout troop, class, soccer team, etc.) just because he or she isn’t your child’s friend. If you’re inviting just part of his or her class, don’t hand out invitations at school. If it's a teen's party, specify an ending time an hour earlier than you actually expect everyone to leave to account for dawdling, and ensure you get parents' contact information with the RSVP. Include all necessary information in the invitation, including things such as style of dress and the level of formality. Include a GPS-friendly address as well. Use websites such as Evite.com or Punchbowl.com to send customized electronic invitations. Add photos and be creative with your wording to build excitement for the party. Follow up with phone calls to those who haven’t RSVP’d a few days before the party.  "], "Preparing for the Party": [" Enlist help if needed. Ask friends, your spouse, relatives, other parents, older children and so forth for help with such things as supervision, photography and games. If you don’t feel comfortable with this, and it’s within your budget, hire a professional, a high-school student or your babysitter to help with the pre- or post-party cleaning, or to help during the party by serving food, supervising children and teens, or whatever you might need to assist you. ", " Make a master list of supplies. Your list of supplies will depend largely on the location and type of party, but one is necessary all the same. Outside of food and drinks, possible supplies include things such as balloons, party hats, signs, games, crafts, music, coolers, serving dishes, tablecloths, plates, cups, ice, extra toilet paper and utensils. ", " Decide on entertainment. The entertainment will depend largely on the type of party, its theme and the location, but it's very important to keep those at the party engaged so put extra thought and effort into planning it. With children’s parties, it’s best to create a schedule of activities and intersperse higher- and lower-energy activities.  If you’re hiring entertainment for any type of party, make sure you book early and ask about set-up requirements. If you plan to have the party at your home and to play music, create your mood-appropriate playlists in advance. Make sure you include the guest of honor’s favorites, too.  ", " Plan the food or menu. Depending on where you’re hosting the party, you may or may not make the food yourself. In fact, if your budget allows it, you could have the food catered at any location. What’s most important is that the food is appropriate for the people who are in attendance, while also keeping the theme in mind. Even if it’s a children’s party, don’t forget the parents who may stay and make sure you have something for them to snack on and drink, too. Here are a few more tips. For children’s parties, finger foods, pizza and things most children actually like to eat are best. Keep it simple. For teen parties, keep it simple as well, but make sure you have a lot. Pizza, chips, pretzels and soda are all good and don't require utensils (more trash). Always have a few extra goody bags in case an unexpected guest attends or one is lost. If you’re having it at your home and cooking yourself, pre-cook and pre-assemble the day before, if possible, so you don’t feel so rushed the day of and have more time with guests. Assign seats at large dinner parties, splitting up couples and seating more quiet people by more lively people to generate a more festive party. Don’t forget the birthday cake, even if it’s a party for an adult, and make sure you order it in plenty of time! If you arrange for the food to be catered, you’ll also want to ensure that it's ordered about three weeks in advance.   ", " Decide on drinks. With children’s and teens' parties, make sure you have more than you think you may need because they'll likely go through a lot. Avoid pumping younger children full of caffeinated beverages, which their parents will thank you for later. For adult parties, make sure you include non-alcoholic beverages, and label big-batch cocktails or punches to indicate that they contain alcohol. Always have more cups than you think you will need. You don't want to run to the store in the middle of the party.  ", " Get your supplies. A week or two before the party, go shopping and get everything you’ll need for the party. Some things, like fresh foods, will need to wait. But it’s best to have everything else well in advance so if you need to have something ordered, you’ll have time to make the order. Balloons, streamers, and party activities can wait as well. ", " Clean and decorate. If you’re having the party at your house, you’ll want to clean thoroughly inside and do any major yard work or planting if the party is outside. Removing knickknacks and clutter and rearranging furniture will help free up space for guests to move about more easily. It also creates a more welcoming environment.  After the cleaning or if you’re having the party at another location, you’ll want to decorate based on the party’s theme. Don’t spend a lot of money, time or energy on decorations that most won’t even notice, though.  ", " Do the final prepping. Get the cameras ready. Stash extra toilet paper in the bathrooms. Light candles. Turn on the music. Set up the food. Strategically place trash cans. "], "Hosting the Big Day": [" Dress for the occasion. The last thing you want is to be in a chic outfit that’s completely unsuited to chasing after children for two or three hours. Nor do you want to wear stilettos that may make your legs look fabulous but your feet ache an hour into your hosting duties. Choose your attire wisely so that you look nice and well put together, but also with a mind to being comfortable so that you’re not a cranky host or hostess.  ", " Give yourself time to settle before the party. Try to have everything in place at least 30 minutes before the party starts. That includes yourself. This will allow you to catch a breath and be more relaxed when you welcome guests and be more prepared in case guests arrive early. Doing this will set the tone for the rest of the party, and it will be a good tone. If you’re running behind and a guest arrives early, greet the person nicely and explain you’re behind schedule. Asking the guest to help with something can help alleviate the awkwardness. If it’s a dinner party at your home, have appetizers and drinks out and ready for guests when they arrive.  ", " Greet guests warmly. You should greet each guest as he or she arrives, hopefully by name. As the host or hostess of the party, it’s your responsibility to make them feel welcome, to make them feel you’re happy they are there. Offer to take their coats; show them around if you’re able to; either receive the gift or explain where to put it; say thank you for the gift; and explain the plans for the party, if applicable. Have a craft or non-competitive game or activity at children’s parties for newcomers until everyone arrives.  ", " Mingle with guests. As the host or hostess of the party, it’s your job to make everyone feel comfortable during the party. Talk with your guests; genuinely listen to what they’re saying; respond authentically; ask them questions; introduce guests to those they don’t know; and so forth. Don’t wait for others to generate the party’s energy. You get it going, help it sustain itself from that point forward, and enjoy yourself while doing so! The more you put others at ease, the better the party will be.  ", " Stay calm when things go wrong. Drinks will be spilled. Plates will start to pile up. The music might suddenly stop. Focus on guests, not cleanup or problems. Problems can be resolved, often much more easily than we may initially think. When accidents happen, as they will, accept apologies with a smile and take care of them.  Have stain remover on hand and create discreet places to put garbage and dirty dishes.  You can deal with those things after the party, or hire help to assist during it. At children’s parties, have plenty of paper towels on hand and keep your sense of humor about you!  ", " Attend to guests throughout the party. Always offer guests refreshments throughout the party. If you see someone with an empty cup, offer to refill it. If you see someone standing alone, go speak with that person or introduce him/her to someone you think they might enjoy getting to know. At children’s parties, don’t rush activities that are going well to stay on schedule. Just go with the flow for a little while until it’s really time to move on. Monitor teens as best you can throughout the party. If you see suspicious activity, talk with the teen in private and, if necessary, call the teen's parent.  ", " Avoid drinking too much alcohol. If it’s an adult party, you shouldn’t drink too much as the host or hostess of the party. Getting drunk or even a bit too tipsy can make your guests feel uncomfortable and doesn’t lend itself well to fulfilling your hosting duties. ", " Don’t use your phone unless absolutely necessary. Although it’s a seemingly regular occurrence for people to be glued to their phones, even at parties, it’s best to keep your phone put away while hosting a party. If a situation exists in which you need to keep your phone on vibrate and then must take a call, excuse yourself politely to take the call, keep it brief and return to your guests promptly to explain why you had to answer the call. Being upfront and only using the phone when absolutely necessary is reasonable, and your guests will be understanding.  ", " Open gifts at children’s parties. Typically, gifts are opened at children’s birthday parties because most children love to see what the guest of honor received. The child who gave the gift also likes to see the guest of honor open that gift. This is usually one of the last things done at the party, and the host will want to write down what present each child gave so that information can be noted in the thank you card. Gifts can be opened at adult and teen birthday parties as well, though this is not generally the standard.  ", " Thank guests for coming to the party. At the end of the party, the host or hostess should personally thank each guest for attending and tell the guests goodbye. The host or hostess should also thank the guests again for bringing a gift, if they did. If it’s a child’s birthday party, use this as a time to teach good manners and encourage your child to personally thank friends for attending and for their gifts. At teen parties, call the parent if someone isn't picked up on time or says he or she is taking an alternate means home. Goody bags are typically given at this time. Although these are generally reserved for children’s and teens' parties, they can also be given at adult parties. Here are some ideas for adult party favors: Make a small potted plant with moss, cacti or a houseplant and wrap a ribbon around it. Create your own wine labels and adhere them to wine bottles using double-sided tape. Mix up your own BBQ herb rub, put it in a glass jar and attach the recipe to it. Buy small notebooks from a dollar store, write down the recipes from the foods you served and tie a ribbon around each. Have photos printed during the party and insert them in frames to give before guests leave.   ", " Send thank you cards. About a week after the party, send a thank you card to each guest who attended, expressing your appreciation. Personalizing each note is a nice touch and goes a long way. Make sure to mention the particular gift that was given. If you have a photo from the party that includes the person and guest of honor or one of the whole group, include that photo as well.  "]}}, "How to Dress for a Birthday Party": {"description": "Staring at a closet full of options can be intimidating, especially when you're going to a special event like a birthday party. The host will probably give you some idea of what to expect, but you still want to make a good impression and be comfortable. You can dress relaxed, fancy, or festive depending on the type of party. No matter what you wear, be comfy and true to your style!", "content": {"Crafting a Casual Look": [" Wear fitted jeans and a playful top for daytime parties. You want to be comfortable and wear a style that's true to you, but you also want to show that it's a special occasion. So take your everyday wear and add a special touch to bring it up a notch. For example, spruce up your casual jeans with a sequined tank top and a fluorescent clutch. Or, wear an interesting neckline (like a henley shirt) with fitted jeans and patterned sneakers.  Add a cropped jacket or patterned scarf to look great in cool weather.    ", " Wear a maxi or midi dress with sandals for outdoor daytime parties. If the party is going to be mostly outdoors, flowy dresses with playful patterns are perfect for daytime fun. If the print is bold, accessorize with minimalist pieces. For solid-color dresses, feel free to wear a few minimal pieces of jewelry or a single statement piece. A chunky necklace is a great way to show off your décolletage. Pair a single-colored maxi or midi dress with colorful shoes or a patterned jacket. Transition the outfit to nighttime by belting the waist, putting on heels, and donning a long, fitted cardigan for cool nights.  ", " Add drama at night with dark wash jeans and an off-the-shoulder top. Nighttime parties call for more drama, mystery, and allure. Show off your shoulders with a fun off-the-shoulder top, and top it off with a small statement clutch and some booties. Choose appropriate clothing that isn't too flashy or sexy. Remember, the party isn't about you and how good you look, it's about the person whose birthday it is!  ", " Wear a blazer over a button-down with tailored shorts or jeans. A nice, fitted blazer will make any pair of shorts or jeans look sophisticated, especially if you do a “French tuck.” Finish the look with a pair of nice loafers, sneakers, or flats. For women, transition the look to nighttime with a pair of low to mid heels or wedges. For men, turn it into a nighttime look by changing into a pair of slacks, chinos, or dark wash denim.   ", " Pair a cardigan with a graphic tee and fitted jeans for day or night. Layering a cardigan or blazer over a comfy tee looks more polished than the t-shirt alone. Just make sure the t-shirt isn't too loose or long to avoid looking unkempt. Leave the shirt untucked for an ultra-casual look and tuck it in slightly to show off a nice belt buckle.  ", " Wear a maxi or midi dress to pool parties. If you're going to a pool party, you might want to wear something you can get in and out of easily (like a maxi dress or thin shirt and shorts that you don't care about getting damp). Wear comfortable sandals or flip flops to match the laid-back poolside vibes. If the party is both indoors and outdoors, dress for the weather and bring layers.  ", " Wear a comfy shirt with shorts or simple jeans to children's parties. Most children's parties are ultra-casual, so your everyday wear will work just fine here. There's probably going to be lots of activities going on, so you'll want to be comfortable and able to move around quickly (especially with younger children in attendance). Avoid wearing white jeans or a white shirt so you they won't get stained from spills or grass.  Wear cargo pants or shorts for pocket space if you might need to hide small objects that aren't safe for younger children and toddlers. If you're a parent, bring a large bag for snacks, water, sunscreen, and anything else you or your child might need.  "], "Dressing to Impress": [" Wear a colorful wrap or cocktail dress for daytime festivities. Semi-formal parties during the day call for smart attire in playful colors and patterns. Pair a knee-length (or just above the knee) dress with cork wedge heels or low heels for comfort and style. Wedges are a good choice if you know that you'll be walking on grass.  ", " Pair a flashy skirt with a simple fitted blouse and low heels. A flashy sequin skirt goes perfectly with a simple (tucked in) top will make a statement without looking overdone. Top it with a cropped denim or leather jacket for cooler weather. The louder the outfit, the simpler your accessories should be. Let the sequins be the focal point and accessorize with a simple gold or silver necklace or bracelet. Turn it into a nighttime look by wearing strappy heels and adding a small clutch.  ", " Wear a cocktail dress or tailored suit for fancy nighttime parties. If the birthday party is at night and taking place in a fancy restaurant or upscale lounge, that's the time to break out those cocktail dresses, tailored suits, and dress shoes! Aim to look sharp and sophisticated with a spoonful of glamour and drama. Opt for a dress that sits right at the knee. If you go shorter, make sure that it has a medium or high neckline so you're not revealing too much skin. Go bold and dramatic with darker colors and structured, romantic shapes (like an off-the-shoulder neckline). A tailored suit is always a great choice for men (lighter colors for daytime and darker for nighttime) with a nice pair of loafers or dress shoes. A tie is optional so long as you wear a collared button-down. Steer clear of any loud patterns unless it's just a pop here and there (like on a pocket square).   ", " Accessorize to complement your outfit. Accessories can complement your style and highlight your best features. But too many accessories can look cluttered and distracting, so be tasteful and remember: less is more! A simple bangle or bracelet will call attention to your wrists, while an understated gold or silver necklace can highlight your décolletage. For men, a puffed pocket square and a nice watch can make any simple suit look posh. If you're wearing a solid color, accessorize with a single statement piece (like a necklace, bracelet, or earrings). With bold patterns, keep accessories small and to a minimum. Keep your silver jewelry looking polished by soaking it in baking soda and hot water in a bowl lined with aluminum foil.  Men should choose a pocket square that's a shade lighter or darker than the main color of the suit to make it stand out. And don't match it directly to your tie (if you're wearing one). Instead, choose a secondary color from your shirt or blazer to match it to.   "], "Matching a Theme": [" Go thrift shopping for retro themes. If you have the time and don't mind spending a little money on a themed outfit, thrift stores are a great resource to find clothes that could fit various decades. For 1950s, look for pastels and waist-high skirts with a little retro bell shape. If the theme is 1970s, opt for high-waisted jeans (with flared legs), paisley patterns, psychedelic prints, ponchos, and clunky platform shoes.  Whether you're familiar with the theme or not, doing some research will spark your creativity. Look through your wardrobe for items that might fit the theme. Even if you don't have clothing that directly matches, combining mismatched pieces and layering them can do wonders!  ", " Wear pastels for an “Under the Sea” theme. Say the theme is “Under the Sea” but you don't have any flowy looking garments. You can wear a pastel shirt, leggings of any color, and a pastel colored skirt over it with a colorful scarf tied around your waist. You won't exactly look like a mermaid, but the color scheme will allude to that idea! ", " Wear denim-on-denim for a late 90s look. Take a tip from celebrity fashion, like wearing head-to-toe denim to channel a late 1990s celebrity-darling look. Combine different washes of denim to make it look more fashionable and highlight your best assets. Pair this look with statement heels or a long blazer to glam it up.  A small headband can be worn as a 90s choker.   ", " Cut up an old skirt to make a cape or toga. Old clothes you don't wear anymore are perfect for costumes because you can cut and shape them to fit various themes. For example, that old maxi skirt you no longer wear can be cut open down the side and fashioned into a cape or draped like a toga. ", " Use tin foil or bubble wrap for intergalactic or campy 80s glam themes. Tin foil and bubble wrap can be a creative way to make normal clothes look interstellar for an outer-space-themed party or 80s shin-dig! It won't necessarily look fashionable, but it will show off your creativity and sense of humor. Cut rounded triangular pieces of foil and safety pin them to an old jacket to make shiny shoulderpads. Tape bubble wrap around your arms, legs, or torso for a spacesuit or alien look.  ", " Rip the sleeves off of old shirts and sweaters for various themes. Simply tearing the sleeves off of sweaters and shirts can work with tons of themes. Look like a Breakfast Clubber by tearing long sleeves off of sweaters or jersey shirts at the shoulder seam. Rip some holes in the front and back in it to make it ultra-grunge or punk. Save your ripped shirts and sweaters for a great zombie-apocalypse Halloween costume! Drape a studded belt diagonally across your torso (like a messenger bag strap) to accessorize a punk or grunge theme.  ", " Use jean scraps to make counterculture patches. Cut old jeans into shorts and then cut the pant legs into small squares to make patches you can safety-pin on a shirt or jacket for a counterculture look. To fray the edges of the shorts, comb and tease out the fibers from the freshly cut edges.  If you want to scuff up the jeans to look worn in, rub the outside of the jeans down the side of a cheese grater. Make sure you don't want to wear the clothing (as is) anymore before you cut into it!  "]}}, "How to Throw a Birthday Party": {"description": "If you've ever been to a bad birthday party, you know how disappointing it can be. But a good party can be a memory for a lifetime, even if the birthday boy or girl is just a few years old.", "content": {"Throwing a Toddler Birthday Party": [" Schedule the party around naptime. The best time for a baby’s or toddler’s birthday is on a weekend afternoon. The parents are generally available for a couple of hours and the invited kids (birthday honoree included) can nap before or after. Choose a day that’s a 2-3 weeks out to give the parents advanced notice. Have a start and end time, say 1-3 pm. This way no one shows up too late and they don’t feel pressure to stage an awkward exit at some point in the day; there will be an actual group exodus 2 hours later. This makes it easy on the child ‘’and’’ easy on the parents. It’s no pressure and convenient, so they’ll be more likely to come. This is also a good amount of time to fit into everyone's schedules.   ", " Choose your guests wisely. This is one of the only times in your child’s life where the guests are going to very different people of mixed ages. They’ll be friends, neighbors, family members, and children close to your child’s age, though not necessarily the same. Think about how many people you can handle being the host. Generally speaking, a good number is around 10. The more ages and types you bring, the more you’ll have to be accommodating. If other young children are present, they’ll need entertaining. You’ll need \"adult food\" and \"child food,\" too. Think about what each person would need when you’re compiling your list.  ", " Pick your invite platform. You’ll need to send out invites for the guests either via snail mail, email, or phone call. Having something tangible is best – a text or a phone call is easily forgettable. There are a few websites like Evite that can set up “personalized” invitations for you, too.  The main benefit of snail mail is that you can make it truly your own. If you go this route, consider adding a personal touch with your baby’s handprint on the invite. That’s one for the scrapbook! However, you’ll likely want to send out a phone call or a text 3-5 days before the party to make sure everyone has remembered the event and to gather RSVPs.  ", " Give guests a clue on what you’d like for gifts. Many parents don’t want more toys for their children. If you want something specific for gifts, be direct on the invitation. Indicate whether you want practical items, money or gift cards, or nothing at all. It’s not impolite – it’s saving them the hassle of buying something you don’t actually want. However, stay away from demanding gifts that are too expensive, or demanding them in the first place. If they're watching their wallets, they'll be less likely to come if gifts are mandatory.  ", " Plan the food. Item number one on the checklist? Cake. That’s a given. But apart from that, what else will you need? Well, it depends on your guests. Cater to their ages – have some “adult” food and some “kid-friendly” food. You don’t need to plan a meal; just have snacks available throughout the party. You can make a boxed cake seem like bakery-made heaven with the addition of mayonnaise or an extra egg. No need to spend a ton of money on a professional cake for a birthday your child will not likely remember. And this way you can get all the credit for the delicious dessert.  ", " If you’d like, make goody bags for the guests. Everyone loves a nice goody bag, especially if they went out of their way to get you a gift and make room in their schedule for your party. Show them you appreciate them coming with a goody bag, even if it’s just for the kids. If it’s not for the adults, they’ll still be glad they came as their kids have something to keep them occupied. It’s more to show them your appreciation and to make it a day for everyone.  ", " Prep your toddler. If your child is old enough to understand, let them know what’s going to happen. A bunch of people are coming over to celebrate Presents! But it also means that other kids might see their stuff, that their routine will be interrupted, etc. If they understand what’s happening, they may stay calmer. Let them know that this is a day of fun – it shouldn't be stressful or scary. Most of the time will be spent playing games, opening presents, and eating food.  ", " If the kids are old enough, plan a few games. Having a bunch of 3-year-olds running around for 2 hours will not be the best birthday party for the books (especially according to the other parents). To be sure they stay at least semi-occupied, plan a few games for them (this also lets the parents enjoy themselves). Need some ideas? Start out with a craft, keeping the kids entertained with coloring, paper, glitter, and whatever else you have around the house. Then move onto musical hot potato, freeze dancing, or a non-competitive round of musical chairs.   "], "Throwing a Kid Birthday Party": [" Plan a theme. Going to a restaurant or to a bowling alley is great, but your kid might go ga-ga over a themed birthday party – and you could even have that theme at the bowling alley anyway. It makes it easier to pick out decorations, design the cake, and choose activities. Talk to your child about what they’d like – it should come down to their preferences. If your child has pretty outlandish taste (“I want a hashtag theme, mom!”), take him or her to the party supply store with you. Show them the options and let them pick from there.  ", " Pick a guest list with your child. Now that your child is growing up, the guest list should be a collaborative effort. Cap it at around 7 or so other children, depending on how many other parents will be available (you don’t want to be left supervising 20 children on your own). Sit down with your birthday-er and pick out who they really, really want at their party. Make sure invitations get handed out covertly. If only certain friends are getting invited, it should be handled with care so the other kids don’t get upset. You can either deliver them yourself, ask a teacher to hand them out with other items, or have your child do it covertly (if you think they can handle it).  ", " Organize a few activities. If kids are left to their own version of fun, you're going to enter the room finding spaghetti on the walls, chairs broken, and someone crying in the corner. Organize a few activities to keep everyone happy and the chaos to a minimum. Games with music, face painting, or craft making are trusty standards. A warm up activity is good, too. That way as the kids trickle in, the early-birds are content having something to do.  ", " Keep the food simple. Kids are easily impressed. If you can whip up a bunch of mini corn dogs, their tummies will be smiling. Have a few healthier snacks (pretzels, a veggie plate), in addition to some candy and finger foods, like chips and salsa. The time of the party will determine the food. If it's just in the afternoon, you'll only need snacks. During a meal? Try ordering pizza or getting take-out. What's the most important part? The cake, of course.  "], "Throwing a Teen Birthday Party": [" Talk your teen about what they’d like, where, and when. Now that your child is old enough, they should have a big say in their party. Do they want it at home or out? What do they want to do? Do they want it during the day or at night? If they have a bunch of ideas, narrow it down for them to 3 or so that you've preapproved – they can then pick which one they want from there. Talk about a budget and scheduling constraints. You'll have to be the voice of reason in this conversation. Be honest and let them know what's doable and what's not.  ", " Plan out the guest list. Ask your teen to come up with \"the short list\" – 8 or so people they want at their party. Ultimately the party should be determined by where it is (if it's somewhere else, that's less work for you) and how long it's going to last. 8 people out for pizza is manageable, but you'll only want to take 3 or 4 to the amusement park. You're finally at an age where it matters who gets invited – some people may not get along or not want to do certain things. Talk to your teen about what the people they're inviting are like, if they know each other, and any problems they foresee. Consider doing it elsewhere, like at a restaurant, trampoline park, bowling alley or arcade. Your teen likely wants freedom, and it's easier on you, too.  ", " Make sure the invites get sent out appropriately. Teens are at an age where feelings can get hurt. If your teen is inviting some kids at school and not others, find a way to make it so the invites are sent out discreetly. If they're not, it might start unnecessary drama that could dampen the event. If possible, send them via email. Ask for RSVPs so you know who is coming and can have a head count. Have your teen send reminder texts or phone calls, too, before the big day.  ", " Consider having a theme. Theme parties are fun for 4-year-olds, 40-year-olds, and everyone in between (though the themes change over time). Talk to your teen about having a theme – the kids can then dress up, you'll have fun planning out themed food, and it'll make it easier to decorate and find matching additions. This should be your teen's decision. As long as it's appropriate and doable, it should be a go. If you don't like it, give your teen a good reason why and offer alternatives.  ", " Provide all the fixin’s for your party. This is especially important if you're having the party at home: plan and arrange all the food and decorate till the cows come home . With a theme it'll be easier to pick out; if you don't have one, it's up to you. Here's a few things to keep in mind: Keep the snacks coming; worry less about the main food. You can always whip up spaghetti or order pizza, depending on what the party-goers feel like. But don't forget the cake! To keep the mess better for you, buy plastic plates, forks, knives, and cups to keep the after-party clean-up to a minimum. Don't be nervous to ask other parents to bring along a few dishes if the party is at your house. A few bags of chips or some liters of soda is an easy way they can chip in.  ", " Keep a watchful eye, but allow them their fun. You need to be there to problem-solve and diffuse any tension, but when things are going well, allow them their space and their fun. They're at an age where they can take care of themselves. Be as far away as you feel is appropriate. Odds are your teen will need you to order the pizza or take care of any mess they create. While it may not be in the way you want, you'll likely be needed to stay relatively near.  "], "Throwing an Adult Birthday Party": [" Plan the who, what, when, and where. An adult birthday party can be anything from a few people gathering for drinks to a room full of people rocking out to live music. It all comes down to the preferences of the birthday honoree. Simple and classy or totally outrageous? Having it at home is easiest, but that means cleaning, cooking, entertaining, and cleaning some more. However, having it at home is cheaper and you have free reign of your territory. If you do have it at home, consider having everyone bring a dish or a drink. This keeps the burden off you and makes it a more interactive affair. If you're going out, make a reservation as soon as possible. Some places are hard to get into on a moment's notice.  ", " Send out the invites well beforehand. Unlike kids, adults have a million and one things going on that they have to attend to. To get all your guests to come, send out invites well in advance, about 2 - 3 weeks. This way they can write down the party in their calendar before the slot fills up. Send something concrete, like an email. A phone call or text is easy to forget and often doesn't seem official. But don't hesitate to send a reminder text a few days before the party.  ", " Choose a theme or over-arching activity. There are a couple of things that can make any party monumental: Pick a theme, where your guests can dress up, eat special foods, and take part in themed activities. This could be anything – from an 80s theme with neon colors and bad movies, to golf with faits and mini-golf set up in the basement, to a cartoon character theme, where you get to relive your childhood. Plan an event. It could be a photo scavenger hunt throughout the city, a pub crawl, or a macaroni and cheese tasting at your house (where everyone brings a different variation). This adds extra excitement about your party and keeps people from being bored, too. Consider entertainment like live music or a sports game. With this route, all the planning is done for you.  ", " Cover all the food and drink necessities. If you're having the party at your house, make sure everyone's well taken care of. You'll need hors d'oeuvres for people to munch on all night long, and food to accommodate everyone's allergies and diets. Some gluten-free and vegetarian plates may be a good idea. What's more, you'll likely want alcoholic and non-alcoholic drinks available. For those that don't drink, keep it fun by making a punch or some other concoction that makes them feel like they're a part of it, too.  ", " Decorate the area according to your theme. Did you choose \"Old Hollywood\" as your theme? Get some old film reels, some black and white decorations, and roll out the red carpet on your sidewalk. \"90s\"? Bust out the scrunchies, the high-waisted jeans, the bright colors, and blast some Spice Girls. The limit is only your imagination – and your budget. Don't have a theme? No problem. For that macaroni and cheese party, set up a large board for everyone to vote on or make them personalized voting cards. Make name tags and decorate the table to make the mac n' cheese look better than it already does.  ", " Keep everyone mingling. Since you're likely the glue that holds this party together, try your best to work in and out of circles, introducing them to one another, and starting games if the atmosphere calls for it. Keep them safe, too. If drinking is involved, take their keys and put them in a safe place. When they go to leave, make sure they're sober before they drive away. If not, arrange a designated driver to take them home.  "]}}, "How to Plan a Surprise Birthday Party": {"description": "Throwing a surprise party seems simple, but great surprise parties need a little planning. Organize a few basic details about the kind of birthday party you want to throw and consider what the guest of honor would enjoy. Once you've made the party details, keep the party a secret while giving the guests enough information. To get the honoree to the party, offer the chaperone a few ideas on how to get them to the surprise without letting the secret slip.", "content": {"Organizing the Basics": [" Select a party theme. Consider what the guest of honor likes and use that as basis for a party theme. If you're throwing a party for a kid, the theme might be their favorite toy or story. For an older guest of honor, choose a theme based on the person's hobbies or interest. For example, if you are planning to surprise your girlfriend , throw a party based on her favorite movie. You could instruct the guests to dress as characters from the film.  Keep in mind that you'll also need to plan food, decorations, and activities around the theme. So if you're throwing a luau-themed party, try to throw the party at the beach or set up tropical decorations. Serve tiki drinks and set out leis for the guests.   ", " Choose the party location. You can host the party almost anywhere. The location should be large enough to accommodate all of the guests. So if you want a big surprise party, you might want to rent a community hall. But if you're throwing a surprise party with a dozen people, you could easily have it at a nice restaurant.  For example, you can have the party at the honoree's house, at your place, at a restaurant, at a park, or anywhere you think your guest of honor wouldn't expect. If you'll be renting a space, learn about what sound systems are available and ask about their policies on food and decor.  ", " Pick a date and time for the party. While you can throw the surprise party on the honoree's birthday, you might surprise them even more if you throw it a day or two in advance. You'll need to choose a time and date that works for most of the guests and you'll need to ensure that the honoree is also available.  Consider asking the honoree if they want to get together to hang out at the time you're thinking of planning the party. If they tell you they have other plans, you'll need to reschedule the party. Avoid throwing the surprise party after the person's actual birthday or they might think you forgot their big day.  ", " Decide what refreshments to serve. People expect food and drinks at a party. If you're doing a surprise party for kids, you can serve standard birthday party treats (such as punch, cookies, and cupcakes). For an adult birthday party, serve foods that are easy to prepare and eat. If you don't want to spend time on the food, consider having food catered or have the party at a restaurant.  Match the foods to the time of the party. For example, if you're having the surprise birthday party right after work on a weekday, most guests will expect a meal. But if the party is in the afternoon on a weekend, you could serve drinks and appetizers.  ", " Make a guest list. Decide how many people you want to have at the party and think about the honoree's personality. If they're not very outgoing, they might love a small surprise party with their closest friends and family. If they love crowds and conversation, you could have a larger group of people.  You might want to ask another person to help you plan and pull off the surprise, especially if they're really excited by the idea of the party.  ", " Invite the guests. Once you've come up with a guest list, set up an event page on social media to invite the guests or call and invite them to the party. Avoid mailing paper invitations so the honoree doesn't find an invitation and learn of the surprise. Make it very clear to guests that the party will be a surprise.  Decide if you want to ask guests to bring gifts or help with food and drinks.  "], "Keeping the Party a Surprise": [" Decorate for the party at the honoree's place. If you are having the party at the honoree's place, you'll need to wait until they're not at home and decorate quickly. Choose decorations that are simple to put up. Ensure that the honoree won't be able to see the decorations before they walk in to the main party room. Keep decorations away from windows that the honoree could look into as they walk in.  If you won't have much time to decorate, stick to decorating the main party room first and then you can decorate other rooms as you have time.  ", " Decorate for a party at another space. If you're not hosting the party at the honoree's house, you can easily set up decorations in advance. You can decorate with the theme of the party, your honoree's favorite colors, or standard birthday decorations like balloons and streamers. Remember that the entrance to the party room should not give away the surprise, so avoid putting up banners or balloons in the entryway. Ask a few of the guests to help you set up decorations before the other guests arrive.  ", " Give the guests party details. Once guests have RSVP'd, call them or leave more detailed information on a social media page that the honoree can't see. To keep the party a secret, tell the guests where they can park, where to put gifts or food when they arrive, any costume or dress-code requirements, and an exact time to show up (usually about 30 minutes before the big surprise).  Avoid giving out party details to too many people or to those who aren't coming to the party. This increases the risk that the honoree will find out about the surprise.  ", " Choose a chaperone for the honoree. Find a chaperone who will escort the honoree while you plan and set up the party. Pick a chaperone that the honoree feels comfortable with (such as a spouse or best friend). The chaperone can distract and redirect the honoree until it's time for the surprise party. Tell the chaperone that you may contact them if you need them to stall for more time or get the honoree to the party right away.  ", " Plan a fake event to throw off the guest of honor. The easiest way to distract the honoree is to plan a different event that they know about. For example, have the chaperone invite the honoree out to dinner or an activity. Your honoree won't be as suspicious if they're already planning on doing something fun.  If you're planning the surprise party at home, have the chaperone take the honoree shopping, to a movie, or on a hike. They should do something fun so the honoree doesn't want to go home early. Ensure that the honoree will be dressed appropriately for the surprise party. For example, if the party will be fancy dress, the honoree should be dressed for a similar activity so they're in fancy dress too.  ", " Go through a to-do checklist before the party starts. To keep track of all the party details, make a checklist. List the things you need to set up, when you should prepare the food, where you'll set up the sound systems, etc. You can use your checklist to delegate things to guests.  For example, ask one person to be in charge of turning on the lights and music when the honoree enters. You can also ask guests to be lookouts for when the honoree shows.  ", " Tell guests what you want them to do when it's time for the surprise. Direct the guests about what they should do so no one accidentally gives away the big surprise. Have them all jump out yelling, \"Surprise, Happy birthday!\"  "], "Getting the Guest of Honor to the Party": [" Ask the honoree to help plan a surprise party for someone else. If you really want to distract the honoree, ask them to get together with you to plan someone else's surprise party. This works great if you don't have a lot of time to distract the person from the party. You could invite the honoree to the venue and have them meet you in a room that isn't decorated. When you're ready to surprise them, lead them into the party room. For example, if the party is at your house, decorate the main rooms and ask the honoree to meet you near the back of your house. When you're ready, you can lead them into the party room.  ", " Make up an excuse if the honoree comes. If you're the chaperone and you're out having fun with the honoree, you'll need to get them to the surprise birthday party at some point. You can tell them that you accidentally \"forgot\" something important at the house and need to go back to get it. This tactic will only work if the party is at your house or the honoree's house.  ", " Ask the honoree to go with you on an errand. If the party is at a venue (such as a restaurant or park), meet up with the honoree. After spending a little time with the honoree, ask them if they wouldn't mind running a short errand somewhere. Take the honoree to the surprise party venue. For example, you could be out for coffee together. After a little while, say, \"A few days ago I left my jacket at the restaurant down the street. Do you mind if we swing by and I can grab it?\"  ", " Give a heads up. If you're the chaperone, text the host of the party 10 minutes before you bring the honoree to the party. If you don't think you can do this secretly, tell the host to have a guest posted near the entrance so they can alert the other guests that the honoree is arriving.  Advance notice is especially important if you'll be dropping balloons, throwing confetti, or exploding glitter. You don't want to waste the surprise on just another guest instead of the honoree.  "]}}, "How to Decorate for a Birthday Party": {"description": "Decorating for a birthday party can be a little daunting, especially if you've never done it before! Start by choosing a theme, since that will help you narrow down your décor options and create a cohesive look for the party. If you're holding the party at a restaurant or party room, be sure to ask the management what their policies are on decorations before buying your supplies. If you're holding the party at an outdoor venue, don't forget to bring tables and chairs!", "content": {"Choosing a Theme": [" Focus on the person’s age when choosing decorations. You can use this theme for any birthday, but it works especially well for first birthdays and other milestone birthdays like turning 16, 30, or 40. Go with banners, balloons, and party favors that announce the person’s age and make sure that the age number appears prominently throughout the décor. For example, for a first birthday, the décor and party favors can feature the number “1” or say “Happy 1st Birthday!” on them. The cake and Mylar balloons can be shaped like the number “1,” as well. You can also base color choices on the age. For example, a Sweet 16 party can be decorated in shades of pink. Black and gold decorations are popular for 40th birthday parties with an “Over The Hill” theme.   ", " Base the theme around the season for an easy option. Seasonal themes are great options that never go out of style. They're also extremely customizable and you should be able to find decorations at your local craft store or online quickly and easily. If you aren't sure what kind of theme to go with or if you don't have much time for planning, consider a seasonal theme! For example, a summer birthday party can have a tropical color scheme and feature beach themed decorations. If the party is in the fall, you could have a burgundy, brown, and orange color scheme and use autumn-themed decorations featuring leaves, pumpkins, cornucopias, and pinecones.  The season can also dictate activities for the party. For example, you can have pumpkin carving or pumpkin painting activities at a kids’ autumn-themed party. Bobbing for apples is another fun idea for fall!  ", " Feature a favorite animal, sports team, or other interest in the décor. You probably know the person well enough to pinpoint one of their favorite hobbies or interests, but if you aren't that close to them, don't be afraid to ask someone who would know! Finding decorations that match a very specific or obscure interest may not be feasible at your local craft store, so try looking online instead. For example, a child who loves unicorns might love a unicorn-themed party with unicorn imagery and pastel decorations. If the person loves Harry Potter or Star Wars, you could go with decorations that reflect those interests. A football or hockey themed party would work great for a sports lover, and you can even zero in on a specific team and use the team colors for your color scheme. Create a Disney-themed party with decorations featuring their favorite Disney characters and settings.   ", " Go all out with a location-based theme for a creative solution. Transform the party space by creating an atmosphere based on a location. Depending on what you choose, this may be the  most work-intensive choice, but if you have plenty of time for planning and have a creative streak, consider making a big splash with this approach. Go with a location or atmosphere that you know the person really loves! For example, create a carnival-themed party with brightly colored or striped décor, carousel imagery, tents, clowns, and lollipops. You could also consider a garden theme, a castle theme, or a zoo theme. Jungle, safari, and outer space themes are also very popular.   "], "Decorating a Restaurant or Party Room": [" Ask the venue about their policy on decorations. Some spaces may provide decorations for birthday parties, so if you're on a budget, definitely inquire about that. If you want to bring your own decorations, find out what they allow before purchasing anything. Balloons, banners, and other easy-to-hang wall decorations are usually totally fine with most venues.  Don't forget to bring tape to hang up your wall decorations!  ", " Write birthday messages on large banners for an easy solution. Birthday banners can be as elaborate or simple as you like. A simple banner might exclaim “Happy Sweet 16, Tara!” in purple and silver lettering, for example. You can also try something more on-theme; for instance, for a royal-themed party, create a scroll-shaped banner with a message like, “Hear ye, hear ye! It’s The Queen’s birthday!”  For a disco-themed party, you could have a banner with an iconic disco quote like, “Let’s get down tonight!”, “Stayin’ Alive”, or “Shake your groove thang!” Hang the banner somewhere prominent so that everyone can see it!  ", " Use garlands to emphasize the party theme or spell out messages. For something simple, string together cardboard letters to spell out a simple birthday message or the person's name. You could also create themed garlands using paper or cardboard cutouts. For example, use flower-shaped cutouts for a garden party, a string of cardboard crown cutouts for a royal-themed party, or T-rex cutouts for a dinosaur-themed party.  String together photos to create a very personal garland.  For an 80s themed dance party, string together paper cutouts of boomboxes and stereo speakers.  ", " Liven up the space with colorful balloons for a classic look. You can find balloons in a wide variety of colors, shapes, and materials at most party stores and they're a classic go-to for creating a festive atmosphere. Balloon solutions can be simple or elaborate, depending on what you want to do and how much time you have. For example, for an easy option, blow the balloons up yourself with an air pump and scatter them around the room or tape them to objects. You can also rent a helium tank, fill the balloons, and either tie them to objects in the room or simply let them float along the ceiling. For a quick option, go with Mylar balloons in different shapes and colors and have the party store fill them with helium for you. Go all out by creating a balloon arch.  ", " Create and hang a photo-collage for a personalized solution. Go with images of the birthday person at different ages and doing a variety of things to create a sentimental vibe. Images that include their friends and family members are also a great idea, especially those that you know will be in attendance at the party. You may want to print the images from digital files to prevent original photographs from getting damaged, though. For example, you could include pictures from their very first birthday party, a summer vacation, and dancing at prom. You can also create the collage as a keepsake and include blank space for the party goers to write birthday messages and well-wishes.  ", " Spread out tablecloths in eye-catching colors or prints for a quick solution. You don't have to cover your tables, but it's usually a good idea if you're renting a space. You can keep things simple and go with plastic, solid-colored table coverings that match the party’s color scheme. You can also use on-theme printed tablecloths, like galaxy prints for an outer space theme or colorful stripes for a carnival theme.  You can buy printed tablecloths for almost any theme you can imagine, or you can make them yourself using butcher paper, printed images, and glue. For a ruffled look, buy several tablecloths in a few different sizes and layer them on each table. Collage printed photographs on craft paper to make a customized, personal print!  ", " Scatter confetti in fun shapes on the tabletops for a quick solution. If you need to create a festive look in a hurry, scatter colorful confetti across the tables. You can use plain confetti, or go with an on-theme solution like star-shaped confetti for an outer space theme.  Scattering glitter or sequins on the tables can create a similar effect and may even work better if you’re doing a disco or carnival theme.  "], "Using Decorations at Outdoor Venues": [" Bring or rent your own tables and chairs. Most outdoor places like playgrounds and parks won't have enough seating to comfortably accommodate the number of guests you're expecting. Make sure you provide enough table space to accommodate everyone!  You may want to have a small, separate table for the gifts and larger tables where guests can eat or chat with one another. Simple folding chairs are a great option for outdoor seating. They can be purchased fairly cheaply, but you may want to rent if you're expecting a crowd.  ", " Use balloons to guide guests to the party area. Fill colorful balloons with helium, then tie the balloons to objects along the way to create a path from the parking area to the outdoor party area. Helium balloons are very light, so you can safely tie them to almost anything! If the party is in a backyard, a balloon path eliminates the need to answer the front door—guests can just walk right up to the party area! You can also post colorful signs that have arrows and messages like, \"Party this way!\" Emphasize the party color scheme when choosing balloons.  ", " Drape string lights between and around trees to illuminate the area. If the party is in your backyard or at another location where electricity is accessible, this is a great solution—especially if you expect the party to continue into the night. If you have trees that are fairly close together, drape the lights between them. You can also wrap the lights around tree trunks and thread them through the foliage. Buy colored lights to match the party's theme or go with white lights for a classic look. You can also find delicate fairy lights that come with battery packs if you don't have access to electricity. Attach lightweight Chinese paper lanterns to the string in between the lights to create even more ambiance.  ", " Cover the tables with craft paper for a homemade vibe. Tape a large piece of white craft paper or construction paper onto the tabletops and scatter crayons and markers across the surfaces so that party goers can write messages and draw pictures. This works great for children’s parties and the covers can be easily saved as a keepsake.  Taping the paper down will prevent it from being blown away by the wind.  ", " Hang up a piñata for a simple, fun solution. A big, colorful piñata feels festive and is a great decoration for outdoor parties. You can buy piñatas already filled with goodies, or you get an empty one that you can fill with customized treats. Choose a shape that matches your party theme or go with whatever catches your eye!  Find a sturdy tree branch to hang the piñata from and make sure there's plenty of space for the guests to swing at it safely!  "]}}, "How to Plan Your 13th Birthday Party": {"description": "You're finally a teenager! Since this is your first birthday as a teenager, you'll want to make it awesome! Thirteenth birthdays can be a bit tricky to plan. Do you go for lots of games, or something a bit more grown-up to herald the start of the teenage years? Everyone will have their own ideas about what makes a good party. But as long as everyone has fun, the possibilities are endless.", "content": {"Assessing your Options": [" Brainstorm some ideas with friends. The first thing you need to do is come up with some ideas for how you might want to celebrate your birthday. It’s a good idea to get together with a couple of your closest friends and try to brainstorm some possibilities. They know you well, and will be able to tell you if you have a really bad idea and offer some suggestions if you’re drawing a blank.  Remember you want to do something that you like, but if you going to be with a group of friends, you want everyone to have fun.   ", " Run your ideas by your parents. Once you’ve come up with a few ideas, and before you get too excited, run them by your parents. They are going to be doing a fair bit of the organising and will know more than you about the costs and limitations. They might disappoint you by not seeming too enthusiastic about an enormous expensive party, but be understanding and work together with them. They really do want you to have fun! Don’t be rude and demanding to your parents, that definitely won’t help with the party organization.  ", " Decide if you are going to party at home or go somewhere else. After getting some ideas with friends and talking to you parents, the first big decision is whether you are going to do something at home, or go out somewhere for the day. Each of these have their advantages and disadvantages, so it’s really about what you think would be fun and what you can organise with friends and family. If the party is at your house, decide where is going to be off limits. Your parents won't want a bunch of teens trekking through their bedroom.  ", " Decide how many people you want to come. The next step is to decide how many people you want to come to celebrate your birthday. You might want to keep it small with just close friends and family, or have a big party with your whole class. What works best will depend on what kind of party you are going to have, but it’s a good idea to have a rough idea of numbers before you get too far ahead in the planning. If you are keeping it small, be aware that word will travel around your class.  Try not to get into an awkward situation where you are inviting everyone from your class apart from one or two people.  Do you want it to be co-ed (girls and boys), all girls, or all boys? Talk it over with your parents and make sure that they approve your final decision.  ", " Choose a date. You'll want to pick a perfect date to have your 13th birthday party on. Ideally, it should be around your real birthday, but it doesn’t have to be. Try to have your birthday party on a weekend, or at least on a Friday night. You could also hold it on a day where you don't have school. Be careful if your birthday is during summer, spring, or winter break, as some of your friends may be on vacation. It’s a good idea to check if another friend is having a party around the same time as you. You don't want to have your friends torn between going to your birthday or another person's birthday if they're on the same night.  ", " Pick a theme or activity. Now you have a good idea of the size, the date, and whether you are having your party at home or out, you can think about what theme you would like. There are almost endless possibilities here, so talk it over with friends and family and try to come up with something that will be really fun and is a bit special. A theme is a good way to tie the party together. Here are just a few ideas: Rollerskating party  (at your home pool or a community pool) Retro party (from the 50's, 60's, 70's, 80's, 90's, etc.) Theme party ( , , etc.)  (at home or at a professional spa) A movie party (watch a movie at the theatre or at your house) A camp-out (in the wilderness or your backyard) Game show theme (American Idol, Survivor, Amazing Race, America's Next Top Model, etc.) Go to an amusement park Go horseback riding with friends Have a (at your house or a community center) Have a  Go to a concert  "], "Making the First Arrangements": [" Book your venue. Your venue is where you will host the party. If you have decided to have a party away from home you need to book somewhere sooner rather than later to avoid disappointment. Bear in mind how many people you are inviting and make sure you are booking somewhere with enough space. Think about if you need space for dancing, and a space to put your stereo or DJ. Having a party at a specialist place can be easier to organise and handle for your parents than having one at home.   ", " If necessary, get the tickets to the event. For some places, like an amusement park or a sports game, you will need to buy tickets. It is easiest and quickest to do this in advance, you don't want to spend ages queueing. It’s best to leave this stuff to the parents to sort out, but make sure you know what is going on and your friends know if they need to get their own tickets separately. Sometimes you can get group tickets at a discount. If you going to a sports game make sure you get seats together.  ", " Arrange transport. Once you know where and when you are going, you need to think about how everybody is going to get there and back again. Maybe you will all get a mini-bus from your house, or carpool. Again, this is something your parents will organise with your friends’ parents, but make sure everybody understands what the plans are, including you. ", " Send out the invitations . Once the plans are well-advanced you can go ahead and send out the invitations. This is a chance for you to be a bit creative and show how much you want to share your birthday with your friends, as well as set the scene for your party. You can either write out the invitations by hand, email them out to your guests, or tell them in person or by calling them. You could also use free services on the internet that create invitations, such as Evite . It’s a good idea to ask people on the invitations to let you know if they are allergic to anything. It wouldn't be good if there was an allergic reaction at your party! Don’t forget to ask people to RSVP, and confirm whether or not they can come. This will be helpful in your planning. It will make arranging food, transport, entertainment, and anything, much easier if you know how many people are coming.  Give all the information and the venue, date and transport on the invitations.  "], "Make the Final Party Arrangements": [" Get the food. Plan what you are going to need food-wise. You don't want a bunch of hungry 13 year old teens turning up to a party with no food. Chips, candy, pretzels, pop, juice, fruit, and chocolate work great for finger food. You can also have little appetizers such as sausage rolls or buffalo wings. If you're going to have your guests stay for a real meal (lunch or dinner), either order in some pizza, sushi, or Chinese food, or go out to a restaurant. Be sure you take into account any dietary needs of your guests. You can tie the food into your theme. Don't forget the cake!  ", " Decorate your venue.  Decorating your party space isn't essential. It's more important if you're having a theme party, but it's always nice to have some little decorations, even if it's only a couple balloons. You’re decorations will depend on your venue. Decorate as little or as much as you want (and as much as you can take financially). It’s great to have decorations that go with your theme. If you are having your party at an outside venue they will most likely take care of all the decorations before you arrive.  ", " Get some entertainment. Games and entertainment can be tricky at a 13th birthday, as you might not want to play the kind of games you liked when you were younger. Be sure to talk to your parents, so you all know what kind of entertainment you and your friends would like. You can keep it simple and provide some music, or maybe a movie, depending on what kind of party you're having. You could also hire some live performers/dancers to really get the party started. You could also have some classic party games such as:  /Treasure Hunt  "]}}, "How to Organize a Birthday Party for Kids": {"description": "Kids' parties can be more fun than adult parties -- you don't have to be so serious and you can let your inner child out with them. Plus, by the end of the day when all the kids' energy has come to a halt, and they fall asleep, you're right there, laying next to them, taking a little nap yourself!", "content": {"Planning Party Basics": [" Pick a theme with your child. Though it may seem unnecessary, having a theme will help you know what decorations to buy, what food to prepare, and what games to plan. Character parties are popular (think Sponge Bob or Scooby-Doo ), but general themes work, too (pirates, fairies, princesses, cowboys, etc.). Unless they want something that just isn't appropriate, allow them creative freedom. Sit down with your child at the table with a pen and paper and write down all the ideas you both like.  Some themes will obviously be more difficult than others. Go with your child to a couple of party stores and see what's available or go online. It'll be easiest to pick a theme based on what you have at your disposal. Most parents aren't Martha Stewart; you certainly don't have to be.   ", " Nail down the specifics. There are a few questions you'll have to address: When is the party going to be? How long will it last? Where is it going to be? Is there anything going on communally or culturally that would prevent other children from coming? What time of day works into your schedule?  Take your child's age into account. Generally, the younger the child, the earlier the party. You do not have to entertain all day--a few hours is more than sufficient. If you're not having it at home, consult the desired venue to see what times are available.  ", " Get invitations (that match the theme! ). Once you have them picked out, it's time to finalize the details. Check your schedule to make sure there are no girl scouts or work meetings during the time you're thinking. On the invitation, put the start and end times, address, what each child should bring (swimsuit, etc.) and if there will be a meal so parents can plan accordingly.  As for guests, a good rule of thumb is the child's age plus 1. And if parents can come along, great! It's best to have a couple others to help with monitoring and clean up. Have your invitations in the theme of your party. The other children will probably get excited, too. Your child can hand them out at school (if possible to do it discreetly) or you can give them to the parents if your child is too young (or forgetful!).  Your child shouldn't hand them out in front of those not invited -- it might make the others feel bad. Give them to the teacher to put in the take home folder or have your child put them in desks or lockers.  ", " Buy decorations. For everything from table cloths to pinatas, a party store is your best bet -- or else you'll end up bouncing around town for days looking to piece it all together. And if they don't have a specific something, ask! They may be able to order it for you.  It's always an option to make your own if you're DIY handy. And your child can always help if you want someone to blame the poor penmanship on! As an alternative idea, a few children can come over a bit earlier to make decorations themselves, if they'd like.  "], "Organizing Activities & What to Eat": [" Plan some games. These are the building blocks of a good child's party, so start thinking up craft projects, look into renting an entertainer, or utilize the facilities at an outside venue. Look in your phone book or online for party rentals or places near you. For younger kids, have a loose schedule to keep things running.  Don't be afraid to go super theme-oriented. If you're having a Wild West party, have them pan for gold in the sandbox. Conduct a scavenger hunt with theme-related clues and a final prize. Don't be afraid to go super simple. Nowadays, kids aren't playing the old school games they could be. Instead of having them all plop down in front of the Wii, have them Capture the Flag, play Red Rover, Blind Man's Bluff, or have relay races. For older children, have more free time. The older the child, the less structured the party should be. Kids will likely want to do their own thing at one point or another. If they express this, don't stress. More free time for you and the other parents!  ", " Make party favors interactive. Instead of giving them a bag of small toys that will get played with for three minutes and then shoved in a drawer, have them make the party favors themselves! The kids will feel more involved and like they were a part of the party.  They could make potato print t-shirts, simple masks, jewelry, fishing rods, badges -- the list goes on and on and on. This requires a bit more forethought, but will pay off in the long run.  You could have this be the first activity -- so children that come earlier have something to busy themselves with while the others slowly file in. Any late arriving child can take the necessary materials home with them if they'd like. Let the kids take home the decorations. This is an easy and quick idea if you have something with a general theme, like princesses or baseball. And it allows for minimal clean up!  ", " Plan the party food. When it comes to parties, one thing is timeless: cake. Will you bake one or buy one? Or two?! Cupcakes are easy and super trendy as well. Whatever you choose, either get the order in early or go grocery shopping for the ingredients ahead of time. Make the food theme oriented, too!  Despite what logic dictates, cake isn't enough. You'll need food too -- make it easy on yourself and get some pizzas delivered or get a fast food restaurant or catering company to take care of everything. Finger sandwiches and lunch bags with sandwiches and fruit, or cookies are great choices, too. If it's a nice day outside and you have a grill, kids love hot dogs and hamburgers. Don't forget the buns, mustard, and ketchup! If there will be other parents or adults attending and watching over the kids, have food for them, too. They may not be so keen on chicken nuggets and Sprite.  ", " Plan the party drinks. Soda pop, lemonade, and juice are all pretty standard. And if you'll be outside a lot, a cooler filled with bottles of water or cans of soda will surely be appreciated, especially if it's hot outside. And, of course, milk goes great with cake. If it's autumn or winter, have the kids play outside and come in for cider to warm them up.  Have glasses (and cutlery in general) that are safe for the kids to use. Things may get broken -- so don't break out your fine china. Be prepared for a mess.  ", " Plan the goodbye. Give the other parents your cell phone number on the off chance they're running late, early, or sending someone else to pick up their child. Establish protocol for the safety of every child.  As the child leaves, take note. Have them say goodbye to everyone, gather their things, their party favor, and mentally check them off their list. Never let the child leave on their own or with an adult you don't recognize.  "]}}, "How to Celebrate a 90th Birthday Party": {"description": "Birthday celebrations can be meaningful and memorable at any age, and celebrating a milestone birthday like 90 certainly deserves a party! The details of the celebration will look different for each nonagenarian being celebrated, but each celebration should make them feel important and cared for. The best parties will focus on honoring the wisdom that comes with age, celebrating a life well-lived, and hoping for many happy years to come.", "content": {"Considering the Health and Interests of the Guest of Honor": [" Recognize if your guest of honor is mobile or requires assistance. Does he or she get around easily, or only with help? Does he or she have trouble with steps, or walking through crowded rooms? Make sure your chosen venue is wheelchair-accessible (if necessary). Consider both the guest of honor and his or her friends.   ", " Note if there are any risks involved. For example, if you are planning a party in January and live in Michigan, you must consider the possibility of snowy or bitingly cold weather. It may not be the best decision to bring a senior citizen out in nasty weather conditions as they are more susceptible to catching illnesses. Be prepared to change plans if the honoree is unwell on the date of the party. It would not be wise to have a 90-year-old attend a party if he or she was under the weather.  ", " Consider transportation to and from the party. Many (though not all) 90-year-olds no longer drive their own vehicles on a daily basis. Recognize if this will be an issue for your guest of honor. Offer to be a driver, or find someone who is willing to drive your honoree and his or her friends, if necessary.  ", " Remember the interests of the honored guest. While you are planning a 90th birthday party, it does not have to be solely focused on the number 90. Instead, think of the current or past interests of your honoree and see if you can incorporate these into the party. This is a great opportunity to be creative! If your birthday honoree loves the outdoors, consider booking a place in a local park and bringing food to cook on a grill. If your birthday honoree loves Italian food, book a private room at the nicest Italian restaurant in town, and decorate it before the party. If your honoree’s favorite and most memorable moment was her honeymoon in Paris, recreate a French restaurant in your kitchen and dining room and take her back to her younger days.  ", " Include your honored guest in the planning. Giving him or her a hand in the party planning can be a great topic of conversation and a fun way for them to stay involved in the party process.  Questions you may want to ask include: Would you rather a small family gathering, or a large event with friends included? Would you rather a party in the afternoon or in the evening? Would you like a home-cooked meal or a special meal at a restaurant? Are there any friends or other guests you would like to invite? (Think about the people you may not know personally). Would you like a certain theme? (Think color, country, activity, etc.) What kind of birthday dessert would you like?  "], "Choosing a Venue for the Party": [" Ask the honoree if s/he would rather go out, or stay in. Depending on their health, independence, and cognitive state, senior citizens may feel more comfortable in a familiar setting. ", " Host the party at the home of the guest of honor. This would save your elderly honoree the stress of getting to another location for his or her party. It may be preferable in certain cases, and may be frowned upon in others. Plan to visit beforehand to lend a hand with cleaning, decorating, and preparing for the party. Do not leave this for the guest of honor to do!  ", " Hold the party at the home of a family member. While this is still a change of scenery for your honored guest, it may be more comfortable and intimate than planning a larger get-together at a public venue. ", " Book a favorite restaurant. A favorite restaurant can be a familiar place that still provides the social and celebratory atmosphere that your nonagenarian may desire. Consider booking a private room. This is a way to make a regular restaurant reservation into a more luxe experience!  ", " Consider a creative alternative option. Depending on the unique personality and interests of your guest of honor, there are many creative venues to hold a fantastic party. If it’s going to be a summer event, consider an outdoor location such as a beach or a park. Consider renting a boat and hosting a party on the water for any sea-lovers. Plan a gathering in multiple venues, such as a pre-theatre dinner at a local restaurant and then a walk over to see a theatre performance.  "], "Picking Food for the Party": [" Have the party catered. Catering a party is a great way to enable you to hold the celebration in a familiar and intimate setting while removing the stress of cooking and cleaning up. Call your local caterer to see if there is a minimum number of guests required at the party or money that must be spent at the caterer. You don’t want to be blindsided by a higher-than-expected food bill! Peruse your menu options, and ensure there is food that your guests would enjoy. Call around to find a reasonably priced caterer. It is always advantageous to get several price quotes from several different companies before settling on a caterer.  ", " Cook your own party food. Cooking your own food can be a wonderful way to pay tribute to your guest of honor, or simply to treat him or her with their favorite foods. Cooking your own party food can also be a subtle way to deal with any dietary issues that your guest of honor may have, without having to deal with them publicly at a restaurant. If your guest of honor loved to cook, serving an old family recipe can bring back good memories and create meaningful conversation. If your honoree comes from a certain cultural background, making food that can serve of a reminder of a homeland, possibly one not visited in a while, may be appreciated. If your guest of honor loves to try new or unique food, think of something creative that he or she might  not have had for a long time- think sushi, ostrich burgers, calamari, lavender crème brulee- the possibilities are endless! Ask your guest of honor what he or she would pick if the dining possibilities were endless! This is the best way to ensure that the meal will make the 90th birthday celebration a special one.  ", " Create a “set menu” at a restaurant. In many cases, it is possible to work with the restaurant to create a “set menu,” which will enable you to include some of the celebrant’s favorite dishes while still providing your guests with a selection. Consider asking if anyone attending has any dietary issues or food allergies. Some common food allergies include gluten and shellfish, so make sure you are aware of guests with potential dining issues. Make sure you include at least one veggie dish. Your vegetarian attendees will thank you! A pasta dish with no meat or fish is usually a safe bet. Ask the restaurant if you can rename your chosen dishes in honor of the 90th birthday celebrating. Something along the lines like “Nonna’s Nineties Nibbles” as an appetizer or “Auntie Sue’s Special Spicy Salmon” can be a fun way to honor your loved one.  "], "Preparing for the Party": [" Make a guest list. Consider inviting friends and family from both near and far. It is the people who attend the event that will make it the most special for your guest of honor. Make sure to ask for an RSVP. This will help you know what sort of venue is appropriate for the celebration. Offer to help friends and family from out of town book hotels, or offer up spare rooms with local family members if possible. This can help defray the cost for people traveling in from far away. Think about any possible “surprise guests.” Did the guest of honor have a special army buddy that he still writes to? Does she have a childhood friend or a favorite cousin that she doesn’t get to see often? If so, these are the types of surprises that your nonagenarian is sure to appreciate.  ", " Decorate for the party. Party decorations are important at any birthday celebration. There are many ways you can go in decorating for a 90th birthday party ranging from very simple to incredibly extravagant. Include memorabilia from past eras and events. Consider making a photo collage, or digging out an old high school diploma, awards and trophies, or wedding photos that will honor the birthday guest. This can be a great way for the younger generations to connect with the guest of honor. Make it a party! Include banners, balloons, party hats, a piñata, streamers, confetti, etc. Include anything that reminds you of a great celebration! Find 90th birthday-themed items! Many card stores (such as Hallmark) or party stores (such as Party City) will sell 90th birthday-themed items. Even a simple hat for the honoree can make them feel special.  ", " Prepare the guest of honor. On the day of the party, it may be appreciated to help prepare your guest of honor for their special day by going out of your way to make sure they feel their best. If the honoree is a woman, consider taking her to get her hair done or nails painted before the party. These simple beauty splurges can make her feel special on her special day. Ask her if she would like a new outfit or new shoes for the party, and make it a point to take her on a special shopping trip before the day of the party. If the honoree is a man, consider taking him to get a shave or a haircut before the party. Ask him if he would like new clothing, a new hat, or a new belt for the party. Something as simple as a new accessory can help him truly feel honored on his special day.  "], "Planning Party Activities": [" Try a “gentle roast. ” A gentle roast can be a great way to get the room (and your birthday honoree) laughing. Ask everyone in the room to write something down about the guest of honor based on a prompt. Call anyone who would like to speak up one by one, and make sure you have a microphone if you are in a large space. Make up your own prompts, or try one of these:  An embarrassing moment I had with John was….. Something I thought I would never confess to John is…… The funniest moment I ever had with John was…… The moment I knew John would be my friend forever was….. The time John and I got into the most trouble was when….. The time I was most amazed by John was when….  ", " Give a “pop quiz” on the life of the honoree. Ask questions about the life of the honoree and offer a prize for the person that knows him or her best. Be sure to include some humorous questions as well! Some example questions include: Where did John go to high school? Where did John’s family vacation when he was a child? What was John’s salary at his first job as a grocery delivery boy as a child? What was John’s favorite sibling’s name? What kind of pet did John have as a boy? What is John’s favorite story to tell? What kind of car did John always want to own?  ", " Give a toast. Attending their 90th birthday party is a great time to let the guest of honor know how much he or she means to you. Plan a portion of time where people can give toasts if they want to. Include champagne (or sparkling grape juice). Make it a true toast! Ask several attendees beforehand to prepare a short toast. You don’t want to be left with a silent room when you propose toasting your honored guest.  ", " Create a souvenir book. This will help your honoree to remember his or her special day. Ask all in attendance to sign the book and to leave a little message to the birthday celebrant. Contact those who will be attending beforehand, and ask them to bring a favorite picture or a favorite letter to put in the book. This book can then be given as a gift at the end of the celebration.  "]}}, "How to Plan a Birthday Party for a Friend": {"description": "Your best friend’s birthday is coming up, and you want to throw her a great party. Depending on your friend, you might want to organize a small themed dinner party at your house, a big affair with extended family and friends, or a surprise party. Whatever you and your friend decide, make her birthday memorable with good company, good food, andfun decorations.", "content": {"Planning a Birthday Party at Your House": [" Brainstorm ideas with your friend. Start planning at least 3 weeks in advance and talk to your friend to get an idea of what she wants. At this point, it is important to decide what kind of party she wants and how many people to invite. Ideas for small birthday parties include: Simple and casual gathering at home. A cozy dinner party or pot-luck.  A barbecue or pool party.  A retro or vintage themed birthday party.    ", " Select a date. Once you decide on an awesome theme, you need to answer the following questions: When is your friend’s birthday? Will you celebrate on her birthday or a few days later? What time of day will the party be? How many guests can we invite? Think of your guests when planning a party. If your friend’s birthday is on a weekday, guests may not be able to attend due to work or school obligations. Friday evenings are usually the best time to hold a small get together. For barbecues or outdoor parties, Saturday or Sunday afternoons are best.  ", " Make a guest list. Work with your friend to create a guest list. Next, organize the list into family and friends. Review the list and add-in significant others, children, siblings, etc. if needed.  For a small party, keep the guest list to 25 people or less.   ", " Invite the guests. Guests should be notified 2 to 3 weeks in advance. You can send invitations electronically via email, write and send through regular mail, or call or text everyone on the guest list. When inviting guests, make sure to give them the following information: your friend’s name, date and time of the party, location including address and any driving/parking instructions, date which guests should RSVP, and your contact information (email address and/or phone number) with instructions for RSVP-ing. If possible, set-up a private Facebook event page and add your guests. This is an easy way to keep everything coordinated, provide information such as directions or party updates, and communicate with guests. If sending invitations in the mail, look online for creative invitation ideas or print out unique templates.  Be creative and make your own invitations at home. You can personalize them to fit with your party’s theme.   ", " Purchase food and decorations. Make a list of everything you need (decorations, grocery list, etc.) and keep it with you at all times. Have everything ready several days before the party. If you are preparing the food yourself, select recipes in advance and bring them with you to the grocery store. Also, place an order for a cake or other desserts to a local bakery or delicatessen at least one week before the party, and buy birthday candles. Take an inventory of chairs, plates, utensils, napkins, cups, and bowls. Purchase additional items if necessary – you do not want to leave your party to go the store because you ran out of napkins! Notify neighbors you will be having a party at least one week in advance. Let them know what time the party is scheduled to begin, and when you expect most guests will leave. This is especially important if you live in an apartment or share a house.   ", " Create a birthday playlist. When making a playlist, you want it to be long enough so you don’t repeat songs, and can “set it and forget it”. Ask your friend for a list of her favorite songs, or create a playlist that fits the theme of the party. For example, for a fancy dinner party consider classical music, or play big-band and jazz hits if you are throwing a 1920s bash. You can also use a playlist online using websites such as Pandora or Slacker.  ", " Set-up decorations and food. Rearrange any furniture to make space for the food and guests. Keep food and drink areas separate so guests are not running into one another. Next, place table clothes over surfaces where food will be served, and hang any decorations. Set-up and organize the buffet table by napkins utensils, and plates first, followed by the salad and sides, and finally hot dishes and the main entrée. All set-up and decoration should be completed 2 hours before the party begins. Set-up an ice bucket at the beverage station and make sure you have extra bags of ice stored in a cooler or the freezer. Keep alcoholic beverages (beer, wine, and liquor) separate from non-alcoholic ones, and have non-alcoholic options for underage guests or designated drivers.  Make sure hot foods are covered with tinfoil to keep them warm. Wrap other foods or dishes with foil or plastic wrap to keep them fresh. If possible, prepare fruit and vegetable platters in advance and keep them in the refrigerator until just before the party begins.  Place bowls of finger-foods in several locations for your guests to nibble on when they arrive. Select items that can be left out for several hours, such as nuts, chex mix, chips and salsa, or trail mix. Do a once over several hours before the party begins. Make sure the space or house is clean, there is enough soap and toilet paper in the bathroom, and you have enough seating for all your guests.  ", " Have fun and celebrate! While the focus of the party is on your friend, you are the host and it is your job to make sure everything goes smoothly and everyone has a good time. Don’t be afraid to delegate tasks to other guests, such as refilling snack bowls or checking on ice and drinks. Also, don’t hesitate to ask an intoxicated or uninvited guest to leave. Simply pull them aside and, if necessary, arrange someone to give them a ride home. "], "Planning a Large Birthday Party": [" Start planning at least 3 months in advance. Larger parties with 25 or more guests often require more planning to be successful. Reduce stress and be prepared by starting far enough in advance. Start by creating a party checklist and timeline for when things need to be finished. Important things to consider include: booking the venue, arranging entertainment if necessary (DJ, photo booth, games, trivia, etc.), sending out invitations, collecting RSVPs, decor, food and/or catering, and drinks and/or a bartender.  Recruit help. Do not try to do everything on your own. Get a group of friends and family together and delegate tasks. Set-up a ‘central command station”, such as an email chain or private Facebook group, to keep one another updated. Check-in regularly with your helpers to see how things are coming along. Create a budget and stick to it. What will be spending money on, asking other friends or family to contribute. Use your checklist as a guideline for costs. Call around and ask for quotes on party supplies, venue prices, and entertainment. Write these estimates next to each item, use them to barter for a better deal, and keep track of your spending as you go along.  ", " Make a guest list. Decide how many people you and your friend want to invite. Organize the list into family and friends. Do not invite more than 20% of people that can comfortably fit in your party space – typically 70 to 80% of all invitees will actually attend.  Consider people’s significant others and if they are likely to attend when deciding who (and how many people) to invite.  ", " Choose the date and reserve a venue. This is important if the party will be somewhere other than your house. Depending on availability, you may need to make reservations weeks to months in advance. If you don't want the hassle of hosting a party at your house or apartment, you can often reserve community centers or church halls for a small fee. These places have the added benefit of providing tables, chairs, and access to a kitchen.  Things to consider when selecting a venue include: availability of parking, if they serve food, who is responsible for set-up and cleaning, size and how many people can fit comfortably.  ", " Send out invitations. For larger gatherings and when you have guests traveling from out of town, you want to send out invitations at least 60 days in advance. Invitations should be printed, addressed, and mailed at least 60 days (2 months) in advance. Make sure to include instructions on how to RSVP (e.g. calling, email, etc.). Your invitations should include: the party hosts (you), purpose of the party (your friend’s birthday), date, time (starting and ending), location, attire (casual, themed, formal), and RSVP.  Customize your invitations so they reflect the theme of the event, or include your favorite pictures of your friend. Search the internet for sites that allow you to customize invitations, such as Zazzle.com or Shutterfly.com. Keep the guests updated by creating a private facebook group.  ", " Book a Disc Jockey (DJ) (optional). For larger events, having professional music will make it go smoother.  DJs also help move the party along. Make sure you hire a reputable DJ. They should be upfront with costs and send you a contract stipulating the terms of their service. Do not send any payments until you see a contract. ", " Plan the menu. Plan the menu based on the type of party and number of guests. For example, ask your friend if she wants pizza and ice-cream or something more formal. What kind of food you serve also depends on your budget. You can save money by making everything yourself, or save time and hassle by hiring a caterer. Most catering companies charge per person, and include additional fees for serving. While caterers can be expensive, they reduce the stress and hassle of organizing a party – and will also set-up before and clean-up after the party. When organizing food and/or hiring a caterer, it is important to keep in mind: . Different types of food, such as: appetizers and snacks, salads, main course, and desserts. If any of your guests are vegan or vegetarian, or have food allergies. Offering a variety of drinks (alcoholic, non-alcoholic, coffee, tea, water, and ice).  ", " Purchase decorations in advance. Make a list of decorations and start buying things several weeks in advance. Search the internet or go to a party supply store for basic birthday decorations or themed items. If necessary, order specialty themed items a month or more in advance so they arrive in time for the party.  Basic birthday decorations include: birthday candles, a \"Happy Birthday\" banner, streamers, balloons, fun birthday hats, and table cloths. If this is a milestone birthday (e.g. 21st, 30th, 40th, 50th, etc.), buy plates, hats, napkins, balloons, etc. with your friend's age. Also, consider making a photo album with pictures of family and friends.  ", " Set-up decorations and food. Create a checklist for everything you need and have everything ready 2 hours before guests arrive:  Furniture: tables and chairs for guests, tables for food and cake, and a space for cards and presents. Drinks: soft drinks, water pitcher with ice (can also include lemon or orange slices), coffee urn and hot water for tea, coffee extras (creamer, milk, sugar, stir sticks), wine (red and white), beer, pre-made mixed drinks or cocktails, and cold storage or extra ice. Eating and drinking: plastic cups or glassware, wine glasses, cutlery (knives, forks, spoons), small plates for appetizers, large plates for main meal, bowls for salad, salt and pepper shakers, butter and butter dishes, butter knives, and water jugs. Food tools and miscellaneous: serving spoons and forks, carving knives, extra bowls, pot holders and trivets, garbage cans, and garbage bags.  ", " Make the party go smoothly. Delegate tasks such as food, drinks, clean-up, gift organizer, kitchen help, and set-up (if you hire a caterer, they will perform most of these functions). Most importantly, make sure your friend is having fun, stress-free birthday! Mingle, and make light small talk. try to approach each guest and thank them for attending.  If serving alcohol, make sure guests get home safely. Ask several friends to act as designated drivers, or call a taxi. Also, if a guest becomes intoxicated and aggressive, simply pull them aside and ask a sober friend to take them home.   "], "Planning a Surprise Party": [" Plan as you would for a regular party. Plan things as you would for a small or large party depending on the number of guests (more than 20 to 25 is a large party). For a smaller gathering, begin planning about 3 to 4 weeks in advance. A larger bash requires starting at least 60 to 80 days in advance. Create a party checklist to keep you on track and organized:  Pick a date and venue. Make an invitation list, decide on a theme, and hire caterers and a DJ. Send invitations, plan the menu, and plan additional activities (e.g. games). Purchase decorations, collect RSVPs, and plan a fun activity to keep your friend occupied the day of the party. Clean the space and set-up food and decorations.  ", " Make sure all guests are on the same page. Collaborate with your guests so they know this is a surprise party. Get in touch with someone who lives with or is close to the birthday boy or girl. Have them casually ask if they have any plans for their birthday. Without ruining the surprise, make sure they are not busy that day by telling them you will take them out for a small birthday lunch or dinner. Alternatively, plan on throwing the party a few days before or after their birthday. Tell them you are taking them to movie or concert, but in reality you are throwing them a party.  ", " Plan a distraction. In order to maintain the element of surprise, make sure your friend is distracted and out of the house the day of their party. Tell them you are busy, and will celebrate with them later. Arrange several friends to take the birthday boy or girl out for a nice lunch, to a movie, a sporting event, or for a spa day. Make sure they are nowhere near the party venue while you are setting-up and guests are arriving! ", " Get ready for the surprise. Tell all guests to arrive 30 minutes or more before the birthday boy or girl. If possible, have them park their cars on another block, so your friend does not see them walking in.  Set the stage for the surprise by giving your guests noisemakers or confetti to throw as the birthday boy or girl walks in. You can also ask your guests to hide behind tables, chairs, couches, etc., and jump-out as your friend arrives. Have someone with a camera ready to capture the moment of surprise.  "]}}, "How to Throw a Dog a Birthday Party": {"description": "Everybody loves their dogs, right? People birthdays are very special, so why shouldn't your favorite pet's birthday be just as fun? Here are some ideas to give your dog a super fun birthday!", "content": {"Planning the Invitations and Date": [" Look at your dog's pedigree. Find the date of your dog's birthday. If your dog's birthday is on a weekday or inconvenient day for you, make the party date on a weekend close to your dog's birthday. *If your dog is without a pedigree, you still should check your calendar for a convenient date. Make sure the party will not be on a holiday or a day when most people can't make it (e.g. Monday!). If your dog does not have a pedigree, it helps to know the month when your dog was born.  ", " Make up a date of birth if you adopted a dog from the pound, and you don't know it and stick to it! Or, if you remember the day you adopted, make it an adopt-a-versary! ", " Mark the date on your calendar so you won't forget once you have chosen it.  ", " Check your address book for friend's addresses - make sure they have a dog. It could be a little pointless to invite people without dogs. You might invite some dogs (and their owners) from your neighborhood, too. ", " Make invitations. You can order special dog birthday invitations or make your own creative ones. Make sure you make enough to send out to everyone you invited. It is also fun to put dog treats on the cards as a surprise for the invited. ", " Write in bold letters on your invitation \"PLEASE BE RESPONSIBLE ENOUGH TO EXCLUDE YOUR AGGRESSIVE DOG. IF YOUR DOG IS AGGRESSIVE, PLEASE LEAVE HIM HOME, BUT YOU ARE WELCOME TO COME!\". This is important if you are inviting a friend over who has a dog but you haven't met the dog yet. ", " Send out your invitations. Make sure you have your phone number or email on the invitations for RSVP-ing. "], "Planning the Place": [" Consider your yard. If you have a house with a yard, make sure to check fences for stability. Clean your yard out from any junk, and fence off any \"doggie no-no\" areas. ", " Don't worry if you don't have a yard. You can use your local park, dog park, etc. Just make sure to survey the area and make sure it is safe and doggie friendly. You also might want to contact the owner(s) of the park to ask if you can reserve some space for the day. ", " Consider an indoor party if all of your friend's dogs are toilet trained. This is especially useful in the winter. ", " Consider having your party at the beach! Most dogs absolutely love the beach, and it will be a lot of fun watching dogs bark at the waves! Make sure that animals are allowed at the beach, first! "], "Doing Activities": [" Set up an agility course. You can buy cheap agility starter kits just for fun. The dogs just love them! ", " Plan tons of games for the dogs to do! You can have a contest for things like \"most beautiful dog\" or \"best party animal\". Be creative and think! ", " Make sure to buy tons of toys for the dogs to play with! Just make sure they don't fight over them. "], "Decorating": [" Decorate tables with plastic table cloths that are dog themed.  ", " Consider making a dog-friendly birthday cake by finding a recipe online!  "]}}, "How to Plan a Child's Birthday Party": {"description": "A birthday party is a great time to surprise your child with a day of fun and laughter. By building the decorations, entertainment, and activities around a fun theme, you can begin to plan a fun birthday that doesn't hurt your savings account.", "content": {"Setting up the Basics": [" Decide on your budget. Whether the party includes entertainers, happens at a for-profit venue, or serves a meal will depend on how much you’re able to spend on the event. Use an Excel spreadsheet to start the process. First, put down how much you’re willing to spend. Afterwards you can begin to break down all the different sections of spending, such as food and decorations.  ", " Have a joint party if your child’s friend is also celebrating a birthday. If theirs is close enough, communicate with their parents and see if you could do a combined party. You might have to combine themes in order to make this work if the two kids are of the opposite gender. In the long run, this will save both money and hassle for everyone, but will require more communication.  Make sure to go over the budget and planning with the other parents carefully so that each side can pay for things equally. Or you can split it up by duties; they can organize food and you can make the decorations. Just make sure that things are done fairly so that they’ll want to do another joint party with you the following year.  ", " Pick a theme. This can be a favorite subject like dinosaurs or Disney princesses. It can also come from their favorite television show or movie. A great way to get ideas of how to make a certain theme come to life is to visit sites like Pinterest to see what other parents have done with similar themes.  ", " Choose the location. The location will decide what kind of activities your guests will be able to engage in. Where you have it will have a lot to do with the age of your child and that of the guests. If it’s summer, the community pool is a great option for inexpensive fun. Museums are exciting and educational for younger kids who have inquisitive minds. Having it in the home allows for ease of mind in terms of safety because of the controlled environment. It also means more work to prepare everything for the big day.  ", " Draft the guest list. If your child is above the age of four or five, they should be involved in choosing who to invite. Do some investigating to find out who your child’s friends are and what the social circles at their school are like. Just because your child doesn’t want someone to come, it doesn’t always mean they shouldn’t be invited to the party. If one of the kids in the class is always being left out then make sure to include them. How would you feel if it was your child being excluded from everything? Kids sometimes don’t realize how their decisions impact others; this is a great time to teach them how to empathize with the people around them.  ", " Send invitations. Communicate all necessary information clearly, such as location, the intended activities, and the start and end time. Include a disclaimer that food will be offered and ask for the parents to send all information concerning their children’s allergies so you can plan accordingly.  Also, provide your phone number and an RSVP date. That way you'll know who can and can't come so you can buy enough materials and food for everyone. Mention anything guests will need to bring, such as a swimsuit and towel if the party is at a pool.  "], "Preparing Food and Activities": [" Have dessert. Cake and ice cream are usually musts, but it all depends on your child’s preferences. If you decide to get ice cream cake, make sure to set it out for a few minutes to thaw before you plan on cutting it.  ", " Choose food that’s easy to cook. If your party takes place just before noon or around six o’clock, then you’ll need to feed the kids a full meal. Candy and soda won’t cut it, unless you want a riot of hyper munchkins on your hands. If feeding everyone would break the budget, try and plan to have the party between two and five and so that you’ll only be expected to provide snacks.  There are some great meals that can be made in bulk, which cuts down on the cost. You could provide spaghetti, chili dogs, or a taco bar. Be sure to ask your child which one they would prefer.   ", " Keep allergies in mind. After getting all RSVPs back, take into consideration any allergies the attending children have. If there are a few minor ones, work around them. If someone is allergic to peanut butter, choose alternative snacks. But if one or more of the children have an allergy like celiac, it might be easier to cook them their own individual meal. If you do this, make sure the meal is as fun and exciting as what’s being offered to everyone else; you don’t want them to feel excluded because of their allergy. This will mean buying some new cookware and dishware so that there is no possibility of there being contaminants in the food.  Clean your house thoroughly and wipe down anything the children might touch or climb on if they’re allergic to materials that you use on a daily basis. If a child has a severe enough allergy, their parents might send them with an EpiPen. Make sure you know how to use one of these just in case of an emergency.  ", " Provide healthy snacks. It’s fine to give them some junk food, but try and balance that with healthier options. Bite-sized vegetables such as baby carrots and celery are perfect for children. Have some peanut butter or other kinds of fun dip to make these healthy choices a little more exciting to the young’uns. Fruit is also a sweet alternative to candy. Make sure to cut up all produce into small pieces if the party is for children under the age of five.  ", " Plan exciting activities that match the theme. You could buy a piñata, play limbo, purchase movies, or pick a craft to make, such as bracelets or a photo frame with a group picture. This also depends on if you’re having a house party, because outside venues will often run their own activities. A good opportunity for keeping a tight budget is to reach out to community contacts like baby sitters, police officers, or fire fighters so that they can put on a little interactive show for the youngsters.  Libraries are also good resources for finding affordable fun for the group.   ", " Plan at least one activity with exercise. The parents of your child’s friends won’t be too happy if their children go home as hyperactive jumping beans. With all the cake, ice cream, and candy that you’re pumping into these kids, you’ll need to help them get their energy out in a productive way. Games like capture the flag or themed versions of tag are good options because their competitive nature makes kids forget they’re blowing off steam. "], "Decorating for Success": [" Stay on the simple side. Children don’t need super elaborate setups to have fun. Even very simple and minimalistic decorations can act as catalysts for their imagination. Refer to the research you did in the beginning stages of planning this party in order to remember all the brainstorming you did when you get to cutting and pasting. It can be easy to get carried away and break the budget when shopping for this part of the party. ", " Print out images. Find fun pictures online that have to do with the theme and print out color versions. Then cut them out and glue the streamer material onto its edges to form a kind of frame. You can either put these directly on your walls using mounting putty or attach string to them and hang them from the ceiling. This way you can reinforce the theme while giving the kids fun things to look at and do it all at little cost. ", " Get a costume. The best kind of décor is the kind your child can run around in. Dressing them up will make their day feel even more special and their imagination will be able to go wild. Though a costume will be more strain on the budget, it can also be used at Halloween and at other parties. Even if buying one means foregoing other items, you’ll get a lot more use out of it than any other decoration you may buy for the party.  is a great option as well.  ", " Use streamers. It’s easy to run them off walls, over lights, and across doorframes. You can also hang them vertically to hide pictures or other items in the house to reinforce the theme. Streamers are a great option for dressing up the house for cheap.  "], "Putting on the Finishing Touches": [" Make gift bags. This isn’t essential, but it can provide a fun ending to the party. Center the items in them around the theme of the party, but you can also include generic treats like stickers and candy. If you have a craft that the kids do during the event, you can give them a container to tote it home in, which can also count as the party’s goody bag.  ", " Childproof your home. If you’re having the party at your house, make sure any possible dangers to the kids are taken care of. Put child safety coverings on all the outlets. Put all the knives in a container and put it far out of reach. Make sure that there isn’t any exposed wiring or rough wood that could give splinters. Try getting at the kids’ eye level and looking around the rooms that they’ll be in and see what could pose a danger to them. ", " Get extra help. If you’re going to have a lot of young children running around your house, ask family members or friends to help you. That way, if one of the children bursts into tears or gets hurt, there are other adults who can help them while you keep an eye on the rest of the group.  "]}}, "How to Throw a Surprise Birthday Party": {"description": "Surprise birthday parties can be fun, exciting, and memorable for the guest of honor. For the party planner, surprise parties can be a considerable amount of work. It takes a lot of planning to determine logistics and to organize a celebration, all while trying to keep the element of surprise. With some diligent planning, you can seamlessly pull off an entertaining and enjoyable surprise party.", "content": {"Planning the Logistics": [" Determine if your honoree will react well to a surprise. Not all people react well to something unexpected. so before planning a surprise party consider how your guest of honor will react. If you are unsure, talk to their close friends or family members to feel out the party idea before proceeding. Also consider whether they enjoy parties or like being the center of attention. Lastly, avoid planning a surprise party for someone who likes to be in charge of hosting their own event. Rule out meticulous people who prefer to know details about an event before attending. Avoid throwing surprise parties for people who get really excited about birthdays. In your attempt to surprise them, they may think you have forgotten to plan anything and become upset.  Consider whether the guest has health issues that may result in a negative physical reaction to the shock.    ", " Grab a friend to help. A trusted confidant is one who will assist you in planning the party and ensuring the element of surprise. They can help to make sure the honoree arrives at the right place at the right time. If you live with the guest of honor, your co-conspirator can help with RSVPs and their house can be used for planning purposes so you do not get caught with evidence. Choose someone close to the guest of honor and someone that you can trust to keep a secret. ", " Pick the day and time. The most important thing to consider when picking a day and time is the guest of honor’s availability. You will have to secretly find out if they are available on the day and time that you have chosen. You can also choose a date before or after the honoree’s actual birthday, to avoid arousing suspicion.  Make sure your honoree is kept busy for a few hours to ensure the element of surprise. A short errand might not give you enough time, in which case you will have to speed up or rush the process. To ensure a seamless surprise, make sure to organize the party around the honoree's routine. You will be able to retain the element of surprise by organizing the party around the guest’s typical schedule.  ", " Choose the location. When planning where to hold the surprise party, consider your honoree’s favorite places. Is their favorite restaurant available? Would they prefer an indoor or outdoor event? Will you be hosting the party in a private home? It’s easier to coordinate details in a private home setting, but public venues are also great options. Choosing a public venue usually means you have less time to easily attend to details, because space is often rented shortly before your event, giving you less time to decorate and prepare. When choosing a location, make sure it is easily accessible to your guests.  ", " Invite guests. Consider the number of people you would like to invite and then consider with whom the guest of honor would really enjoy celebrating their special day. When contacting guests, phone calls or private Facebook invites work best. This way, information cannot be forwarded to friends who have not been invited, and it cannot be accidentally read by the guest of honor.  "], "Making it a Surprise": [" Time it well. It is important that guests arrive much earlier than the guest of honor, so if someone is running late, it will not ruin the surprise. Plan for guests to arrive at least 30 minute before the surprisee’s scheduled time of arrival. If someone is running late, advise them to remain in their car until the guest of honor has arrived, to avoid spoiling the surprise.  ", " Keep decorations hidden. This goes for before the party, as well as the day of the party. Store pre-purchased decorative items in a place where the honoree will not accidentally come across them. If you live together in the same home, try storing them at a friend’s house. On the day of the party, avoid highly visible decorations like lights or flashing signs that can easily be seen. Also, avoid decorating the outside of the location with balloons or signs.  ", " Hide cars. Whether the venue is public or private, tell guests to park cars out of sight to avoid being recognized by the honoree. This is especially important if people have unique or easily recognizable cars or license plates. Encourage carpooling to cut down on the number of cars present.  ", " Avoid telling people that cannot keep a secret. For those who have a difficult time keeping secrets, encourage them to not be in too much contact with the honoree. Avoid telling children until the day of the event, to ensure they do not accidentally spill the beans. Talk about their birthday as easily and calmly as possible. This will keep them from becoming suspicious or thinking that everyone has forgotten about their birthday.  "], "Deciding Between Different Reveals": [" Make as much noise as possible. When your honoree arrives, you can jump out and yell surprise,  but you can also add to the surprise by making a lot of noise. Give your guests instruments like whistles or shakers, or instruct them to sing or clap when the honoree arrives. ", " Consider a quiet surprise. Instead of the traditional surprise approach, have guests walk in on the guest of honor, instead of the guest of honor walking into the surprise. Choose a day that appears \"typical\" to the guest of honor, and instruct your guests to casually file in one by one. Watch your honoree glow with shock as they see the number of their loved ones arriving to honor them.  ", " Use silly string or water guns. If you are planning an outdoor event, surprise the honoree by showering them with items like silly string, or water from water guns or water balloons. If you are choosing the water option, make sure the party is water-themed so that the guest will dress appropriately; either have on a swimsuit or have a change of clothes handy.  Consider your honoree's reaction before taking this route. Some people will not be happy about getting their clothes wet or having their hair covered with silly string.  ", " Make sure your party is in progress, when the guest of honor arrives. Begin serving food and drinks ahead of time. This will help detract from some of the spotlight and ease the honoree into the party more easily. "]}}, "How to Throw Your Own Birthday Party": {"description": "Throwing a birthday party for yourself can be the best way to get your friends and family together to celebrate with you, and you can plan all of the details to make sure you get exactly what you want. Invite people who make you feel great, set up some fun decorations, and enjoy a day that's all about you!", "content": {"Figuring out the Details": [" Create your guest list first. By estimating your number of guests before you make any other plans, you'll be able to make decisions about the other elements of the party, including the venue, food, and drinks. Start planning your guest list as soon as you decide to throw yourself a birthday party. If you expect 5 guests, for instance, you'll have very different plans than a party with 50 guests.   ", " Choose a venue that's in your budget and the right size for your guests. Birthday parties are extremely flexible — you can meet up with a few friends in the park or you can host a formal event at a local restaurant. Think about the amount of money you have available to spend, how many guests you expect to attend, and the overall feel you're going for.  If you want to have a casual, intimate celebration with a few close friends, host your party at your house. That way, you can set up at your own pace. If you'll be serving a meal to a large group, consider holding your party at your favorite restaurant. Just be sure to let guests know if you expect them to pick up their own checks. Rent a tent or a pavilion if you want to have a large outdoor barbecue for your party, but be sure you have a backup in case it rains.  ", " Decide whether you want a theme for your party. Picking a theme can help set the tone for the whole party, from the music to the decor and even what your guests wear. Of course, you don't have to have a theme, but if something seems fun to you, go for it! If you want to have a Roaring 20s theme, ask the girls to wear feathered headbands and flapper dresses, then decorate everything in black and gold and Art Deco. Serve champagne and play jazzy music when your guests arrive. Throw a 70s disco party by hanging a disco ball, decorating in neons, and playing fun dance music all night. Ask guests to wear platform shoes, bell-bottoms, and plenty of glitter, and have fun fruity cocktails available. Have your friends wear their jeans and cowboy boots to your Country-and-Western-themed party. Play line-dancing music and make sure there's plenty of beer on hand!  ", " Plan a menu you can prepare or pick up before the party starts. Unless you really love cooking all day, try to plan foods that can be prepared ahead of time, or order catering 1-2 weeks in advance if it's in your budget. You can also host a potluck-style party, in which you ask guests to bring a dish of theirs that you really love. If you're not going to serve a meal, opt for a variety of finger foods. Plan for 3-5 servings of appetizers per guest, although you might want to have extra on hand in case of last minute arrivals. If you are having a seated meal, small appetizers like chips and dip or pretzels will whet your guests' appetites without filling them up too much. In this case, 2-3 servings of appetizers per guest should be sufficient. Provide a variety of beverages, including water and soda, even if you're serving cocktails. Some of your guests may not drink, and they'll appreciate having plenty of options. Plan for guests to drink 1 beverage per hour, plus 1 additional drink apiece. If the weather is warm, you may want to have extra drinks on hand, since people will likely drink more.   ", " Order a birthday cake that's large enough to serve all of your guests. The size will depend on the shape of your birthday cake. If you decide on a single-tier 9 inches (23 cm) round cake, for instance, it will serve 24 people. Consult your baker to determine what size cake you will need based on your guest list.  If you have multiple tiers, you can factor that into your serving size as well. If you don't want a birthday cake, you can have any dessert you like, including cookies, cupcakes, pies, or no dessert at all. After all, it's your birthday!  ", " Host your party earlier in the day if you don't want to serve a meal. If you're thinking of just having light appetizers, it's best to plan your birthday party for about 2 p.m. This will give everyone time to go home and have dinner afterwards if they're hungry.  ", " Ask your friends and family for help if you need it. It's your birthday, so you shouldn't be stressed out! Don't try to do everything on your own. If your mom makes a dip you love or your best friend is awesome at making crafty decorations, ask them if they'll help you. Chances are, they'll probably be happy to add their touch to your birthday!  "], "Inviting Guests": [" Invite more people than you expect to attend the party. Even with plenty of notice, some of your friends and family will have scheduling conflicts, may not feel well the day of your party, or may even forget. Conventional wisdom says that about two-thirds of your invited guests will attend your party.  Of course, you should have extra supplies on hand in case everyone shows up!  ", " Choose guests who will make for a fun atmosphere. Invite people who will bring a positive energy to your party. Try to think of friends who are always positive, who tell the best stories, or who are always happy to meet new people. If you're having a large party, try to invite a mixture of people from different backgrounds, career fields, and even age groups. This will help ensure that your guests enjoy mingling with a variety of different people instead of just the same friends they see all the time.  If you're having a small, intimate gathering, inviting friends who are already close is perfectly fine.  ", " Send out invites 3-6 weeks before the party. In an ideal situation, you'll be able give your guests plenty of notice so they'll have time to clear their schedules. If it's later than that when you start planning, just get the invitation sent as quickly as possible.  Everyone loves getting something in the mail, so if you have enough time, mail paper invites! If you're on a time crunch, online invites are convenient and can reach your guests immediately.  ", " Include the date, time, and location of the party on your invitations. Read through your invitation a couple of times to make sure it covers all of the important information, including how guests can contact you to respond to the invitation.  If your party has a theme or a dress code, include that on the invitation as well.  ", " Ask your guests to donate to a charity in lieu of gifts. Some people think it's tacky to ask for gifts for yourself. Sidestep this issue by stating on the invitation that you would prefer donations to your favorite charity instead of birthday gifts.  ", " Follow up with guests who haven't RSVP'd the week before the party. Remind them about the invitation and ask them if they think they'll be able to attend. This should help you get an estimate on the final head count.  An added bonus to reaching out to your friends is that it will let them know that you genuinely care whether or not they're at the party. Try saying something like, “Hey Jane, I haven't heard from you! I'm really hoping you'll be at my party next Friday night, and Sasha and Joe said they're looking forward to seeing you again, too. Do you think you'll be able to make it?”  "], "Setting up the Party": [" Make sure there's enough seating for everyone. If you're going to be serving a meal, there should be at least 1 chair per person, and maybe a few extra just in case someone brings a last-minute guest. If the party is more casual, you should still have enough seating for about 85% of your guests to sit at any one time. ", " Prepare a playlist that will set the mood for your party. You don't want to spend the whole party picking the next song that's going to play. If you don't have a stereo system, ask one of your friends to bring over a bluetooth speaker so you can play music loud enough for everyone to hear. Try playing laid-back tunes as your guests arrive, then transition into upbeat dance music as the night goes on. If you're having a big party, you might want to hire a DJ to keep the music going.  ", " Decorate for the party the day before, if possible. Setting up and decorating for a party almost always takes longer than you plan. If it's possible to set up the day before the party, you'll save yourself some stress on the day of the party. If it's not possible to decorate a day ahead, try to find a couple of friends who you can trust to take charge of the party decor. Ask them to arrive at the venue an hour or so before the party to hang decorations, set out party favors, and arrange chairs.  "], "Enjoying Yourself": [" Greet your guests as they arrive. If the party is at someone's house, answer the door yourself whenever you can. Greet your guests warmly, and try to introduce them to at least one person. If they already know everyone inside, announce their arrival. This will help your guests feel welcome and comfortable as soon as they arrive.  If the party is held at a restaurant or another venue, try to get there early so you can greet guests as they arrive.  ", " Keep guests entertained with fun activities. You don't have to have every minute of the party planned out, but it's a good idea to have a few activities planned to give everyone something to do. If you're having a small get-together, plan a craft project that you and your friends can do together. If everyone at the party is an adult, play a drinking game like . Just make sure everyone who is drinking has a ride home! Put out games like or lawn darts for an outdoor party.  ", " Try to spend time with each of your guests personally. Don't spend too much time in any one place. Move from group to group, mingling with your guests . If you see anyone who seems bored, introduce them to someone you think they'll like. For instance, if 2 people in the room both ride horses, point that out and they'll instantly have something to talk about. If you have a certain friend who always makes other people feel comfortable, take the time to let them know it's really important they attend. You can even ask them to help you work the room, making sure no one is standing alone.   ", " Ask a couple of guests to stay to help you clean up after the party. It's your birthday, so you shouldn't be stuck with the clean-up all by yourself. When the party starts to wind down, ask some of your closest friends if they would mind helping you pick up behind the other guests. Have extra trash bags on hand so you can quickly dispose of paper plates, napkins, and plastic cups. It's a good idea to have extra resealable plastic bags and plastic containers with lids to easily store any leftovers.  "]}}, "How to Decorate for a Birthday Party at Home": {"description": "Birthday parties at home are great fun and don’t have to be much work. If you’re lacking inspiration, pick a theme to help you choose decorations. Be creative and embrace the party-spirit as you decorate. Use streamers, garlands, balloons, and food to transform your home into a party zone.", "content": {"Creating a Theme": [" Decorate your home with rainbow colours for a young child's party. A rainbow theme is a fun and easy way to style a party. Use as many colours as possible to create a rainbow feeling. Where possible, arrange the colours in the order of the rainbow (red, orange, yellow, green, blue, indigo, violet).  Use different coloured balloons and streamers to add colour to your home. Purchase disposable plates and cups that have rainbow pictures on them. Use chalk to draw rainbows on the driveway.   ", " Display jungle decorations for a kid’s birthday party if they love animals. Animals are incredibly popular with kids making them a great choice for decorations. Choose decorations that have animal patterns, such as leopard or tiger print. Decorate the cake with a picture of an animal.  A safari party or a zoo party are also great animal themes. Place plants in hanging baskets to create a jungle feeling.  ", " Create a monochromatic theme for an elegant affair. Pick a colour and use it to create a monochromatic theme. If it is a child’s birthday, let them choose their favourite colour, or pick classy colours such as black, gold, silver, or white. Purchase decorations that are all the same colour.  For example, have a pink tablecloth, pink balloons, pink streamers, and pink cups.  ", " Use the birthday guest's favourite movie as a theme for a fun, film-inspired party. This theme works well for any age group. Pick a favourite movie and choose decorations that relate to the film. For example, if you choose a football movie, hang football memorabilia on the walls, have a football game on the television and make a ball-shaped cake.  If you choose a children’s movie, look for disposable cups and plates that have pictures of the characters on them.  ", " Create a royal theme if the birthday guest loves royalty. This theme is a fun and easy choice for both adults and children who love to dress up. Tell the party guests to come dressed in their favourite royal costume. Consider buying crowns for all the party guests to wear. Choose balloons, streamers, and tableware in royal colours; silver, blue, purple, and gold are great options.  Consider watching a prince or princess movie in the evening.  "], "Decorating for a Young Child’s Party": [" Purchase disposable tableware that fits your theme. Choose tablecloths, napkins, cups, and plates that are related to your theme. For example, if you're hosting a jungle-themed party, pick plates, cups, and napkins in various animal prints.  Purchase disposable tableware from a party supplies store  ", " Hang up lots of streamers to create a festive feeling. Streamers are a cheap and easy way to decorate your house for a party . Cut lengths of streamers that are the height of the door and use sticky tack to attach them onto the top frame of your front door. When children enter your home it will feel like the party has already started. Alternatively, use sticky tack to hang lengths of streamers from the ceiling to create a fun atmosphere.  Be creative! If your children want to be involved, let them choose what colours to use. Purchase streamers from a party supplies store.  If you are hosting the party in the backyard, wrap streamers around the tree and hang them from branches. If you are having a rainbow themed party, use lots of different coloured streamers. If you are having a monochromatic theme, use streamers that are the colour of your theme.  ", " Use bright coloured food on the table as decorations. Place brightly coloured foods, such as watermelon, grapes, chopped carrots, fairy bread, or cake with bright icing on the food table to add colour to the party. Place different coloured foods next to each other to create contrast. For example, place red watermelon besides green rock-melon, and yellow cake. Children will be drawn to the bright colours.  If the weather is good, consider having the food table outside. This will save your floors from getting dirty from dropped food or drink. Assemble the food in a rainbow shape if you are having a rainbow themed party.  ", " Hang a pinata up to set a party atmosphere. Pinatas are a great way to create a fun and colourful focal point to a room. Purchase a pinata that fits with your theme and fill it with treats. Tie the pinata to an exposed ceiling beam or a ceiling hook. Try to hang the pinata somewhere central in room so that children won’t hit the wall when they try and open it.  Purchase a pinata from a party supplies store.  ", " Set up a pin the tail on the donkey display. This is a great way to decorate a wall and is also a fun party game. Choose a display that fits your theme. For example, if you are having a princess party, you could choose a pin the crown on the princess display. Attach the pin the tail on the donkey display onto a blank wall or fence. Keep a blindfold on hand for when it’s time to play the game.  Buy a pin the tail on the donkey display from a party supplies store or get crafty and make one yourself.  "], "Choosing Decorations For a Party": [" Place blankets and pillows on the ground to create a picnic look. Picnic style seating is a popular and trendy look. Ask guests to bring a picnic blanket or use your own blankets. Even if the party is inside, this can still create a fun, picnic atmosphere. Place pillows on the blankets and around coffee tables to help encourage people to sit down.  Avoid using your favourite pillows in case they get food on them. This isn’t the best option if you’re hosting a formal party. However, if you’re hosting a casual gathering, this idea will work a treat.  ", " Blow up lots of balloons to create a festive atmosphere. Join clumps of 6 balloons together to create feature pieces. Hang these up on curtain rails to give a festive feeling to the house. Another option is to secure a string from one end of the room to the other and tie the balloons along the string. If you feel creative, sprinkle colourful confetti into clear balloons to create an elegant look.  Purchase balloons from dollar stores, grocery stores, or party supply stores. Pick a colour scheme for your party, such as black and gold, and purchase balloons of those colour Avoid using balloons for young children’s parties as the popped balloons will be a choking hazard. If the birthday guest is turning a significant age, purchase a helium balloon with their age printed on it.  ", " Hang up a photobooth backdrop. Guests love to take pictures at parties to remember the night by. Hang the backdrop in a well lit area where the guests will linger throughout the party. The living room and the courtyard often work well. Choose a backdrop that fits the theme of your party. For example, choose a sparkly gold backdrop if you are having a royal or monochromatic theme.  Purchase a photobooth backdrop from a party supplies shop or get creative and make your own. If you decide to make your own, consider hanging streamers, tinsel, paper chains or ribbons on the wall.  ", " Hang up decorative lights to create a party atmosphere. Lights are a great way to set the mood for a party. Hang festoon lights or fairy lights in the trees, from the rafters, or over exposed ceiling beams. If you don’t have any decorative lights, ask a friend if you can borrow theirs or hire some from a party supplies store.  If possible, use LED lights as these won’t burn party guests if they accidentally touch the bulbs.  "]}}}