{"How to Change a Tire": {"description": "Have you ever been stuck on the side of the road with a flat tire? Do you want to be able to change a tire without having to ask for help? Fortunately, changing a tire is a pretty simple task, provided you're prepared and willing to exert a little effort.", "content": {"Steps": [" Find a flat, stable and safe place to change your tire. You should have a solid, level surface that will restrict the car from rolling. If you are near a road, park as far from traffic as possible and turn on your emergency flashers (hazard lights). Avoid soft ground and hills.   ", " Apply the parking brake and put car into \"Park\" position. If you have a standard transmission, put your vehicle in first or reverse.  ", " Place a heavy object (e.g. , rock, concrete, spare wheel, etc.) in front of the front and back tires.  ", " Take out the spare tire and the jack. Place the jack under the frame near the tire that you are going to change. Ensure that the jack is in contact with the metal portion of your car's frame  Many cars have molded plastic along the bottom. If you don't place the jack in the right spot, it will crack the plastic when you start lifting.  If you're not sure about the right place to put the jack, read your owner's manual. For most modern uni-body cars, there is a small notch or mark just behind the front wheel wells, or in front of the rear wheel wells where the jack is intended to be placed. For most trucks or older cars that have a frame, look to place the jack on one of the beams of the frame just behind the front tire or in front of the rear tire.  ", " Raise the jack until it is supporting (but not lifting) the car. The jack should be firmly in place against the underside of the vehicle. Check to make sure that the jack is perpendicular to the ground.  ", " Remove the hubcap and loosen the nuts by turning counterclockwise . Don't take them all the way off; just break the resistance. By keeping the wheel on the ground when you first loosen the nuts, you'll make sure that you're turning the nuts instead of the wheel.  Use the wrench that came with your car or a standard cross wrench. Your wrench may have different sizes of openings on different ends. A correctly-sized wrench will slip easily over the nut, but will not rattle. Try to prepare for any unforeseen tire changes by keeping the exact socket size for your lug nuts as well as a breaker bar handy in the trunk. It can take quite a lot of force to break your lug nuts free. If all else fails, you can use your body weight or stomp on the wrench (be absolutely certain you are turning it the correct way - counterclockwise). However, using your body weight or stomping means you run the risk of stripping the lug nuts, as it is difficult to maintain full contact.  ", " Pump or crank the jack to lift the tire off the ground. You need to lift it high enough to remove the flat tire and replace it with a spare.  As you lift, make sure that the car is stable. If you notice any instability, lower the jack and fix the problem before fully lifting the car. If you notice the jack lifting at an angle or leaning, lower and reposition it so that it can lift straight up. It is always a good idea to keep a small jack stand handy in the vehicle as well, in case the jack gives out during the tire change. Using both the small jack and the normal jack will keep you safe in the event of a jack failure.  ", " Remove the nuts the rest of the way. Turn them counterclockwise until they are loose. Repeat with all lug nuts, then remove the nuts completely.  Although rare, some vehicles actually have reverse threaded lug nuts. These are usually much older cars from Chrysler and GM.  ", " Remove the tire. Place the flat tire under the vehicle so in the event of a jack failure the vehicle will fall on the old wheel, hopefully preventing injury. If the jack is placed on a flat, solid base, you shouldn't have any problems.  The tire might stick due to rust. You could try hitting the inside half of the tire with a rubber mallet to loosen the tire, or use the spare tire to hit the outside half.  ", " Place the spare tire on the hub. Take care to align the rim of the spare tire with the wheel bolts, then put on the lug nuts.  Be sure to install the spare tire the correct way and not backwards. The valve stem of a doughnut tire should face outwards, away from the vehicle. If your vehicle uses acorn-style lug nuts, it is easy to put those on backwards as well. Be sure the tapered part of the nut faces the wheel when tightening it down.  ", " Tighten the nuts by hand until they are all snug. They should turn easily at first.  Using the wrench, tighten the nuts as much as possible using a star pattern. To ensure the tire is balanced, don't completely tighten the nuts one at a time. Going in a star pattern around the tire, one nut across from another, give each nut a full turn until they are equally tight. Avoid using so much force that you risk upsetting the jack. You will tighten the lug nuts again once the car is down and there is no risk of it falling.  ", " Lower the car without applying full weight on the tire. Tighten the nuts as much as possible.  ", " Lower the car to the ground fully and remove the jack. Finish tightening the nuts and replace the hubcap.  ", " Put the old tire in your trunk and take it to a mechanic. Get an estimate for the cost of repair. Small punctures can usually be repaired for less than $15. If the tire is not repairable, they can dispose of it properly and sell you a replacement  "]}}, "How to Change a Hubcap": {"description": "You may need to replace a dinged or scraped hubcap, which can happen from parking too close to or hitting a curb. If you find yourself missing a hubcap, you will need to replace it. You may be able to find a replacement hubcap to match the other hubcaps on your car online, at a tire store that carries hubcaps or at the dealership where you purchased your car.", "content": {"Change Hubcaps With Lug Nuts": [" Pull up the e-brake and park the car somewhere flat and level. You're going to be right down by the wheels, so make sure that they can't roll!  ", " Turn one lug nut counterclockwise with a lug wrench to loosen it. Lugnuts are the small, hexagonal screws holding the tire onto the car. This may take some effort if the lug nuts are tight. Once loose, you can unscrew them by hand. If you're really struggling, you can apply pressure to the wrench with your foot to really get them off. A lug wrench looks like a crowbar with a circular hole in it. It should be in your trunk with the car, but make sure you have one if not. They are also needed to change a tire.   ", " Take three of the lug nuts off the hubcap, keeping two nuts on opposite sides on the tire. Lugnuts hold both the wheel on, and you don't want the whole wheel coming off. Take care to put the lug nuts somewhere safe so you do not lose them. If you have five total lugnuts, take off two that are next to each other and one on the opposite side.  ", " Remove the plastic washers from the lugnuts. These are what keep the hubcaps on, not just the lug nuts. Set them aside somewhere safe -- you'll need them. ", " Reattach the three lug nuts, tightening them lightly. You don't need to completely tighten them on, just to hand tightness. Then use the lug wrench to tighten them just a quarter turn more or so. These three will keep the tire in place as you remove the other two washers. ", " Unscrew the other two lugnuts to remove the hubcap. Without the washers, the hubcap should slide right off. ", " Place the new hubcap onto the bolts and replace the two lug nuts. There will be a small cut out that needs to fit over the valve of the tire. Line this up, then slide the new hubcap on and tighten on the two nuts. Just tighten them by hand for now -- don't worry about full tightness. ", " Remove the first three lug nuts, put the washers back on, and screw them in. Tighten them back on by hand so that your tire is back where it started. You can also slip the washers over the section ", " Tighten the lug nuts with the crowbar to ensure a tight fit. Tighten them all by hand at first. Then, working in a circle, tighten them each one quarter-turn at a time until they don't want to move too much. Never tighten one screw completely before moving on to the others -- this can bend or warp the hubcap.  "], "Change a Hubcap With Screws": [" Set the car in park on level ground and pull the e-brake. This is a simple, easy safety measure that should not be ignored. Don't be working on the wheels or under the care without making sure that the car can't move. ", " Locate the screw on the hubcap you need to remove. If it is not immediately visible, it could be under a plastic piece. Use a screwdriver to pry this small cover off carefully. ", " Unscrew the screw and remove the old hubcap. Take care to place the screw somewhere safe so it will not roll away or get lost. ", " Attach the new hubcap to the wheel and replace the screw. Thread it in by hand to start, then grab the screwdriver afterward. ", " Screw tightly with a screwdriver, being careful not to over-tighten the screw. Tighten it enough that it doesn't move, but don't feel like you need to break your back turning it. "], "Change a Hubcap Without Screws or Lug Nuts": [" Park the car on flat ground and pull the e-brake. You want to be 100% that the car is unable to move before you start working. ", " Pry around the rim of the old hubcap with a screwdriver to loosen it. Use a flat-head screwdriver and lightly pull at certain spots until you feel the cap wiggle loose. If something feels like it will break or snap, stop and move to another spot. You may have to loosen a few areas to get it off.  ", " Remove the hubcap. Keep prying to pop the old hubcap off.  ", " Place the new hubcap onto the wheel. Line it up with the old one, noting where the little whole or cutaway is for the valve stem. ", " Tap the rim all the way around until it the hubcap stays on. It will not be secure yet. ", " Hit the hubcap with a rubber mallet very carefully around the rim to make the hubcap secure. Lightly tap it into place, working all the way around the rim to perfect it. You should here light \"clicks\" as it pops in. "]}}, "How to Change a Truck Tire": {"description": "Like with any other vehicle, your truck’s tires will wear out over time. Changing a truck tire is a relatively simple but valuable skill to learn. Big trucks have big tires that require heavy-duty tools. To manage the truck’s weight, take proper safety precautions by parking it on a stable surface and securing it with a jack and jack stands. Removing the tire is straightforward as long as you have a tool capable of loosening the lug nuts. Swap out the old tire with a new one to get your truck back out on the road.", "content": {"Lifting the Truck": [" Park the vehicle on a hard, level surface. A garage, driveway, or quiet parking lot are a couple of options. Level, stable ground prevents the vehicle from moving while you’re working on the tire. Also, pick a secluded spot where you won’t be disturbed by other vehicles.  Hard surfaces are always better than soft ones. Soft soil, for example, may not be able to support the truck’s weight, causing it to fall off a jack. The spot you choose is an important part of changing a tire safely. If you don’t feel safe where you are, you are better off calling for a tow truck.   ", " Place chocks around the wheels to prevent the truck from moving. Chocks are small rubber blocks you can wedge underneath each wheel. Place a chock in front of and behind each tire other than the one you want to change. If you don’t have chocks, use bricks or wooden boards instead. Make sure they are firmly wedged underneath each wheel so it can’t rotate at all.  Auto part stores sell chocks, but you can also get them online. They are inexpensive but very effective at keeping you safe while working on a truck. You can also engage the truck’s parking brake for additional safety.  ", " Use a screwdriver to pry off the hubcap if your truck has one. Most truck wheels have a metal cover over the lug nuts. If you don’t see exposed lug nuts, then you have a cover to remove. Slip the tip of a flathead screwdriver between the metal cover and the rubber tire. Then, pry the cover toward you in a few different spots to pop it off of the wheel.  Some hubcaps are held in place by lug nuts. Using a lug wrench, loosen all of the nuts gradually and evenly until you are able to remove them. Most pickup trucks and flatbeds have hubcaps. Bigger vehicles, including semi trucks, often have a mix of covered and uncovered wheels.  ", " Turn the lug nuts counterclockwise with a lug wrench to loosen them. Fit the open end of the lug wrench over the nuts one by one to begin removing them. They can be difficult to move at first, but keep trying until you no longer feel any resistance. You may need to step on the wrench or throw your body weight into it to break the lug nut free. Once you feel it come loose, stop turning it and leave it on the wheel.  If you’re having a hard time getting stubborn lug nuts to turn, spray a rust-busting lubricant like WD-40 on them. Lug wrenches are fine for pickups and flatbeds, but you will most likely need something stronger for bigger vehicles. Try using a breaker bar if you’re doing it manually. For an easier way to detach the nuts, get a 1 in (2.5 cm) cordless impact wrench. It’s a handheld tool similar to drill, but it has an open end meant to fit over lug nuts.  ", " Raise the truck up by fitting a jack under it. Select a jack that is strong enough to support the truck’s weight, such as a hydraulic bottle jack. Many vehicles have notches near the wheel wells indicating a safe spot to place the jack. When using a bottle jack, pump the handle up and down to raise the truck. Lift it so the wheel is about 6 in (15 cm) off the ground.  For safety, position the jack along a metal part of the frame rather than the plastic exterior. Check the owner’s manual if you are unable to locate the jack point just by looking at the truck. To lift heavier trucks, including dump trucks and similar haulers, use a hydraulic lift instead. Park the truck on the lift, then pump the handle to raise it. The biggest lifts are capable of supporting the additional weight. Really big trucks like semis often don’t need to be lifted. The other wheels are capable of supporting the truck’s weight.  ", " Fit jack stands underneath the truck next to the jack. Pull the jack stands up so they reach the bottom of the truck. Then, slide them into place, making sure they are supporting the truck’s metal frame. The jack stands support the weight of the truck so it can’t fall off the jack. Use at least 2 jack stands to hold up the truck and prevent it from falling off the jack.  Consider using 4 or more jack stands, especially when dealing with anything heavier than a standard pickup truck.  "], "Replacing the Tire": [" Remove the lug nuts by turning them counterclockwise by hand. Now that you have the tire off the ground, you are ready to start pulling it off the truck. The lug nuts come first and should be easy to remove since you loosened them earlier. Twist them as much as you can by hand. If you are unable to remove them all of the way, finish the job with a lug wrench or breaker bar.  Spray a lubricant like WD-40 as needed to loosen stubborn nuts. You most likely won’t have to use any once the nuts are loose, but have a bottle on hand just in case. Having an impact wrench makes the removal process much easier, although you won’t need it unless the nuts are really stuck.  ", " Pull the wheel off of the truck and set it on the ground. Wheels are heavy, especially for bigger trucks, so take your time. Once the lug nuts are off, you should be able to pull the tire toward you. Grip the top and bottom of the wheel, then pull it toward you. Wear gloves to keep your hands clean and maintain a firmer grip on the wheel.  Some trucks, including semis and some pickups, have double wheels. If you need to access an interior tire, pull it off after removing the exterior tire. You may need to get on your back and go under the car to undo the nuts.  ", " Mount the new tire on the truck’s lug bolts. Line up the holes in the wheel with the lug bolts in the wheel well. After sliding the wheel onto the bolts, push it back as far as you can. If you’re replacing a double wheel, fit both wheels onto the lug bolts. Slide the inner wheel back, underneath the truck, before pushing the outer wheel into the wheel well.  Positioning the new tire can be tough, especially with bigger trucks. Consider asking someone to help you lift the tire onto the axle.  ", " Reinsert the lug nuts and tighten them by hand. Don’t tighten them all the way yet. Turn them as far clockwise as you possibly can by hand. This will secure the wheels to the truck so you can begin removing the jack and jack stands.  Make sure the lug nuts are secure so the tire can’t fall off while you’re lowering the truck back down to the ground.  "], "Lowering and Securing the Tire": [" Pull the jack stands out from under the truck. Use the jack to raise the truck by 1 in (2.5 cm). This will give you some room to reach underneath the truck and slide the jack stands toward you. Collapse the jack stands so they are easier to store.  Make sure the truck is stable on the jack before attempting to reach underneath it.  ", " Lower the truck by operating the jack. If you’re using a bottle jack, remove the handle and attach it to the metal valve near the jack’s base. Pump the handle to gradually bring the jack down until the truck’s tires touch the ground. For a hydraulic lift, lower it until the truck is back on the ground.  Don’t remove the jack yet. Wait until you have finished tightening the lug nuts with a lug wrench or breaker bar to ensure the new tire is secure.  ", " Tighten the lug nuts by turning them clockwise with a lug wrench. Once the new tire is on solid ground, finish securing all the lug nuts. Tighten them until they can no longer be moved. Test the nuts by attempting to remove them by hand. If you are able to turn them, then you haven’t tightened them enough.  Use your foot or body weight as needed to help turn difficult nuts. Switch to a breaker bar or impact wrench if you aren’t working on a pickup truck. Remember that bigger trucks can have as many as 10 lug nuts. Make sure you get them all!  ", " Replace the hubcap if the wheel had one. Many hubcap wheels fit directly over the side of the wheel and don’t require any special tools to replace. Line up the notch on the hubcap with the valve stem, then push the hubcap onto the wheel. Start with the bottom edge, fitting it against the bottom rim of the tire. Then, fit the upper part against the tire, tapping it into place with a rubber mallet or the soft part of a hubcap removal tool.  Some hubcaps screw into place. If you have this kind, fit it over the lug bolts before putting the nuts back into place. Keep the jack underneath the car until you’re done with the installation.  "]}}, "How to Replace a Bicycle Tire": {"description": "Having a flat bicycle tire can leave you stranded, but it’s simple to replace the tire yourself. Usually, this just meansreplacing the tubeinside the tire. However, you may need a new tire if it’s very damaged or worn. Before you replace the tire, you’ll need to take it off. Then, replace the tube and tire, if necessary. Finally, put the tire back onto the wheel.", "content": {"Taking Off the Wheel": [" Put your bicycle on its side with the chain facing up. You can’t remove a tire while the bicycle is upright because it will fall over. The chain side, which is called the driving side, should always face up to avoid damaging it. You can also turn the bike upside down, resting it on its handlebars. Some people don’t like turning it upside down because the handlebars or seat can get damaged.  As another option, you can invest in an upright bike stand that will hold your bicycle while you work on it. You can find these stands at some bicycle stores or online.   ", " Adjust your gears to the smallest ring if you’re removing the back tire. Usually, this will be the outer gear. Setting your chain on this outer, smaller gear will make it easier to remove the rear tire.  You don’t need to adjust the gears if you’re removing the front tire.  ", " Open and remove the quick release lever, if your bike has one. Look for the quick release lever at the center of your bicycle wheel. Pull up on the lever, then turn it 180 degrees to loosen it. Remove the lever from the axle and set it aside.  If your quick release lever doesn’t come off after you turn it 180 degrees, keep turning it until you can remove it. If you’re not sure how to remove your bicycle tire, it’s best to check your bicycle manual or the manufacturer’s website.  ", " Use a wrench to loosen the nuts if you don’t have a quick release lever. Hook the wrench onto the nut, then turn to loosen it. Continue turning the nut until it comes off. Remove the wheel nuts on both sides of the bike.  If you can’t get the nut loose, you can spray it with WD-40 or cooking spray to make it easier to loosen it. A 15mm wrench is usually the correct size for loosening the nuts on a bicycle.  ", " Detach the brake cables if necessary. In many cases, opening the quick release lever also detaches the brakes. If your model doesn’t have this feature, squeeze the calipers on the brakes to release the cables.  Check your bicycle manual or the manufacturer’s website if you’re having trouble detaching your brakes. Instructions vary for different bike models.  ", " Lift the wheel off the frame. Pull the tire out of the forked slot that supports it on the bicycle. You may need to slightly shift the bike tire as you remove it.  If you’re removing a back tire, you may need to lift the bicycle chain out of the way.  "], "Removing the Tire and Tube": [" Deflate the tire completely. Loosen the cap on the air valve. If it comes completely off, set the cap aside. Release the air using the correct procedure for your air valve type. This will make it easier to remove.  If your bicycle has a Schrader (American) valve, use a small tool, such as your wrench, to press down on the plunger inside the air valve to release the air. If you have a Presta valve, unscrew and pull up on the valve cap to release the air. If you have a Dunlop valve, take off the cap, then pull up on the air valve to release the air.  ", " Hook the rounded edge of a tire lever under the outer edge of your tire. This will pop up the edge of the tire, releasing it from the frame. Pull the other end of the lever down toward the spokes. Next, hook the other end of the lever onto a wheel spoke to keep the edge of the tire popped up.  If you don’t hook the other end of the lever onto a spoke, your tire will go back into place and reseal itself around the wheel. The outer edge of a bicycle tire is called a “bead.” You can find inexpensive tire levers at a bicycle store, outdoor store, or online. You may be able to remove your tire with a spoon or screwdriver, but they can damage your tire.  ", " Work a second tire lever clockwise around the circumference of the tire. Insert the second lever near the first one, then press up on the tire. Move the lever clockwise around the tire, pushing up on the tire as you go. Keep going until the entire side is loosened from the frame.  ", " Pull the tube out from inside the tire. Insert your fingers under the side of the tire. Grab the tube and slide it out. When you reach the air valve, push it through the hole on the wheel frame, then continue removing the tube.  You can discard or recycle the tube.  "], "Inserting a New Bicycle Tube": [" Unwrap the tube and remove the dust cap, lock ring, and valve cover. Carefully unfold the tube, making sure you don’t damage it. A dust cap and lock ring may be on your air valve, and you will need to remove them. Loosen or remove the air valve cover so you can add air to the tire.  ", " Inflate the bicycle tube slightly so it will hold its shape. Putting air in the tire will also help you avoid pinching, bending, or twisting the tube as you install it. This makes it easier to install the new tube.  ", " Inspect the inside wall of the tire for a puncture. Look for a sharp object that may have punctured the tire, such as a nail, thorn, or piece of glass. Use your eyes, a cloth, or a gloved finger to check the surface of the tire.  If you find something stuck into the tire, remove it if you plan to patch the tire. Don’t put a new tube inside your bicycle tire without checking for a puncture. If there is an item like a thorn or nail stuck in your tire, it will likely puncture the new tube.  ", " Place the tube inside the tire. Press the tube into the tire using your fingers. The tube should follow the shape of the tire. Make sure there are no bends, twists, or kinks in the tube.  The entire tube should be inside the tire before you proceed. If you're having trouble getting the tube fully inside, take it out and start over. You may need to let out some of the air you put in to help it hold its shape.  ", " Buy a new set of tires only if you can’t repair it or the treads are worn. You can usually repair a flat just by changing the tube. However, your tire may need to be replaced if it’s damaged beyond repair. This might mean a large break or puncture. It may also be beyond repair if the treads are worn down, the tire is dry rotted, or the tire is very old. If this is the case, you can buy a new set of tires from a local bike store or online.  You’ll need to buy a set of tires labeled for use on your bicycle model. It’s best to get them from the manufacturer. Tires are sold folded up in a package. Usually, the package will contain a set of tires. Always change both tires if you need to change one. Otherwise, the tires won’t match and you risk having a blow out on one of them, particularly the older tire.  "], "Putting Your Tire Back on Your Bike": [" Work the tire back onto the wheel on one side. Put the air valve in the air valve hole. Then, align the outer rim on one side with the wheel. Push the rim back into place along the wheel frame.  Check your tire for an arrow that tells you which direction the treads should face. This is called the “direction of travel.” If your tire has an arrow, make sure it’s facing forward. Some tires can go in either direction and won’t have this arrow. Don’t use any tools to replace the tire. This can damage or puncture the tire or tube. Just use your fingers. Use this same process to put the tire on the wheel frame whether it's the old tire or a new tire.  ", " Fit the other side of the tire back onto the wheel frame. Make sure the tube is completely under the tire. Next, put your fingers on one side of the air valve and press the tire into place. Work your way around the wheel frame, pushing the tire onto the frame. Finish over the air valve, which will be the loosest part of the tire when it’s on the frame.  Make sure there are no bulges on the tire, which could mean the tube is bunched up, twisted, or pinched. You may have to use tire levers at the end of the process, but be very careful not to puncture the tube or tire. Putting your tire back on the wheel can be very difficult, especially if your tire is new. However, you can get it back on with just your hands.  ", " Screw the lock ring down over your air valve if there is one. Some tubes come with a lock ring that goes down over the air valve. It will hold your tube in place on the wheel. Align the lock ring with the threads on the air valve, then screw it down.  If your bike tube didn’t have a lock ring, skip this step.  ", "Inflate your tire to the correct pressure level. You can use a manual or electric air pump to air up the tires. Fit your pump onto the air valve, then air up the tires. Once the tires reach the correct pressure level, put on the air valve cap.  The correct pressure level should be listed on your tire wall. You can also check your bicycle manual or look it up online.  ", " Slide the wheel back onto the bike and replace the lever or nuts. Thread the wheel back into the forked slot that holds it in place. Then, slide the lever or metal bar that holds the wheel back into place. Tighten the easy release lever or nuts, using a wrench if necessary. Close the easy release lever, if your bike has one.  If you fixed your back tire, you’ll need to lift the chain to put it back on. Check that the wheel spins freely.  ", " Reconnect the brakes if they’re still detached. Press the calipers again and slide the brakes into place. Squeeze the brakes to make sure they tighten up on the wheel.  Before you ride your bike, check the brakes again to make sure they’re in correct working order.  "]}}, "How to Change a Bike Tire on a Mountain Bike": {"description": "Throughout the lifetime of a mountain bike, you will find yourself needing to maintain and possibly repair various parts. If you ride your mountain bike with noticeable frequency, eventually 1 or both of your tires will go flat. There are numerous ways to fix a deflated tire, but if your tire is damaged internally, you'll need to replace the bike's inner tube entirely. Learning how to change a bike tire on a mountain bike will not take up much of your time.", "content": {"Steps": [" Turn the mountain bike over onto its back. In other words, position your mountain bike in such a way that the seat and handlebars are on the ground and the 2 tires are in the air. The tires should be able to spin freely without any resistance.  ", " Remove the faulty tire from the mountain bike. Your tire will be kept on the axle by 2 nuts, 1 on each side, and these nuts will need to be loosened and removed. Depending on the make of your mountain bike, you may also need to undo a quick release lever on the side of the tire. Disengage the brake cable before pulling out the tire from between the brake pads.  ", " Remove the tube from the rim of the wheel.  Locate the valve stem for air input and choose a spot on the opposite side of the wheel. Using the beveled end of a tire iron, separate the tire from the wheel rim and latch the iron onto a spoke.  Repeat with a second tire iron approximately 1 inch (2.5 cm) away from the first tire iron. Keep doing this around the wheel until you can fully remove the tube from inside.  ", " Check and clean the inside of the tire for debris. Look for anything that could cause future tears or punctures. In particular, thorns, glass shards, and metal shrapnel should be removed. ", " Locate the holes or tears in the tube. To find the holes, you can submerge the tube under water and look for bubbles, or you can pump up the tube and listen for any air leaks.  If a hole is located on a seam or ridge along the tube, the tire patch may not hold well and the tube will be irreparable. In that case, you'll have to purchase a brand new replacement tube.  ", " Patch the holes using the bike tire patch kit. Roughen the areas of the tube around the holes using sandpaper. Apply a glue-less patch to the tube firmly, covering and sealing the hole as tightly as you can.  ", " Wait a few minutes for the patch to bond to the tube.  ", " Test to see if the patch has held well. Pump up the tube slightly and see if there are any air leaks with the new patch. If there are, you may need to try again and apply a new patch, or the tube may be too damaged and you'll need to purchase a new one. ", " Place the tube back into the tire. Starting with the valve stem, insert the tube back into the tire. Make sure the valve stem is centered correctly or else it could end up being damaged with future use. Work the tire rubber back into the rim, removing 1 tire iron at a time.  ", " Secure the tire into your bike frame. Screw the nuts back onto the axle and reconnect the brake cables. Make sure your tire is centered correctly and be sure that your brakes are working correctly.  ", " Pump up your new tire.  "]}}, "How to Fix a Flat Tire": {"description": "Having a flat tire is one of the major inconveniences of driving. When a good spare is unavailable, you either have to call a tow truck or fix the tire yourself.  Luckily, the process of fixing it yourself is relatively straightforward and requires only a few tools.", "content": {"Finding the Leak": [" Inflate the tire. In order to find a leak the tire must be properly pressurized.  You should inflate your tire with air until it reaches the appropriate pressure (measured in psi) specified in your vehicle's service manual.  ", " Visually inspect the tire. Before moving on to more time consuming techniques, you should take a moment to look at your tire. If you notice any holes, cuts, or objects protruding from tire then you have found your leak. ", " Listen for a hissing sound. Even if you aren't able to see the problem right away you might be able to hear it.  A hissing sound is a clear sign that air is leaking from your tire, and can help you locate the leak.  ", " Feel around the tire for air. If you run your hands over the tire carefully you may feel the leak even if you can't hear or see it.  ", " Mix soap and water. If you followed the steps above and you were not able to easily find the leak don't fear. Spraying the tire with a little soapy water or window cleaner may help. If you see bubbling at any place on the surface of the tire then you have found your leak.  ", " Cover the tire with the soap and water solution. You can use a spray bottle to spray the tire, or if a spray bottle isn't available you can just pour the mixture over the tire.  ", " Watch for bubbles. As air escapes the tire and encounters the soapy water mixture it will form soap bubbles. If you notice the soapy water bubbling at any particular place on the tire, you have found your leak. "], "Fixing the Leak with Tire Puncture Sealants": [" Read the directions on the can of sealant you have brought. Various manufacturers have slightly different steps and required amounts you should put in. However, there are some steps that are generally the same. ", " Pull out any object that has punctured your tire. This may or may not be necessary depending on why your tire is flat. ", " Turn the wheel until the valve is at the top of the wheel. Unscrew your valve cap. You will put the sealant in the same way that you would inflate your tire with air. ", " Attach the nozzle of the product to the valve stem. Once you have it on securely, press a button to release the contents.  ", " Drive your car. You need to drive your car to rotate the tire. This allows the sealant to be distributed evenly inside the tire and prevents it from forming a heavy lump inside the tire.  ", " Replace your tire. Tire sealants are great to bail you out in a major crisis. Unfortunately they are only good for 3 days or 100 miles, whichever comes first. You should replace your tire before then to avoid possible problems.  "], "Using a Tire Plug Kit": [" Loosen the lug nuts with a lug wrench (tire iron) or impact wrench. It is important to remember to loosen, or break, the lug nuts before you jack up the vehicle.  This way the weight of the vehicle is still on the wheels and it prevents them from spinning dangerously while you turn the lugs. ", " Jack up the car. Once the lugs have been loosened, it will be necessary to jack the care up so that the wheels can be removed.  As mentioned above, this should be done on level concrete or some other hard, level surface.  Some important things to remember when jacking up the care are:  Your service manual will recommend jacking points The most common way to elevate the car is a floor jack, or trolley jack. If you are unsure how to use one visit . You should use jack stands to stabilize the car.  A good tutorial on jack stands can be found at . If you have access to a hydraulic lift it will save you time.  ", " Remove the lug nuts and pull the wheel off of the hub. At this point, the lugs may be loose enough to remove by hand.  If not, finish removing the lugs with the lug wrench or impact wrench.  Once the lugs are removed, pull the wheel off of the wheelbase. If you are uncomfortable removing a wheel, read about how to Remove Lug Nuts and Tires .  ", " Pull out any protruding object with a pair of pliers. It is also good practice to mark the spot with chalk or markers.  When there's no protruding item, follow the above steps for locating a leak.  ", " Clean the hole with the rasp tool contained in the tire plug kit. This is done by inserting the tool in and out of the hole quickly. This also roughens the area so the fix will hold. ", " Thread the plug through the center of the insertion tool. Both of these pieces can be found in your tire repair kit. This is sometimes difficult and requires squeezing down one end to make it fit though the hole first.  ", " Use the insertion tool to force the plug into the hole. There should be roughly ½” of plug protruding from the tire. If your kit came with an adhesive, such as rubber cement or glue, apply it to the plug before inserting. This will lubricate the plug, making it easier to push in. The adhesive will also promote a better seal.  ", " Cut away the excess plug material from the tire surface. Before doing this, you should let any adhesives used dry for at least one minute.  ", " Pump air into the tire. Use a tire gauge to check that the tire is at the manufacturer recommended air pressure. ", " Apply some soap mixture onto the plug. This will allow you to check the seal to make sure it is holding. If it isn't holding, add a little cement or retry using another plug.  ", " Re-install wheel. You should slide the wheel back onto the wheelbase and thread the lug nuts on tight enough to hold wheel in place while the car is still on the jackstands.  ", " Lower the vehicle to the ground. Use the floor jack to lift the vehicle off of the jackstands. Remove the jackstands and lower the vehicle with the floor jack.  ", " Tighten the lugs to the specified torque. Once the weight is back on the wheels, use a lug wrench or impact wrench to tighten the lugs to the proper torque specifications in your service manual. Be sure to tighten lugs in a star pattern.  ", " Replace the tire. While a plug can provide more stability than tire sealants, it is not a forever solution. It is suggested that you replace the tire within the next 20,000 miles.  "]}}}