{"How to Clean Black Appliances": {"description": "Black appliances have a beautiful glossy appearance. That look, however, rarely lasts. Black surfaces pick up fingerprints easily and, even after cleaning, pick up streaks that seem impossible to remove. The key to keeping black appliances looking good is to carefully buff them after cleaning.", "content": {"Cleaning Your Appliance": [" Dampen a terry cloth towel. Terry cloth towels will be gentle on your appliance. Wet them and then squeeze out excess moisture.  Terry cloth is the fabric used for most bath towels, bath robes, and slippers, but because of its soft, absorbent qualities it can be great for non-streak cleaning as well. Terry cloth towels are plush and soft.    ", " Apply an ammonium-based cleaner or vinegar solution to the towel. Apply a cleaner to the towel. For store bought solutions, use an ammonium-based cleaner. This includes most glass and window cleaners, multipurpose cleaners, and oven cleaners.  For a homemade vinegar solution, mix one part vinegar with one part water.   ", " Wipe down the appliance. Take your towel and wipe down the appliance. This will sanitize the appliance and remove dirt, but probably leave streaks. You will likely need to perform this cleaning frequently.  Buffing immediately after cleaning will remove the remaining streaks.  ", " Pick up tough stains with gentle cleaners. To protect against scratches, never use steel wool or abrasive scrubbing pads to pick up tough stains. Magic Eraser is good at picking up tough stains, without leaving scratches.  For a homemade alternative, try mixing baking soda with a couple drops of liquid dish soap. Apply this solution to an old toothbrush and use it to scrub away tough stains.   "], "Buffing the Appliance": [" Set aside fabric towels for buffing. Ideally, you should have certain towels that you only use for buffing. This will prevent them from accumulating cleaning products, making them more effective at removing streaks. Wash them separately from your other towels, without bleach.  Consider making all your buffing towels a single color to make them easier to recognize. A simple fabric towel should suffice. Although some people recommend microfiber, a basic towel made of cloth should work in most cases.   ", " Clean before buffing. If you do not wipe your appliances down with a cleaning solution before every buffing, your buffing towels will accumulate dirt and become ineffective. Always be sure that there is no dirt or grime left on the appliance before you buff it.  ", " Wipe the appliance down with a clean, dry buffing towel. Do not wet the towel or apply cleaner. A dry towel should easily pick up the streaks. Gently wipe down the entire surface before the cleaner dries.  If you allow the cleaner to dry on before buffing it, you will find it harder to pick up streaks that have dried on.  "]}}, "How to Clean Kitchen Appliances": {"description": "There are many ways to clean your kitchen appliances. This article provides just a few possibilities for putting common items from your kitchen to good use cleaning kitchen appliances.", "content": {"Using salt": [" Use salt to clean burnt food. For spills onto the stove top, sprinkle with salt before it has a chance to cool; it'll peel off with ease. If you've burnt food onto the base of your pans, sprinkle with salt and a little water and let sit for a while before scrubbing off. The salt will help to lift off the burnt material.  ", " Use salt and lemon to clean cutting boards. Cut a lemon in half. Rub the cutting board with the lemon half. Sprinkle the rubbed board with salt. Allow to sit for a quarter of an hour. Then, use the lemon half to rub the salt in. Rinse off with water. Let dry. The board will now be deodorized and clean. ", " Use salt to clean cast iron. Make a mixture from one tablespoon of olive oil and a teaspoon or so of coarse sea salt. Scrub the cast iron pan or pot with a cloth, using the abrasive quality of the salt to thoroughly clean. Finish off by wiping off the salt and leaving a thin layer of olive oil for a coating.  "], "Using citrus": [" Clean the microwave with a lemon. Cut a lemon in half. Place both halves cut-side down on a microwaveable plate with a tablespoon of water. Microwave for about 1 minute or until the lemon is hot and the inside of the microwave is steamy. Wipe the inside of the microwave with kitchen paper and wash the plate. Now that the lemon is hot and squishy, it makes a great natural cleanser for a smelly garbage disposal. Cut the halves into smaller pieces and flush through with plenty of water. ", " Remove grease from appliances with a lemon. Slice a lemon in half and place it in the microwave on high for 30 seconds. Firmly rub the inside of the lemon over your kitchen appliances in a circular motion - microwaves, ovens, fridges whatever you have that harbors grease and grime. Heat the other half of the lemon and continue if necessary. Wipe down with a clean kitchen towel and be amazed as all the grease pulls away effortlessly. ", " Use lemons and oranges to clean water stains. Use fresh citrus juice on chrome items in the kitchen, to remove scale build-up. Squeeze the juice out, then either wipe or spray it onto the chrome item. ", " Use lemon to clean odors. Lemons can be used to remove odors from plastic containers and garbage disposal units. For a garbage disposal unit: Throw finished peel and lemon halves/quarters into the unit. Turn the unit on to grind the lemon pieces. This is a great way to get rid of the peel or old lemons, as it will leave a fantastic odor behind. For plastic containers, squeeze lemon juice into soap water and fill the container. Allow to soak for half an hour or so, then scrub lightly. Pour out and allow to dry. The odor should be gone. Let sit for 10 minutes, then rinse off. Any scale build-up should come off with it.   "], "Using vinegar": [" Clean your microwave using vinegar. Heat up a mixture of vinegar and water for few minutes and wipe it with a towel for cleaning. ", " Use vinegar as an all-purpose surface cleaner in the kitchen. Vinegar can effectively clean kitchen counter tops, stove tops, and the tops of refrigerators and other appliances. Spray undiluted vinegar over the surface of appliances and counters in your kitchen, then wipe away using paper towels or a soft, clean rag. ", " Use vinegar to clean odors out of food processors and blenders. Pour half a cup of white vinegar into the food processor bowl or blender jug. Add a quarter teaspoon of your usual dish washing detergent. Pour in warm water to near the top of the food processor bowl or blender jug. Place the processor or blender lid on and set aside. Leave for an hour or two. During this time, the vinegar will absorb the food odor from the plastic or glass. Tip the water and vinegar solution out. Wash the processor or blender as usual. Give it the sniff test; if it's odorless, you're good to go. If not, repeat but allow the soaking to occur for 8 to 12 hours, then rinse. That will usually be sufficient to remove the odor. ", " Remove soap scum from kitchen faucets. Mix together 1 part salt with 4 parts vinegar, then moisten a rag with the solution. Use the rag to rub away built-up soap scum from bathroom and kitchen faucets. ", " Periodically run the dishwasher with vinegar. Place 2 cups of vinegar in the bottom of your dishwasher and run it on low, or the energy-saving setting. Halfway through, stop the dishwasher and let the vinegar soak on the bottom for 15 or 20 minutes. After the time is up, turn it back on to finish. If it's really bad, you can let it soak overnight. If smell is an issue, sprinkle 1/2 - 1 cup of baking soda around the bottom and run the washer as normal. ", " Use vinegar to descale a kettle. Dilute it with water in a 1:1 ratio. Pour into the kettle and leave it in the kettle for 1 hour, without boiling. Tip it out after the soaking time. Rinse. Fully rinse the kettle with fresh water at least 5 times before using again. "], "Using soap and water": [" Clean a blender with soap and water. Squeeze a little dish detergent into the the blender. Add a little warm water. Press the blending button to give it a whirl. Tip it out, then rinse with water. For more details, refer to How to clean a blender . "], "Using baking soda": [" Clean the oven with baking soda. See How to clean stubborn stains off an oven using baking soda and How to clean oven glass with a baking soda paste for more details. ", " Use baking soda to keep sink drains smelling sweet. Add 2 tablespoons of baking soda to the drain and run warm water for a couple minutes. This will help keep your drains from becoming stinky. ", " Use baking soda to scrub baked-on food in casserole dishes. Add a bit of baking soda powder to a dampened dishcloth. Scrub the casserole to remove the baked on food. You can also apply the baking soda powder directly to the surface and scrub. ", " Use a box of baking soda to help keep the refrigerator smelling sweet. Be sure to change the box about every month or so to maintain the deodorizing effect. "]}}, "How to Clean Stainless Steel Appliances": {"description": "Stainless steel makes for a great modern finish on appliances like refrigerators, ovens, dishwashers, blenders, and toasters. Unfortunately, it can also be a magnet for fingerprints, spots, and streaks. The good news is that it’s actually pretty easy to clean your stainless steel appliances, as long as you know what you’re doing. Use a mild detergent to wipe away streaks and prints, and clean it with nonabrasive cloths to polish the steel surfaces.", "content": {"Washing Away Marks and Fingerprints": [" Check the grain of your stainless steel. Like wood, stainless steel has a grain, or a surface texture that runs in a particular direction. For appliances with a horizontal grain, wipe in straight motions from one side of the steel face to the other. For appliances with a vertical grain, wipe the steel face in long, fluid motions from top to bottom.  Avoid rubbing your cloth back and forth or up and down. Try to start all your wipes from one side and move straight across or down to the other. So, for example, if you start a wipe on the left side of an appliance, wipe all the way to the right, then bring your cloth back to the left to start your next wipe. This helps decrease streaks as you wipe.   ", " Dilute 4-5 drops of dish soap in 1 US quart (950 ml) of warm water. Mix the dish soap until it’s fully incorporated into the water. The water should be foamy or bubbly on top, and you shouldn’t see any streak or chunks of the dish soap left suspended in the water.  Use a mild dish detergent to clean stainless steel. Abrasive detergents may scratch or damage your steel.  ", " Wipe down the steel using soapy water and a microfiber cloth. Dip a clean, nonabrasive cloth into your soapy water just enough to moisten it. Wring out any excess liquid, then wipe down your steel with the soapy cloth, working in the direction of the grain.  Work in sections for the washing, rinsing, and drying process. You don’t want the soap to dry before you rinse it, as this can leave residue and streaks.  ", " Rinse the steel with a clean cloth soaked in hot water. After soaping a section of your appliance, rinse the detergent away using a new, clean, nonabrasive cloth soaked in hot water. Go over the section as many times as you need in order to remove all the soapy residue from the steel.  It may help to put a towel or something absorbent under the appliance to catch any excess water that spills during the rinsing process. Wring out the cloth in between sections to remove any soapy water that may have accumulated as you rinsed.  ", " Dry the steel with a clean, nonabrasive cloth. Once you’re done rinsing down your section of stainless steel, immediately dry it with another clean microfiber cloth to avoid streaks. You may need a couple cloths to properly dry larger appliances like refrigerators.  Avoid letting the appliance air-dry, as this could lead to spots and streaks.  "], "Polishing Stainless Steel": [" Mist your appliance with white vinegar. Fill a spray bottle at least ¼ of the way full with white vinegar. Then, spray down the stainless steel surfaces of your appliance with a thin mist of the vinegar.  Mist the appliance enough that you cover the full surface, but not so much that the vinegar starts to condense into droplets and roll down the front of your appliance.  ", " Wipe down the steel with a cotton microfiber cloth. You want to use a clean, nonabrasive cloth to wipe down stainless steel. Microfiber cloths work best, but any nonabrasive cloth will do. Wipe down your appliance in the direction of the grain until you’ve removed all the vinegar mist.  Wiping down your appliance with vinegar helps cut through dirt and grime and get rid of streaks and marks before you polish it with oil.  ", " Polish the steel with mineral oil and a clean cloth. Add a few small drops of mineral oil or olive oil to another clean, nonabrasive cloth. Gently wipe the oiled cloth over the surface of the steel, going with the grain. Wipe in sections, adding more oil to the cloth as necessary.  You don’t want any oily residue on the surface of your appliance. There should be just enough oil to give it a polished look. If you have too much oil on your steel, use a clean, unoiled cloth to wipe away the residue. This may take a few passes. Only add a little bit of oil to your cloth at a time. It’s always easier to go back and add more than it is to take away excess oil.  "], "Using a Specialty Cleaner": [" Spray on a spray cleaner for a deep clean. You can find purpose-made stainless steel cleaners at most home improvement stores, groceries stores, and major online retailers. For most of these products, you simply spray it on your appliance, allow it to soak for 1-2 minutes, then wipe it away with a clean, nonabrasive cloth.  Specific directions for each cleaner will vary from product to product. Read the directions for use on the product packaging before you apply it to your stainless steel appliances.  ", " Use stainless steel wipes for quick cleanings. Like spray cleaners, you can find wipes made specifically for stainless steel in most stores that sell cleaning products. These wipes usually let you wipe down the surface of your appliance in a single step, without having to rinse, dry, or polish.  Wipes may not be as effective as sprays or detergents for removing grease and oils from fingerprints. They are great for quick cleans in between deep cleans to keep your appliance looking fresh, but they often don’t substitute for a deep clean.  ", " Invest in a scratch-removal kit for surface scratches. If you have small scratches on the surface of your steel, your best option is to get a scratch removal kit made especially for stainless steel. These kits will help you buff out small scratches, but they won’t take care of large or deep scratches.  Read the directions for the kit fully and completely before using it on your appliances. Directions may vary from kit to kit.  "]}}, "How to Remove Yellowing from White Appliances": {"description": "Removing yellowing from appliances can be a pain, but there are several ideas that you can try. Clean appliances weekly with an all-purpose cleaner with bleach, a magic eraser pad, or baking soda. For severe yellowing, apply a cream peroxide to appliances and put them in direct sunlight for 3 to 4 hours to reverse the discoloration.", "content": {"Doing a Basic Cleaning": [" Wipe down appliances with an all-purpose cleaner. To clean white appliances, use an all-purpose cleaning spray that contains bleach, which will disinfect surfaces and whiten stains. Spray the product onto a clean cloth or sponge and wipe down the surface thoroughly. Rinse with a clean wet cloth.  Before buying, read the product label to make sure that it is safe for use on appliances. Maintain white surfaces by doing a basic cleaning every week.   ", " Use a magic eraser pad. Purchase a magic eraser pad to remove stains on your yellowed appliances and whiten them. Simply wet the sponge and wipe down the surface of the appliance thoroughly. There is no need to rinse afterwards!  Magic eraser pads are safe for use on most surfaces, other than those with delicate or glossy finishes.   ", " Clean surfaces with baking soda. Sprinkle a generous amount of baking soda onto a damp, clean cloth and wipe down the surface of your yellowed appliance. For hard to reach parts or corners, use a soft-bristled toothbrush to scrub things clean. To rinse, wipe with a clean, wet cloth. ", " Use a bleach and baking soda solution. Combine 32 fluid ounces (950 mL) of warm water, 4 fluid ounces (120 mL) of bleach and 2 fluid ounces (59 mL) of baking soda in a bucket. With gloved hands, dip a clean sponge in the liquid, wring it out, and wipe down the surface of your appliance. Let it sit for 10 minutes, then wipe the appliance once more with a clean, wet sponge.  You may need to repeat the process a couple of times for best results. Make sure to wait the full 10 minutes each time.  "], "Using Cream Peroxide on Small Plastic Appliances": [" Purchase a bottle of cream peroxide. Look for a bottle of cream peroxide at hair supply stores. Cream peroxide ranges in concentration from 9 to 12%, making it more effective than hydrogen peroxide at 3%. This ingredient is used to bleach and color hair in salons and may also be found in permanent hair dye kits (sold in pharmacies and department stores).  ", " Coat the appliance evenly with cream peroxide. Put on gloves to protect your skin. Cover any emblems or stickers on the appliance with scotch tape to protect them. Use a toothbrush or paint brush to apply the cream peroxide to the surface of the appliance.  ", " Seal the item and place it outside in the sun. Place the item in a large Ziplock bag or clear garbage bag and seal it tightly. The cream peroxide should not be allowed to dry during this process, so make sure that there are no tears or holes in the bag. Place the item outside in direct sunlight.  This method of whitening is ideal for small to medium sized appliances, that can easily be covered and moved outdoors. Check weather reports to make sure that it will be sunny for several hours before starting the process.  ", " Let the item sit outside. Allow the appliance to sit outside for 3 to 4 hours in the sun. Rotate the item every hour so that all parts of it get equal sunlight. Exposure to UV light will prompt a reaction with the cream peroxide, reversing the yellowing effect on the appliance.  ", " Remove and rinse the item. Remove the item from the bag. Using a wet cloth, wipe off all the cream bleach from the surface. Allow the item to dry for several hours before using it.  "]}}, "How to Clean a Vicks Humidifier": {"description": "A Vicks humidifier can be a godsend when you’ve got the flu, a nasty cold, or sinus issues. They use special filters to remove contaminants from the air and contaminants from your water can build up into scaly deposits over time. Fortunately, cleaning your Vicks humidifier is actually really easy. Rinse the humidifier daily to keep it lasting longer, and do a nice deep-cleaning at least once a week to remove any scale deposits. It’s also a good idea to disinfect the water tank and tray at least once a month to prevent any bacteria from building up.", "content": {"Rinsing the Humidifier Daily": [" Place the humidifier on a flat surface. Make sure the humidifier is turned off and unplug it. Set it on a clean, flat surface like a table or a countertop. Make sure you have enough space to clean the humidifier.  Make sure the surface is flat and even to keep water from running off the sides.   ", " Remove the water tank and water tray. Both pieces are attached to the base of the humidifier. Take off the water tank first, which will allow you to slide out the tray. Be careful not to damage the filter when you remove the tank and tray.  If your humidifier doesn’t have a tank, remove the top housing and lay it upside down on a flat surface. Make sure you don’t rest the housing on the water tube or you could damage it.  ", " Empty the tank and flush it with warm water. Unscrew the cap on the water tank and empty the water into a sink. Flush the container with clean, warm water. Shake the container to slosh the water around inside of it.  Use warm, but not hot water to flush the tank. Hot water could melt or warp the plastic. If your humidifier doesn’t have a water tank, empty the base of any remaining water and wipe it down with a clean rag or paper towel to dry it off.  ", " Wipe down the water tank with a dry cloth or paper towel. Take a clean cloth or a few paper towels to the exterior of the water tank and any other areas that may have gotten water on it. If any other parts of the humidifier are dusty or dirty, use the damp cloth or paper towel to wipe them down.  "], "Deep-Cleaning the Humidifier Weekly": [" Empty the water tank and flush it with warm water. Remove the water tank, unscrew the cap, and empty any water inside of it. Then add some warm water to the tank and shake it around to flush it. Set the tank off to the side until you’re finished cleaning the humidifier.  Place the tank upside-down to allow any additional water to run out of it.  ", " Turn on the humidifier to allow air to flow through the filter. With the tank still removed, turn on the humidifier. When the wicking filter is completely dry, turn off the humidifier and unplug it. It should take about 10-15 minutes for the filter to dry out. If your humidifier doesn’t have a removable tank, turn off the humidifier and unplug it. Then remove the top housing, and dump out any water left inside. Wipe it down dry with a cloth or a paper towel.  ", " Lift the filter from the water tray. Gently pull the filter straight up to remove it without tearing it. The filter should be completely dry before you try to remove it. If it isn’t dry, wait another 5 minutes.  ", " Remove the water tray and pour 1 cup (240 mL) cup of vinegar into it. Slide out the water tray and set it aside. Pour the undiluted vinegar into the tray and allow it to sit for 30 minutes. The vinegar will loosen any scale deposits that may have built up over time.  For humidifiers that don’t have a removable tray, use a sponge soaked in vinegar and wipe the inside of the base. Then rinse it out with warm water. Use undiluted white vinegar.  ", " Scrub the water tray to remove any scale deposits. After 30 minutes, take a sponge and scrub off any scale from the water tray. If the scale isn’t coming off, soak the tray in vinegar for another 30 minutes then scrub it again.  Use a sponge that has an abrasive side to scrub the tray.  ", " Rinse the tray and pickup tube with warm water. Once you’ve scrubbed off the scale deposits, rinse off the water tray and the pickup tube that transfers the water from the tank. Use warm water that isn’t too hot. Dry off the tray, tank, and tube with a clean cloth or paper towels when you’re finished.  Make sure you rinse the inside and outside of the pickup tube.  "], "Disinfecting the Water Reservoir Monthly": [" Fill the water tank with water and bleach. Mix together 1 teaspoon (4.9 mL) of bleach and 1 gallon (3.8 L) of warm water. Allow the water tank to soak for 20 minutes. Stir the water occasionally by gently shaking the container every few minutes to make sure the bleach reaches every part of the tank.  If you don’t have a removable water tank, add the bleach and water mixture to the water reservoir in the base.  ", " Pour out the bleach water after 20 minutes. Remove the pickup tube and carefully pour out the bleach so it doesn’t get on any other parts of the humidifier. Pour the bleach into a sink or another safe disposal area.  If any of the bleach water splashes onto the humidifier, dry it off immediately with a cloth or paper towel.  ", " Rinse the water tank and the pickup tube until the bleach smell is gone. It’s important that you flush away all of the bleach from the humidifier. Use warm water to rinse the water tank repeatedly until you no longer smell any bleach at all. Make sure you flush the pickup tube as well.  Flush out the water reservoir in the base if your model doesn’t have a removable tank.  ", " Dry off the entire humidifier. Use a clean, dry cloth or paper towels to dry any surface that got wet. It’s important that the exterior of the humidifier is completely dry before you plug it in and use it.  Let the humidifier air-dry for about 3-4 hours to make sure it’s fully dry.  "]}}, "How to Clean a Warm Mist Humidifier": {"description": "Warm-mist humidifiers can create a more comfortable environment by releasing moisture into your home’s air. Because humidifiers contain water reservoirs, they do need to be washed regularly. By performing routine cleaning and minimizing the risks of warm-mist humidifier use, you can enjoy your humidifier in a healthy way for years to come.", "content": {"Cleaning Your Humidifier’s Removable Parts": [" Unplug your humidifier and let it cool. Before cleaning your humidifier, be sure to unplug it from the wall. If it’s been running, let the humidifier cool down until it is completely cool to the touch.  ", " Remove all detachable parts from your humidifier. Gently remove any detachable parts of your humidifier for cleaning, so you can better access the water reservoir inside. It may be helpful to consult your owner’s manual, which usually has directions on how to take your unit apart for cleaning.  ", " Place all removable parts in a white vinegar bath for 30 minutes. Fill your sink with household white vinegar, and place the detachable parts of your humidifier in to soak. Let them sit for 30 minutes.  ", " Wash the parts with a sponge. Using a regular kitchen sponge, wipe all the components with the vinegar in the sink. Focus on any areas of mineral or mildew build up, rinsing and wringing the sponge as necessary.  ", " Rinse the removable parts with distilled water. Using distilled water, rinse the parts after soaking to remove all traces of the vinegar. Dry thoroughly with a clean towel. Set these aside. "], "Cleaning Inside Your Humidifier": [" Dump out any water from the humidifier. Dump out any residual misting water from the humidifier, shaking if necessary to remove as much as possible. Set the humidifier down on its base as if you were going to use it. ", " Fill the water reservoir with white vinegar. Pour household white vinegar into the water reservoir of the humidifier, filling to within a half inch (1.5 cm) of the top. Let the vinegar sit in the humidifier for 30 minutes to kill any bacteria and loosen scum.  ", " Use an old toothbrush to scour any areas of minerality or mildew. Use a toothbrush or baby-bottle brush to scrub any gray or brown areas of mineral staining or mildew. Be sure to focus your attention on any crevices where water pools as the humidifier’s tank empties with use. ", " Rinse the humidifier with distilled water. Dump the vinegar out of the humidifier into the sink. Fill the reservoir with distilled water and dump out two times to rinse the vinegar completely. Let the humidifier air-dry. ", " Reassemble the humidifier. Using your owner’s manual, reassemble the humidifier with its clean component parts. The humidifier is now ready for use. Clean your humidifier every three days for optimal functioning.   "], "Minimizing Risks of Warm-Mist Humidifiers": [" Empty your humidifier’s tank between uses. It can seem convenient to fill your humidifier full of water and run it on and off until all the water is gone. To minimize the growth of bacteria and mold however, it’s really best to dump out your humidifier between uses so stagnant water is not sitting inside the machine for long periods of time.  Only use distilled water in your humidifier, as its lower mineral content will lead to less buildup inside your machine.  Refill the machine with clean water each time you’d like to use it.  ", " Keep your humidifier away from upholstery and fabric. Excess humidity can cause mold to grow on upholstered surfaces, such as curtains or carpets. Run your humidifier on a heat-safe surface away from any fabric. ", " Use only cool-mist humidifiers for children to avoid burns. Warm mist humidifiers can release mist of varying heats, from lukewarm to hot. To protect your child from possible steam burns, use only cold-mist humidifiers in children’s rooms. Supervise your child whenever they are around your warm-mist humidifier. "]}}, "How to Apply Aquapel": {"description": "Aquapel is a product you can apply to any glass surface to repel water. The chemicals bond with the glass, causing rain and other liquids to bead and fall off.It is especially useful to improve your visibility when you’re driving, keep your shower doors water-mark free, and make other glass surfaces look cleaner for longer. Pre-cleaning the windshield, window, or any other glass surface is key to ensuring the Aquapel properly bonds to the glass.", "content": {"Applying Aquapel to Your Windshield": [" Check the weather to make sure it’s above 40°F (4°C) and not raining. Before you prepare your windshield, make sure it’s not raining or too cold because water and near-freezing temperatures can affect how Aquapel bonds to the glass. Your car can be in an open garage or outside—direct sunlight won’t affect how the chemical bonds to the glass.  If your car is parked under a tree, move it to an open-sky area to prevent debris falling onto the windshield.   ", " Lift the windshield wipers away from the glass and wipe them clean. Lifting the wipers will allow you to clean the entire windshield without missing the areas under the wipers. Grasp each wiper at the mid-way point and pull them at a diagonal angle away from the glass. Then wet a paper towel and wipe them clean so they can sweep off rain without leaving streaks across the windshield.  Make sure the wiper blades aren't worn or misshapen because that affects how efficiently they wipe raindrops away. If your blades are worn out, buy replacements at any hardware or automotive parts store.  If you have a windshield wiper on the rear window, pull that one up as well. Note that if you’re applying it to the back window, you’ll need a second applicator because a single applicator only covers a little more than 1 windshield.  ", " Clean the windshield with a professional glass cleaner. It's important to clean the glass first so the Aquapel can bond with the glass (and not any residue or dirt sitting on top of the glass). Spray glass cleaner onto the windshield and use a paper towel or rag to wipe it clean.  Do this for all of the windows where you plan to apply Aquapel. Inspect the windshield from several angles to make sure there are no streaks or dirty spots left.  ", " Wear safety goggles or glasses to protect your eyes. Aquapel can irritate your eyes, so put on a pair of safety goggles or glasses to prevent any accidents. If it does get in your eyes, flush them with water for 5 to 10 minutes.  If your eyes continue to show signs of irritation (redness, burning, pain), go to a doctor.  ", " Touch the felt base of the applicator to the glass and squeeze the applicator’s wings. Grip the applicator with your thumb, index, and middle finger, and hold it onto the glass. Squeeze the small wings on either side of the applicator (where your fingers are gripping it) until you hear a pop and see that it's releasing the Aquapel.  Make sure to hold the applicator level for even distribution.  ", " Apply the Aquapel to 1 side of the windshield in a criss-cross pattern. Use medium pressure to apply the product to half of the windshield, using long strokes from the top to the bottom. Then, apply it over the same area moving from side to side to make a criss-cross pattern.  Use the black outline of the windshield as a guide so you avoid getting the product on any painted areas of the car. You only need to apply 1 layer, so work slowly and make sure you haven’t missed any strips of glass. The Aquapel will start to bead as you apply it. Avoid getting Aquapel on the wiper blades or molding.  ", " Wipe away any excess Aquapel with a paper towel or clean rag. Once you've applied Aquapel to one half of the windshield, wipe off as much of the residue as you can—do not let the product sit on the surface for longer than it takes you to apply it.  Fold or rotate the towel if you need to so you're using a dry side for each section of the windshield.  ", " Repeat the criss-cross application and wiping process on the other side. Start at the top of the windshield near the center and make long strokes up and down the window. Then reapply it from side to side. Once you’re done, use a clean rag or paper towel to wipe the product away.  It’s okay if you accidentally go over an area that you covered in your first application on the other side.  ", " Reapply Aquapel on the area in front of the driver's seat and then wipe it clean. To get the most visibility when you’re driving, reapply the product to the windshield in front of the driver's seat in a criss-cross pattern and then wipe it away just as you did in the beginning. There should be just enough left in the applicator to cover the area in the driver’s line of vision, but if not, open a new one.  Dispose of the applicator and paper towels in a trash can after you’re done. Do not try to wrap the applicator to save some for later use. Aquapel will work for up to 6 months and won’t come off in the car wash.  ", " Treat the back and side windows with 1 or 2 new applicators if desired. Each Aquapel applicator has enough of the product to treat 1 average-sized windshield (like on a sedan). For a 2-door car with only 2 large windows on the sides (and 2 small triangle ones), you can use 1 applicator to treat those along with the small rear window. For a 4-door car, use 1 applicator on the 4 side windows and 1 applicator on the rear window.  For a large van or a sedan with a large sunroof, you’ll need a total of 3 to 4 applicators to treat all of the glass.  "], "Using Aquapel on Glass Surfaces": [" Protect your shower doors from watermarks and soap scum. First, clean your shower doors with a glass cleaner until any existing watermarks are gone. Hold the applicator at the top of the glass and make streaks going up and down the door. Then start at the top of the door and sweep it on from side to side. Work in criss-cross patterned blocks until you've covered the entire surface and then use a paper towel to wipe off the product as soon as you finish applying it.  Stop inch (1.3 cm) away from the sides of the door so you don't get any product on the molding. One applicator should be enough for a single shower door. If you have 2 or 3 large glass walls around your shower, you may need 2 or 3 applicators. Reapply the product every 6 months.  ", " Use it on house windows to prevent rain streaks. Clean the outside of your home windows with glass cleaner and a rag. Then apply a layer of the product on 1 or 2 small windows at a time in a criss-cross fashion. As soon as you’ve covered 1 or 2 small windows, wipe it away with a clean cloth and move on to the next set of windows.  Note that 1 Aquapel applicator holds enough product to cover a windshield, so you may need to stock up if your house has a lot of small windows or floor-to-ceiling windows. If your windows have painted panes, leave inch (1.3 cm) of room around the edges when you’re applying it.  ", " Apply it to glass tables to protect from spills and watermarks. Clean the table with glass cleaner and then apply Aquapel in even, parallel strokes before going over it again to form a criss-cross pattern. Once you’ve covered the whole table in a criss-cross pattern, wipe the table clean with a rag or paper towel. Don’t let the product sit on the table for any amount of time—wipe it down as soon as you finish applying it.  Any spilled liquids will bead on top of the surface so you can easily wipe the mess away. If your glass table has water rings, rub out the marks with saltwater and a rag or white vinegar and lemon juice before applying Aquapel.  "]}}, "How to Clean a Garbage Can": {"description": "A dirty garbage can is unsightly and smelly. Fortunately, you can easily clean up your garbage can so it doesn’t cause any negative odors in your space. You can pull out large particles and take it outside to hose it off. You can also use soap and water and a scrubbing brush to deep clean it. To keep your garbage can from smelling, change out the trash bag every day and give the inside of the can a quick spritz of a cleaning solution.", "content": {"Spraying the Can Clean": [" Put on a pair of rubber gloves. A thick pair of rubber cleaning gloves will keep your hands protected from any bits of old food and trash while you’re cleaning out your garbage can. Use a pair of well-fitting rubber gloves so you can work to clean out the can and keep your hands from being exposed to the bacteria and gunk in the can.  You can find rubber cleaning gloves at department stores and online. Make sure there aren’t any holes or tears in the gloves before you start cleaning out the can.   ", " Empty out the trash and pull out any large particles. Remove the garbage bag from the can if there is one. Use your hands to pull out any large bits of food or debris that are in the can. If any bits are stuck to the sides, pry them off with your fingers.  Throw any garbage that you remove into the bag you removed or another trash bag to dispose of it.  ", " Take the garbage can outside. Find an area where you can spray down the garbage can with a hose without damaging any plants or furniture. You also don’t want the water to run off onto a public sidewalk or street. Your backyard or a side alley away from pedestrian traffic will work as suitable areas to clean out the garbage can.  You can lay down a plastic sheet or tarp over your grass if you want to keep it protected from the water used to clean out the garbage can.  ", " Spray down the inside and outside of the can with a garden hose. Aim the stream of water all over the garbage can. Pay extra attention to the inside, and focus the stream to spray off any stubborn, stuck-on bits of food or debris.  Empty the water out of the can periodically so you can continue to spray all of the inside areas with the hose.  ", " Wipe the can dry with paper towels. Use a clean towel or paper towels to wipe down the inside and outside of the garbage can when you’re finished hosing it down. The can needs to be completely dry before you put a new garbage bag inside of it or odor-causing bacteria could form and cause the can to stink.  Be sure to wipe down the corners and the bottom of the garbage can.  "], "Deep-Cleaning the Garbage Can": [" Wear rubber gloves to keep your hands clean. No matter how dirty your garbage can is, there’s plenty of bacteria and debris that you don’t want to get onto your hands. Strap on a pair of well-fitting rubber cleaning gloves before you get to work so your hands are protected from exposure to dirt, bacteria, and any particles inside of the can.  You can find rubber cleaning gloves at department stores and online. Make sure they fit well and there aren’t any rips or tears in the gloves.  ", " Fill a medium-sized bucket with dish soap and warm water. Take a medium-sized bucket and fill it about halfway with warm water. Then, add a few drops of dish soap and stir it well with a scrub brush to combine the soap and water and form bubbles, which will help lift dirt, grime, and bacteria from the garbage can.  Use warm water so the mixture combines better and you can work it into a soapy lather.  ", " Use a nylon-bristled brush to scrub the can with soap and water. A long-handled nylon cleaning brush will allow you to reach into all of the areas of the garbage can. The nylon bristles will work to remove any stuck-on food or dirt particles, and won’t scratch or damage the inside of the garbage can. Scrub the inside and outside of the garbage can with the brush.  You can find nylon-bristled brushes at department stores and online. Scrubbing both the inside and outside of the can will reduce the amount of odor-causing bacteria that may be present. Spend extra time scrubbing any stubborn stains or stuck-on bits of trash.  ", " Rinse out the can with clean water. Take the garbage can outside and hose it off, or use clean water to wash off the soap from the inside and outside of the can. Scrubbing the can with soap and water traps germs and bacteria inside the suds. Rinsing them off will keep them from causing the garbage can to smell bad.  Be sure to rinse the inside of the can completely so there isn’t any residual dirt or bacteria. Pour out the water outside or down the sink when you’re finished rinsing the can.  ", " Spray the inside and outside of the can with disinfectant. After you scrub the inside and outside of the garbage can, douse it with a good coating of spray disinfectant. This will kill odor-causing germs and bacteria that can multiply and cause the garbage can to smell.  Hold the spray can about 12 inches (30 cm) away from the can and sweep it back and forth as you spray to cover the can evenly. You can find spray disinfectants in the cleaning aisle of your local grocery store, department store, as well as online.  ", " Dry off the can with paper towels. It’s important to completely dry off the garbage can before you place a trash bag inside of it. Moisture can breed bacteria that can build up and start to smell. Use paper towels or a clean cloth to wipe down all of the can so there isn’t any water on it.  Be sure to wipe down the creases and corners inside of the garbage can as well.  "], "Keeping Your Garbage Can Clean": [" Change your trash bag regularly. Trash contains bacteria, germs, and rubbish that can smell if you let it sit for too long. A good practice to maintain a clean, non-smelling garbage can is to take out the trash bag as soon as it’s full, throw it in the dumpster or garbage can outside, and replace it with a new, clean bag.  Check to see how full the bag is every night before you go to bed so it doesn’t have a chance to sit overnight and stink up your garbage can if it’s full. If the bag tears or leaks, clean up any spills immediately to prevent unpleasant odors.  ", " Mix together equal parts white vinegar and water in a spray bottle. White vinegar is non-toxic and environmentally-friendly, and works as a great household cleaner. Keep a spray bottle filled with half vinegar, half water so you can use it whenever you need it.  You can find white vinegar and spray bottles at your local department store and online. Shake up the bottle before each use to combine the water and vinegar.  ", " Spritz the inside of the can when you remove the trash bag. Whenever you change out your garbage bag, give the inside of the can a light spray of the vinegar and water solution. This will help reduce odor-causing bacteria and keep your garbage can smelling fresher for longer.  Don’t saturate the can or the excess vinegar can build up and cause an unpleasant odor. Just a quick spritz will work. Hold the spray bottle about 12 inches (30 cm) away from the surface of the garbage can when you spray to cover more area.  ", " Wipe the inside of the can with a paper towel. Before you add a new trash bag into the can, give it a quick wipe down to remove any excess cleaning solution and moisture. Take a paper towel or a clean rag and wipe the inside of the can so it’s clean and dry.  A quick wipe down of your garbage between bag changes will keep it dry and won’t give bacteria and germs a chance to build up.  "]}}, "How to Descale a Keurig": {"description": "Over time, Keurigs can develop lime scale that affects the machine’s performance and the taste of the coffee it brews. Fortunately, it’s easy to descale a Keurig using a cleaning solution or a few simple household ingredients.", "content": {"Preparing for Descaling": [" Remove any Keurig k-cup packs from the brewer. You can take out the funnel or cup holder as well, or you can leave them in. Leaving the funnel or cup holder inside will help guide the vinegar/cleaning solution into the exit spout and prevent any spills.   ", " Take the reservoir out of the Keurig and pour any water into the sink. If there is a water filter inside, take it out and set it aside. ", " Make sure that the automatic shut-off setting is turned off. You will need to let any cleaning solution sit in the larger Keurigs for a long time, and the brewer will need to be on during this time. "], "Using Vinegar and Water": [" Fill the water reservoir half-way with distilled white vinegar. You will be using one part white vinegar to one part water. Using straight, undiluted vinegar can damage the inside of the machine.  Avoid using apple cider vinegar. While is it possible to use apple cider vinegar to descale a Keurig, you will need to do extra rinses with fresh water in order to get all of the flavor out. You can also use lemon juice instead. Simply fill the water tank half way with lemon juice. If the build-up is not too bad, then fill it only a third of the way.  ", " Fill the reservoir the rest of the way with water. Do not go past the top fill line. The water will dilute the vinegar and make it safer for the Keurig. ", " Place a ceramic mug on the tray beneath the spout. Aim for something that holds about 10 ounces (300 milliliters) so that you do not get any overflows or spills. ", " Brew a cup of hot water, then pour the water out into the sink. The vinegar will flow through the machine and dissolve any lime scale build-up. ", " Keep brewing and dumping the water out until the reservoir is almost empty. Most Keurig brewers will say \"Add Water\" on the screen or flash a light. If you are using a smaller brewer, such as a K10 Mini Plus or a K130 Brewer, then turn it off just as it begins to drip hot water into your mug. ", " Allow the remaining vinegar to sit in the reservoir for four hours. Once the reservoir is almost empty and the machine indicates \"Add Water,\" stop the brew cycle and let the Keurig sit for four hours. This will allow the vinegar to do its work inside the machine. Keep the machine on during this stage. If the \"Auto Off\" feature is enabled, press twice to access the Auto Off settings, then press the Left button to cycle through the number of hours until it displays \"Off.\"  ", " Pour remaining vinegar into a sink and rinse it well. You want to get all of the vinegar out of the reservoir before moving on to the next step. ", " Fill the reservoir with fresh water. Your Keurig will still have some vinegar inside it, so you will have to flush it out using fresh water. If you don't do this, you will get bad-tasting coffee the next time you use your Keurig.  ", " Brew a cup of hot water. You may notice a strong, vinegar smell. This is normal. The smell will lessen with each cup of hot water that you brew. ", " Pour the water out and put the mug back beneath the dispenser. Tip the mug over the sink and dump the water out. You do not need to rinse the mug; just put it back onto the tray. ", " Keep brewing cups of hot water until the reservoir is empty. Dump each mug of hot water into the sink before brewing another. The strong vinegar smell will get weaker with each brew. Small-capacity brewers, such as the K10 Mini Plus and the K130 Brewer will need about three brews.You may need to refill the reservoir with fresh water. Larger brewers, such as the Keurig K-Cup Home series, the K145, K155 Brewers, Vue Brewers (V500, V600, V700), and Rivo Brewers, will need about 12 brews. You may need to refill the water reservoir in order to get that many.  "], "Using Citric Acid and Water": [" Prepare the citric acid solution. You will need 1 to 2 tablespoons of citric acid per 4 cups (1 liter) of water. You can find citric acid in the canning department of grocery stores. It may also be labeled as \"sour soda\" instead. Stir with a spoon to mix the citric acid into the water. If you are using a smaller, single-cup brewer, such as a K10 Mini Plus or a K130 Brewer, consider using 1 cup (240 milliliters) of liquid citric acid instead.  ", " Pour the citric acid solution into the reservoir. The citric acid will dissolve any lime scale build-up inside your machine. ", " Place a mug beneath the drainage spout. Make sure the cup matches the brew size so that you do not get any spills. You can also use a larger cup. ", " Brew a cup of hot water. The citric acid will flow into the Keurig and dissolve any build-up inside. ", " Pour out the hot water and brew another cup. Keep repeating until the reservoir is empty. If you are using a small brewer, such as the K10 Mini Plus or a K130 Brewer, then turn it off just as it begins to brew and let it sit for 30 minutes.  ", " Fill the reservoir with fresh water. Once the reservoir is empty, take it out of the Keurig and refill it using cool water. Put it back into the Keurig once it is full. The machine will still have some citric acid inside, so you will need to flush it out. If you don't, you will get a bad taste the next time you try to brew coffee. ", " Keep brewing cups of hot water until there is nothing left in the reservoir. After you brew a cup of hot water, pour the water into the sink and replace the mug beneath the dispenser. If you are using a small brewer, such as the K10 Mini Plus or a K130 Brewer, then you will need to run the water through it about six times.   "], "Using Keurig Cleaning Solution": [" Fill the reservoir with one part Keurig Cleaning Solution and one part water. You can also use a different type of cleaning solution, but make sure to follow the recommended proportions on the label. Here are some guidelines as to how much Keurig Cleaning Solution and water you should use:  For the K10 Mini Plus and K130 Brewer, use one third of a bottle (4.6 ounces/136 milliliters) of cleaning solution liquid. Fill the tank the rest of the way with clean water. For all other Keurig K-Cup Home series, the K145, K155 Brewers, Vue Brewers (V500, V600, V700), and Rivo Brewers, use the entire bottle of cleaning solution. Fill the empty bottle with clean water, and pour that into the water tank as well.  ", " Place a large mug beneath the dispenser. Make sure that the brew size matches the cup size so that you do not get any spills. ", " Brew one cup of hot water, then pour the water out. Lift the handle, wait 5 seconds, then lower the handle. Press the \"brew\" button and wait until the cup fills. Dump the hot water into the sink and replace the mug. ", " Repeat until the water is all gone, then wait 30 minutes. Keep brewing cups of hot water and pouring the water out of the mug until there is no more water. When the \"Add Water\" warning comes on, stop and wait 30 minutes. Make sure that the machine stays on during this time. The cleaning fluid will work on dissolving any build-up inside the machine during this time. If you have a K10 Mini Plus or a K130 Brewer, start to brew another cup, then turn the Keurig off just as the water starts to come out. Wait 30 minutes, then turn the Keurig on and finish brewing the last cup. You may have to lift the handle and press back down on it get it to start brewing. If you have one of the Rivo Brewers, there is no need to wait 30 minutes. Simply proceed to the next step.  ", " Rinse the reservoir and fill it with fresh water. Once the reservoir has no more cleaning solution in it, pull it out and rinse it. Refill it using cool water. There will still be some cleaner inside your machine, so you will need to clear it out using fresh water. ", " Brew a cup of hot water, then pour it out. You will need to repeat this step several times until there is no cleaner left inside your Keurig. If you don't do this, you will get a bad taste the next time you use your machine. Here are some guidelines as to how many brews you should do:  For the K10 Mini Plus and K130 Brewer, you will need to do about three brews. For all other Keurig K-Cup Home series, the K145, K155 Brewers, Vue Brewers (V500, V600, V700), and Rivo Brewers you will need to do about 12 brews.  "]}}, "How to Clean a Nespresso Machine": {"description": "Nespresso machines are convenient machines that use single-serve pods. They are generally hassle-free, but they still need to be cleaned regularly. You should clean the drip tray, empty the capsule container, and change the water every day. Descaling every three months provides a deeper clean and helps keep your machine working properly.", "content": {"Doing Routine Cleaning": [" Clean the drip tray daily. Each day, remove the drip tray from your Nespresso machine and wash it. Use dish detergent and a clean cloth. If there is any buildup in the drip tray, make sure to scrub it away. Rinse the drip tray with warm water and let it air dry.  Also clean the capsule container the same way. Without proper cleaning, your drip tray will grow bacteria and mold.   ", " Wash the water tank daily. While you are cleaning your drip tray, remove the water tank and the lid from the machine. Wash both parts with mild dishwashing detergent. Rinse with warm water, making sure to remove all suds. If you don’t use your Nespresso machine daily, consider washing the lid and water tank every few days.  Let the lid and water tank air dry before reassembling. You can also dry it with a clean cloth. Avoid letting water sit in the water tank. It can start growing mold or bacteria.  ", " Wipe the capsule detector lens with a soft cloth. Take a dry soft cloth to gently wipe the capsule detector lens. There is no need to use water or soap. You just want to wipe away any smudges on the lens.  The detector lens is located inside the machine. You can get to it once you remove the maintenance module, which is attached to the drip tray and holds the cups.  ", " Wipe down the external parts regularly. The coffee outlet and outside cover of the machine should be wiped down often. Consider doing this multiple times each week. Use a clean damp cloth to wipe down the machine.  The coffee outlet is the place where the coffee drains into your cup. Use the cloth to wipe away any buildup. Wipe down the outside edges and the inside walls where the capsule holder goes.  ", " Avoid strong cleaners on your Nespresso machine. When cleaning this machine, never use strong or abrasive cleaners. Use only mild, odorless detergents. Don’t use sponges when cleaning. Only use soft cloths.  Never submerge any of the parts in water or other liquid.  "], "Descaling Your Machine": [" Descale your machine every three months. Your Nespresso machine will need to be descaled about every three months. If you drink a lot of coffee, you should descale it every 300 capsules. Some models have a light on the machine that blinks when you need to descale.  If you connect your machine to the online app, the app will tell you when your machine needs to be descaled.  ", " Ready the machine. Before you begin, make sure you empty the capsule container of all capsules. You should also empty the drip tray. Replace them back into the machine. Then, turn the machine on. ", " Put your machine into descaling mode. Depending on your model, you will press different buttons to start the descaling mode. The buttons will blink, and the machine will beep when you can let go. This lets you know you are in the descaling mode.  The VertuoLine has one button you need to hold for around seven seconds. The Pixie, Inissia, and CitiZ models have two flashing buttons you hold at the same time for approximately three seconds. For the Prodigio, press the three coffee buttons at the same time. Hold them for three to six seconds.  ", " Fill the tank with descaling solution. Pour one container of Nespresso descaling solution into the water tank. Then, add half a liter of water. Close the slider and place a container large enough to catch all of the water from the water tank under the coffee outlet.  You can buy the descaling solution from the Nespresso website.  ", " Make your own descaling solution. If you don’t want to buy a commercial descaling solution, you can make your own. Run the homemade solution through the machine just like commercial solution. Before using a homemade solution, make sure to check the instruction manual or call the manufacturer to make sure it is safe.  You can make a solution with citric acid. Use 1 part citric acid to 20 parts water. You can also use lemon juice or vinegar. Mix equal parts of either liquid with equal parts water. If you use citric acid or lemon juice, rinse the machine twice before making coffee. If you use vinegar, run five rinse cycles.  ", " Begin the descaling process. Press any of the blinking coffee buttons. This begins descaling your machine. The machine will run the water through the machine and expel the water into the container under the coffee outlet.  When the machine stops pushing the water through the outlet, it is done.  ", " Repeat the descaling process. Pour the water in the container back into the water tank to go through the descaling process again. Once again, press one of the blinking buttons to start the machine. The machine will do the same thing as before. When it is finished, it will stop running and the water will be back in the container.  ", " Rinse all the parts. Toss out the solution that ran through the machine. Remove the water tank, drip tray, and cup support. Rinse them thoroughly with warm water. Make sure all of the residue from the descaling solutions is completely rinsed from the parts.  Reassemble the machine once you’ve rinsed and dried the parts.  ", " Rinse the machine. Fill the water tank with clean water and place the container back under the coffee outlet. Click one of the blinking lights to make the machine run the clean water through it. This rinses the solution from the machine. Pour out the water.  Place clean water into the water tank and hit the blinking lights to repeat the rinsing process once more.  ", " Exit descaling mode. After you have rinsed the machine with clean water twice, you are done with the descaling process. Press all the coffee buttons until the machine beeps. This lets you know you have exited descaling mode.  Let the machine dry for at least 10 minutes before you use again.  "]}}, "How to Clean a Keurig": {"description": "Keurigs are great for making single cups of coffee, but over time, they can get dirty and buildup can form inside the machine. Every now and then, you need to clean your Keurig so it keeps making full cups of flavorful coffee. Every week you should clean the removable parts, and you should change the filter anddescalethe machine every few months. When your Keurig is clogged, you can manually clean out the pod holder and needle. Once the machine is clean, your coffee will taste fresh with each brew!", "content": {"Performing Weekly Maintenance": [" Wipe the entire machine with soapy water. Mix liquid dish soap in a sink full of warm water. Wet a cleaning cloth in the soapy water and wring it out so it’s not dripping. Wipe all of the exterior surfaces on your Keurig to clean off any dust or dried-on coffee. Focus on areas like the mug tray and pod holder since they get the dirtiest.  Make sure there isn’t a K-cup or coffee pod in the holder when you start cleaning. If your Keurig has a touchscreen display, wipe it dry with a paper towel when you’re finished cleaning it so it doesn’t get damaged.   ", " Remove and wash the bottom reservoir. The bottom reservoir is underneath the mug tray and is used to catch any accidental spills. Pull out the bottom reservoir and soak it in your sink filled with soapy water. Scrub any stuck-on residue with your cleaning cloth before rinsing it off.  The mug tray usually rests on top of the bottom reservoir. You can either wipe the mug tray with a cloth or soak it in your sink.  ", " Soak the water tank in soapy water. Pull the tank off of the Keurig and empty the water into your sink. Rinse out the tank with warm water before soaking it. Scrub the inside of the tank with your cleaning cloth before rinsing it clean again.  If you have a Keurig filter in the water tank, pull it out before washing out the tank.  ", " Let the bottom reservoir and tank air dry. Put the tank and reservoir upside down on a drying rack so they can air dry. Leave them to dry completely before putting them back on your Keurig. Don’t use a towel to dry them since it could leave lint inside the tank.  "], "Unclogging the Needle and Pod Holder": [" Pull out the pod holder from the top. Lift the handle on top of your Keurig to access the pod holder. Grab the edges of the pod holder and pull up carefully to remove it from the machine. The pod holder cartridge will easily come out so you can clean it.  Be careful of the needle above the pod holder since it’s sharp.  ", " Separate the funnel from the pod holder. The pod holder is made with 2 pieces that are held together in the middle. Gently pull the pod holder apart to remove the bottom funnel from the pod compartment. You may need to twist the funnel to help loosen it.  Take apart the pod holder over your sink or a paper towel in case leftover coffee grounds fall out  ", " Poke a paper clip through the tube on the pod holder. Unbend a paper by hand until it’s straight. Stick the end of the unbent paper clip into the small tube at the bottom the Keurig’s pod holder to break apart any clogs. Take the paper clip out of the pod holder so any residue you broke apart can fall out through the hole. Keep poking into the pod holder until you don’t see anymore residue.  You can also use a toothpick if you don’t have a paper clip.  ", " Rinse the pod holder and funnel under warm water. Turn on your sink so it’s running warm water. Hold the pod holder and funnel upside down underneath the water to rinse any residue out. Rotate the pod holder and funnel under the water until it’s completely rinsed.  Avoid using any soap while cleaning out your pod holder since it could affect the flavor of your coffee if it’s not completely rinsed out.  ", " Clean the inside of the needle with your paper clip. The needle is located inside your Keurig above the pod holder. Use the same paper clip you used to clean the tube on the pod holder and poke it inside the hole in the center of the needle. Work the paper clip back and forth to loosen any coffee grounds or scale that may have gotten stuck inside.  Be careful while cleaning the needle since it is sharp and could hurt you.  ", " Put the pod holder back in your machine. Reattach the funnel and the pod compartment by pressing them together. Set the entire pod holder into the space where you pulled it out and gently push it back into place. The pod holder will click once it’s secured again.  There is usually an arrow on the pod holder and the Keurig to show which way to insert it. Make sure the pod holder is lined up correctly.  ", " Run 2 water-only cycles through your machine. Place an empty mug on the mug tray underneath the dispenser. Fill the water tank up to the max fill line and start a water-only cycle on your machine. Let the water fill the mug until the first cycle is finished. Empty the mug and run the machine one more time without a K-cup so it can clean out any residue.  Some Keurig machines will make you press a button on a touchscreen to confirm that you want to run the cycle without a K-cup. Other machines may make you lift the handle and close it again before starting another cycle.  "], "Descaling the Tank": [" Empty the water tank and remove the filter. Take the reservoir off of your Keurig machine and dump out any water that’s inside it. If your Keurig has a water filter, pull it out of the tank and set it aside while you descale the machine. Put the water tank back onto your Keurig once it’s empty.  ", " Mix equal parts descaling solution and water in the tank. Pour a full bottle of Keurig descaling solution into the water tank, which is usually around 14  fl oz (410 ml). Fill the bottle again with water from your sink and add it to your tank to dilute the solution.  You can buy Keurig descaling solution online or in the kitchen section of big box stores.  ", " Run the Keurig until the “Add Water” light blinks. Place a mug underneath the dispenser so the solution doesn’t spill when you run it. Make sure there isn’t a K-cup inside the machine before you start running a regular brew cycle. Start the machine and let the first cycle fill the mug. Once the first cycle is over, empty the mug and start another cycle immediately. Keep running cycles until the tank is empty and the “Add Water” light starts blinking.  If your Keurig has a touchscreen, the screen will display when it needs more water in order to run.  ", " Let your Keurig sit for at least 30 minutes. Your Keurig stores some of the solution inside an internal reservoir after you run the cycles. Leave your Keurig alone for at least 30 minutes so the descaler can break apart any residue or buildup inside the reservoir.  If you’re using vinegar to descale your Keurig, leave it alone for about 4 hours so it has time to break down the buildup inside.  ", " Fill the tank with clean water. Pour out any leftover solution or liquid into your sink and rinse it underneath warm water. Make sure you rinse the tank thoroughly so there’s no solution left inside. Fill the tank to the max fill line with clean water and put it back on your machine.  ", " Run through water-only cycles on your Keurig at least 12 times. Set a mug on the mug tray and run a hot water-only cycle through your machine. Once the first cycle is complete, empty the mug and run another cycle immediately after. Keep running cycles until you’ve done it 12 times to clean out all of the descaler solution.  You may have to fill the water tank at least once to run all of the cycles. Descale your Keurig every 6 months.  "], "Replacing the Water Filter": [" Soak a new filter in water for 5 minutes. Keurig filters should be replaced every 3 months or every 60 times you fill the tank. Take the replacement filter and put it in a bowl of cold water. Let the filter soak for at least 5 minutes before putting it in your Keurig. This helps the filter work better once it’s inside your tank.  You can buy new Keurig filters online or in the kitchen section of big box stores.  ", " Pull out the filter tube from your water tank. The filter tube is usually found in the middle or near the back of your Keurig’s water tank. Simply pull the tube out from the Keurig and set it on a piece of paper towel so it doesn’t get your counter wet.  Not every Keurig will have a filter.  ", " Take apart the bottom of the tube to remove the old filter. Keurig filters consist of a long tube and a mesh piece on the bottom to hold the filter in place. Grab the mesh piece on the bottom and pull it loose to take out the filter. Once you remove the old filter, throw it away.  Take out the old filter while the new one is soaking. That way, once the new filter is done soaking, you can immediately put it in.  ", " Rinse the new filter in water for 1 minute. Take the new filter out from the bowl of water and rinse it underneath cool water. Rotate the filter in your hands to rinse it completely. Keep the filter underneath the stream of water for at least 1 minute before you put it in the tube.  ", " Place the new filter in the tube and put it back in the tank. Hold the filter tube upside down and set your filter inside of it. Replace the mesh bottom to secure the filter in place before putting the filter back into your Keurig. Once the filter is replaced, you can immediately use the Keurig again.  "]}}, "How to Clean an Electric Kettle": {"description": "Electric kettles are convenient ways to boil water for tea, other beverages, or food. Because water boils over and over inside the kettle, it can get limestone buildup that causes scaling or “kettle furring.” This buildup can start flaking into your tea or food, and it also slows down the heating of your kettle. To clean your electric kettle, try a vinegar or lemon solution, use baking soda to get off any stubborn stains, and wipe down the outside.", "content": {"Using a Vinegar Solution": [" Mix a vinegar solution. Vinegar can help descale an electric kettle and remove build up from hard water. Mix a solution of water and white vinegar in equal parts. Fill the kettle around halfway or three quarters the way full with this solution.   ", " Boil the solution in the kettle. To clean the inside of the kettle and remove limestone stains, turn on the kettle with the solution inside. Bring it to a boil.  If the scaling inside the kettle is really bad, increase the amount of vinegar in the mixture. Boil again.  ", " Let the kettle soak. When the kettle has come to a boil, turn off the kettle and unplug it. Let the solution soak inside the kettle for around 20 minutes. After the 20 minutes, pour out the solution.  If the scaling is really bad, leave the solution in the kettle longer.  ", " Scrub the inside. If the scaling is really bad, use a non-metallic sponge or cloth to scrub the inside of the kettle. Do this after you have let the vinegar solution soak in the kettle for a long time.  Make sure that you do not scrub the heating element on the bottom of the kettle.  ", " Rinse to remove the vinegar. Rinse the electric kettle with water. You may have to rinse multiple times to remove the vinegar smell. Wipe down the inside with a cloth. Let it dry.  If there is any vinegar taste or smell left in the kettle, boil water in it again and dump it. This should get rid of it. Boil water multiple times if the vinegar smell or taste won't go away.  "], "Cleaning with Other Solutions": [" Use a lemon solution. If your kettle manufacturer states that you should not use vinegar to clean your kettle, you can use lemon instead. Make a solution with lemon and water. Squeeze a lemon into water and then cut up the lemon and place the slices in the water. Fill the kettle with this solution.  Boil the water and let it soak in the kettle for around an hour. Dump the water and rinse the kettle. Alternately, you can use a lime instead of a lemon.  ", " Make a baking soda solution. Another cleaning option is to make a solution of baking soda and water. Mix around a teaspoon of baking soda into water. Pour this into the electric kettle and bring to a boil.  Let the solution soak for around 20 minutes. Then, pour out the solution and rinse with cold water. This should remove the scaling inside the kettle.  ", " Use a commercial kettle cleaning product. If you want to use a commercial cleaner, find a kettle cleaning product online or in your local home improvement store or supermarket. You should dilute the cleaning product with water according to the directions and boil the solution in the kettle.  Leave the solution in the kettle to let it soak. Rinse the kettle with cold water.  "], "Maintaining Your Kettle": [" Clean the outside with dish soap. To clean the outside of your kettle, use basic dish detergent. Wash the outside with the dish soap and then wipe it down with a damp cloth. Try not to get any dish soap inside the kettle.  Clean the outside every week or so. Because of the heating element, you cannot place your electric kettle in water.  ", " Polish with olive oil. If you have a stainless steel electric kettle, you may want to polish it to keep it shiny. To make it shiny, use olive oil. Place some oil on a soft cloth and rub over the outside of the kettle. Rub gently to make sure you don't scratch the outside surface.  ", " Clean your kettle often. The interior of your kettle can get build up with frequent use, especially if you live in an area with hard water. This can lead to flakes in your tea or coffee, and cause the kettle to work slower. To keep your kettle working properly, clean it every few months.  "]}}, "How to Clean a Waffle Iron": {"description": "When it comes to breakfast food, waffles reign supreme. When you own a waffle iron, you have the added luxury of eating your deliciously fluffy waffles in the comfort of your own home. The downside, however, is that you also have to clean up that iron, which is sure to get messy in the process of making your breakfast. It's always best to check the owner's manual for exact instructions for your particular model but – let's get serious – you probably already tossed it out. Depending on the kind of waffle iron you own, there are different ways to clean it.", "content": {"Cleaning an Electric Waffle Iron with Non-Removable Plates": [" Unplug your waffle iron and allow it to cool. Most modern electric waffle irons come with nonstick plates, and they have to be cleaned without immersing the appliance in water. You definitely don't want to burn yourself trying to clean a piping hot waffle iron. Instead, unplug it before enjoying your waffle. By the time you're finished and ready to clean, it should be cool.  ", " Remove excess oil with dry paper towel. If you have a nonstick waffle iron, you may not have used any oil. If you did, however, there maybe little puddles of grease. You can dab these up with a dry paper towel. It may be helpful to fold the paper towel into a point, so that you can push it between the ridges of the iron.  ", " Brush away large crumbs. Often times, there will be bits of dried batter stuck within the ridges, or even dripping over the sides if you filled the iron generously. Do a once over, brushing away those big pieces with a soft-bristled kitchen brush. It's important that the bristles really are soft, because you don't want to risk scratching the nonstick surface. ", " Loosen the hardened bits with a hot cloth. If there is a lot of batter dried to the iron, it can be extremely annoying to loosen and scrape each one, bit by bit. Instead, soften all the batter up first. Grab a dish towel or rag and soak it with hot water from the sink. Ring it out a bit so that it isn't dripping, but still saturated. Place it on the waffle iron, and close it. Let it sit for a few minutes, so that the heat and moisture from the rag loosens up those pesky crumbs.  ", " Remove any remaining batter with a rubber spatula. These rubber kitchen utensils might as well have been made for cleaning a waffle iron, because they're ideal. The rubber won't scratch the surface, and it's thin and malleable enough to get in between the rows of the waffle iron. Once the dried batter has been softened by the wet rag, you should be able to use your rubber spatula to scrape the rest of the batter off. You can also use a sponge to gently remove the loosened batter. Make sure you purchase one that is specifically for nonstick surfaces.  ", " Clean the outside of the iron with a damp cloth. Make sure that your cloth is damp, not wet. It's important that you don't accidentally get water into the electrical parts of the iron, which could cause you to get shocked next time you turn it on, or break the iron altogether. Clean everything that has batter on it, or looks dirty.  "], "Cleaning a Waffle Iron with Removable Plates": [" Allow your iron to cool and remove the plates. You can unplug it when you're finished making your waffles, and it can cool while you eat. Remove the plates from the waffle iron according to the manufacturer’s instructions, if you still have them. Waffle iron grid plates usually snap out easily. ", " Immerse the plates in warm water. It's probably easiest to do this in your sink, but you can also use a shallow dish of warm water. Don't add any soap to the water. Nonstick plates should never be cleaned with soap because it can cause the nonstick surface to deteriorate.  ", " Gently clean the plates with a sponge or brush. Again, it's important to be cognizant of the nonstick surface and use soft cleaning supplies. Use a sponge that is made specifically for nonstick surfaces, or a kitchen brush with soft bristles. You don't want to scratch up the plates while cleaning them.  ", " Rinse the waffle grid plates in warm water. Allow the water to remove any remaining crumbs. It's great to turn the plates vertical so that the water can run through the ridges, rinsing spots you may have missed with your sponge, brush, or rag. The dishwasher can be damaging to the nonstick surface of the waffle iron, so this method is the next best thing. Check your manufacturer's instructions to see if your plates can go in the dishwasher or not.  ", " Allow the plates to dry and snap them in. Set them on a drying rack or on a dish towel on your counter. If you're in a hurry, you can certainly use a dry cloth or paper towel to dry them more quickly. You want to make sure your plates are completely dry before snapping them back into your iron.  ", " Clean the outside of the iron. Use a damp cloth to get the exterior as clean as you got the plates. Be careful to avoid getting water into the electrical parts of the iron, which could damage the iron or result in a shock next time you plug it in.  "]}}, "How to Clean a Mr Coffee": {"description": "The Mr. Coffee machine requires regular cleaning. If your morning coffee is tasting a little odd, it could be an indication that your coffee machine is dirty. Water deposits gradually accumulate in coffee makers, which can be removed by using a vinegar solution and the cleaning function on the machine. You should also regularly clean the carafe, filter basket and lid.", "content": {"Cleaning After Each Use": [" Clean the carafe. Pour out the old coffee. Spray the interior of the carafe with tap water. Add a bit of mild dish soap. Swish the soapy water around the interior of the carafe. Empty and rinse the carafe so it is clean for your next brew.  If you see any stains, sprinkle baking powder into the carafe. Scrub off the stains with a dishwashing brush or sponge and some warm water.    ", " Empty and clean the filter basket. Open the lid on top of the Mr. Coffee machine. Pull out the filter basket and empty the contents into the compost. Use the spray nozzle or tap in your kitchen sink to rinse out the filter basket. You can use some mild dish soap and warm water to remove any stains. Rinse out the filter and put it back in your coffee machine.  ", " Clean the lid. The inside of your coffee lid should be cleaned on a daily basis. Use a sponge to wipe off the inside and outside of the lid on your Mr. Coffee machine. On the inside of the lid, you will see the spray heads that pour water onto the coffee grounds. You should use a clean rag or sponge to thoroughly clean these spray heads.  ", " Wipe off the spout. The coffee pours into the carafe from a spout. Remove the carafe and use a clean sponge or rag to wipe off the spout. You can use warm water and some mild dish soap. Then, rinse it off with a clean sponge and replace the carafe.  ", " Polish the outside of the machine. Use a clean sponge to clean the outside of the machine, such as the control panel and the base of the coffee machine. Dry it off with a clean towel.  "], "Doing a Deep Cleaning": [" Do a deep cleaning once per month. Hard water deposits gradually build up in your coffee maker. Yeast, mold and bacteria also tend to accumulate in coffee makers. Once per month, you will need to decalcify minerals and remove grime with water and vinegar.  ", " Unplug the machine. Let the machine cool off for a few minutes. Then, get your cleaning supplies together, such as your sponge, vinegar and dish soap.  ", " Empty the carafe and the filter. Start by emptying the leftover coffee from your carafe. Then, empty the contents of the filter. Use a clean sponge, hot water and mild dish soap to clean the carafe and the filter. Replace the filter when you are done cleaning it.  ", " Mix a solution of equal parts vinegar and water. To get the hard water out of your coffee maker, you will need to mix a solution of equal parts vinegar and water. If your carafe has measuring indicators, you can use it to mix the solution. Then, pour the solution into the reservoir.  You could also use a measuring cup to mix the vinegar and water solution.  ", " Use the cleaning function to remove hard water deposits. Put a new filter in the filter basket. Put the carafe in the warming tray. Then, press the “select” button on your Mr. Coffee machine until it lights up the clean function. Once it is selected, your Mr. Coffee machine will start cleaning the machine. The process takes one hour.  ", " Rinse your coffee maker. Remove the filter from the filter basket. Empty the vinegar from the carafe. Pour clean water in the reservoir. Then, press “brew.” After one brewing cycle is complete, you can empty the water from the carafe. Finally, rinse out the carafe.  If you like, you can repeat this step to get the machine well rinsed.  "]}}, "How to Clean a Cuisinart Coffee Maker": {"description": "To keep your Cuisinart coffee maker in its best condition, you should clean it regularly with some simple household products. Whether your Cuisinart has a self-cleaning option or not, you shouldclean your coffee makerregularly bydecalcifying the water reservoir with vinegarand washing the other pieces of the machine with warm, soapy water. With proper cleaning and maintenance, your Cuisinart coffee maker should continue to provide you with tasty coffee for years.", "content": {"Cleaning the Water Reservoir": [" Decalcify your coffee maker every 1-6 months. If you use your coffee maker more than once a day, you may need to clean your  water reservoir once a month to decalcify (remove hard water and mineral build ups from) the machine. If you use it less frequently, however, you can wait up to 6 months between cleanings. Either way, the hardness of your tap water will influence how often you need to clean your machine. If your coffee begins to taste bitter or otherwise off, it may be time to decalcify the reservoir. If you have a Clean button on your Cuisinart, it will begin flashing when the machine needs to be decalcified.    ", " Empty the carafe and grounds. If you have any coffee remaining in the carafe, discard it and rinse the carafe with water. Remove the basket from the machine and dump out any coffee grounds or paper filters.  ", " Fill the water reservoir with 1 part white vinegar and 2 parts water. Mix enough white vinegar and regular tap water to fill the reservoir to its full capacity. You can use the carafe to measure and pour the solution.  The exact amount of vinegar and water you use will depend on the size of your coffee maker. For a standard 12-cup coffee maker, you will need 4 cups of vinegar and 8 cups of water to fully fill the reservoir.  ", " Press the Clean button if your coffeemaker has one. Once the Clean light glows, press the On/Off button to begin the cycle. The Clean light should shine steadily to indicate that the machine is in CLEAN mode. Once the cycle is finished, the machine should beep 5 times and turn off.  The CLEAN cycle will take 2-3 times longer than your normal brew, as the machine will pause between every few cups it makes.   ", " Run a brew cycle manually if your coffeemaker doesn't have a self-clean function. Once you've filled the reservoir, simply turn the machine on to run a cycle, just as if you were making a regular pot of coffee. For a deeper clean, turn off the coffee maker off mid-way through the brew cycle and let it sit for an hour. Then turn the coffee maker on again and let the brew cycle finish.   ", " Repeat the cycle if you can still see build-up inside the reservoir. One cycle of the vinegar-water mixture should be sufficient to clean the machine. However, if you have a particularly dirty coffee maker, you may need to run it again. Once the vinegar-water mixture has finished running and the machine has cooled, inspect the inside of the tank. If any build up remains, let the machine cool fully and then run another cycle with a fresh solution of vinegar and water. If your machine has a self-cleaning feature, turn the machine on again after the first cycle of vinegar and water. If the Clean light continues to flash, you should repeat the cycle with a fresh mixture of vinegar and water.   ", " Run a cycle of fresh cold water to rinse. After the brew cycle has completed, discard the vinegar-water solution from the pot. Then allow the coffee maker and the carafe to cool slightly, especially if you have a glass pot. Then fill the water tank with plain fresh water (without vinegar). Run another brew cycle with just the water.  To ensure all the vinegar has rinsed out, you may want to repeat the water-only cycle two or three times.   "], "Washing the Rest of the Machine": [" Turn the coffee maker off and unplug it from the wall. If you used the machine recently, allow it to cool fully before removing pieces or beginning to wash it. Most machines will take at least 30 minutes to completely cool once they are turned off and unplugged, but some can take longer. Test yours by lightly touching the back of your hand to the body of the water reservoir after 30 minutes.  Since the base of the coffee maker includes electrical heating equipment, it can be dangerous to get the machine wet while it's plugged in. If you try to clean the machine while it's plugged in, you could damage your coffee maker or receive a nasty shock.  ", " Remove the filter basket and carafe. On most Cuisinart models, the filter basket will either lift or slide out from the machine. Discard any remaining coffee from the carafe and dump out any grounds or filters from the basket. If you have a model with a built-in coffee grinder, take that basket out as well. Some models may also have a removable reservoir lid that you can take off.   ", " Wash the removable items in warm, soapy water and let them dry fully. Use a sponge, soap, and warm water to wash the filter basket, carafe, and other items in your sink, just as you would wash regular dishes. Avoid using any harsh cleansers or scouring agents, such as steel wool. Rinse the pieces thoroughly and dry them before placing them back into the machine.  If you have serious build-up on any of the removable pieces, fill your sink with warm, soapy dishwater and soak the items for a few minutes before washing.  Alternatively, you can wash these items in the top rack of the dishwasher.”  Once they're clean, it's best to allow the removable pieces to air-dry, since the unusual shapes can make them difficult to fully dry with a towel.  ", " Wipe down the body of the coffeemaker. While the removable pieces dry, use a damp dishcloth to clean the rest of the coffee maker, including the area under where the filter basket sits.  If you have a Cuisinart with a built-in grinder, be careful to avoid splashing water onto the grinder motor as you clean it. Use only a damp dishcloth.  Never immerse the base unit (which contains electrical equipment) in water or any other liquid.   ", " Remove stains from the heating plate using soap and a damp cloth. Wipe the area where the carafe sits using a damp cloth and a small amount of dishwashing soap. Once you've removed any stubborn coffee stains, rinse the dishcloth and wipe the plate again with plain water to rinse off the soap.  Again, ensure the coffee maker is fully unplugged and cooled before touching the heating plate.  ", " Reassemble the coffee maker. Once all the elements of the machine have been cleaned and allowed time to fully dry, you can put the pieces back together. Replace the filter basket by reinserting or sliding it back in and place the carafe back onto the heating plate. If you have a model with a built-in grinder, replace the cleaned basket into the machine. If you removed the reservoir or carafe lids, don't forget to put those back as well.  "]}}, "How to Clean a Coffee Maker": {"description": "Coffee makers are convenient household appliances that can provide you with a fresh cup of java first thing in the morning. However, due to the high levels of moisture, they can easily harbor mold and bacteria. Drip filter coffee makers require cleaning after each use. They also need to be deep cleaned monthly to remove hard water deposits, leftover coffee oils, and other impurities. With a little elbow grease, you can keep your coffee maker nice and clean.", "content": {"Cleaning Your Coffee Maker After Each Use": [" Disassemble the coffee maker. Remove any parts that come off, such as the pot, the brew basket, and any other removable parts.  These part should be cleaned separately from the rest of the coffee maker.   ", " Wash the removable parts. Submerge the removable parts in warm, soapy water, and wash them using a dish rag. You can wash removable parts of your coffee maker the same way you would wash dishes.  Glass pots can be very breakable. When washing your coffee maker's pot, treat the glass gingerly. Some coffee makers may have parts that can be washed in a dishwasher. Check the instructions manual, if you still have it. If you're unsure if your coffee maker can be washed in the dishwasher, err on the side of caution and hand wash it.  ", " Wipe down the outside of the machine. Take a wet, soapy rag and give the outside of the machine a good wipe down. Wipe down the sides and remove any coffee grinds from the warming plate. When you're down, wipe off any soap suds with a clean, damp rag.  ", " Reassemble your machine. After all the parts are dry, you can put your coffee machine back together. It is ready to use again. Make a habit of cleaning your coffee maker like this after each use.  "], "Deep Cleaning Your Coffee Maker": [" Add a vinegar and water solution to your coffee maker. Make a mixture using half white vinegar and half water. The precise amounts will vary depending on the size of your coffee maker, but make roughly enough to fill the reservoir. Pour the mixture into the reservoir like you normally would with water when making coffee.  ", " Let the coffee machine run half a brew cycle. Turn the coffee machine on. Keep an eye on it as it brews. Once about half the pot is full with the filtered vinegar/water mixture, turn the pot off.  ", " Let the coffee maker sit for an hour. Set a timer for an hour. Let the coffee pot sit for this time frame. This will give the vinegar time to sit in the machine and clean out any mold. ", " Complete the brew cycle. After letting the coffee maker sit for an hour, turn the machine back on. Let it run the rest of the brew cycle. When done, all the vinegar/water mixture should be filtered into the pot. You can pour this mixture down the sink.  ", " Run two brew cycles with plain water. Fill your coffee pot with clean water. Pour this into the reservoir and run a complete brew cycle. When it's done, pour the water out and run one more brew cycle with clean water. This should clean any vinegar out of your coffee maker.  ", " Wipe down the coffee maker. After disinfecting the coffee maker, take a clean, damp rag. Wipe down the exterior of the machine to remove any dirt and debris. You should also make sure to remove coffee grinds from the warming plate.  "], "Avoiding Common Mistakes": [" Read your instruction's manual. If you still have the instructions manual, read it before cleaning your coffee maker. Most coffee makers can safely be cleaned with a vinegar/water mixture, but it's always a good idea to check first.  If you don't have the instructions manual, try looking up your model online. You may be able to find an instructions manual on the Internet.  ", " Leave the reservoir lid open. Many people keep the reservoir lid closed. However, it's a good idea to leave it open when not in use. This will help dry out the machine, preventing mold and bacteria from growing in a moist environment.  ", " Rinse the brew basket in the sink regularly. The brew basket is very susceptible to mold as it gets wet during the brewing process. Make sure you rinse out the brew basket after each use and make a habit of cleaning it each time you do dishes. This will keep your coffee maker mold and germ free.  "]}}, "How to Descale a Magimix Coffee Machine": {"description": "Minerals can build up inside your coffee maker over time, slowing water flow or even clogging it completely. Descaling uses a slightly acidic liquid to dissolve these minerals and return your machine to normal. All Magimix coffee machines use the same Nespresso descaling liquid (or a homemade citric acid alternative), and most follow a similar process. Even if your model is not listed here, one of the methods below may work with a little fiddling.", "content": {"Magimix U, Inissia, Pixie, or Citiz": [" Throw away used capsules and water. Remove the coffee capsule if present. Pour out water from the drip tray. Lower the lever to move the capsule container back into place.  ", " Pour water and descaling liquid into the water tank. You'll need 0.5 liters (17 oz) of water, and one Nespresso descaling liquid packet. Take care not to get the descaling liquid on your skin or clothing. The Citiz & Co. model with two nozzles requires 1 liter (34 oz) of water and two descaling packets.  You can make your own descaling liquid by mixing 5g citric acid into 95mL water. This approach is not approved by the manufacturer, but citric acid is the active ingredient in its descaler.   ", " Place a container under the nozzle. Choose one large enough to hold all the liquid in the water tank. On a Citiz & Co. model, repeat each step of this process for the second nozzle.  ", " Turn on the machine. Wait until the lights stop blinking before you continue. ", " Hold both cup buttons down for three seconds. Once the lights start blinking, your machine is in descaling mode. On the Magimix U model, the slider must be closed for this step. After the machine beeps, open the slider and hold both buttons down again until a second beep.  ", " Press the large cup button to start descaling. Leave the machine alone until the water tank is empty. This can take anywhere from 90 seconds to several minutes. On the Magimix U model, just close the slider to start descaling. Do not press any buttons.  ", " Descale again with the same liquid. Pour the liquid that went through the machine back into the water tank. Press the large cup button again. Let the machine run again until the liquid is gone from the tank. ", " Repeat with drinking water. Pour out the descaling solution. Rinse the water tank thoroughly, then fill it with ordinary water. Press the large cup button to run the machine through descaling mode one more time. ", " Return to normal mode. Once the water tank is empty, the descaling process is complete. Hold both cup buttons down for three seconds. The machine is now ready for brewing, although it may take thirty seconds to heat it up. "], "Magimix Essenza or Le Cube": [" Empty the capsule container and drip tray. Remove the coffee capsule and pour water out of the drip tray. ", " Rinse the machine. Fill the water tank and place a container under the nozzle. Turn on the machine. Press the coffee button, let water run through for about a minute, then press the coffee button again to stop. If you have the Essenza Automatic model, instead let the water run until it stops, and repeat until you've pressed the coffee button six times.  If no water comes through at all, stop the machine and lift the lever. Start the machine again, then lower the lever once you see water reach the nozzle. If this still doesn't work, Essenza models (but not Essenza Automatic) have another option you can try. While the machine is off, press and hold the power button while you press the coffee button three times. Flip the lever open, hold it there for three seconds, and close it again. The machine should shut down and attempt to repair itself. It will not be usable for thirty minutes.  ", " Pour water and descaling liquid into the water tank. Measure out 0.5 liters (17 oz) of water and pour it into the tank. Add one packet of Nespresso descaling liquid. The descaling liquid is a strong irritant, so keep it away from skin and the casing of your machine. Alternatively, buy citric acid from the supermarket and dilute 5g of it in 95mL water to make your own descaling liquid.  ", " Insert the filter if there is a slot for it. The official Nespresso descaling kit comes with a filter. Lift the lever and look for a slot to fit the filter in. Close the lever afterward. If there is no slot, just skip this step. ", " Put a large container under the nozzle. Make sure it can hold all the liquid you added. ", " Hold down both buttons for three seconds. Hold down the power and coffee buttons until they start to flash. The machine is now in descale mode. ", " Press the coffee button. Leave the machine alone until all the descaling liquid has gone through the machine. ", " Descale again with the same liquid. Pour the collected liquid back into the water tank. Press the coffee button and let it run through a second time. ", " Remove the filter and rinse. Take out the filter if you used it. Rinse the water tank and collection container thoroughly to remove traces of descaling liquid. Fill the water tank with drinking water. Press the coffee button one more time and let it run through. ", " Exit descaling mode. On an Essenza Automatic or a Le Cube machine, hold the power and coffee buttons down for three seconds. On an ordinary Essenza model, just turn the machine off and on again. "], "Magimix 200 or 200A": [" Prepare the machine. Before you begin descaling, take care of the following: Remove any coffee capsules. Empty the drip tray. Remove the steam nozzle and place a cloth under the hole. You may need to unclog the steam nozzle separately with a needle or a special nozzle cleaning tool.  ", " Fill the tank with water and descaling solution. Pour in 500 mL (17 oz) of water and one 100mL (3.4oz) packet of Nespresso descaling solution. You can make a cheaper descaling solution with a 20:1 mix of citric acid and water. Never use vinegar.  ", " Let the liquid pass through the machine. Place a large container under the nozzle. Start the descaling process as follows: Magimix 200: Turn on the machine and set the switch to hot water. Magimix 200A: Turn on the machine. Once it's warmed up, press and hold the two coffee buttons simultaneously for three seconds. Press the coffee button whenever the water runs out, until the tank is empty (about five presses).  ", " Descale the coffee system. If using the 200 model (not 200A), pour the collected liquid back into the water tank. Move the switch to \"Coffee\" and let the tank empty again. ", " Rinse the machine. Rinse the tank thoroughly and fill with fresh water. Run the water through the machine until the tank is empty. Magimix 200A: Turn the machine off and on again to return to brew mode.  "]}}, "How to Clean a Keurig Water Reservoir": {"description": "With a Keurig coffee maker, brewing a steaming cup of joe has never been easier. But how easy are they to clean? While some parts of a Keurig can be disassembled and run through the dishwasher, other components, like the removable water reservoir, need to be cleaned by hand. The good news is that this process is quick and painless. Your can gently scrub your Keurig’s water reservoir with warm soapy water for routine cleanings, or run it through a few brewing cycles using diluted white vinegar for a more thorough descaling.", "content": {"Washing the Water Reservoir by Hand": [" Turn off the Keurig. Before you begin cleaning, make sure your Keurig is shut off and unplugged. You’ll be using a lot of water in and around the unit, so you’ll want to safeguard the electrical components. If there’s a K-cup pod in the brewing chamber, take it out and dispose of it.  You can turn off your Keurig by flipping the on/off switch on the back of older models, or pressing and holding the power button on newer touch-screen models.  Wait until the display and power light are completely off before proceeding.   ", " Remove and empty the water reservoir. Lift the reservoir tank straight off of its base, then pry off the lid and set it aside. Dump the old water out into the sink. Shake out as much excess moisture as you can.  You should get in the habit of changing the water in your Keurig’s reservoir daily, even when it’s between cleanings.  ", " Wipe the base clean with a damp cloth. Once you’ve detached the reservoir itself, quickly spot-clean the area of the unit where it rests. There may be hard water stains or coffee grounds built up on the base. These will get worse with time if left untreated.  While you’re at look, look for other parts of the machine that could use a wipe down, like the spout, mug tray or the area around the brewing chamber.  You can clean most of the exterior of the Keurig by simply wiping it down with warm water.  ", " Scrub the inside of the reservoir with warm, soapy water. Add a small amount of a mild liquid detergent to a sink full of warm water and stir it by hand. Submerge the reservoir in the soap solution and gently go over the interior with a sponge or clean cloth. Concentrate on the small port and mesh screen at the bottom of the reservoir where the buildup is likely to be heaviest.  For especially heavy stains or buildup, allow the reservoir to soak in the soap solution for 10-15 minutes before scrubbing. Don’t forget to go over the underside of the lid as well.  ", " Rinse the water reservoir thoroughly. Run fresh, hot water over the reservoir inside and out. Direct the stream over the port and screen for several seconds to make sure they’re sufficiently clear. Completely drain the reservoir of water when you’re done rinsing.  Be sure to rinse off any lingering traces of soap, or it could create a film on the plastic surface and affect the flavor of the coffee.  ", " Dry the reservoir with a clean, soft towel. A microfiber towel or absorbent chamois will provide the best results. You can also set the reservoir upside and leave it to air dry completely for a few hours. Once it’s dry, return the reservoir to its base, replace the lid and enjoy your next cup of coffee!  Be sure to leave the lid off of the reservoir while it’s air drying to prevent moisture from becoming trapped inside. Drying the reservoir with a paper towel or ordinary cloth could leave behind small fibers that can then find their way into your coffee.  "], "Descaling Your Keurig": [" Clear out the water reservoir. If you use your Keurig very frequently and it hasn’t been cleaned in a long time, it may be in need of a total descaling. Start by pouring any remaining water out of the reservoir and returning it to the base empty. From here, you’ll be using the reservoir to disperse a special homemade cleaning solution through the machine.  ”Scale” refers to the natural mineral deposits from water that accumulate on surfaces over time.  If you decide to descale your Keurig, be sure to clean the water reservoir separately once you’re finished.  ", " Fill the reservoir with equal parts water and distilled white vinegar. Ordinary white vinegar can be used to safely descale your Keurig without the need for harsh chemicals. Run a few ounces of cool water in with the vinegar to dilute it. Fill the reservoir about two thirds of the way full.  Vinegar is an excellent natural cleaning agent. It’s mild, non-toxic and rinses away easily, leaving your coffee maker clean and sanitized.  When the brew cycle is activated, the vinegar mixture will be pulled through the water line and spout of the machine, eliminating buildup from the inside.  ", " Run a few brew cycles with the hot vinegar solution. The acidity of the vinegar will help dissolve calcium deposits and hard water stains inside the machine. Use a large mug or another container to catch the hot contents as it emerges from the spout. Continue cycling the vinegar solution until nothing is left in the reservoir.  Do not place a K-cup in the brewing chamber. You’re just trying to flush the interior of the machine with the vinegar solution.  Run the Keurig on the largest cup setting to keep the maximum amount of water flowing through the machine.  Dispose of the used vinegar solution after each cycle.  ", " Spot clean other areas as needed. Some parts of the Keurig, such as the spout and brewing chamber, may be accessible to clean by hand. If there’s any mineral buildup remaining in these areas, you can scrub them with an unused toothbrush or the corner of a sponge.  Detail small holes and crevices, such as the grooves around the K-cup compartment, with a toothpick or paperclip.   ", " Perform repeated brew cycles with only water. Empty the reservoir and fill it back up with fresh or distilled water. Run the two or three more cycles to ensure that all the vinegar has been rinsed out. Keep running the Keurig until the water is completely clean and odorless.  You may need to drain and refill the reservoir a couple of times before the lingering notes of vinegar are fully dissipated.  If your Keurig is especially dirty, it may be a good idea to let the vinegar solution sit in the machine for 20-30 minutes before rinsing it out.  "]}}, "How to Clean a Bunn Coffee Pot": {"description": "Bunn coffee makers can be used for commercial and personal use and are extremely popular. To make delicious coffee, it is important that you keep your coffee pot clean and free of bacteria. Regular cleaning will also ensure that your coffee pot lasts longer. In order to clean a Bunn coffee pot, you should wash the pot and machine between uses, clean the thermal carafe, and give the entire a machine a thorough cleaning ever three months.", "content": {"Washing the Pot Between Uses": [" Wash by hand using mild dish soap. For general cleaning, wash your Bunn coffee pot by hand using a mild detergent, warm water, and a soft cloth. Avoid using an abrasive scrubber because this could scratch the glass or stainless steel decanter.   ", " Clean the pot in the dishwasher. Bunn coffee pots and filters are also top-rack dishwasher safe. Place your coffee pot upside down on the top rack of your dishwasher. Use a mild detergent and wash the pot on a normal cycle. Do not wash the lid of the coffee pot in the dishwasher.  ", " Soak the pot with vinegar. If you begin to notice stains on the bottom or sides of your glass coffee pot, then you will want to give the pot a more thorough clean. Fill the entire coffee pot with vinegar and let it sit for three to four hours. Then, rinse and wash the pot with warm soapy water.  You can also scrub the sides using a soft cloth or sponge.  ", " Wipe the brewer frequently. You should also keep the outside of your Bunn coffee maker clean by periodically wiping down the brewer. Use a non-citrus dish soap and wipe down the entire machine with a damp cloth. Make sure to always unplug the machine before wiping it down.  ", " Wash the brew funnel 1-2 times weekly. Remove the brew funnel from the machine by sliding it out. Clean with mild dish soap and warm water, or place it in the dishwasher. This should be done about once or twice a week if you are using the brewer on a daily basis. "], "Cleaning the Thermal Carafe": [" Remove the lid. If you own the thermal carafe Bunn model, you will need to take apart the decanter periodically in order to thoroughly clean the lid. You can remove the lid by rotating it counterclockwise. ", " Wash the lid with a non-abrasive soap. While cleaning, pay particular attention to the valve in the center of the lid. Do not use an abrasive sponge because this could scratch the surface. The lid must be washed by hand and is not dishwasher safe.  ", " Clean the valve. In order to remove the valve, you need to pull up at the edges. Then, clean the valve with warm water and a mild soap. Alternatively, you could place the valve in the dishwasher. To replace the valve, align it with the slot on the lid of the pot and press the valve into the hole. This type of thorough cleaning should be done once a month.  ", " Place a filter in the coffee maker. In order to give your Bunn decanter a more thorough clean, you should begin by placing a paper filter into the funnel of the coffee maker. ", " Add two teaspoons of dishwasher detergent. Then pour two teaspoons of dishwashing detergent into the filter. Slide the filter funnel into place. ", " Pour cold water into the brewer and brew. This can be done by filling the Bunn coffee pot with water and then pouring the water into the back of the coffee maker. Return the coffee pot to the base and start the brewer. ", " Remove the filter and rinse thoroughly. Once the brewing is complete, remove the brew funnel and dispose of the coffee filter. Rinse the funnel thoroughly in warm to remove any soap that may have been left behind. ", " Let water sit in pot for 15 minutes. Allowing water to soak in the pot will help to loosen any stains that may develop on the sides of the pot. ", " Clean inside the pot with a soft bristled brush. Using a soft bristled brush with a long handle, scrub the inside of the coffee pot to remove any stains. ", " Pour the solution into the sink and rinse with water. Once you have thoroughly brushed the sides of the pot, you can dump the water and detergent solution down the sink. Then rinse the coffee pot with warm water to remove any residual soap. "], "Keeping the Brewer Clean": [" Unplug the coffee maker. Prior to cleaning, you should always unplug the coffee maker. This will ensure that you don't accidentally turn on the machine and heat the vinegar or water that is used for cleaning.  ", " Pour one quart (1 L) of vinegar into the brewer. Make sure that the funnel and pot are securely in place. Then, pour one quart (1 liter) of white vinegar into the top of the brewer. This is the same place that you normally pour water when brewing a pot of coffee.  ", " Let the vinegar drip through the brewer. The vinegar will begin to slowly drip through the coffee funnel and into the pot. Once the vinegar has completely stopped dripping, you can empty the decanter into the sink.  ", " Pour one quart of water into the brewer. After running white vinegar through the machine to help clean it, you need to rinse out the vinegar using cold water. In order to do this, pour one quart (1 liter) of cold water into the back of the brewer. Allow the water to drip through the machine and into the pot.  Repeat this process.  ", " Unscrew the spray head. Then, unscrew the spray head which is the area that the water drips through from the funnel into the pot. This can easily be unscrewed.  ", " Lift the entire coffee maker and empty all liquid contents. Once  you have removed the spray head, lift the entire coffee maker. Be sure to use one hand to support the base of the coffee maker and the other to steady the top of the machine. Turn the machine upside down and empty all liquid contents from the machine. Make sure that the coffee pot is removed from the base and that the machine is unplugged prior to lifting. Water will likely drip out the top of the machine from both the back and funnel areas.  ", " Reattach the spray head. Once the water has stopped dripping, place the machine back onto the counter and reattach the spray head. ", " Continue to pour water through the brewer. Pour another quart (liter) of water through the machine. This will help continue to rinse the machine. Once the water no longer tastes of vinegar, you can stop rinsing out the machine with water.  "]}}, "How to Unclog a Keurig": {"description": "If your Keurig suddenly stops brewing full cups of coffee, you may have a clog. This is a common problem that is fixable after washing all the removable parts with dish soap and hot water. Most clogs caused by coffee grounds are easy to break up with nothing more than a paperclip and a plastic straw. For calcium scale buildup, flush out the remaining debris with vinegar to keep the hot coffee flowing every morning.", "content": {"Washing the Detachable Components": [" Unplug the Keurig from the wall outlet. To fully clean the Keurig, you need to access some of the parts involved in carrying water and coffee grounds through the machine. There are some electrical components around these parts. Always pull the power cord out of the wall before opening up the machine.   ", " Wait 30 minutes for the water inside the Keurig to cool. The water inside the machine may be hot, especially if you made coffee recently. As long as the machine has no power running to it, the water will begin to cool. Avoid burns by giving it plenty of time to cool off. You will have to tip the machine over to drain some of the water, so play it safe by letting the Keurig rest.  ", " Remove the water reservoir and other detachable components. Lift up the big water tank on the side of the machine to detach it from the base. Then, slide the drip tray towards you to remove it. Next, open the top of the coffee machine and pull out the coffee pod holder, which looks like a black funnel.  All of these parts are easy to detach by hand. The funnel requires a little force if you haven’t removed it before, but you don’t need a screwdriver or any special tools to remove it.  ", " Wash all of the parts with a liquid dish soap and hot water. Dampen a microfiber cloth with warm, soapy water, then use it to scrub all of the removable parts. These parts, particularly the coffee pod holder, get clogged with coffee grounds or scale after repeated use. Rinse the parts fully under running water to remove any loose debris.  Be aware of hidden components. The coffee pod holder consists of 2 parts, so pull them apart and wash them both thoroughly. Also, wash the lid on the reservoir tank. Use the soapy water and a microfiber cloth to clean the outside portion of the machine as needed.  ", " Reassemble the Keurig components after they are clean. Give each component a rinse with warm water if you see any coffee grounds on them. Dry them all off with a microfiber cloth before putting them back in place. Slide the drip tray and water reservoir back in place, then put the coffee pod holder into the slot inside the top part of the machine.  When you reinstall the coffee pod holder, notice the tab slots inside the Keurig. Align the tabs on the funnel with the slots to easily slide it into position.  "], "Clearing Sediment Clogs Manually": [" Clear out the holes in the coffee pod holder with a paperclip. Straighten out 1 end of a paperclip to use as a cleaning tool. Then, examine the smaller end of the coffee pod holder. You will see several holes at the end of the funnel. Stick the end of the paperclip in the holes to clear out any coffee grounds there.  The pod holder consists of 2 parts. Pull them apart by hand to access a funnel hole in the larger, topmost piece. Sometimes washing the part in hot water is enough to clear out most of the debris. Double-check the funnel after washing it to make sure it’s free of debris.  ", " Use the paperclip to clear out the needle inside the Keurig. The needle is located above the spot where the pod holder rests inside of the machine. Open the top part of the machine and look along the top edge to find a small metal needle. Around the needle, you’ll see a series of 3 holes where water flows from the water line to the pod holder. Push the end of the paperclip into the holes and rotate it to clear away stuck debris.  The needle pierces the K-Cups during the coffee-making process, so it will always be accessible in the top part of the Keurig. You can’t harm the machine by cleaning out these holes. None of the mechanical or electrical parts are there, so take the time to clear out all of the coffee grounds.  ", " Shake the Keurig out over the sink. Move the coffee maker into the sink, then turn it upside down. Shake it a few times to dislodge any debris loosened by the paperclip. Tapping the bottom end of the machine also helps force out stubborn debris.  Any water stuck inside the machine will also come rushing out as the clogs clear, so work over a sink to avoid a big mess.  ", " Use a straw to blow air through the water line. Locate the water spout where clean water passes into the machine from the reservoir. It is usually white and located at the bottom of the tank. While holding the Keurig upside-down, push a plastic straw or turkey baster over the spout. Puff on the straw a few times to force out any remaining debris.  Another way to access debris in the water line is by sliding off the cover on top of the machine. You will see a big, clear tube running towards the needle. Squeeze the tube a few times to force out any dark-colored sediment stuck inside of it.   "], "Descaling with Vinegar": [" Fill the water tank with equal amounts of water and vinegar. Drain the water reservoir if you already have water in it. Then, fill the tank half full with distilled white vinegar. Top up the rest of the tank with clean water.  To avoid damaging the coffee maker, always dilute the vinegar with water. Never run pure vinegar through the machine. Keurig sells a commercial product. It is effective, but it tends to be a bit pricey. If for some reason vinegar doesn’t work, the descaling product is worth a try.  ", " Run the Keurig on a hot water setting. Set a big mug underneath the machine like you’re going to brew some coffee. Start the machine on an ordinary hot brew setting. Let it run until it fills up the mug. Then, dump the vinegar water out in the sink and put the mug back on the drip tray. Continue running the machine until it uses up all of the vinegar water in the reservoir.  If your Keurig does not run without a K-Cup inside it, put a used K-Cup in the coffee pod holder. This causes a little bit of coffee or tea to run through the machine, but it doesn’t prevent the vinegar from clearing out the lines. The vinegar smell gets a bit overwhelming, but it is a safe and natural way to flush out calcium scales. As long as you dilute the vinegar, the liquid won’t be acidic enough to damage the Keurig.  ", " Flush out the Keurig by running clean water through it twice. Once the machine uses up all of the diluted vinegar, detach the reservoir tank and fill it with clean water. Set your mug back on the drip tray. Run the machine again until it uses up the water, pouring out the water in the mug as needed. Repeat the process another time to ensure you remove all of the vinegar in the water line.  Go through this process at least twice, even if the Keurig seems to be in working order. Any vinegar left over may degrade the line, but more importantly, it will foul up your next cup of coffee!  ", " Fill the tank with clean water and run the machine if it still has vinegar in it. Test the water in your mug before deciding that the machine is clean. Smell it first, then taste it. If you get a hint of vinegar in the water, you still have some in your Keurig. Continue flushing the machine with clean water until all the vinegar is gone. Another way to test the machine is by sprinkling some baking soda into your mug. Baking soda fizzes when it comes into contact with vinegar.  "]}}, "How to Clean an Espresso Machine": {"description": "Every time you pull a delicious shot of espresso or froth foamy milk, your espresso machine accrues a layer of espresso debris, oils, milk-proteins, and mineral-deposits. While it is important to clean your machine after every use, chemically cleaning your machine once a week to dissolve built-up espresso debris is highly recommended. To rid your machine of built-up oils, milk-protein, and mineral deposits, descale your machine every three to four months.", "content": {"Maintaining Your Machine After Daily Use": [" Scrub the portafilter and basket. Remove the basket from the portafilter. Use a nylon brush or a scrubby pad to dislodge grounds from the portafilter and basket. Rinse the basket and portafilter with hot water and dry the items with a clean towel.  The portafilter is the handled, portable filter that is inserted into the group (the gasket that releases hot water to make the espresso). The basket, or portafilter basket, is a metal filter screen that is placed within the portafilter.   ", " Clean the gasket. Insert a nylon brush into the group to clean the gasket. Move the brush around the edges to dislodge material from the gasket. Run water through the group to rinse away any remaining material.  The gasket, or group gasket, is a rubber-O ring with grooves. The gasket provides the seal between the group and the portafilter.  ", " Wash the screen and underside of the group. Look at the underside of the group and locate a screw. Loosen the screw with a short screwdriver to remove the screen from the group. Use a nylon brush or scrubby pad to remove debris from each side of the screen. Debris can build up in the area behind the screen. While the screen is out, scrub the interior of the group. Screw the screen back in place.  The screen, or group screen, covers the filter chamber. It prevents grounds and oils from clogging the head.  ", " Backwash the machine. Insert a blind disk, a basket without holes, into the portafilter. Lock the portafilter into the group. Turn on the group and allow it to run for approximately twelve seconds. Remove the portafilter, empty the water, and repeat the process one more time.  Before you backwash your machine, read the user’s manual to determine if this cleaning process is recommended by the manufacturer.  ", " Sanitize the steam arm. When left uncleaned, milk-proteins will build up on your steam arm. Overtime, the residue will affect the taste of your drinks and clog your machines. To prevent this from occurring, purge your steam wand before and after use.  Place a clean, damp rag over the steam wand’s nozzle. Turn on the steam wand for one to two seconds to flush out water and milk proteins. Once you’ve steamed your milk, wipe down the steam arm with a clean, damp rag. Place the rag over the nozzle and turn the wand on for one to two seconds.  ", " Wipe down the machine. Making espresso can be a messy process. After you’re done pulling shots and frothing milk, run a clean, damp rag over the entire machine.  If you use a cleaner, make sure it is safe to use on your machine.  "], "Deep-Cleaning Your Machine Once a Week": [" Make the cleaning solution. Once a week, you should chemically clean your espresso machine with a specially formulated cleaner. Dissolve espresso machine cleaner into a container of fresh water. When you prepare the solution, always follow the instructions listed on the cleaning product.   ", " Disassemble the machine for cleaning. You can use the cleaning solution to chemically sanitize your machine’s portafilter, basket, steam wand, and screen.  Remove portafilter from the machine. Take the basket out off the portafilter. Detach the steam wand from the machine. Remove the screen from the group with a small screwdriver.   ", " Soak the items in the solution. In the evening, insert the items into the cleaning solution. Allow the pieces to soak overnight. Do not be alarmed if your cleaning solution changes color. This indicates that the chemicals have dissolved espresso residue   ", " Scrub and rinse the items. Remove the items from the solution. If the cleaning solution did not dissolve all of the espresso residue, scrub the portafilter, basket, steam wand, and/or screen with a scrubbing pad. Rinse the espresso machine parts under warm water.  Double-check the steam wand to make sure all of the milk-protein is removed. Consult the product’s instructions to determine how to dispose of the cleaning solution.   "], "Descaling Your Machine": [" Prepare the descaling solution. Over time, mineral deposits from your water build up in your machine. To remove these deposits, clean, or descale, your espresso machine every three to four months with a commercial descaling solution. To prepare the solution:  Fill your machine’s reservoir with fresh water. Add the descaling solution to the water and let it dissolve. Always read and follow the instructions listed on the descaling cleaner.   ", " Run the solution through the steam wand. Place a container under the steam wand to catch the solution. Turn on the steam wand. Allow approximately one cup of solution to run through the steam wand. Turn off the steam wand.  The descaling solution contains citric acid. If not collected, the citric acid will tarnish the espresso machine’s metal exterior.   ", " Turn off your espresso machine. Let the machine rest for twenty minutes. During this time, the descaling solution will start to work. In order for the descaling solution to work effectively, you must let it sit in the machine for twenty minutes.   ", " Run the solution through the steam wand and group. Turn on your machine. Place a container under the steam wand. Flush approximately ¼ cup solution through the steam wand. Turn off the steam wand and set the container directly under the portafilter. Turn on the group and run approximately ¼ cup solution through the portafilter.  If you have a super-automatic espresso machine, run ½ cup of solution through the steam wand. Do not run any solution through the group.   ", " Turn off the machine. Allow the machine to sit for another twenty minutes. As it sits, the solution will continue to break down the mineral deposits.  ", " Run the rest of the solution through the machine. After twenty minutes, turn on the machine. Place the container under the steam wand. Flush half of the remaining solution through the steam wand. Move the container under the portafilter. Turn on the group and drain the rest of the solution from the machine.  If you have a super-automatic machine, run all of the solution through the steam wand.   ", " Flush the machine with fresh water. Fill the reservoir with fresh, clean water. Run the clean water through the steam wand and portafilter. Run a second reservoir of fresh water through the machine if desired.  Place a container under the steam wand and portafilter to collect the water. If your espresso machine is super-automatic, flush all of the fresh water through the steam wand.   "]}}, "How to Clean a Blackened or Burnt Coffee Pot": {"description": "Forgetting to turn off your coffeemaker before you leave the house in the mornings or leaving coffeemakers on overnight can have adverse effects on the look of your coffeemaker. Leaving the pot resting on its burner for too long can lead to scorch marks and discoloration at the bottom of your pot. Not  only does it look unsightly, but it can also give your routine cup of joe a bad taste.", "content": {"Using Ice to Clean Your Coffee pot": [" Add salt and ice to your coffee pot. Start by giving your coffee pot a good rinse. Then place ½ cup of salt into the coffee pot. You will need this to help alleviate the discoloration and burnt marks. After that, add two cups of crushed ice, or enough ice to fill the pot halfway.   ", " Add water and lemon to the salt and ice mixture. Add a cup of water to the salt and ice in your coffee pot. Follow the water by squeezing the juice of 1/4 of a lemon into the pot.  When adding additional water, it is important that it is cold. Hot water mixed with the ice will cause the pot to crack or shatter.  ", " Swish the solution around in the pot. As you swish and swirl, you will begin to see the burned brown layer lift from the surface. Watch the stain and the water to measure the improvement of the stain and whether or not it’s removing.  When the water becomes too dark for you to see a difference in the stain and/or discoloration, empty the coffee pot and start the process of adding salt, ice, water, and lemon juice to the pot to continue the process.  Continue to swish the mixture in multiple directions. Keep in mind that severe burns will need more time to soak in the solution so be patient and trust the process.   ", " Wash the coffee pot as you would normally before use. To avoid making yourself a salty or sour cup of coffee, rinse your pot thoroughly once the discoloration is visibly removed. Once you have dried the coffee pot out with a soft cloth, you are ready to use it again and make a delicious cup of coffee.  "], "Using Vinegar to Clean Your Coffee Pot": [" Remove film or burned stains with vinegar. White vinegar is known for its extra special cleaning properties and is great for stubborn blackened or burnt stains on coffee pots. Fill the pot to the brim with white vinegar. Let it sit overnight to soak. ", " Pour the vinegar into a large bowl. Place that bowl to the side for later, and wash the coffee pot out with hot soapy water. The majority of the brown stains the coffee pot accrued should be gone completely.  ", " Soak the pot again if stains are still evident. Fill the coffee pot with the saved vinegar and allow it to soak overnight. Keep repeating the previous step until all of the stubborn stains have been removed and the coffee pot looks like new again.  "], "Using Baking Soda to Clean Your Coffee Pot": [" Use baking soda and water to clean your coffee pot. Pour one cup of baking soda into the pot and completely fill it with water. Turn on the coffee maker to heat both the water and baking soda in the pot to a rolling boil.  ", " Begin cleaning your coffee pot. Remove the coffee pot from the heat. Allow the mixture to settle and stand for about 10 minutes. After it’s cooled down a bit, use a soft cloth or non-abrasive scrubbing pads to gently scrub the pot. Be careful of the pot’s hot sides as you clean it. ", " Clean remaining stains by forming a paste in the pot. If there are stains left over even after the baking soda/water boil, take the pot and pour almost all of the mixture out of it. Add more baking soda to the pot to create a paste. Scrub the pot out with the paste. Wash it out thoroughly when the pot is stainless to prepare it for use.  "]}}, "How to Clean a Percolator": {"description": "Acoffee percolatoris a simple, energy efficient way to get your morning cup of java, but like any coffee machine, it needs a little upkeep from time to time. A clean percolator that runs well will make better coffee, and it’ll last you much longer than one that is dirty and corroding. Take a few minutes to clean out your percolator on a daily basis, and give it a good deep cleaning with baking soda and white vinegar every 1 to 2 months.", "content": {"Performing Regular Maintenance": [" Avoid letting coffee or coffee grounds sit in the percolator overnight. The best way to keep your percolator in good shape is to give it a little TLC every time you use it. Once you’re finished drinking your coffee, take a few minutes to drain out any excess liquid and discard of those used coffee grounds. Leaving those things in your percolator for too long can stain your machine and affect the quality of your morning brew.  If you want a more environmentally friendly option for your used coffee grounds, add them to a .   ", " Use warm soapy water to wash out the body of the percolator. Take your percolator to the sink (make sure to unplug it if it’s an electric percolator), and fill the water basin with warm water and about 1 teaspoon (4.9 mL) of dish soap. Swirl the soapy water around and use a sponge to quickly wipe down the interior. Rinse it out until the water runs clear.  Take your time when rinsing out the soapy water—you really don’t want sudsy coffee the next time you go to brew a pot.  ", " Scrub the percolator basket if it has built up grime or coffee residue. The basket is where the coffee grounds sit, so it can get oily pretty quickly. If you’re cleaning your percolator every day, you should be able to just use a sponge dipped in warm, soapy water to wipe down the basket.  Never use a hard-bristled scrub brush or a scouring pad to clean the percolator basket. It could get scratched easily or damage the built-in filter.  ", " Wipe down the stem and clean away any stuck coffee grounds. This may also be called the “perk tube,” just depending on what kind of machine you’re using. Essentially, it’s what holds the percolator basket in place. It can get a little oily sometimes, so take a few moments to wipe it down with your soapy sponge, and rinse it off with clean water when you’re done.  If there are any coffee grounds stuck in small places, use the tip of a knife or something similar to dislodge them.  ", " Clear off the inside of the lid if it looks discolored. As the coffee brews, the steam rises inside the percolator and can carry steaming coffee to the lid, which sometimes discolors it. Use your sponge with soapy water to wipe it down and clear away any grime or residue.  The lid may not need to be cleaned every time, depending on how often you’re using and cleaning your percolator. Keep an eye on it, and give it a quick clean anytime you notice it needs it.  ", " Clean the outside of the percolator to keep it sparkling. Don’t use a scouring pad or anything else that might scrape the stainless steel . Warm soapy water on a sponge should get rid of any coffee drips. Use a lint-free towel to dry it off and buff it back to its original shine.  You could also use a special stainless steel cleaner, just be careful to not get any of the cleaner on the inside of the percolator. Most percolators are made of stainless steel, but if yours is made of something else, like glass or ceramic, you should be able to clean it the same way.  "], "Doing a Deep Clean with Baking Soda and Vinegar": [" Brew a water-only pot to loosen grime and built-up coffee residue. Empty your percolator of coffee and coffee grounds and rinse out the body with clean water. Fill the percolator to the maximum-fill line, and then turn it on. Once it has gone through the cycle, empty the water into the sink. If your percolator is electric, plug it in to turn it on. If it’s wireless, use your stovetop like you normally would to brew a pot. Start a for an environmentally friendly way to dispose of your coffee grounds.  ", " Scrub the coffee pot inside and out with warm soapy water. If your percolator is electric, make sure it’s unplugged at this time. Dish soap works perfectly fine for this purpose, and you don’t need to scrub very hard. Just give it a quick once-over to dislodge any big sections of grime or oil. Dry off the outside of the percolator with a lint-free towel when you’re done to prevent water spots. Never submerge an electric percolator in water.  ", " Fill the percolator with water and add 1/4 cup (45 grams) of baking soda . Add water until it almost reaches the maximum-fill line. Put half of the baking soda in with the water, and put the other half directly into the percolator basket.  If you don’t have baking soda, you could use the same amount of cream of tartar.   ", " Let the percolator “brew” the water and baking soda, then empty it out. Turn on the percolator and wait until the cycle has finished. Once it’s done, pour out the water and open up the container to check out the progress. If it was really dirty, you probably saw some gunk coming out when you dumped out the water.  Be careful when dumping out the water and removing the parts of the percolator to not burn yourself. Use a dish towel or oven mitt if you need to. If there is a lot of build-up that is starting to come loose, use your sink sprayer to rinse off the pieces a little more thoroughly.  ", " Run another cycle with cup (120 mL) of white vinegar. Fill the water basket almost to the maximum-fill line, and then add in the white vinegar. Turn on the percolator and let another cycle run. Once it’s done, carefully dump out the water.  If there is a lot of build-up, use a higher ratio of water to vinegar. If there is any remaining visible grime, go ahead and use a sponge to wipe it away. It should be really loose and come off easily.  ", " Do a final cycle with just water to clean away any lingering vinegar. The last thing you want is a cup of coffee tinged with the scent of vinegar! Take a few moments to run through one final cycle of water to completely clear the percolator. Dump it out when it’s finished, and leave it open on the counter to air dry. If you want to put the percolator away quickly, use a lint-free towel to dry it off.  "]}}, "How to Clean a Meat Grinder": {"description": "Meat grinders are a popular appliance, but whenever you deal with raw meat, cleanliness is a must in order to avoid the germs and bacteria that come from residue. However, washing your grinder isn’t really any different than washing other cookware. Properly storing its parts afterward will help ensure that it’s well maintained (and thus less likely to make a mess when used). Following a few additional pointers when using it will also help ensure an easy clean-up.", "content": {"Hand-Washing Your Grinder": [" Start cleaning immediately after use. Expect meat to leave oil and grease behind as it passes through your grinder (as well as stray bits of meat). These will dry and crust over if given time, so don’t wait too long before cleaning up. Make life easier by dealing with it promptly after each use.   ", " Feed bread into the grinder. Before you disassemble the machine, grab two or three slices of bread. Feed them through the grinder just as you did with your meat. Use these to absorb the meat’s oil and grease, as well as push out any stray bits that are lingering inside the machine.  ", " Disassemble the grinder. First, unplug the machine if it’s electric. Then break it down into its parts. These may vary according to type and model, but generally a meat grinder consists of:  A pusher, feed tube, and hopper (usually a single piece through which the meat is fed into the machine). A screw (an internal piece that forces the meat through the machine) A blade A plate or die (the metal piece with holes where the meat comes out) A cover for the blade and plate  ", " Soak the parts. Fill a sink or bucket with warm water and add some dish detergent. Place the disassembled parts inside once full. Let them sit for about a quarter of an hour to loosen up any remaining grease, oil, or meat.  If your grinder is an electric model, do not soak any motorized parts. Instead, use this time to wipe down the outside of the base with a damp cloth and then a fresh one to dry it.  ", " Scrub the parts. Use a sponge to clean the screw, cover, and blade. Be careful when handling the blade, since this is sharp and can easily cut you if mishandled. Switch to a bottle brush to clean the inside of the feed tube, hopper, and the plate’s holes. Rinse each part with clean water when finished.  Don’t rush through this process. You want to remove all traces so you don’t end up with a breeding ground for germs and bacteria. So once you think you’ve scrubbed something enough, scrub it just a little bit more.  ", " Dry the parts. First, wipe them down with a dry towel to get rid of excess water. Then lay them on a fresh towel or wire rack to air-dry. Avoid rust and oxidation by waiting until they are totally dry before putting your grinder away.  "], "Storing Your Grinder": [" Oil any metal parts. Keep your grinder well lubricated and prevent rust from forming during storage. Fill a spray bottle with food-grade mineral oil. Then mist all of your grinder’s metal parts (excluding an electric parts) with an even coat of oil.  Pay particular attention to the pusher and screw, since these come into the most contact with your meat as you feed it through the machine.  ", " Bag each part individually with rice. Place each part to your grinder in its own sealable plastic bag. Then add a handful of rice to each bag. The rice isn’t strictly necessary, but it will absorb any present and future moisture, which makes it a good idea if you store your parts in the freezer and/or live in an area with high humidity.  ", " Store in your freezer if possible. Keep in mind that your grinder works best when its parts are cold. Keep any non-electric parts in the freezer if there’s space. However, if you can’t devote that much space for long-term storage, don’t worry. Instead:  Store your parts somewhere dry in the meantime. Then simply place them in the freezer long enough to chill them before your next use (roughly an hour).   ", " Sterilize oiled parts with bleach before use. Mix a tablespoon of bleach with one gallon (3.8 L) of water. Fill a spray bottle with this solution. Then spray each metal part that you oiled before storage to ensure that they are disinfected. Then thoroughly rinse them with clean water to remove all traces of bleach.  "], "Ensuring an Easy Clean-Up": [" Keep parts and meat cold. Expect warm meat to make a bigger mess when you’re grinding it. Make clean-up easier by keeping both the meat and the grinder’s parts well chilled before use. If you need to grind the same meat multiple times:  Fill a large bowl with ice. Place a second bowl inside the first and grind your meat into that. Repeat as needed to keep the meat relatively chilled between each grind.  ", " Slice off sinew before grinding. Expect any sinew in your meat to dull your grinder’s blade over time. Carefully cut this away with a knife or cleaver before feeding the meat into your grinder. Ensure a better grind (and thus less mess to clean up inside).  ", " Sharpen or replace blades as needed. Remember: a dull blade will create a bigger mess inside. If your machine seems to be consistently smearing meat around instead of grinding it into small pieces, sharpen the blade or replace it with a new one. However:  As long you keep your grinder well maintained and avoid feeding sinew into it, the blade should get sharper and sharper the more you use it. At most, you should only need to sharpen or replace it annually, if that.  "]}}, "How to Clean a Milk Frother": {"description": "Milk frothers are just like any appliance - they get dirty. The process of cleaning the frother is simple. This article will show you how to clean your milk frother.", "content": {"Cleaning a Handheld Milk Frother": [" Turn your milk frother off. Turn your milk frother off. Unplug it if the tool runs on electricity. Let the device cool down.  ", " Hold the dirty wand with the whisk under a faucet and hand-wash it with warm water. Be gentle when you clean around the coil so that you don't break it. Use a brush to clean the coil, if it holds any milk residue. If the wand has any limestone deposits, soak its whisking part in warm water with lemon juice/citric acid or other cleaners that eliminate milk buildup. You may also submerge the dirty whisk in a vessel with warm water and let the device spin for several seconds.   ", " Place the frother in warm soapy water and turn it on. Give your frother a periodic thorough cleaning with a thick cleaning detergent to prevent the formation of milk deposits. Sanitation with a detergent extends the service life of the tool. ", " Add some soapy solution in a vessel with hot water. Dip the whisk into the soapy water and turn the frother on for several seconds. Keep the electric parts of the frother away from water. You may use dish liquid or liquid soap. ", " Rinse the frother under running water or immerse it in a vessel with pure water and turn it on. Let the device work for 10-15 seconds to wash away the remnants of the cleaning agent. You can repeat this stage several times. Use clear water each time. Give the wand a thorough rinsing if any detergent has been used. ", " Turn the frother on to let the whisk dry. If there are dirty spots on the handle, wipe it with a damp cloth. Clean the cord with a wet fabric and dry it with a clean paper towel.  "], "Cleaning an Electric Milk Frother": [" Turn the frother off. Make sure that all the items that you are going to clean are not heated up. Unplug the tool from the outlet. ", " Dismantle all of the removable parts. Put them aside, somewhere away from the sink. Remove the milk jug from the base. Detach other removable parts of the frother, like the frothing and heating disks. Both the base and the pitcher are not compatible with dishwashers and should be hand-washed. If the lid of the device has a seal, remove it, as well.   ", " Rinse the carafe inside with warm running water. If there is any caked milk remaining on the bottom, wash it off with a non-abrasive sponge. You may use dish liquid or any other soft detergent. If you notice any limestone deposits, scrub them gently. You can also use citric acid or lemon juice. You can also use citric acid or lemon juice. Apply other cleaners that break down milk protein buildup. Don’t scratch the non-stick surface inside the carafe. ", " Pour some liquid in the carafe and leave it to soak for 1-2 hours, then give the jar a good rinse with pure water. You may also make a paste from bicarbonate of soda and water. Apply it on the bottom of the carafe for 10-15 minutes. Do not use knives or other metal objects to clean the burnt milk residue. Don’t expose the electric part of the device to moisture. ", " Rinse it with warm water. All the detached attachments should be hand-washed separately with warm soapy water. ", " Clean the frothing disks under a tap with warm water. If necessary, add dish soap and clean them with a brush. Do not damage the fragile whisks during cleanup. ", " Clean the exterior with a soft cloth. Don’t use any chemicals for cleaning the stainless steel, because they may cause rust and discoloration. ", " Wipe the device with a dry cloth before storing. Dab all the screws with kitchen roll paper. Make sure that they are all dry before storing.  ", " Assemble all of the parts after they are dry. Place the disks in their position or in the storage compartment. Attach the seal back to the lid. "]}}, "How to Clean a Coffee Grinder": {"description": "Grinding coffee at home is a must for avid coffee drinkers, but your home grinder builds up dust and oil from coffee beans. To keep your coffee tasting fresh, clean your grinder out on a monthly basis, at a minimum. Blade grinders can be cleaned with rice and a damp cloth. Clean burr grinders by removing the burrs and brushing them down, as well as using a vacuum and a dry cloth.", "content": {"Cleaning a Blade Grinder": [" Measure ¼ cup (59 ml) of uncooked white rice into the grinder. Buy a package of white rice at your local grocery store, or use rice that you already have on hand. Make sure to use white rice for cleaning purposes. Use ¼ cup (59 ml) to ⅓ cup (79 ml) depending on the size of your grinder.  Measure the rice and pour it into the grinder.   ", " Run the grinder for about 1 minute. Plug the grinder in and turn on the power. Turn on the blade and let it grind the rice for at least 30 seconds and up to one minute. This will turn the rice into rice flour.  The rice cleans the grinder by soaking up oils and residue left in the grinder by coffee beans.  ", " Dump the rice flour out. Shut the grinder off and unplug it. If your grinder has a detachable hopper, take it off of the base. If not, take the whole grinder to the trash can. Dump the rice flour into the trash can.  Even if you use rice flour on a regular basis, don’t use this flour because it is contaminated with old coffee residue.  ", " Wipe the grinder down with a damp cloth. Get a paper towel barely damp with warm water. Carefully wipe down the inside of the grinder. Get all of the crevices. Be sure not to cut yourself on the blades as you wipe down the grinder.  Rinse the paper towel and wipe the grinder more than once if necessary. Be careful not to get the grinder soaking wet, as some of the moisture could stay inside it. Get the cloth just wet enough to wipe up the remaining flour.  ", " Allow the grinder to dry. Never use your grinder for coffee beans when it is still wet from cleaning. Dry it off with a cloth and allow it to air dry completely before you use it again. It may be helpful to dry the grinder upside down to make sure no moisture settles into it. "], "Cleaning a Burr Grinder": [" Vacuum or blow air inside the grinder. Use a vacuum that has a wand attachment to clean out your grinder. Unplug the grinder and set the vacuum up close to it. Poke the wand around the inside of the hopper and around the burrs to remove as much of the coffee dust as possible.  If your vacuum has multiple attachments, use the one with the narrowest end that will help you get the nooks and crannies of the grinder. If you want, use a can of compressed air to blow dust out of the grinder instead of sucking it out with a vacuum. If you are in a hurry, or don't have a vacuum or compressed air handy, blow in the grinder a few times to dislodge any leftover grounds. Be careful not to blow anything into your eyes.  ", " Remove the hopper and wash it by hand. If your grinder has a removable hopper where you load the beans, take this off and wash it separately. Wash the hopper and lid by hand with warm soapy water. Make sure you rinse it thoroughly to get all of the soap residue off of it before you use it again.  Allow the hopper to air dry upside down. If you are in a hurry, dry it with a lint free cloth or a paper towel.  ", " Take one of the burrs out. On most coffee grinders, either the inner or outer burr can be removed. It may require a tool that came with your grinder. Check the manual to find out how to remove the burr. Take out whichever one comes out most easily.  If neither one comes out easily, you’ll have to clean them while they are in the grinder. Be careful using tools to take the burr out. Make sure the grinder is unplugged for safe cleaning.  ", " Scrub the burrs with a toothbrush. Use a toothbrush or brush made for coffee grinders to carefully scrub all parts of the burrs. Scrub the one you’ve taken out first and then scrub the burr that is still in the grinder. Get all the cracks and crevices of the burrs, anywhere you can reach with the brush.  Use a brush with stiff bristles, but make sure they are not metal. Metal bristles may damage the burrs.  ", " Tip the grinder over and shake grounds out into the trash. After you have scrubbed the burr in the grinder, dump loose grounds into the trash. Scrub again and dump it out again if any more grounds seem to be stuck in there. Repeat this process as necessary.  ", " Wipe inside the grinder with a dry rag. Take a dry, clean wash cloth and wipe all parts of the grinder where the beans go. Wipe the burrs themselves carefully, and also wipe the chute and catcher where the coffee grounds fall.  The “dry” cloth is important. Never use a damp rag to clean the grinder. The metal parts will corrode if moisture gets into them.  "]}}, "How to Descale a Map Coffee Machine": {"description": "Is it time to descale your Map Coffee machine? Use these easy to follow instructions to understand the process of descaling your coffee machine at home or in your office.", "content": {"Steps": [" Turn off your Map Coffee machine.   ", " Lift the lever to empty the capsule chamber, then return lever to down position.  ", " Next, empty and rinse out the capsule drawer, then return to the machine.  ", "Now, fill the water tank with the Map descaling solution and place a cup or container on the drip tray directly under the water spout ", " Press the espresso (small cup) and long coffee (medium cup) buttons at the same time, while turning on the machine. The red and amber lights will blink, indicating the machine is in descaling cycle ", " Press the long coffee (medium cup) button to begin. The descaling solution will run through the machine in approximately 10-minute intervals for approximately 30 minutes. ", " You must empty your cup as it fills to prevent overflow, then return to the drip tray. Once the descaling cycle is over, the long coffee (medium cup) button will blink. ", " Now, carefully rinse out the water tank and fill with fresh drinking water. Empty and rinse out the capsule drawer and drip tray, then replace in the machine. Place your cup or container back on the drip tray. ", " Press the long coffee (medium cup) button to start the rinsing cycle, which will take approximately 3 minutes. Remember to empty your cup as it fills to prevent overflow, then return to the drip tray. ", " Once the cycle is complete, the long coffee (medium cup) button will blink. Press the long coffee (medium cup) button to quit the cycle. Carefully remove the water tank and fill with fresh drinking water. Empty and rinse out the used capsule drawer and drip tray. "]}}, "How to Clean the Steam Nozzle of a Coffee Machine": {"description": "The steam nozzle of a coffee machine should be cleaned after every use.", "content": {"Steps": [" Wipe the steam nozzles after each use. For a better clean, soak the nozzles in hot water to loosen the milk residue.  ", " Turn the steam wands on both before and after use. This will help to release the condensation and milk reside build-up. ", " Remove steam nozzles with adjustable crescent. Soak them at the end of a service to prevent blocking. Clogged jets can be unblocked using a paperclip.  "]}}, "How to Clean an Oven Door": {"description": "Oven doors get dirty with frequent usage, and baked-on oven grease is notoriously difficult to clean. When you want to see inside your oven again, your first instinct might be to go looking for some type of industrial oven cleaning product. However, these products are toxic and can be harmful to use, and they aren’t even necessary! With just a few common household products, you will be able to clean both outside, inside, and even in between the glass on your oven door to get it looking like new in no time!", "content": {"Wiping the Outside of the Door with a Natural Cleaner": [" Mix water and vinegar in a spray bottle to create a natural glass cleaner. Combine 2 cups (473 ml) of water with 2–4 US tbsp (30–59 ml) of vinegar in an empty, clean spray bottle. Shake the bottle to mix them well.  You can use either distilled white vinegar or apple cider vinegar to create this glass cleaner. If the front of your oven door is extra dirty, try adding 2-3 drops of liquid dish detergent to the mixture. You can also increase the ratio of vinegar to water in the cleaner.   ", " Spray the cleaner liberally on the outside of your oven door. Hold the spray bottle level with the door and spritz from top to bottom. Spray extra on any particularly dirty spots.  The cleaner will also work to clean grime off parts of the oven that aren’t glass. You can spray it anywhere on the oven door that you want to clean.  ", " Wipe the cleaner and dirt away with a clean microfiber cloth . Use downward strokes and work from one side to the other. Spray more cleaner on any greasy or dirty spots that don’t come off after the first try and scrub them clean with the cloth.  If there are any streaks left on the glass after you clean it, you can buff them away with another clean, dry microfiber cloth.  "], "Using Baking Soda to Clean the Inside of the Door": [" Combine water and baking soda to make a paste. Pour 1/2 a cup (90 g) of baking soda into a small bowl. Stir in just enough water, a little bit at a time, to make it into a thick paste.  You want the mixture to be about the consistency of shaving cream.  ", " Open the oven door and wipe off any loose bits of grime stuck to the inside. Open the door all the way so it is parallel with the floor. Use a damp microfiber cloth to wipe away chunks of baked-on gunk from the inside of the door.  Don’t worry if there are still bits you can wipe off, you just want to get rid of any easy stuff at this point before you put the baking soda paste to work.  ", " Spread the baking soda mixture evenly over the inside of the oven window. Use your fingers to scoop the paste out of the bowl and apply it to the oven door. Work it over the glass evenly in circular motions.  You can put on a pair of rubber gloves if you don’t want to do this with your bare hands.  ", " Let the paste sit for 15-20 minutes. The baking soda mixture needs to sit for at least 15 minutes to work its magic. Let it sit for 20 minutes or longer if the oven glass is extremely grimy.  Baking soda is a highly effective, non-toxic cleaner that you can use to clean bot only your oven door, but also other parts of the oven and stove top.  ", " Use a damp microfiber cloth to wipe away the paste and grime. Moisten a clean microfiber cloth under the kitchen faucet. Wipe the paste away from one side to the other, rinsing the cloth out as you go if needed.  You can repeat this process as many times as you need to get the inside of your oven door clean.  "], "Getting Between the Glass of an Oven Door": [" Remove the drawer or access panel below the oven door. Slide out the drawer completely, if your oven has one, and set it aside. Take off the access panel below the oven door if there is no drawer.  This will expose the slots at the bottom of the oven door so you can clean inside of it, without having to remove or take apart the oven door.  ", " Wrap a glass cleaning wipe around an unbent wire clothes hanger. Use store-bought glass cleaning wipes, or a paper towel moistened with homemade glass cleaner. Unbend a wire clothes hanger and wrap the cleaning wipe around one end of it.  You can get glass cleaning wipes in the cleaning aisle of a local supermarket.  ", " Slide the cleaning wipe up through the slots in the bottom of the oven door. Carefully push the cleaning wipe at the end of the wire up into one of the slots in the bottom of the door until it reaches the glass. This will allow you to start moving it around from side-to-side to clean the glass.  Depending on your oven’s model, the number of slots at the bottom of the door will vary. You will probably need to slide the wire and cleaning wipe up into each of them to reach all parts of the glass.  ", " Swipe the cleaning wipe back and forth to clean the inside of the glass. Bend the wire, if you need to, in order to reach all parts of the glass. Pull the wire out and move it to another slot after you have cleaned one area of the glass completely.  If the cleaning wipe gets dirty or dries out before you finish cleaning between the glass, then discard it and wrap a fresh wipe around the wire to finish cleaning.  "]}}, "How to Clean a Burnt Oven Bottom": {"description": "Spills and splashes are pretty common while cooking and baking, but if you don’t wipe them up right away, they can burn and stick to the bottom of your oven. Luckily, burnt on food at the bottom of your oven can be removed with a little bit of time and elbow grease. You can easily get rid of the burnt coating with either homemade remedies or store-bought cleaners.", "content": {"Preparing Your Oven": [" Remove everything from inside the oven. Take out the oven racks so that you can easily reach the bottom. Also be sure to remove any other items you may keep in your oven, such as an oven thermometer or pizza stone.  If your oven racks are also coated in burnt food remnants, you can use these same cleaning solutions to scour them. Simply remove them, , and replace them once you’re done cleaning the oven. You can easily clean oven racks by soaking them in warm water with dish detergent mixed into it. After the oven racks soak for a few hours, use a scouring pad to remove any stuck on grime. Then dry them with a clean dish towel.    ", " Wipe away any large chunks of food or fresh splashes. It’s best to remove easy-to-clean spills before working on the burnt areas. Use an old rag or some paper towels to clean up any food that’s easily removed from the bottom of your oven. ", " Lay newspapers or old towels on the floor in front of your oven. Some of the liquid cleaning agent could drip out of your oven while you’re cleaning. Having something on the ground to catch these drippings helps protect your kitchen floor and makes clean-up easier.  ", " Run a self-cleaning cycle if your oven has one. This process causes your oven to heat up to a high temperature and bake any food remnants or spills to a crisp. This may help you more easily remove the grime. Depending on your oven, a self-cleaning cycle can take between 1.5 and 3 hours.  If the bottom of your oven is completely covered in burned-on food, you may need to skip this step. Excessive amounts of burned food layers can end up smoking a lot, setting off your smoke alarm and releasing chemicals.  Keep an eye on your oven while running the self-cleaning cycle. If you start to see smoke, it’s probably best to shut off the cycle and just clean everything by hand. Once the cycle is done and the oven has cooled, remove the light-colored, charred ash from the bottom of your oven by wiping it down with a damp cloth.   "], "Applying a Cleaning Agent": [" Make a paste of baking soda and water for an easy solution. Combine ½ cup (260 g) of baking soda and 2–3 tablespoons (30–44 mL) of water in a small bowl. Wearing gloves, spread the paste onto the burnt areas. Let it sit overnight to loosen the grime.  As you spread the paste around, try to rub it into the particularly bad burnt spots. The mixture should start to turn brown.  Add vinegar to the cleaning paste to make it more effective. As an alternative, spray the vinegar onto the paste just before you scrub it off. The vinegar will react with the baking soda to create more cleaning power.  ", " Bake lemons in your oven for a natural cleaning option. Cut 2 lemons in half and squeeze the juice into a small oven-safe bowl or baking dish. Add the peels and enough water to fill the bowl or dish ⅓ of the way. Put one of the racks in the center of the oven and place the bowl on the rack. Bake it for 30 minutes at 250 °F (121 °C). The vapors from the lemon juice will penetrate through the burned layers, making them easier to remove.  It’s normal for the oven to smoke during this process. Provide ventilation by turning on your oven fan and opening a nearby window. Let the oven cool down and remove the rack before trying to wipe away the spills.  ", " Use a store-bought cleaner if you don’t mind using harsh chemicals. These cleaners will probably work better than any other method, so if your oven is really dirty, you may want to try this option. However, these cleaners can be toxic, so you need to make sure they’re fully removed before you cook food in your oven again. Spray the cleaning agent on the burnt areas, and let it soak in for 20-30 minutes.  Wear safety glasses and thick rubber gloves if you use heavy-duty cleaners to prevent the chemicals from splashing in your eyes or absorbing into your skin. Check the package directions to find out how to apply the cleaner and how long to let it soak.  ", " Avoid getting any type of cleaner on the heating elements. Whether you’re using a natural or chemical cleaning product, do your best to keep the cleaner away from the heating elements. When you turn the oven back on, the heating elements can create fumes when burning off the cleaner, which could alter the taste of your food.  For electric ovens, lift up the thick metal wire that forms the bake element and apply the cleaner underneath. If your oven is gas, try not to spray or get cleaner on the gas valve or igniter. If you accidentally get some of the cleaner on the heating element, wipe it away with a cloth dipped in clean water.  "], "Removing the Cleaning Agent": [" Wipe off the cleaning agent and grime with a damp rag. Rinse and wring out your rag several times throughout this process. Make sure you’re getting the cleaner out of every nook and cranny. If you used a commercial cleaning product, read the label and follow the instructions for removal. If you used baking soda paste, put a bit of white vinegar in a spray bottle and spray it on the paste before trying to wipe it away. The baking soda-vinegar mixture will foam up, making it easier to see.  If you tried cleaning your oven with lemons, you can use some of the leftover lemon water to scrub away at the burnt areas.  A plastic spatula might help to scrape off the burnt food.   ", " Use a scouring pad to scrub off any bits that are stuck. Get your pad a bit damp and scrub at any grime that didn’t easily wipe away. A microfiber sponge or a piece of steel wool may also work.  ", " Give your oven a final wash with a wet rag, then let it dry. Grab a clean cloth and wipe out the bottom of your oven one more time to make sure that all of the dirt, food particles, and cleaner is rinsed away. Let your oven air dry or dry it with a clean towel.  If you used a heavy-duty cleaner, it may be a good idea to wash the bottom of your oven again with a bit of dish soap just to make sure that no toxic chemicals remain. If you notice any remaining bits of grime, spray vinegar onto them and continue wiping with your wet rag. The vinegar will help you remove the stubborn spots.  ", " Clean up the surrounding area and replace your racks. Make sure to wipe down the sides and door of your oven if you happened to get any cleaner on them. Remove your newspaper or towels from the floor, and wipe up any bits of grime that may have leaked out of the oven. If you also need to clean the oven racks, thermometer, or any other items that you removed before cleaning the oven, do so before replacing them.  "]}}, "How to Clean Grill Grates": {"description": "If you like to grill your food, it's important to clean the grate when food particles start to build up. Routine cleanings the grates after each use, in addition to yearly deep cleanings, will improve the quality of your food, prevent harmful bacteria from building up, and lower the risk of fire hazards. Porcelain grates require different care from cast iron and stainless steel grates. However, you can use the same deep cleaning method for all three.", "content": {"Cleaning Porcelain Grates": [" Read your owner's manual. Porcelain coating is very fragile and easily damaged from scrubbing and scraping. Follow the manufacturer's instructions to the letter. Otherwise, you could void your warranty.   ", " Use a nylon scrubber brush while the grill is still hot. Avoid a brass brush, which can scrape the coating off the grate. Opt for a curved brush that can get in between the grating. Gently scrape in a diagonal motion. Start at the point closest to you and move upward. Move in one direction to minimize the risk of damage to the coating. If you have built-up gunk like barbecue sauce, wet the brush before scrubbing.   ", " Clean the underside of the grill. Flip the grill over after it has cooled. Scrape away excess food and gunk with the brush using a diagonal motion. The underside will take somewhat longer to clean because of the drippings that accumulated during cooking. Scrub until the grate is completely clean. If your grate comes in multiple sections, flip and clean each part separately.   "], "Cleaning Stainless Steel and Cast Iron Grates": [" Opt for a stainless steel grill brush. The bristles are soft enough to protect the surface of the grate. Choose between a roll brush or a straight brush. Both will clean the grill effectively, but the roll brush will more easily clean the sides of the grates.  ", " Keep the grill hot. This will soften any leftover grease and make it easier to clean up. Turn the grill to its “high” setting if it's not at that setting already. Let it heat up for 10 to 15 minutes, or until the temperature gauge reaches 500 to 600 °F (260 to 316 °C). Then, turn off the burners.  ", " Scrub the grate. Scrub using a back-and-forth motion along the first bar. Continue until the bar is free of grease and food particles. Repeat the process on the rest of the grate.  ", " Apply vegetable oil to the grate. Dip the towel into a container of the oil to pick up about a teaspoon (5 mL). Place the towel in a pair of tongs and wipe it along each bar. This will prevent your grate from rusting. Don't apply more than a teaspoon of oil. Too much can cause a dangerous flare-up if it drips onto any smoldering food particles below the grate.   "], "Deep Cleaning Grill Grates": [" Soak the grates in a vinegar solution. Mix one cup (237 g) of vinegar and two cups (474 g) of baking soda. Pour the solution into a garbage bag or container large enough to fit the grates. Place the grates in the solution and allow them to soak overnight. Place a cover on the container. If you use a garbage bag, fasten it with a rubber band.  ", " Remove and rinse the grates. Untie the rubber band or remove the cover from the container. Lift the grates out of the solution. Then, rinse them down with a garden hose. Most of the stuck-on food should fall off.  ", " Scrub off any remaining gunk, if necessary. Use a nylon brush for porcelain-coated grates. Move in gentle diagonal strokes. Cast iron or stainless steel grates can handle stainless steel bristles. Move in a gentle vertical direction.  ", " Rinse and dry the grates. Hose the grates down one last time. Pat the surface dry with a microfiber towel. Then, replace the grill.  "]}}, "How to Clean a Gas Grill": {"description": "Whether you’re a novice griller or a BBQ pit master, keeping your grill clean is an important part of creating a good meal. Maintaining your gas grill after each use cuts down on the time to make your grill shine, but even if you haven’t cleaned your grill all season, a little effort will get it cooking like new again.", "content": {"Cleaning the Interior of Your Grill": [" Turn off the gas supply to the grill. You do not want to have dangerous gasses build up during the cleaning process that can lead to injury. Locate the gas supply valve on the propane tank for LP grills and where the grill connects to the house for LNG supplied grills. Turn the knob or lever clockwise to shut off the gas supply running into the grill. Remember \"righty-tighty, lefty-loosey\" to close and open valves.   ", " Remove the grates and scrub with a wire brush and soapy water. Grill brushes can be purchased from your local supermarket that have wire bristles, an acrylic scrubber, and a metal scraper. Invest in a grill brush for easy cleaning.  Fill a bucket with soapy water made from teaspoon of liquid dish soap for every quart of water. Dip the wire brush in the water and scrub away any grimy build up present on the grates. Be sure to clean both sides of the grates.  ", " Remove any metal plates or coverings over the burners and scrub clean. The plates protect the burners and help to disperse the heat to allow for even cooking.  Clean the burner protectors by scrubbing with sponge or scouring pad dipped in soapy water.  ", " Gently wipe any grime off the burners. Check the holes in the burners for clogs and use a toothpick to dislodge any objects that may be blocking the flow of gas. In some grill models the burners are easy to remove for cleaning; if yours do not come out easily, you can wipe them clean while they are in place.  ", " Scrape any charred drippings from the bottom of the grill surface. If your grill has a removable bottom pan, you can take it out to scrape all the debris away. If the bottom pan is secured in place use a metal spatula or grill scraper to push any burnt scraps through the grease hole and catch them in a trash bag.  ", " Clean the bottom of the grill with a soapy sponge. Once all the chunks are gone, scrub the bottom with a sponge or scouring pad and soapy water to remove any built up grease or grime. Lots of drippings and food scraps tend to build up under the burners of the grill. Pay close attention to this area and clean it as much as possible to avoid corrosion.  ", " Check the sides and underside of the lid for flaking paint or caked on food. Use the grill scraper to gently clean any flecks off the underside of the lid and wipe it clean with a soapy sponge. Be careful not to scratch the metal or scrape any undamaged paint off the lid as this may lead to rusting or corrosion.  ", " Replace burner covers and grill grates. Reassemble your grill by putting everything back in the reverse order you removed it.  Burner covers and grill grates usually rest in place. Look for groves or ledges to place these items back in the proper location.  ", " Turn on the gas and fire up the grill. Turn the grill on high and close the lid for 15 minutes to burn off any remaining soap or cleaners you used on the interior surfaces of the grill.  ", " Turn off the burners and oil the grates. Oiling the grates will help to prevent your food from sticking to the surface.  Dip a paper towel in canola oil. Use tongs to rub the oily towel over the surface of the hot grates.  "], "Cleaning the Exterior of Your Grill": [" Turn of the gas before beginning to clean the grill. Make sure that the gas valve is completely closed to avoid filling the grill with dangerous flammable gas during the cleaning process.  ", " Check the drip pan under the grill and replace as needed. Most grills have a disposal drip pan or cup. Clean the surface of the drip pan holder, and replace the liner with a fresh aluminum pie plate or tin can.  If your drip pan is not disposable, wipe out the grease with paper towels. After removing as much grease as possible rinse the drip pan with a solution of soapy water.  ", " Fill a bucket with soapy water. Make a soapy solution to clean the outside of the grill with 1 teaspoon of dish soap per quart of water.  ", " Wipe the exterior surfaces with an old rag dipped in soapy water. Clean all surfaces of the grill thoroughly to minimize the chances of corrosion due to food bits clinging to the metal. Pay close attention to the areas around the knobs to remove any drips that may have accumulated. Wipe the side panels or burners with the soapy water as well.  ", " Rinse any soap away with a gentle spray from a hose. Keep spots from forming due to soap bubbles by thoroughly rinsing the outside of your grill after cleaning.  ", " Use glass or stainless cleaner to polish any stainless steel surfaces. If your grill has a stainless steel lid or cabinets, spray a glass cleaner on the surface and wipe with a paper towel to keep the surfaces looking shiny.  "], "Maintaining your Grill": [" Oil the surface of the grates before each use. Keep your grill grates cleaner by oiling them prior to each use with an old rag or paper towel dipped in vegetable oil. Use tongs to rub the oily towel on the hot grates before placing food on the grill.  ", " Clean the grates with a wire brush after each use. It is easiest to clean the grill grates while they are still hot. Use a wire grill brush to scrape away any remaining food bits by rubbing the wire bristles along the length of the grates.  ", " Check your gas line for leaks. Regularly inspect the gas lines connecting your grill to the gas tank by applying a small amount of soapy water to the surface of the line and connectors. This should be done each season you are using the grill and monthly during periods of high usage.  Use a rag or brush to apply soapy water along the length of the gas line. Make sure to apply soapy water liberally around the connections and valves. Look for any bubbles that indicate gas is leaking causing a potentially dangerous situation.  ", " Burn off any drippings to prevent grimy build up. In between every 3-4 times you grill, heat up the grill without any food present. Turn the burners on high. Close the lid to burn up any drippings that have fallen on the burner protectors. Allow the heat to build up inside the grill for 10-15 minutes.  ", " Cover your grill in between uses. Invest in a cover for your grill to protect it from the elements when it is not in being used. Keeping rain and debris from piling up on your grill will help keep it from rusting and extend the life of your grill. ", " Finished.  "]}}, "How to Clean a Philips Airfryer": {"description": "If you’re a proud new owner of a Philips Airfryer, you might be wondering how to clean up the cooking appliance after roasting a batch of veggies or a deliciously-crispy chicken. Thankfully, all you really need is hot, soapy water and a gentle sponge to get the grease and oil off of the pan, basket, and heating element. All Philips-brand air fryers can be cleaned using the same methods.For everyday maintenance, make sure you wash out the pan and basket after each use. Give the appliance an inside and outside clean once per season, or more frequently if you notice a lot of buildup or smoke.", "content": {"Washing the Pan and Basket": [" Unplug the appliance and allow it to cool down completely. Before you start any sort of cleaning, be sure to disconnect your Philips Airfryer from its power source. Then, wait for about 30 minutes to allow the components to cool down before you start washing them out.  If you can’t wait for the Airfryer to cool down completely, make sure you wear heat-resistant gloves before handling the hot appliance. If you wear oven gloves, avoid getting water on them as they’ll fail to protect your hands once they get wet.   ", " Pull out the pan from the appliance and lift out the basket. Once everything has had some time to cool off, grab the handle on the pan and slide it out horizontally from the body of the appliance. Next, lift out the frying basket and set this aside for a moment.  You’ll probably want to set the basket in your sink or on a few pieces of paper towel to catch any drips of grease.  ", " Discard the grease from the bottom of the pan. If you notice that the bottom of the pan is lined in grease, get rid of this before washing the pan with soapy water. Hold the pan over a lidded disposable container, such as a glass jar or plastic tub, and carefully tip out the grease into it. Once you’ve gotten all of the grease out, seal up the container and discard it.  While liquid fats will easily drip out, you might need to scoop out solid fats. Use a plastic utensil to do this. Don’t use a metal tool as it might scratch the nonstick coating on the pan. Refrain from tipping the grease down your sink; this will only clog up your pipes.  ", " Soak the pan and basket in hot, soapy water to remove sticky residue. Reinsert the basket, then fill up the pan with hot water and mild dish soap. With the basket nested inside the sudsy pan, leave both pieces to soak for about 10 minutes.  If your air fryer isn’t too dirty and you don’t notice any gunky grease spots, feel free to skip this step.  ", " Scrub out the pan and basket with a sponge or soft-bristled brush. After soaking the pan and basket, lift out the basket and scrub off the food and grease residue. Use hot, soapy water and a sponge or soft-bristled brush to scrub around both sides of the mesh. Rinse this piece off and set it aside. Next, gently scrub the pan in a similar way. Finally, rinse off any remaining suds from the inside and outside of the pan and basket. Refrain from using stiff-bristled brushes or steel wire sponges to clean your air fryer. These may quickly scratch up the nonstick coating.  Especially tough grease stains can be removed using a more powerful liquid degreaser, but you’ll want to check the manual for your Philips Airfryer to confirm what types of products will work best without damaging the nonstick coating.  ", " Run the pan and basket in the dishwasher instead, for a quicker clean. While hand-washing is the recommended cleaning method, the pan and basket in a Philips Airfryer are dishwasher safe. First, tip out the grease. Then, give each piece a quick rinse and scrub to get rid of as much food residue and grease as possible. Finally, set the pan and basket face-down into your dishwasher and run a normal cycle with mild dish detergent.  If these pieces aren’t particularly dirty, the dishwasher can be a faster and lower-maintenance alternative to hand-washing. However, you’ll want to soak, scrub, and hand-wash them if you notice a lot of grease or build-up. Keep in mind that the appliance itself isn’t dishwasher safe; you’ll need to remove the pan and basket to wash them.  ", " Allow the pan and basket to air-dry before reinserting them. Once these pieces are grease-free and sparkling clean, set them out to air-dry for about 30 minutes to an hour. Use a paper towel to blot away any excess water, if necessary. Once they’re dry, go ahead and place the basket back into the pan, then slide the pan into the body of the appliance.  "], "Cleaning the Appliance": [" Start with an unplugged, cooled-down appliance. Before you start cleaning your Philips Airfryer, unplug it from its power source and allow it to cool down completely. Wait about 30 minutes for your appliance to reach room temperature.  Refrain from cleaning the inside or heating element while the appliance is still hot.  ", " Wipe down the outside using a moist, damp cloth. To eliminate fingerprints and food bits from the outside of your Philips Airfryer, get a lint-free cloth moist with hot water. Use this to wipe down all of the outside surfaces, including the handle and buttons.  If necessary, spray a small amount of degreasing solution onto your cloth and use this to rub away any stubborn spots.  ", " Take out the pan and basket, then turn the Aifryer appliance upside-down. In order to easily reach the heating element, which sits above the pan and basket, you’ll have to flip the whole appliance upside-down. First, slide out the pan and basket and set these pieces aside. Then, use 2 hands to rotate your appliance. Set the flat top part of the appliance down onto a flat work surface.  The heating element looks like the coils on an electric stovetop. Avoid trying to clean the element while the appliance is right-side up. You’ll have a hard time seeing the coils and probably won’t be able to thoroughly clean them.  ", " Scrub out the inner chamber and heating element using a soapy sponge. Dampen a sponge or soft-bristled brush with hot water and mild dish soap. With the appliance turned upside-down, you’ll be able to see the heating element very clearly. Start by scrubbing the surface of the coil to release the greasy residue. Rinse off your sponge or brush as needed, and continue to wipe down the rest of the inner chamber.  Allow the inner chamber to air-dry for 30 to 60 minutes before sliding the pan back into the appliance. You’ll probably need to discard the sponge as it will collect a lot of grease. Refrain from cleaning out the inside of your Philips Airfryer with a steel wire sponge or a stiff bristle brush. Use a flexible cleaning brush to reach behind the heating element, or try an old toothbrush for a more detailed clean.  "], "Deep-Cleaning the Heating Element": [" Spray a baking soda solution onto the heating element. Mix up a solution using 3 g (0.11 oz) of baking powder and 100 millilitres (0.42  c) of water. Use a spray bottle to spritz this solution onto the heating element while the appliance is turned upside-down. Let the solution settle for 1 or 2 minutes, then flip the appliance right-side up and leave it to soak for 30 more minutes.  Repeat this process once more to get rid of especially stubborn residue. Make sure the appliance is unplugged and completely cool. You’ll also need to take out the pan and basket before applying the solution.  ", " Pour about 400 millilitres (1.7  c) of water into the pan and reinsert it. Start with a clean pan so you don’t allow any more grease or food residue to circulate around the air fryer. Line the bottom of the pan with about 400 millilitres (1.7  c) of water. With the appliance right-side-up, slide the pan and basket back into the appliance.  ", " Run the Airfryer for 20 minutes to dislodge any remaining residue. Plug your Philips Airfryer back into a power source, then the temperature to 200 °C (392 °F). Run a 20 minute cycle at this temperature to allow the moisture and baking soda solution to take care of any sticky or greasy spots.  After this cycle, toss out the water and any residue caught in the basket.  ", " Allow the appliance to cool before wiping it down. Unplug your Philips Airfryer after running a quick cycle. Allow it to cool down partially for about 20 minutes. You’ll want it to be slightly warm, but not hot. Remove the pan and basket, then flip the appliance upside-down. Use a damp sponge to wipe off the heating element and the inside chamber. The heat, plus the moisture from the sponge, should make it easy to wipe off the remaining grease buildup and bits of food.   "]}}, "How to Clean a Foreman Grill": {"description": "George Foreman grills are some of the most popular cooking appliances available because they make delicious food quickly without taking up a lot of space. Using the grill is fun, but cleaning it takes a bit of time. If your Foreman has removable grill plates, washing them is incredibly easy. Cleaning Foreman’s without removable plates is a little tougher, but you have a few options to choose from!", "content": {"Cleaning a Foreman Grill with Removable Plates": [" Unplug the Foreman after using it. Give it about 10-15 minutes to cool down. If the grill is still hot after that time, wait a little longer to avoid any injuries.  If you want to play it safe, put on some oven mitts before you go through the rest of the cleaning process.   ", " Remove the grill plates one at a time. This is where the oven mitts come in handy. Once you’ve taken the plates out of the grill, place them on your counter.  You should lay out paper towels so you don’t risk the grill plates damaging any part of your kitchen counter.  ", " Wash the grill plates in the dishwasher for the easiest option. The plates are completely dishwasher-friendly, so you don’t need to change any settings or add any more dishwasher detergent to get them clean. If possible, wash the grill plates with a smaller load to give them the best chance to get clean.  While using a dishwasher will clean the grill plates, soaking them separately lets you clean them completely.  ", " Soak the grill plates in soapy water if you don't have a dishwasher. Fill the water to the halfway point of the sink and add a few drops of dish soap. Keep your grill plates completely submerged in the water and let them sit for a few minutes.  You can use a bathroom sink to do this if your kitchen sink does not have room.  ", " Dry the grill plates with a towel before reattaching them. Use a soft towel to scrub away any excess food particles or soap. Once the plates are completely dry, reattach them to your Foreman Grill.  Since the Foreman has electrical wiring inside of it, you must wait for the plates to dry before putting them back in the grill. The wiring can short-circuit if it comes into contact with the water.  "], "Washing a Grill without Removable Plates": [" Put damp paper towels on your grill once it has cooled down. This helps lift the grease that accumulates on the grill. Place three layers of lightly damp paper towels on the grill plates, as just one paper towel will be ineffective.  Don’t do any of this until you’ve unplugged the grill and waited a few minutes for it to cool down. If you put paper towels down when the grill is still hot, it could cause a fire.  ", " Close the grill to let the paper towels absorb the grease. The paper towels will loosen the grease and make it easier to scrub away. To save time, set this up right before you eat. By the time you’re done, you’ll be able to remove the damp paper towels and the grill will be ready to clean. The grill should be warm when you do this, but if it is too uncomfortable to touch, wait for it to cool off a bit more.  Even though you don’t want to put paper towels on a hot grill, you do want your Foreman to be somewhat warm when you layer the paper towels on it. The mix of the grill’s warmth and the paper towels’ moisture is necessary to lift the grease out of the grill plates.  ", " Spray the grilling surface with water as an alternative to using paper towels. This is another way to clean your Foreman if you don’t want to put paper towels in it. Fill a spray bottle with water, and start spraying the grilling surface once you’ve unplugged the grill and made sure it’s turned off.  The grill will still be hot, so be careful not to burn yourself. If you do not have a spray bottle, you can put a wet paper towel ball between metal tongs and wipe down the surface this way. This allows you to get in between the ridges and reach the more obscure areas of the grill. Don’t directly pour water onto your grill, as this can damage its electrical wiring if the water finds its way under the grill plates.  ", " Chip away at fat and food chunks with your plastic scraper. The scraper comes with the Foreman grill. If you’ve lost it or do not have one for some reason, use a plastic spatula to get rid of the excess food chunks.  Make sure you use a plastic scraper, as metal can damage the Foreman grill.  ", " Use a wet sponge to wipe away any loose debris. Add warm water and a small amount of soap to a sponge, rag, or paper towel to get rid of any residue that is still on your grill. Wipe the inside of your grill thoroughly.  Take time to wipe all parts of the grill, as grease can get anywhere. You want your grill looking fresh and clean for the next time you use it!  ", " Pour grease out of the drip tray and wipe it down by hand. The drip tray catches the excess grease that comes from your food, so there’s a good chance it’s full once you’re done cooking. Pour the grease into your sink and use a rag with warm water to scrub away the remaining residue.  You can use a paper towel to clean the drip tray instead of a rag if you’d like. The drip tray should be clean once you’ve wiped it down. However, if you want to play it safe and make sure it’s as clean as it can be, stick it in the dishwasher after you’ve cleaned your grill.  "]}}, "How to Clean a Range Hood": {"description": "Your stove’s range hood can be easily overlooked when cleaning your kitchen. However, this is an area you definitely should be cleaning to keep your home safe from germs, bacteria, and fire hazards.The hood itself can be easily cleaned if you make a regular habit of it, although it may require some harsher chemicals than your regular surface cleaner at first. Then, depending on what type you have, you can easily clean or replace the hood’s filter on a less frequent basis.", "content": {"Washing the Outside of the Hood": [" Choose the right cleaner for your specific hood. Range hoods can be made from a variety of materials. When choosing what to clean with, pick a cleaner that's safe to use on that material in order to avoid damaging it. For instance: For plastic or vinyl hoods, use an all-purpose cleaner or warm soapy water.  For stainless steel, go with warm soapy water.  For copper, use copper cleaner.    ", " Wipe the outside of the hood. Expect the hood’s exterior to be a pretty easy job since it’s aimed away from your stovetop. Simply spray it with your cleaner. Follow the cleaner's directions if it advises letting it sit for any length of time before wiping it off.  ", " Dry the hood. Wipe it down with a dry, clean cloth or paper towels. Remove all traces of the cleaner. If the hood's material has an obvious grain, wipe with the grain for a more effective clean and polish.  "], "Cleaning Underneath the Hood": [" Steam the inside if needed. First, take a peek under the hood. If it looks like you have your work cut out for you up there, fill a large pot three-quarters of the way with water. Bring it to a boil, uncovered, on the stovetop and keep it boiling for a half hour or more, as needed. Let the steam soak into the crud so it starts to loosen from the hood.  Wait for the stovetop to cool before proceeding. Keep in mind that you’ll probably have to lean over the stove to reach up and under the range hood. If you boiled water to work the crud loose with steam, remove the pot to a heat-safe surface. Wait for the burner to cool down before moving on.  ", " Test-spray the inside. If the dirt is light enough for your regular surface cleaner to work, great. If, however, you need a tougher chemical for degreasing (like Super Clean, OxiClean, or Mrs. Myers’ All-Purpose Cleaner) to get the job done, give a small area of the hood a test spray before using it all over. Make sure it doesn’t cause any adverse reactions with the hood’s paint or other materials.  Again, always double-check the cleaner's recommendations regarding which materials it's safe to use on.  ", " Spray and wipe. First, read your cleaner’s instructions for proper use. Wear safety gloves if advised. Open windows and turn the exhaust fan on if strong ventilation is recommended. Then spray the hood’s interior as directed and wipe it down with a sponge, cloth, or paper towels.  Some cleaners may recommend wiping down immediately. Others may advise letting it sit for a period of time so it can soak into the dirt, grease, and crud.   ", " Wipe again with wet towels. Expect strong cleaners to leave streaks and odors if any traces are left to linger. Once the area is clean, dampen a cloth or paper towels. Wipe the interior again to remove any chemical residue. Then repeat with a dry cloth to dry it.  ", " Repeat frequently. Expect the job to be tougher the longer you wait in between each cleaning. Make washing the hood part of your daily or weekly routine when doing the whole kitchen. If a particular meal used a lot of oil or caused a lot of splatter, clean it up immediately afterward, as soon as the stovetop is safe to work around.  "], "Dealing with the Filter": [" Check it monthly. Clean the hood itself on a daily or weekly basis, but don’t worry about dealing with the filter that often (unless you happen to deep-fry a lot of foods on a regular basis). Inspect it once a month. If it appears stained or splattered, plan on cleaning or replacing it ASAP.  ", " Remove the filter. Filters can be secured into place in a number of different ways. Give yours a look over. It will probably be attached by:  A fastener that you can rotate in and out of position. A latch that you need to press and lift. Rim supports that just need to be pushed up and rotated. Screws.  ", " Replace fabric and charcoal filters. If you have either of these types, do not attempt to clean them. Simply switch the old one out and install a new one. However, with charcoal filters, keep in mind that you only need to replace these if you have a ductless range hood.  A ductless range hood means the exhaust fan is recirculating air right back into the kitchen. If the exhaust is being ventilated out of the house through ducts, you shouldn’t need to replace your charcoal filter.  ", " Soak metal filters in cleaner and water. Fill your sink with hot water. Add dish soap or the recommended amount of a stronger cleaner (like Super Clean or OxiClean) to degrease it. Let it soak for ten minutes up to a half hour, then agitate it in the water to shake off any loose dirt. Use a bristle brush to scrub any stubborn bits. Then rinse clean under a strong jet of water (like your faucet’s sprayer attachment). After that: Set the filter on a clean towel or drying rack and allow it to air-dry before reinstalling.  "]}}, "How to Clean a Cast Iron Dutch Oven": {"description": "Cleaning a cast iron Dutch oven is no different from cleaning any othercast iron cookware.Depending on how deep of a clean it needs, there are a number of different methods to choose from. Once it’s clean, taking a few extra steps in terms of maintenance and storage will help prolong its life for years to come. Even so, all cast iron needs to be re-seasoned every now and then, but this is pretty easy since your kitchen’s oven does most of the work for you.", "content": {"Washing Dirty Cast Iron": [" Wipe it down with cooking oil and towels. If the cast iron isn’t all that dirty and you use it a lot, simply pour in enough cooking oil to coat the insides. Then use cloth or paper towels to wipe away any loose bits of food. Use fresh paper towels to wipe away any excess oil. If it looks clean after that, that’s all you need to do, so call it a day!  Cast iron becomes sterilized once it reaches 212 degrees Fahrenheit (100 degrees Celsius), which should only take a couple minutes the next time you use it.  However, if you don’t use your Dutch oven frequently, it’s a good idea to give it a more thorough wash than this. The cooking oil may turn rancid after a few days of non-use.    ", " Scrub with mild soap and warm water. Wet a sponge with warm water. Add a few drops of mild dish soap. Scrub off all traces of food and then rinse thoroughly with plain warm water.  A popular myth is that you should never, ever use soap on cast iron. Manufacturers definitely advise against using strong detergents, scouring pads, and dishwashers, but handwashing with mild soap is fine.   ", " Use salt for tougher crud. To remove more stubborn bits of food that have scorched to your Dutch oven, shake some salt into it. Then place it on a burner and turn the heat to high. Use cloth or paper towels to scrub the abrasive salt around to loosen and dislodge the scorched bits. Then repeat either Step 1 or 2 to remove the salt and loosened crud.  The heat from the burner should also help loosen the crud as you work. However, cast iron heats up pretty quickly, so switch the burner off after a minute or two (or less if it feels too hot to handle safely). Wiping more cooking oil over the cruddy bits can also help loosen them as it heats up.  ", " Use special tools if needed. For especially tough crud, pick up some tools specifically designed for cleaning cast iron. Scrub your Dutch oven with steel mesh instead of a sponge or towels. If you think that might be a little too abrasive, pick up some plastic scrapers so you can chip away at burnt food. ", " Scour off any rust. Expect prolonged exposure to water to rust your Dutch oven pretty quickly. If your cast iron develops any, use steel mesh or fine-grade sandpaper to scrub it off. If the rusted area was relatively minor, rinse it with warm water, dry it off, and then wipe it with cooking oil.  If the rust returns soon afterwards, or if the affected area was pretty large, you will need to reseason your Dutch oven.  "], "Caring for Your Dutch Oven after Washing": [" Dry it immediately. Expect wet cast iron to start to rust pretty quickly. If you used any water to wash it out, wipe it dry immediately. To really ensure that all moisture has been removed, heat it in the oven or on the stovetop until all traces of water have evaporated.  This is only necessary for water, not cooking oil. Cooking oil will actually act as a barrier to water.  ", " Oil it back up and reheat it. Give your Dutch oven a quick reseasoning. Wipe it down with a light application of more cooking oil. Then wipe up any excess with fresh paper towels. Set the Dutch oven on a burner, set the heat to high, and let it heat up until it starts to smoke a little bit.  It should only take a couple minutes to start smoking at high heat.  ", " Prevent moisture from building up during storage. Always store your Dutch oven and its lid separately. Allow air to circulate inside it when it’s not in use. For double protection, stuff a few sheets of paper towels inside so they absorb any moisture that might accumulate during humid weather.  "], "Reseasoning Cast Iron More Thoroughly": [" Reseason as needed. Expect to need to do a more thorough job of reseasoning now and then even if you give your Dutch oven a quick one after each use. How often this needs to be done will vary from person to person (for instance, if you use it to cook a lot of acidic foods, you will probably have to do so more often than someone who doesn’t). Thoroughly reseason your cast iron whenever:  Foods begin to stick to it constantly. Rust recurs frequently and/or pervasively. The cast iron turns from shiny and black to dull and gray.  ", " Wash with mild soap and a brush. Definitely use a mild dish soap to wash it this time for a more extensive clean. Instead of a sponge, however, use a cleaning brush with stiff bristles for an even more rigorous job. Give it a thorough rinse with hot water and then dry it off.  ", " Oil it up again. Wipe it down with more cooking oil. This time, however, do it all over: both inside and out. Do a thorough job, but keep the application thin. Wipe away any excess with fresh paper towels if needed.  ", " Put your cast iron in the oven. First, expect oil to possibly drip from your Dutch oven while it bakes, even if you did a good job of removing the excess. Cover the lower rack with aluminum foil to keep the bottom of your oven clean. Then set your Dutch oven upside-down on top of that.  ", " Bake your cast iron. Turn the oven on. Heat it up somewhere between 350 and 400 degrees Fahrenheit (177 and 204 degrees Celsius). Once your oven reaches your desired temperature, let the Dutch oven cook inside it for a minimum of one hour. After that, it’s good to go.  "]}}, "How to Clean a Griddle": {"description": "To clean the griddle, you’ll need a number of kitchen aids, including a griddle-cleaning soap, a sturdy griddle sponge, and, possibly, a griddle brush or scraper.  With your griddle warm, mix some warm water with your soap.  Dip your sponge in the water and scrub the grime away.  You can make your job of cleaning the griddle easier if you season it well and avoid using metal kitchen implements on it.", "content": {"Removing Grime": [" Turn on the griddle. With your griddle warm, caked-on bits of grime should come off more easily during cleaning.  Turn your griddle to the appropriate setting.  Different griddles are meant to be cleaned at different temperatures.  Different griddle soaps, likewise, are intended for use at different ideal temperatures.  Check both your griddle’s user manual and the griddle soap you obtained to determine what temperature you should set your griddle to.  It will be easier to clean your griddle when you’ve just used it, before it’s cooled, than it will be to try and clean the griddle after the bits of whatever you’ve been cooking have caked onto its surface.    ", " Mix your water and soap. In a small bowl or bucket, combine griddle soap with warm water.  Your griddle soap might have specific directions regarding the proportions of water and soap should be mixed.  For instance, perhaps your soap will come in a single packet that must be mixed with two cups of water. Do not submerge your griddle entirely in water and soap.  Doing so could damage the electronics inside your griddle.  ", " Scrub your griddle. After dipping your sponge or cleaning implement into the warm, soapy water you’ve prepared, use it to loosen and remove as much gunk as possible.  Use a back-and-forth or up-and-down scrubbing motion when scrubbing your griddle.  You could move from top to bottom, or from bottom to top.  If you’re scrubbing your griddle with an up-and-down motion, you could move from right to left or from left to right as you scrub. Attach the drip tray if your griddle does not have one permanently attached.  Place a bowl or small container beneath the drip tray’s drain to catch the water you use to scrub the griddle. Dip your sponge or griddle brush into the water frequently during the cleaning process.  This ensures the griddle receives a steady application of soapy water. If a moderate level of force is not removing gunk from the griddle, apply pressure more firmly when scrubbing.  ", " Move on to stronger scrubbing devices if necessary. For instance, if your griddle is not getting clean with a thin griddle sponge, use a thicker griddle sponge.  If your griddle sponges have proven ineffective, try a griddle brush.  If the griddle brush proves ineffective, try a griddle scraper. Sometimes alternating between different cleaning instruments produces the best result.  For instance, you might use a griddle brush to loosen material that has caked onto the griddle, then scrape it off with a griddle scraper.  "], "Maintaining Your Griddle": [" Season your griddle before use. When you first use your griddle, you can add a protective coating – or “seasoning” – to it to prevent rust and make it easier to clean in the future.  To season your griddle, pour one teaspoon (five milliliters) of vegetable oil onto the griddle.  Use a paper towel to spread the oil across its entire surface.  Let the oil sit on the griddle for one hour.  Wipe up any residual oil after an hour has passed.  Season your griddle again if you’re using it again for the first time after a long period of disuse.  ", " Avoid cooking with non-stick cooking spray and corn oil. Non-stick cooking sprays have a high water content and burn easily.  And if you’re cooking on a griddle with a nonstick coating, they’re completely redundant.  Corn oil, likewise, should be avoided.  The high sugar content in corn oil tends to caramelize (melt) and coat the surface in a sticky, burnt mess.  ", " Wipe your griddle down after light cooking. Use a paper towel to wipe the surface down.  The small amount of oil that remains on the griddle after a light wipe-down will help season the griddle.  ", " After heavy cooking, wipe your griddle down with club soda. Pour room-temperature club soda directly on the griddle.  Pull oil and food scraps toward the grease trough with a metal spatula.  Wipe the surface down with a paper towel, then season your griddle.  ", " Do not use metal utensils. When using your griddle, avoid using metal forks or spatulas.  These could lead to scratching or removal of your griddle’s nonstick coating, if present.  Instead, utilize rubber, plastic, or wooden cooking implements. One exception to this rule is in the case of ceramic or stainless steel griddles, which can withstand a metal griddle scraper or other implement.   "], "Using Effective Cleaning Tools": [" Obtain griddle soap. Specialized griddle-cleaning sops will make cleaning your griddle a breeze.  If you cannot locate a specialized griddle-cleaning soap from your local home good store, use an extra-strength soap, or one that is designed to cut through layers of grime and grease.  ", " Obtain a griddle sponge. A griddle sponge is specialized type of scrubbing device for griddles.  Its surface will scour your grimy griddle to remove caked-on bits of grease and burnt material.  Griddle sponges are available with varying thicknesses.  The more cleaning your griddle needs, the thicker your griddle sponge should be.  Do not use steel wool or other abrasive cleaning devices to clean your griddle.  ", " Obtain a griddle brush. For larger griddles, or griddles with grime and crust that simply won’t budge even when scrubbed with a griddle sponge, you’ll need to invest in something more heavy-duty.  For this kind of cleaning, get a griddle brush from your local kitchenware store.  A griddle brush is a stiff-bristled brush, typically with a wooden handle, that will help you remove even the most tenacious griddle grime.  ", " Get a griddle scraper. A griddle scraper is a kitchen tool that resembles a paint remover.  From the comfortable handle, a fan-like blade extends outward to a straight edge.  It is this edge which is used to scrape the griddle of residue and stuck-on bits.  "]}}, "How to Clean an Electric Grill": {"description": "An electric grill is a convenient cooking tool that can whip up grilled cheese sandwiches and burgers from your kitchen countertop, or patio if it’s an outdoor style. As easy as it is to grill with one, it can be somewhat less easy to clean one, because meat can still stubbornly stick to the nonstick plates. By following some simple steps, like rubbing grime off while the grill is still hot to wiping the removable plates down with a soapy sponge, you can get your electric grill clean in a jiffy.", "content": {"Cleaning an Indoor Countertop Grill": [" Unplug your grill after cooking. Protect yourself from electric shock by unplugging your grill before you put it anywhere near a wet sponge.  ", " Let the grill cool down slightly. The best time to clean the grill plates is when they’re still warm. After you unplug the grill, let it cool down for about ten minutes.  ", " Use a rubber spatula to scrape off leftover food. It’s important not to use abrasive scouring pads that can scratch the nonstick grill plates. Some electric grills come with a rubber spatula that can scrape off caked-on food, but any rubber spatula will do. Scrape along the ridges and crevices of the grill surface.  ", " Wipe the plates down with a damp sponge. Wet a soft sponge or rag and wring it out thoroughly. Rinse the sponge frequently while you wipe the plates down, because it will get greasy and grimy quickly. Use a dollop of dish soap on your sponge for tough jobs. ", " Remove the drip tray and wash it with soap water. Dismantle your electric grill by taking the plates off and remove the drip tray. Squirt some dish soap and wash it with a soft, wet sponge or rag. ", " Dry all pieces with a paper towel. Dry the drip tray and give the grill plates another once over with a paper towel. You’ll remove any leftover gunk and get your pieces dry. ", " Put detachable parts in the dishwasher. Some electric grills have detachable pieces that can be cleaned in the dishwasher. Follow the manufacturer's directions, but put the drip tray and cooking plates in the dishwasher if you can.  "], "Cleaning an Outdoor Electric Grill": [" Turn your grill off. Make sure your electric grill is turned off, before you start cleaning it. Locate the power button and flip it off. ", " Scrape cooking grates with a stainless steel brush. While the grill is slightly warm, scrape the cooking grates down with a stainless steel grill brush. ", " Take the removable liner off. An outdoor electric grill will likely have a removable liner underneath the grates. Take this piece off and use a rubber spatula to scrape off any excess, dropped food pieces. If it’s especially dirty, wash it with a wet soapy sponge.  ", " Wipe the lid down. Use a damp cloth to wipe the lid down. Make sure the cloth does not drip and never immerse this part in water. ", " Remove the grates to wash with soap and water. If your grill is not very dirty, you may be able to skip this step. If it is, take the grates off and wash them with a wet sponge and dish soap. Scrape with a stainless steel brush as needed. ", " Completely dry any removable pieces. Before you put the removable liner or grates back on and use your grill again, make sure it’s completely dry. Use a dry dishrag or paper towel to thoroughly dry it. ", " Deep cleanse grates annually with vinegar and baking soda. To remove all dried, burnt-on food residue, use a concoction of vinegar and baking soda by mixing 2 cups (470 mL) vinegar to 1 cup (240 mL) baking soda in a trash bag. Tie the dirty grates in the bag and leave it overnight. Dried on residue should fall off easily in the morning. "], "Using an Alternate Method to Clean an Indoor Grill": [" Unplug the grill and let it cool. Right after you cook with your grill, unplug it and let it cool down for about five minutes.  ", " Place wet paper towels between the plates. While the grill is still warm, lay two to three moistened paper towels on the bottom plate. How many paper towels you use will depend on how thick each one is. Use enough to be able to grab food particles without tearing them. ", " Close the lid and let the paper towels steam clean. Let the warm grill plates and damp paper towels steam clean the grill for about 1 minute or until the plates completely cool down. Any caked-on grease will loosen up. ", " Open the lid and wipe the plates down. Use the damp paper towels or dampen a sponge with hot water and dish soap. Scrub the grill down until it’s squeaky clean. ", " Dry the grill before using it again. Make sure your grill is dry, especially around the plug, and wipe it down from top to bottom with a clean, dry dishcloth. "]}}, "How to Clean a Dutch Oven": {"description": "Dutch ovens are typically made of cast iron and are often glazed with an enamel coating. To clean an enamel dutch oven, simply wash it with hot water, soap, and a nonmetal scrub pad. For pesky burnt-on stains, use baking soda, a mineral abrasive cleaner, or a degreaser. If your dutch oven is raw cast iron, you should only use hot water, as soap will strip its seasoned coating. For more intensive cleaning, carefully rub thick deposits of rust, dirt, or grime with fine steel wool, then scrub the pot with oil and salt, which will clean and re-season it.", "content": {"Caring for an Enameled Dutch Oven": [" Stay away from steel wool. Cleaning an enameled dutch oven after using it is simple, and only involves soap and hot water. You might need an abrasive scrub pad to remove pesky food residue, but the most important rule to follow is to avoid steel wool and other metallic pads or brushes.  Steel wool, wire brushes, and other metallic scrubbers can erode the enamel coating. Go for nonmetal options, like nylon. A Scotch-Brite Dobie Pad is a great non-scratch choice for cleaning enamel cookware.   ", " Wash the pot with dish soap, hot water, and a scrub pad. You’ll have an easier time cleaning your dutch oven when it’s still hot, so wash it as soon after cooking as possible. Run hot water, add a few drops of dish soap, and scrub off food residue with your non-scratch pad. Rinse away soap suds, then dry the pot thoroughly with a towel.  ", " Boil water in the pot before washing if it’s a little grimy. Boiling water is a quick trick for stubborn bits of grime, but not so tough that they require breaking out the big guns. Fill the pot halfway with water, place it on a burner set to medium, and let the water boil briskly for a few minutes. Scrape away the residue with a wooden spatula, pour out the water, then wash the pot with soap and hot water.  If stubborn stains didn’t flake away after the quick boiling water technique, you can try more intensive cleaning methods.  "], "Removing Burn Stains from Enamel": [" Try simmering water and baking soda in the pot first. Fill your dutch oven halfway with water, then bring it to a boil over medium heat. When it starts to boil, slowly stir in baking soda, then lower the heat and let it simmer for a few minutes. Use a wooden spoon or spatula to work away pesky burnt-on stains.  Use a ratio of 2 tablespoons (29.6 ml) of baking soda per 1 US quart (950 mL) of water. After simmering and nudging off the residue, pour off the water and baking soda, then wash the pot with soap and hot water. If you still spot caked-on grime, you’ll need to up your game with elbow grease and a baking soda paste.   ", " Scrub stubborn stains with a baking soda paste. Pour 2 heaping tablespoons of baking soda into the pot, then add a small amount of hot water to form a thick paste. Cover the sticky spots with the paste and let it sit for 30 minutes. Then use your non-scratch scrubbing pad to scrub the problem areas.  After scrubbing, rinse away the baking soda paste to check your work. Don’t worry if you still see stains. There are still plenty of cleaning tricks you can try!  ", " Use a mineral abrasive cleanser if baking soda won’t do the trick. After baking soda, your next option is an abrasive cleaning powder, such as Bar Keepers Friend or Bon Ami. Make a thick paste by mixing 2 or 3 spoonfuls of cleaner with hot water. Then, using plenty of elbow grease, scrub away the sticky bits.  You can find cleaning powders like Bar Keepers Friend or Bon Ami wherever cleaning products are sold. Your local department store or major grocery chain should carry them.  ", " Try a commercial degreaser if your pot’s still dirty. If you have a major stain problem that survived baking soda and abrasive cleansers, it’s time to get serious. You can choose between a couple of degreaser options. For either, spray the product onto the problem areas, let it sit, scrub with a nonmetal pad, then thoroughly rinse away residue with hot water.  If you prefer eco-friendly products, go for a biodegradable degreaser, such as De-Solv-It. If you use a non-toxic, biodegradable degreaser, you won’t have to wear gloves. While not as powerful as heavy-duty cleaners, a non-toxic product should do the trick. Powerful, heavy-duty degreasers, such as Zep, will get just about anything off of your pot. However, they’re toxic and are not environmentally friendly. Be sure to wear rubber kitchen gloves and work in a well-ventilated area.  ", " Try ammonia if you have it on hand. If you happen to have ammonia for household cleaning, you can use that instead of running to the store for a commercial degreaser. Dilute 2 to 3 tablespoons (29.6 to 44.4 ml) of household cleaning ammonia with hot water at a 1 to 1 ratio. Scrub the problem spots, then rinse the pot thoroughly with hot water.  Ammonia is an excellent degreaser, but it’s harsh, toxic, and not eco-friendly. Wear gloves and work in a well-ventilated area. Never mix ammonia and bleach together, as they produce toxic fumes when combined.  ", " Soak the pot in a bleach solution if it’s discolored. After scrubbing until your arm feels like falling off, you might find that burnt-on grime left behind a dingy, discolored spot on your enamel. If you want to get your enamel’s hue good as new, soak it overnight in a solution of bleach and water. Wash the pot with soap and hot water thoroughly after soaking it in the bleach solution.  Dutch oven manufacturers recommend mixing 1 tablespoon (14.8 ml) of bleach with 1 US pint (470 mL) of water. However, you can use a ratio as strong as 1 part bleach to 3 parts water. If only the bottom is stained, just use enough solution to cover the bottom. If the sides are discolored, fill the pot with enough solution to cover the stained area. Remember to keep bleach away from ammonia. If you degreased the pot with ammonia, rinse it thoroughly before adding a bleach solution.  "], "Cleaning a Cast Iron Dutch Oven Routinely": [" Wash cast iron with hot water and a nonmetal scrub brush. If you use soap on cast iron, you’ll have to go through the time-consuming seasoning process. Instead, use the hottest tap water that you can handle to rinse the pot immediately after cooking. If necessary, use a nonmetal brush or pad to scrub away bits of food residue.  ", " Boil water in it after brushing if you’re concerned about germs. Since you can’t use dish soap, some people worry about sanitizing cast iron. You’ll ultimately oil and heat the dutch oven after rinsing it, so germs shouldn’t be a problem. However, if you’re germ-conscious and want to take an extra step, fill the pot with water, briskly boil the water for at least a minute, then pour out the water.  ", " Dry the dutch oven thoroughly. Never let cast iron cookware drip dry or stay wet for extended periods of time. Immediately after rinsing it (or after boiling water in it), completely dry your dutch oven with paper towels or a dedicated cast iron cloth.  Cast iron cookware has a seasoned coating that will blacken the cloth you use to dry it. Use paper towels or a dedicated cast iron cloth instead of your best kitchen towels.  ", " Oil the surface lightly after each cleaning. Place the dutch oven on the stovetop, set the burner to medium-low, and heat the pot until all traces of water have evaporated. Add a half teaspoon of vegetable or flaxseed oil. Use paper towels to coat the inside of the pot with the oil, then continue to wipe the surface with oiled towels until it’s black and smooth.  Flaxseed oil is the best choice for seasoning cast iron cookware. However, since you’re just giving the coating a quick touch up instead of doing a full re-seasoning, it’s fine to go with vegetable oil.   "], "Restoring Rusty or Crusty Cast Iron Cookware": [" Rub the pan lightly with fine steel wool, then wipe away loose dirt. You should only use steel wool for neglected, rusty pans or thick deposits of dirt or grime. Be sure to use fine steel wool, such as grade #0000. Wear down rust or gunk by rubbing the pan with gentle to medium strokes, then wipe away loose debris with a dry cloth.  Repeat scrubbing and wiping until you’ve cleared away the rust or dirt.  ", " Coat the pot with oil, then heat it on the stove for 5 minutes. Place your dutch oven on a burner set to medium-low. When it’s hot, add enough vegetable or flaxseed oil to thickly coat the bottom. Keep the pot on the hot burner for 5 minutes, or until the oil smokes, then turn off the stove.  ", " Add coarse salt to form a thin paste, then scrub the pot. Make a liquidy paste with the salt and oil, then put on a pair of clean work gloves. Scrub the inside of the dutch oven completely with a wad of paper towels. Use a potholder to hold the handle and steady your dutch oven as you scrub.  ", " Repeat heating and scrubbing your dutch oven 3 to 5 times. The inside surface of the pot will have absorbed and distributed the oil after the first scrub. When the oil residue has thinned, add more oil to heavily coat the bottom the pot, then heat it until the oil smokes. Add more salt to make a paste, scrub the inside with paper towels, and repeat the process 3 to 5 times, or until the surface is slick and black.  ", " Rinse and dry the pot, then coat it thinly with oil. After scrubbing the pot, rinse it thoroughly under hot water, then dry it completely with paper towels or your cast iron cloth. Heat the pot on a burner set to medium-low to evaporate the last bit of water. Turn the burner off, add a teaspoon of oil to the pot, then use paper towels to spread the oil and absorb any excess.  "]}}, "How to Clean a Burnt Ceramic Stove Top": {"description": "Ceramic-glass stove tops make cleaning a lot easier since they have a flat surface, but food can still burn and get stuck on. If you don’t have any ceramic cleaners, you can easily lift minor stains with a paste of baking soda and water. For more persistent stains or large pieces of residue burnt onto the cooktop, try using a scraper and ceramic cleaner to remove them. Within the afternoon, you can make your stove look new!", "content": {"Scrubbing the Surface with Baking Soda": [" Wipe as much off the stove top as you can with a damp paper towel. Wait until the stove cools off completely so you don’t burn yourself. Start in the back corner of the stove top and wipe residue toward the front. Cup your other hand under the edge of the stove to catch the pieces that came loose. Work your way across the stove in back-to-front strokes until you reach the other side.   ", " Sprinkle baking soda over the burn marks. Pour the baking soda directly out of the box onto the stove top. Use enough to completely cover the burnt area and any other stains you want to remove. Spread the baking soda flat by hand so it forms an even layer over the surface.  Don’t use other abrasive powder cleaners because they could scratch or damage the ceramic.  ", " Soak a microfiber towel in a dish soap solution. Fill a bowl with 1 teaspoon (4.9 ml) of liquid dish soap and 1 US quart (0.95 L) of warm water. Mix the solution together until it forms suds. Put a microfiber towel that’s large enough to cover the burnt area in the bowl and let it soak until it’s completely saturated.  You may need to use multiple towels if you need to cover the entire stove top.  ", " Lay the towel over the baking soda and leave it for 15 minutes. Pull the towel out of the soapy solution and wring it out loosely to remove some of the water. Unfold the towel and place it flat over the baking soda. Allow the towel to soak the baking soda for at least 15 minutes to help break down the residue.  Baking soda breaks down dirt and oil when it reacts with water, so it works great as a natural cleaner. You may leave the towel on the stove top for up to 30 minutes for more difficult stains or residue.  ", " Scrub the surface in a circular pattern a scrubbing pad. Remove the microfiber towel from your stove, doing your best to leave as much of the baking soda on the surface as you can. Start in the middle of the burnt area with a cloth scrubbing pad, working in circular motions out toward the edges. Apply slight pressure as you scrub to help lift the stains easier.  You may also use a microfiber cloth or paper towel if you don’t have a scrubbing pad.  ", " Wipe the baking soda off with a paper towel. Start in the back corner and wipe toward the front of the stove with a single straight. Continue working across the surface of the stove, replacing the paper towel whenever it gets too wet or soiled. Clean off any leftover streaks with a dry paper towel.  If you weren’t able to clean the burnt area completely, you may need to try using baking soda again. If that doesn’t work, you may need a stronger cleaner. Spray glass cleaner on the stove and wipe it off with a paper towel if it still has a cloudy appearance.  "], "Scraping and Washing Difficult Residue": [" Work while the surface is still warm if possible. Turn off the stove as soon as you notice something burning, and set any cookware aside on a heat-safe surface. Allow the stove to cool slightly until it’s warm enough to comfortably work on without feeling too hot. Avoid letting it cool down completely since stains may set in easier or it could be more difficult to remove.  If the heat is too warm for you to handle, put on an oven mitt before you start working.  ", " Hold a metal scraper against the ceramic at a 45-degree angle. Put the blade of the scraper against the stove so it’s flush with the ceramic. Keep the handle at a 45-degree angle so you don’t scratch the cooktop. Place the edge of the blade against the stain or burned residue.  You can buy a metal scraper from your local hardware store.  ", " Push the scraper through the residue to lift it off the surface. Apply slight pressure to the scraper as you guide it through the residue. Use short forward strokes as you move the scraper over the residue. Go over burnt sections multiple times until you can’t lift up any more of the burnt section.  Always move the scraper’s blade away from your body so you’re less likely to injure yourself. If the blade on the scraper gets dirty, clean it with a paper towel.  ", " Wipe off the residue with a paper towel. Clean from the back of the stove toward the front so the residue is easier to control. Cup your hand underneath the edge of your stove and catch the pieces as they fall down. Replace the paper towel as it gets dirty so you don’t spread the burn marks around.  Try wetting the paper towel and wringing it out before wiping the stove to help lift up more of the fine powder residue.  ", " Apply a ceramic cooktop cleaner to the surface with a scrubbing pad. Put a coin-sized amount of the cooktop cleaner directly onto the stove. Use the corner of the scrubbing pad to spread the cleaner in a circular motion over the entire area you just scraped. Continue working the cleaner into the surface until it’s clear.  You can buy ceramic cooktop cleaners from appliance or home improvement stores. Don’t use oven cleaners or ammonia products since they could damage the cooktop.  ", " Let the cleaner dry until it hazes. Leave the cleaner on the surface and avoid using your stove until you’re finished cleaning. Allow the cleaner to sit for about 10–15 minutes, or until it forms a cloudy appearance.  The drying time may vary depending on the cleaner you use.  ", " Buff the surface with a dry microfiber towel. Work across the entire surface in circular motions to help polish the stove top. Apply light pressure as your work over the burnt areas to lift up any residual stains or discoloration. Wipe off all of the cleaner until the stove has a sparkling, clean appearance.  If you still see marks, you may need to clean the stove again.  "]}}}