{"How to Train Your Dog for a Dog Show": {"description": "Showing dogs, or \"conformation\" is a popular and enjoyable activity for many dog owners. It gives you a chance to build a stronger bond with your dog, and also to show off your canine friend to an adoring public. But, before your dog can trot to success, you need to train it for the stage so it can steal the show. This will be easiest if you begin when your dog is still a puppy.", "content": {"Getting Ready to Train": [" Make sure your dog is eligible to participate. Before you invest a lot of time and effort in training your dog, you will want to make certain your dog will be allowed to take part in dog shows. Only purebred dogs over six months old that are not spayed or neutered may take part in American Kennel Club (AKC) shows. That's because the purpose of these events is to judge whether your dog is good breeding stock.  Your dog must also be as a purebred with the appropriate breed club and conform to all breed guidelines. If you got your dog from a breeder, they probably gave you the certification paperwork showing your dog is registered. If not, you'll need to contact the appropriate breed club. The AKC has an online directory you can use to contact the club.  If your dog is spayed or neutered, there are other events you can take part in. The United Kennel Club (UKC) has an \"altered\" class that allows these dogs to compete.  If your dog is not a purebred, it can compete in shows organized by mixed breed dog clubs.    ", " Attend some dog shows. The next step is to attend some dog shows to get a better sense of what it's all about.  This will help you get a better sense of what judges are looking for, and what you can expect when you enter your dog.  This is also a great way to get more information about the show process and preparing your dog. Visit the club table or tent to pick up information on entering your dog and training classes offered by the club.   ", " Get the right lead. When your dog walks out into the ring, you'll need to have it on the right kind of leash or \"lead.\" The sooner you get one of these, the sooner your dog can get comfortable with being on it. Go online or ask at your local pet store for one of these: For small dogs, you can use a Resco “all in one” style collar with lead. The Resco is a loop with a slider to keep it snug on the dog’s neck.  For a medium sized dog, you can use a martingale lead. These leads close up enough to keep your dog's head from slipping out, but don't tighten around a dog's neck like a choke-chain. They also help to train your dog to keep its head held up high while showing judges their gait, and while stacking. The other commonly used lead is the chain and show lead. This is not as elegant as the martingale, but many handlers use them for larger, boxer breeds such as the Rottweiler. These also help your dog to keep its head held high, and to not run away in the ring.  ", " Enter your dog in a local ring raft class. These classes help you train your dog for a show. Although this is not necessary, it is recommended. Ringcraft classes can help you socialize your dog to other people and dogs. They can also help the dog learn to walk on a lead without being distracted by other dogs.  These classes can also be a great source of information about shows and showing. They can be a good opportunity to meet other people involved in showing dogs.   "], "Training your Dog for Show": [" Practice gaiting. Gaiting is moving your dog in a way that allows the judge to see their movement and structure. The correct gait is usually a trot, with the dogs head up. A trotting dog’s right front leg and left back leg move forward at the same time, then the left front with the right back. Trotting is the correct pace because it shows the dog’s true structure the best. To start, use treats to lure your dog to follow you around without a lead. The dog should remain at your left side. Once the dog is comfortable wearing the collar and walking beside you, formal lead training can begin. Attach a show lead to the dog's collar, pick up the dog and carry it a short distance away from your home. Put it down and walk back toward your house at a speed that encourages the dog to trot, holding the other end of the lead. The dog should be happy to go toward home and follow you. Repeat this process, carrying the dog farther away from home each time. If your dog fights the lead, back away and offer it treats to come toward you.  ", " Teach your dog to “hand stack. ” To succeed, all dogs must learn to \"stack,\" or stand squarely and still. In hand stacking, you manually place each leg in position while standing or kneeling close to the dog. Dogs will have to stack several times during a show. Many people let dogs \"free stack\" most of the time, but hand stack right before the judge's examination. This ensures the best possible stance for the dog.  The specific position your dog should be in will vary by breed. Consult the guidelines for your breed, available from the appropriate club.  To train for hand stacking, keep a good-sized treat in your right hand. Keep it partially covered so the dog can only nibble on it as you adjust the positions of the dog's feet with your left hand. Adjust the dog's front legs first, moving them at the elbow. Then, keeping your left hand on the dog at all times, move to the back legs and adjust them at the hock. Never stack by touching the dog's feet, as this may cause it to shift its whole body. Repeat this until your dog is comfortable with the process.  Finally, teach the dog to maintain that position. Pull the food away for a second and tell the dog to stay. If it holds the position, say \"yes!\" and give the dog a nibble of the food. If it doesn't, restack the dog and try again.   ", " Teach your dog to \"free stack. \" Free stacking is when your dog assumes the proper position on command, rather than with manual adjustment. This is most easily done with some training treats and clicker. To begin with, click and reward your dog whenever it stands. If it keeps standing, reward it again. Keep doing this until the dog offers the stand position spontaneously.  Next teach “back up.” Step toward the dog and click and treat any shift of movement backward, which should result in the dogs back legs aligning. Repeat this process with the command, clicking and reward increasingly correct backing up behavior.  Then, teach the dog to align its front legs with the command \"step.\" To teach this command, step back and click and treat as soon as the dog moves a front foot forward. Once the dog does this easily, say “step” just before you prompt it. Repeat this until the dog aligns it's front feet on command.  Finally, teach the command \"stack.\" Click and treat every time the dog is in the correct position. Repeat if the dog holds that position. Eventually, you'll be able to just use the \"stack\" command without \"back up\" and \"step.\"   ", " Bait train your dog. You want your dog to also look alert and happy when stacked. Most breeds should have their attention on the handler and the judge, and have their ears perked and their eyes on you. Training your dog to look at you is something you can begin the first time you feed the dog a meal. When you put the food bowl down, repeat the word “cookie\" over and over. This repetition will teach the puppy to associate a food with that word. Later, use this command to focus your dog's attention on you while offering it treats from your hand when it is in a stacked position. This causes the dog stretch its neck upward to look at you. This pose shows the dogs outline and balance to the judge.  ", " Teach the dog tolerate examination. In a dog show, judges will physically examine a dog, touching its body and mouth. A successful show dog will need to tolerate this without complaint. A good first step in getting your dog accustomed to this is to to touch the dog all over its body daily, including inside its mouth. If you start this at a young age, your dog will quickly grow accustomed to it.  Next, begin giving your dog regular inspections that approximate those of a judge. Closely examine the dog's teeth. For males, touch the testicles. Do this on both a table and the floor, if your dog is smaller in size. While small dogs are usually inspected on a table, some judges will begin inspection while the dog is still on the ground. Finally, when the dog is comfortable with your inspections, bring in a second person and ask ask them to do the same. This way, your dog will get comfortable with inspection by strangers.  ", " Start showing for local clubs. Before you try taking your dog to a major club show, try showing your dog with a small, local club. This can be fun, and a good way to determine if your dog is ready for the \"big leagues.\"  "]}}, "How to Identify a Show Worthy Maltese": {"description": "If you've made a decision that you'd like to show your Maltese dog at the next dog show in town, you'll need to be aware of what's expected by way of standards and appearance. To work out whether your Maltese is show-worthy or not, you’ll need to familiarize yourself with the competition’s guidelines and inspect your dog for qualifying characteristics. Focus on your dog’s physical appearance as well as its trainability and personality traits.", "content": {"Examining Physical Features": [" Assess the body of the dog. The standard body of a Maltese is compact. Typically, the distance from the withers (shoulders) to the root (base) of the tail should be the same as the distance from the withers to the ground. Its back should be level from the tail to the shoulders. The dog's chest should be slightly deep and the loins should be tight and slightly tucked under.  The dog's neck should hold the head in a high position, almost as if the dog is holding its head back a little. The tail should be curled over the dog’s hind end. The tail should also be plumed. The front feet can be slightly turned out, but turned out back feet are not permitted. The Maltese pup’s paw pads should be completely black.   ", " Inspect the dog’s face. The face of a dog is one of the most important aspects of a show dog, especially when it is being closely scrutinized by a judge during a competition. A Maltese dog should have a slightly rounded head on top with drop ears and a medium length snout.  The dog should have a black nose, with its eyes a deep brown or black. The skin around the eyes should be dark. The jaw should be lined up in a scissor bite. A parrot or sow bite is considered not desirable for this breed.   ", " Check the appearance of the coat. The coat should be pure white. But it can be common to see cream, tan, or lemon ears. These colors should be seen nowhere else on the coat. It is preferable not even to have these pigments on the ears, although it is still permitted if they are light and barely noticeable.  The coat should be silky and thin, never greasy. Maltese dogs can also have red fur on their feet, but this is not permitted in most show competitions.  ", " Ensure that a male dog has two scrotal testicles. The testicles should appear normal and fully descended. Retained testicles are not acceptable on the dog show circuit.  "], "Identifying Desirable Personality Traits": [" Look for obedience. One of the most important traits for a Maltese show dog to possess is obedience. This trainability should be at least somewhat obvious, even as a young puppy. Notice if the dog listens to you when you speak to it and if it seems to adapt its behavior based on previous learning experiences.  Try telling the dog “no” to a behavior you don’t want it to do. If the dog seems to understand, or at least try to, then this is a good sign for trainability.  ", " Monitor for temperament. Personality is one of the things these dogs are known for. The dog you are showing should be fearless. They are sweet dogs that are not at all aggressive. The personality needs to be playful. Any Maltese without these traits is not show worthy.  You want a Maltese dog that is comfortable around people and not afraid of a crowd. Your dog should not be aggressive or shy.  ", " Meet the parents. If you are purchasing a puppy, meet the parents of the litter. If you cannot meet the father, at least see the mom. By observing the behaviors of the parents, you should be able to get an idea about the temperament of your puppy.  Behavioral characteristics in dogs are often shared genetically – so a dog that is mild-mannered is likely to give birth to puppies with similar mild-mannered temperaments. And vice versa with disobedient or aggressive behaviors. This is also a great way to get an estimate about the ultimate size your Maltese puppy will grow to.  "], "Understanding Show Guidelines": [" Acquire registration papers. All Maltese dogs entered in shows must be registered as purebreds. In most cases, you should have been given your dog’s registration papers directly from the breeder when you acquired the dog. Most U.S. competition shows require AKC registration, so be sure to verify that. In some competitions, other types of registrations are partially acceptable. For example, CKS and APRI registered dogs are often allowed to participate in most events at shows, only excluding the Conformation event. If you don’t have any papers for your purebred Maltese dog (and you can’t get any from the breeder), you can contact the AKC to see what they can do to help you. In some cases, accreditation can be given with photo evidence and written statements by witnesses who claim that the dog is a purebred.  ", " Maintain weight requirements. Check to see whether the dog complies with size breed standards according to the AKC. The AKC requires a Maltese to be under seven pounds (3.2 kg), but four to six pounds (1.8 - 2.7 kg) is preferable.  You could also check with another relevant body, such as the Kennel Club. In some cases, the show entity will have its own rules regarding breed-specific weight requirements.  ", " Get the necessary training. Many dog competition shows require a certain amount of training to prove that your dog is ready for entry in a real competition show. This training involves obedience tests and command tests.  To get your Maltese to a point where it is ready to succeed in a dog show, you’ll need to focus on . This means practicing commands, establishing your position as the leader, rewarding your dog when it behaves correctly, leash training, and teaching your dog some simple commands. Once your dog masters some easy commands (like “sit,” “stay,” and “come”), you can move to more complicated tasks like fetching, following you without a leash, and rolling over. Make sure your dog knows how to stand and carry itself well so that its flowing coat is on display. Some shows also require entry into a preliminary competition at an unofficial dog show called “Matches.” These events are still hosted by kennel clubs and help dogs become more socialized and accustomed to the show atmosphere.  ", " Aim for success. A successful Maltese show dog must have a willingness to perform, which often translates into a demanding, pushy attitude. Winning show dogs often want to be the center of attention with their owners.  A dog who loves to perform, even under pressure, will be able to succeed in the stressful show environment when other dogs may break due to the stress of the situation.  "]}}, "How to Become a Dog Show Handler": {"description": "Dog show handlers are responsible for working with dogs at dog shows on behalf of their clients, who are often the dog's owners. Handlers are expected to help the dog make the most favourable impression on the judges, and they are often responsible for grooming and preparing the dogs for shows, as well as arranging transportation. Most dog show handlers are self-employed and have a number of dogs and owners as clients. Become a dog show handler by getting to know everything you can about dogs and the business of dog shows, and attracting clients who will hire you to handle their canines.", "content": {"Learning About the Job": [" Research the job. Start by doing some thorough research about the nature and demands of the job. Being a dog show handler is about much more than showing dogs in the ring in front of judges. It's a job that means a lot of time on road and a lot of time on your feet. You will need excellent knowledge and enthusiasm for every aspect of showing and caring for pure breed dogs. Once you have a good roster of clients you may be competing in 100 or 200 shows per year. Each show requires a great deal of preparation and organization to ensure all the dogs are in top shape.   ", " Assess your qualities. Before you go about trying to develop a career as a dog show handler you need to evaluate your skills and weaknesses against the requirements for a successful handler. Remember you need to be able to work well with people as well as dogs, so strong interpersonal and communication skills are a must. You will be part of a team with the owners and the dogs, so you need to work well with other people.  Being a handler can be a physically demanding job so you need to be in good shape and enjoy spending a lot of time outdoors, even if it's wet. You have to be passionate about the presentation and grooming of the dog as well as its physical fitness.  ", " Observe the professionals. A great way to learn about how dogs are shown and try to pick up some expert knowledge is to spend lots of time watching professionals at as many dog shows as you can make it to. Arrive early and stay late to observe how the handlers work in and out of the ring, as well as how they conduct themselves around the show. Things such as dress and manner are important parts of showing dogs so the more exposure you have to that environment the better. ", " Join your local kennel club. To get to know more people interested in dog shows and become involved in your local dog community you should join your local kennel club. You will learn great tips from people with experience and knowledge as well learning when and where you can go to shows to develop your skills and watch other handlers.  You can search for your local club through the , or just use a search engine.  ", " Estimate basic start-up costs. Starting up as a dog show handler is not a minor investment, so you should take some time to draw up some figures that detail the kind of costs you will face at the outset. It's good to do this early so you can begin saving up some money and looking out for good deals on key items while you go about developing your skills and making contacts. The kind of equipment you will need includes: A good van or other vehicle suitable for transporting dogs. Dog crates, crate fans, crate pads and cooling mats. Grooming tables and professional standard grooming equipment such as scissors, dryers, combs, brushes and shampoos. As you develop your business you will need to provide kennels and exercise space.  "], "Training as a Show Handler": [" Show your own dog to start with. The easiest way to get experience in handling and showing dogs is to practice with your own dog. If you don't have one, you will need to buy a registered purebred puppy that has a demonstrably good lineage from a good breeder if you want to show it. Having your own dog to work with will help you practice whenever you can to improve your handling and learn about showing dogs. Start by enrolling your puppy in obedience classes with an experienced handler, and then progress to the presentation and grooming techniques needed for shows.  Show your puppy at your local kennel club shows and pay attention to feedback and judging.  ", " Consider starting as a handler's assistant. A great way to learn about the job while gaining valuable skills, experience and contacts, is to get a job as a handler's assistant. Successful handlers who work with a number of dogs will often hire an assistant to take care of preparation work, grooming, conditioning and training. Working as an assistant will give you a much clearer picture of the day-to-day working life of a handler.  If you develop a good relationship with the handler she could act as mentor and help you develop your own handling skills. You can ask the handler for feedback and advice on your handling work.  ", " Try a Junior Showmanship event. Another good way to get more practical experience with handling dogs is to participate in the American Kennel Club's Junior Showmanship classes and events at licensed dog shows. The classes are open to those between 9 and 18 years old and are divided into three age groups: junior, intermediate, and senior. The classes are also divided into novice and open classes. Once you have gained enough points, you can graduate into open classes. These classes give you a good introduction to handling and experience of competition and judging. You will also get to know other people your age interested dog handling and can share tips and experiences. You must enter a dog that is eligible to compete in obedience trials or dog shows. The dog must belong to you, your family, or a member of your household. Look up a local show near you and go to see how it all works before you join up.   ", " Apply for an apprentice program. You do not require any official certification or training to become a dog handler. You can gain a lot of experience working as an assistant or participating in junior classes, but you should seek out professional instruction to hone your handling whenever possible. If you are working with a registered handler you can apply to the American Kennel Club's apprentice program. This program gives you the chance to develop your skills in all aspects of dog handling and care. This can be an accelerated route to the prestigious Registered Handler Program.  The Professional Handlers Association also run a well-respected apprentice scheme.   "], "Developing Your Skills and Business": [" Grow your contacts. Once you have all the necessary skills to show dogs you need to work on developing your client base. Word of mouth and reputation are crucial in the dog show world, so begin to network at shows and events and raise your profile among owners and other handlers.  Create a and use to raise awareness of your business and attract new clients. Doing well in competition is arguably the best way to raise your profile and gain clients.  ", " Develop your physical infrastructure. If you want to grow your business and take on multiple dogs who you will have to care for out of competition, you will need to develop a good setup of kennels, grooming and exercise space for all of the dogs you are working with. This can be expensive, but is essential if you want to increase the number of clients you have. Boarding expenses will be charged to the client, so will need to understand the costs and make sure your prices are appropriate.   ", " Apply for official recognition. Once you have gained significant experience as a handler, anywhere between five and ten years, you can go one step further and apply for official recognition of your status as an elite handler. You can apply for this with the American Kennel Club's Registered Handlers Program and the Professional Handlers Association. Having recognition from these two bodies with give you added prestige as a handler, and may enable you to charge a higher rate.  The Registered Handlers Program requires seven years of experience, and you must sign a code of ethics.  The Professional Handlers Association requires ten years of involvement with show dogs, including at least five as a handler.   ", " Consider employing assistants. If you find that you are becoming a successful handler with a number of dogs and a hectic schedule of shows to attend, you might consider hiring an assistant to help with the grooming and preparation, or to assist with the administration and finances. If you started out as a handler's assistant it could be very satisfying to help the next generation of trainers to get started in the business and learn the ropes from you. "]}}, "How to Organise a Dog Show": {"description": "Organising a dog show is fun, even if it is just for a small group of people. You can do agility with dog shows as well! It is also a good way to raise money for a charity.", "content": {"Steps": [" Do you have insurance? Do you have a license? Good, now lets continue.  ", " Volunteers. To run a successful fun dog show you’ll need lots of reliable people to help you. Assign everyone a job and make sure everyone knows their role. ", " Begin by organizing the place you are going to do the show. Make sure that you are allowed to hold a public event here. Also decide what to do if it rains. Is it indoors? Will it get muddy? Is there somewhere to do agility if you are holding that event? Make sure that once you have your venue, book it with plenty of time to organize everything else. Village/school halls with access to a playing field are good choices. Marquees are another option but expensive. You will also most likely need good parking facilities for spectators and competitors. Also make sure you toilet facilities. If you have a second ring for Agility/ Obstacle course or Obedience, then a notice of that ring’s purpose should be displayed on a prominent notice board. The ring should be large enough for the contestants to stand along 2 sides and maybe partway down the third side. For a 6 class novelty type show, you should consider a ring of some 20 meters (65.6 ft) by 20 meters (65.6 ft). If the contestants are stood along 4 sides then the ring is too small for purpose - so make it bigger next year.  Spectators should be able to sit along at least 2 sides of the ring, if not 3.  ", " You need to decide how serious your show will be. More serious shows use qualified and experienced judges. Fun dog shows are just that and taken less seriously by all concerned. With either however you need to plan out a good show programme with the right number of classes etc. ", " Decide all of the classes you will have for the show. If you are stuck for ideas you can look up classes. Here are some ideas: Suggested Pedigree Classes Puppy - Any breed (6 - 12 months) Yearling - Any breed (12 - 24 months) Gun-dog - Any breed Hound and Terrier - Any breed Working or Pastoral - Any breed Toy and Utility - Any breed Any Variety - Open Suggested Novelty Classes Best Veteran - Any breed (7 years and over) Best Crossbreed Best Rescue Dog - Any dog that has come from an animal shelter. Most Handsome Dog Prettiest Bitch Most Appealing Eyes Waggiest Tail Best Condition Best Brace - 2 dogs alike Best Irish Brace - 2 dogs of different types Best 6 legs - Dog and Owner Best Junior Handler Dog The Judge Would Most Like To Take Home  ", " Dog agility classes are often included at dog shows but usually as an interesting novelty. Owners are invited to let their dogs have a try-out at various challenges such as walking along planks, over hurdles or in and out of sticks etc. These competitions are usually just a bit of fun and an added attraction to your fundraising event.You may however like to consider inviting your local dog agility club. These clubs are often keen to demonstrate the skills of their pets and regularly feature in all sorts of summer fundraising events. A run through of their routines can make a great attraction at your event. ", " It is traditional to give rosettes to the winners of every class, with a larger and more colourful rosette to the Best In Show Winners. Some shows give rosettes to the first four places, whilst some shows have rosettes down to 6th place. You do not have to award six places in every class. You could also do certificates. Remember do order these early and in plentiful supply. Cups are also a good option. ", " Paperwork. Every show will have its own style of Entry form. Ideally, the form should be A4 size with the entrant keeping the top half - which has venue, class list, class fee, sponsors, etc. The volunteer booking in the entries should write the classes entered on to the kept section, or on to the back of the ring number cards as they are issued. The bottom half should be submitted at the entry point, and include: Name, age and breed of dog Owners contact details Classes being entered Total entry fee paid Dog Club membership number (If a DC event) You may also want to have forms for the judge to fill to say who came where. This is especially important if you are holding a best of show class.  ", " You may want to advertise out space so local dog related companies can come and try show of their stuff. You can also hold little raffles, tombolas, etc. ", " Judges. Make sure have either professional judges, or volunteers willing to do it. Either way they should have experience with dogs. ", " Advertising. Make posters, put notices in newsagents’ windows or on council notice boards, use local newspapers and radio stations, and advertise on Facebook. Make noise and get the word out there. You will want to do this anywhere from a month before to a couple of weeks before, depending on how much publicity you want. ", " Set up. Depending on how early you are allowed at the venue, you may need to get a wiggle on. Lots of volunteers are useful. If you are running an agility course you will need to set up, plan and number a course. ", " Health and safety. Think about the venue and activities that you’ve chosen. Is there anything that could put a dog or owner at risk? Vets — you should have a vet on hand should a dog need medical attention. You could ask a local vet to be a judge.  ", " Don't panic on the day. Enjoy it! "]}}, "How to Become a Dog Show Judge": {"description": "Dog shows allow breeders and owners to display the dogs that best conform to the ideal type of their breed. Judges in the show examine each dog and select the dog that is the best example of their breed. Judges are individuals who have gone through a rigorous licensing process and have been active, successful, and long-time participants in the sport. The process to become a dog show judge is a long-term process, but with careful planning and commitment you can begin this career.", "content": {"Gaining Experience to Become a Dog Show Judge": [" Learn about the dog show circuit. If you are considering a career as a dog show judge, you will become intimately familiar with the dog show circuit. Most kennel clubs have strict requirements about the number of years an applicant has spent in the dog show circuit or as a breeder before they can become a judge. A breed type is the standard established for the ideal type of that breed. It can cover the colorings of the dog, coat type, height, weight, body structure, and ears. Most dog shows are conformation shows, also known as breed shows. In these shows, the judge is an expert in a specific dog breed and will examine several purebred dogs to see how well these participants conform to the established breed type. In smaller shows, there may be only one judge that evaluates all of the dog breeds. In larger shows, there may be multiple judges or judges that evaluate only specific breeds.   ", " Attend dog shows and sanctioned matches. Pay careful attention as you observe the judges, the dogs that are being shown, as well as the handlers and breeders that participate in the show. You will see that even with a very detailed breed standard, judges may have to make subjective judgment calls when there are several exemplary breed examples. You will also have the opportunity to see many different breeds and to become more knowledgeable about the different breed standards. This is a great way to become more familiar with the dog show circuit. You will also come into contact with other breeders and aspiring judges who can help you in your pursuit to become a dog show judge.  ", " Join a kennel club. You should register with the kennel club that you’d like to eventually become a judge with. Judges are generally affiliated with the club that runs the show and must be licensed through this organization. For example, a judge licensed through the American Kennel Club would judge at American Kennel Club shows. Most kennel clubs are national organizations, so research clubs that are in your country.  Each club will have very different requirements. It is essential that you research the organization that you choose carefully to ensure that you have met their requirements before applying to become a judge. If you want to work with a specific breed, research the organization to ensure that they show those breeds. Most large organizations, like the UK’s Kennel Club, will show almost all standard breeds.  ", " Participate in club events and activities. Your local and national clubs will put on different events throughout the year. These are usually showings of different dogs. By participating in these, you have the opportunity to meet other breeders, judges, and dog lovers. ", " Connect with breeders. In order to begin the dog breeding process, you will need to be in contact with breeders who are willing to breed with your dogs. Keep in close contact with breeders, as they can be helpful and also provide tips and support in your path to becoming a dog show judge. Participating in events and activities that the club puts on is a good way to meet and build relationships with other breeders.  ", " Map out a timeline. The road to becoming a dog show judge is a long one. You should expect to spend upwards of ten years before you reach your goal. You will need to undergo years of training, breeding dogs, working at shows, and applying for positions in order to be accepted. Base your timeline off of the organization that you want to work with. For example, the default application to be a judge with the American Kennel Club is a 12-5-4 program. This means you must spend 12 years exhibiting a specific breed of dog that you want to judge. You must have bred 5 litters and 4 champions.  If you want to judge with the UK Kennel Club, you will need to be nominated to be awarded a Challenge Certificate. Among other requirements, you must pass several assessments and exams that address your knowledge of a specific breed and to have been a steward for 12 days at shows.   ", " Become a steward. A steward assists judges during dog shows by ensuring that the show goes smoothly, completing paperwork, and that the dogs are well cared for. You can volunteer as a steward at any time during your membership with your kennel club, and it is a good way to gain experience.  The AKC requires that aspiring judges be a steward at six shows and to participate during six judging assignments in order to apply. Volunteer as a steward in any dog shows that are in your area to gain experience, even if they aren’t specifically for your chosen organization.  "], "Breeding and Exhibiting Dogs": [" Choose a breed and learn the breed standard. The breed standards cover the ideal appearance of a dog. You will need to have an expert level knowledge of the dog breed that you want to judge in order to become a judge. You will need to select the dog breed that you will breed and exhibit before your judge application process. The American Kennel Club Study Guides are very comprehensive collections that will be helpful to you as you begin to breed dogs and to become a judge.  Guides cover breed history, breed standard, give information about the breed's parent national parent club and regional clubs. They also list experienced breeders and exhibitors who may be willing to share their knowledge with new breed enthusiasts. Most judges are experts in a few different dog breeds, but you must be knowledgeable about the majority of dog breeds in order to judge at smaller shows.  ", " Select dogs to breed. Once you have determined the type of dog that you want to breed and to judge, you need to begin the breeding process. Most kennel clubs will require that you breed a certain amount of litters and a certain number of champion dogs in order to be considered as a judge. You will need to have a dam, which is a female that you can breed, and a sire, which is a male that will breed with the female. You want both dogs to be in the top 10% of their breed. This means that the dogs are great specimens of the breed and meet nearly, if not all, the breed characteristics that are laid out in the breed standard.  Breeding dogs is an expensive endeavor. You may need to pay another breeder to allow their male to breed with your female, you will need to purchase supplies to keep a female in your home, and you must be prepared to raise puppies for at least 8 weeks. Find an established breeder that is willing to be your mentor and find a veterinarian that you can consult throughout the process. Once the female becomes pregnant, you will need to take care of her during her pregnancy until the puppies come.  ", " Raise your first litter. When you have a litter of puppies, you will be able to determine whether any of these puppies are of show dog quality. There are puppy divisions of many dog shows where you can begin to exhibit your dogs.  Bring the puppies to a veterinarian so they can undergo genetic testing. You will need to make sure that the puppies are not at risk for genetic diseases and conditions, and to ensure that they are purebred.  ", " Register your litter. You must register your new puppies with your club organization in order to begin to show the dogs.  Having documentation that you have bred successful litters of puppies will be essential during your judging application. For organizations like the AKC, you will need to breed 5 litters of the same breed to qualify with the 12-5-4 process. You may need to produce many litters in order to have 4 championship dogs. Breeding dogs is a time intensive and costly process. You should expect to spend multiple years during this stage of the judge application process.  ", " Show your litter. Many organizations require that their judges have experience showing dogs that they have bred. Once you have your first litter and have registered them with the kennel club, you can begin to exhibit the dogs. There are puppy divisions of dog shows that you can exhibit puppies at, or you can wait until the dogs are several months old so they can participate in different show categories.  If you are unfamiliar with how to show your dog, you can attend a class taught by your kennel club or hire a professional handler to show your dog for you.   ", " Repeat the breeding process. Most organizations will require that you have bred several successful litters of purebred dogs in order to qualify to become a judge. Once you have begun the breeding process, you will need to repeat it until you have met organization requirements. "], "Applying To Be A Judge": [" Fill out and submit your initial application. This application should be completed and returned to your organization at the onset of your application process. It primarily signals your intent to become a dog show judge.  Be prepared to share documentation during your initial application, such as proof that you have bred specific numbers of litters. There are typically fees associated with your initial application, but these will range depending on your organization. For example, the AKC charges US$30 initially. The United Kennel Club, another United States organization, charges US$25.  This initial application will cover your basic background information and will ask questions about your breeding and dog show experience.  ", " Attend training. Once you have submitted your initial judging application and the organization approves it, you can begin the organization-specific training to become a dog show judge. Training may take place over weeks or months, be in person or online. It depends on your organization and the breed that you have selected to judge. For organizations like the AKC, new breed judges are required to attend an institute before requesting regular (full) status as a judge, but no less than 2 years before submitting the initial application. The Canine College is a great online source of information for aspiring dog judges and breed enthusiasts.   ", " Take any training exams. If your organization requires, you may need to take and pass exams about breed standards, organization rules, dog anatomy, and the judging selection process. For example, the United Kennel Club requires you to pass two written exams on breed standards and UKC rules. You will need to commit to learning and studying the history of the breed, the exact breed standard, the judging process, your organization's rules, dog anatomy, and to be familiar with any changes in the dog show world.  ", " Interview with judge evaluators. Some organizations require that you interview with evaluators in order to progress through the application process. These interviews may take place before or after you attend judge training. These are often in person interviews where an evaluator will judge your knowledge on your selected breed. They may ask you to judge a few dogs to examine your judging process and to evaluate how accurate you are with conforming to breed standards. Often, these evaluators act as liaisons between applicants and the organization.   ", " Complete your judge application. Once you have completed the necessary training, exams, and interviews that the organization requires, you can submit your final judge application. Gather documentation that proves that you have completed the required steps, like training and exams, to submit along with your application. The judge application will be similar to the first application that you submitted at the beginning of the process that signaled your intent to become a judge. It will be used by the judge selection committee to determine that you have met all of the organization’s requirements. If your application is not accepted, you may be able to request an appeal from the judging committee. You can also wait and gain more experience before applying again.   ", " Apply for provisional judging status. If your application has been approved, you will need to register with your organization as a new judge. This will establish you as a provisional judge that is able to begin judging at events. Many organizations will publish the names and biographies of new judges, so dog show coordinators are aware that there are new judges available.  ", " Apply for regular judging status. For some organizations, like the American Kennel Club, you may need to judge a certain number of shows as a provisional judge before you can receive your regular judging status. Once you have judged a certain number of events, the AKC requires you to judge 5 events, you can apply for full judging status.  This is the final step in the application process. Once you have been accepted as a regular judge, you are now able to begin your career as an official dog show judge with your kennel club.  "]}}, "How to Enter a Dog in an American Bully Kennel Club (ABKC) Show": {"description": "An American Bully Kennel Club (ABKC) show is an opportunity to show off your American Bully breed dog and earn recognition and awards for you and your dog. ABKC shows are held all over the country throughout the year and the requirements for entry are straightforward. Ensure your dog is of an acceptable breed before getting it registered, and look over its physical features for imperfections that might disqualify it. By registering your dog with ABKC before the event and talking to event organizers about event-specific requirements, you can ensure that your dog will make it to the show.", "content": {"Registering for the Event": [" Find an event. ABKC shows are held all over the country. You can find a list of events at http://theabkcdogs.org/events/ . The date, time, and location of each events is listed on the ABKC page.  If you have questions about a particular event, use the contact information provided on the ABKC event page to contact the organizers.   ", " Look at the specific rules for each event. Each show has its own organizers, and the ABKC enforces certain general rules of all events. Check the ABKC website for general requirements. Generally, all dogs at the show must have an assigned ABKC registration number. Additionally, all dogs in ABKC shows must have proof of current vaccinations, including rabies vaccination.  Contact the event organizers for more specific requirements for a particular show.  Contact information for specific events can be found online at .  ", " Send in your registration form. You will need to contact individual organizers for details on how to submit your registration. You can find contact information on the ABKC event page.  Most events cost $15 if you register in advance, and $20 if you register on the day of the show. You will need to provide proof of your dog’s ABKC registration.  "], "Ensuring Your Dog Qualifies": [" Check your dog’s breed. Your dog must be a bulldog or a breed accepted for competition by the ABKC.  For instance, you might enter an English Bulldog, a French Bulldog, an American Pit Bull Terrier, a Shorty Bull, or, of course, an American Bulldog.  If your dog’s breed has not been verified by a registration organization, you can check for certain characteristics that will determine if your dog potentially qualifies as an American Bully.  Go to the ABKC website at for a complete list.  ", " Ensure your dog has the right head. Each dog entered in an ABKC competition must meet certain qualifications regarding its head.  Every breed has its own unique specification standards.  For instance, an American Bulldog should have a head that is heavy, large, and broad, with chiseled features and distinct cheek muscles. The ears should be high and either natural or cropped.  The eyes can be any color other than blue, or pinkish red.  Some breeds that qualify to compete in ABKC competitions do not have their ideal head specifications listed online.  If your dog does not have its ideal head specifications listed, contact the ABKC to find out what sort of head they expect your dog to have.  ", " Ensure your dog’s neck meets the breed specifications. Each dog entered in an ABKC competition must meet certain qualifications regarding its neck.  Every breed has its own unique specification standards.  For instance, an American Bulldog’s neck should be muscular and slightly arched, with minimal loose skin. A thin or weak-looking neck will not meet the standards of the ABKC show.  Some breeds that qualify to compete in ABKC competitions do not have their ideal neck specifications listed online.  If your dog does not have its ideal neck specifications listed, contact the ABKC to find out what sort of neck they expect your dog to have.  ", " Ensure your dog has the right body. Each dog entered in an ABKC competition must meet certain qualifications regarding its body.  Every breed has its own unique specification standards.  For instance, an American Bulldog’s body should have broad, muscular shoulders.  The upper arms should be joined at an angle of 35 to 45 degrees.  The body should be heavily muscled, with massive bulk.  The ribs should be well-rounded, resulting in a barrel chest appearance.  Some breeds that qualify to compete in ABKC competitions do not have their ideal body specifications listed online.  If your dog does not have its ideal body specifications listed, contact the ABKC to find out what sort of body they expect your dog to have.  ", " Look for disqualifications. There are a few physical and behavioral characteristics that will automatically disqualify your dog from inclusion in the breed.  These characteristics vary from breed to breed.  Check the information on your particular breed for more information.  For instance, in an American Bulldog, aggressive behavior towards humans, albinism, Merle pattern, the absence of one or both testicles, deafness in one or both ears, and a screwed, bobbed, or docked tail are among disqualifying characteristics. If you cannot find disqualifying criteria about your dog’s breed online, contact the ABKC to find out what features would disqualify your dog.  "], "Registering Your Dog With ABKC": [" Download and fill out the form. Registration forms are available in English, Spanish, and French.  There is also an international form for owners who live outside the United States.  Download and fill out the appropriate form.  For instance, if you speak Spanish, download and complete, the Spanish dog registration form.  All forms require similar information.  Your name, address, email, and phone number are required. Your dog’s name, date of birth, color, gender, breed, and lineage are required.  You may include your dog’s microchip and DNA numbers, if you have them. Use your best handwriting, or fill the form out on your computer.  ", " Include two pictures. You must include a side view of your dog and a front view of your dog.  Use a paper clip to attach these pictures to your pedigree certificate.  ", " Include the required certificates. Along with your registration form, you must include a copy of the front and inside of your dog’s Pedigree Certificate.  The Pedigree Certificate includes information pertaining to your dog’s ancestry.  It must show at least three generations of your dog’s family history – in other words, all your dog’s ancestors going back to its great-grandparents.  If you don’t have a Pedigree Certificate, you’ll have to buy one from the United Kennel Club, the Bull Breeds Coalition Association, the American Dog Breeder Association, the American Kennel Club, the World Bulldog Alliance, the International Olde English Bulldog  Association, or the National Kennel Club. Simply visit the website of the affiliated kennel club of your choice, register with the organization, and fill out the form requesting a Pedigree Certificate. There is usually a cost of about $20 associated with obtaining the certificate.  Follow payment directions when submitting your certificate application.  ", " Make your payment. If you live in the U.S., you will have to pay a $20 registration fee.  If you live abroad, you will have to pay a $25 registration fee.  In either case, you can make personal checks, cashier’s checks, and money orders out to American Bully Kennel Club.  Mail payment to: American Bully Kennel Club Registration Dept., P.O. Box 2677, Spotsylvania VA, 22553. Alternately, you could send your registration fee via PayPal to the address theabkc@gmail.com.  "]}}, "How to Improve Your Dog's Show Ring Gait": {"description": "Improving your dog's show ring gait is best done by a qualified professional in a controlled setting.  However, if you wish to improve your dog's show ring gait, you can do so at home if you have plenty of time and patience.  Observe your dog's show ring gait and decide what needs improvement using feedback from a dog show judge or your own judgement.  Adopt a clicker and reward system that lets your dog know when they are gaiting properly.  Then, train your dog to gait in the way you wish, starting without a leash and then moving over to leash training when they improve.", "content": {"Adhering to General Rules": [" Use the collar and leash you'll use during the show. If you use one type of collar and leash during training and a totally different type of leash and collar during the show, your puppy might get confused.  To avoid this, use the same collar and leash during the show that you'll be using in the show ring.  If you need to make a change to your dog's collar or leash due to show rules or for any other reason, do so during training.   ", " Decide what needs improvement. A dog's show ring gait is comprised of several discrete elements.  Identify whether your dog's straight-line movement, left and right turns, amble, or trot need work.  Your dog's gait might also need to be adjusted based on its relation to the leash.  If your dog pulls the leash too tightly, it will not walk properly.  ", " Correct one aspect at a time. If your dog's show ring gait needs several corrections – for instance, perhaps your dog's speed and distance from you are wrong – only take on one correction at a time.  Adjusting your dog's show ring gait in even one way can be difficult.  Therefore, the best approach is to take only one thing at a time.  After your dog has corrected one aspect of its show ring gait, begin adding other elements that you want it to correct.  ", " Do not tease or bait your dog. Waving food around in front of your dog or getting your dog wound up will not help your training process.  You should be teaching your dog that the clicker is the reward, not the treat itself.  ", " Reward your dog. When your dog assumes a show-ring appropriate gait, reward it in two ways.  First, click the clicker or whatever clicker substitute you've adopted for training purposes.  Second, administer a treat.  The treat you use is up to you.  Your dog might, for instance, enjoy a cube of cheese or a slice of ham.  ", " Train your dog early. Younger dogs have an easier time correcting their show ring gait than older dogs.  When improving your dog's show ring gait, begin as early as possible.  "], "Choosing Your Methods and Techniques": [" Enroll your dog in classes. Once you know exactly how you want your dog's show ring gait improved, you will be able to take corrective action.  The best way to improve your dog's show ring gait is to sign it up for classes.  Contact your local kennel club about enrolling your dog in classes to improve show ring gait.  If they don't offer classes, ask a club representative if they know of a local trainer or club that does offer classes. If you continue to struggle trying to find classes for your dog, check online or use your yellow pages to find an instructor.  ", " Obtain a clicker. A clicker is a small device, available at most pet stores, to help your dog associate good behavior with a reward.  However, it is not necessary to use a clicker manufactured for the specific purpose of dog training.  You could instead use a whistle, a bell, or any other noisemaker.  The important thing is to keep the clicker or clicker substitute consistent throughout training, otherwise your dog could be confused.  ", " Find a partner. It is easier to engage in clicker training if you give your dog a treat while another person utilizes the clicker, or vice versa.  Ask a family member or friend to help you improve your dog's show ring gait.  Alternately, locate someone else who is also interested in improving their dog's show ring gait.  That way, you and the other person can take turns helping each other improve your dogs' show ring gaits.  With a partner, one of you can stand in a central position observing from a distance with a clicker, while the other one can walk along the dog holding its leash and administering treats when as needed. If you don't want to work with a partner, just hold the clicker in one hand and the treats in your other hand.  "], "Attempting a General Gait Correction": [" Teach your dog to follow along your left side. With your dog off-leash, hold a treat in your left hand.  Look behind your left shoulder as you walk.  When you see your dog following you, click and give it a treat.  Ensure as you give it a treat that its head remains up and facing forward.  ", " Leash the dog. Once your dog successfully learns to walk along your left side, and understands why it is being rewarded, put your dog on a leash.  The leash should be held in such a way that it does not drag on the ground between you and your dog.  Hold the clicker and leash in your left hand and the treats in your right.  Continue the training as before, rewarding only proper form with treats and clicks.  ", " Correct your dog's gait as you go. If your dog is trained incorrectly, it will only cause another problem that will require retraining later.  If you notice your dog not perfectly adhering to your gait-correction training, take immediate action to correct it.  For instance, if your dog is veering off course or running rather than walking, say “Oops!” or “Uh-oh!” in a friendly way.  Return with the dog to your starting point and try again.  Do not reward your dog for pulling or veering off course.  ", " Repeat as needed. Improving your dog's show ring gait is a process.  Your dog's show ring gait will not improve with just one or two training sessions.  For some dogs, improvement will take longer than it might for others.  But for all dogs, you will need to invest a significant amount of time in the training process.  Use random intervals between training sessions, otherwise your dog might come to associate performing an appropriate gait with a certain time (for instance, right when they wake up). For instance, if you wish to teach your dog to keep its head up to improve its show ring gait, perform a head-up exercise with your dog, then again 15 minutes later, then again five minutes after that.  ", " Keep your training sessions short. Do not push yourself or your dog too hard when training.  Working in sessions of five minutes or less several times per day should be sufficient to improve your dog's show ring gait.  "]}}, "How to Breed Show Dogs": {"description": "Show dog breeding is an endeavor for individuals who are committed to the betterment of a breed. Show dogs are essentially dogs that embody the breed standard and have a strong, genetic background. Get informed about conformation shows, breed standards, and dog breeding. Enter your dog into shows to establish it as a high-quality, American Kennel Club-registered purebred. When it is ready, breed your dog with a genetically-suitable stud. Take care of the female and puppies, and register your new purebred litter with the AKC.", "content": {"Highlighting Your Dog’s Pedigree": [" Buy a purebred puppy . You should purchase a purebred puppy from a reputable, AKC-registered breeder. Note that a good breeder will ask you a lot of questions, and make the effort to ensure that their puppy is going to a suitable home. Make sure to: visit the breeder ask detailed questions see the condition of the litter’s mother request proof of health for mother and puppies ask for references   ", " Make sure your dog contributes to the breed standard. An important part of show dog breeding is understanding breed standards, as established by the American Kennel Club. The true purpose of dog shows (also known as conformation shows) is to evaluate breeding stock. Dogs are judged based on established criteria for what is considered the best of the breed; to better understand the best attributes of your dog’s breed:  attend dog shows read books, articles, and other reputable source material about breed standards look up your dog’s specific breed on the American Kennel Club’s website: www.akc.org  ", " Learn the ins and outs of dog shows. Whether you learn by attending local dog shows, watching them on television, or reading about them, it is a good idea to get informed before you participate. Dog breeds are generally grouped into seven categories, based on the jobs they were initially bred for – “sporting,” “hounds,” “working,” “terrier,” “toy,” “non-sporting,” and “herding.” Show dogs are also grouped into different classes at shows – “puppy,” “twelve-to-eighteen months,” “novice,” “bred by exhibitor,” “American-bred,” and “open.” There are a series of different ribbons presented to participants that judges choose as the best of a class (e.g. a blue ribbon is awarded for first place in any regular class). Many AKC clubs offer conformation handling classes for owners wishing to show their dogs. The classes show owners how to present their purebred dog to judges at a conformation show. Local AKC clubs offering these courses will be listed on the American Kennel Club website.  ", " Enter your dog into local a local conformation show. If your dog meets breed standards, is older than 6 months, and is not spayed or neutered, you can enter it into a conformation show. If you do not feel ready for this step yet, consider entering your dog into a match show first; match shows are informal shows where dogs and owners can socialize and get accustomed to the procedures for official conformation shows. Alternatively, you can hire a professional handler to present your dog to judges at the conformation show, for a fee that should be established upfront before the show.  The American Kennel Club Registered Handlers Program promotes professional handlers who meet a specific criterion of responsibility and knowledge.   ", " Aim for points. Most dogs entered in conformation shows are competing for championship points, which are essentially credits earned towards championship status. Dog shows are essentially a process of elimination leading to one dog being named “Best in Show” at the end of it; other dogs are able to earn points along the way. Either way, you dog’s participation signals that it is an AKC-registered purebred, whose parents and ancestors are also purebred. "], "Facilitating the Breeding": [" Find a mentor. Show dog breeding is a very precise tradition, and the people who participate tend to be very committed to it. Find a mentor who can show you the ropes, share their experiences, and walk you through the different aspects of breeding show dogs. People entering into this new world often find mentors in the breeders they buy their puppy from; good breeders look after their puppies well after their sale, which means that a long-term relationship with the puppy’s new owner is often developed.  ", " Make sure the female is ready for breeding. The best time for your female to start breeding is between her second heat cycle and the age of 7; because of health risks, dogs older than 7 should not be bred. The female will make it clear whether or not she’s ready for breeding by how she reacts to the male – if she is not ready, she will avoid him, and if she is ready, she will move her tail to the side to communicate her consent. ", " Find a suitable stud. Show dog breeding requires a general understanding of genetics and a desire to better the breed. You can search for studs in the classifieds of dog breeding magazines, online, or by putting up flyers in your area. Look for a stud that is certified healthy, and that offers genetic attributes that will complement your female. Work out a stud contract with the stud’s owner, outlining the details of breeding times, fees, payment, expectations, and guarantees.  ", " Ensure the dogs' health. Both dogs should be tested for genetic disorders, parasites, and possible infections. The female should receive a full pre-breeding exam from a veterinarian about a month before breeding to ensure her health and readiness to breed. Both dogs should be up to date on their vaccinations.  ", " Breed the dogs. It is usually best to bring the female to the male for breeding, as females handle new environments better. Depending on your stud contract agreements, you can either bring the female for multiple visits, leave her in the custody of the stud owner for the duration of the breeding period, or stay with your dog throughout the process to observe. Though the process should come naturally to dogs, some assistance from the owners might be needed.  For instance, dogs usually remain “tied” after mating, staying together for anywhere from 2-30 minutes. This process is integral to conception, but if your dog is new to breeding, it might get nervous and try to pull away. In this instance, stepping in to reassure your dog can rescue the breeding attempt.  "], "Welcoming Your Puppies": [" Monitor your dog’s pregnancy. A veterinarian can confirm your dog’s pregnancy around day 28 of a typically 63-day gestation period. Your vet can advise you on breed-specific care for your pregnant dog. Start setting up a whelping box (i.e. a box for your dog to give birth in) a few weeks before the expected due date to ensure that your dog is comfortable with the spot. In general, make sure that your female remains comfortable and healthy during her gestation period.  ", " Be present for the birth. Approximately 24 hours before whelping begins, the female will begin to show symptoms – her temperature will drop and she will usually stop eating and drinking. When whelping begins, she will show signs of distress (e.g. whining, visible restlessness). While dogs are generally capable of giving birth without assistance, it is best if you are present to monitor the situation and call a veterinarian in case of emergencies.  ", " Take care of your female. After whelping occurs, monitor your female closely. Make sure she receives adequate Vitamin D, calcium, and phosphorous in order to avoid post-natal eclampsia. She will also need two or three times more food to provide sufficient nutrition for her puppies when nursing. Experts recommend giving the female a period of rest and regeneration instead of breeding her again at her next possible breeding cycle.  ", " Monitor the puppies’ health. You should check and weigh the litter every day to make sure they are healthy and developing properly. Keep the puppies warm (with a heating pad or heat lamp, if necessary) and make sure that they are nursing properly. Once the puppies are weaned, you will have to feed them and begin to socialize them.  "], "Looking After Future Show Dogs": [" Register the litter. A few days after whelping, you should register your litter with the American Kennel Club. This will allow you to provide new owners you buy your puppies with a registration application, and establish you as a responsible breeder . You can register your litter online at http://www.akc.org/register/?pre=breeder&activity=litter , or print out a form and mail it in.  ", " Screen potential owners. An integral part of breeding puppies is finding good owners for them by interviewing potential buyers and choosing the right person, or family, to give one of your puppies a good home. Look for people who are knowledgeable about your dogs’ breed, and who have the time and means to provide a dog with the best care possible. An ideal candidate would be someone who is passionate enough about the breed to participate in dog shows, allowing one of your puppies to reach its full, show dog potential. Screen potential owners with questions like: ”Why did you choose this specific breed of dog?” ”Who will be the dog’s primary caretaker? ”How much time can you devote to exercise, obedience training, and feeding a dog?”  ", " Encourage new owners to register with the AKC. Convincing your puppies’ buyers to register them with the AKC is a step towards ensuring that your litter grow into show dogs. While the AKC funds many initiatives devoted to canine health, safety, and rescue, it also sanctions more than 20,000 competitive dog events each year. Dog shows shows can be a fun, educational experience for pets and owners alike, but a dog must be registered with the AKC to participate. "]}}, "How to Show and Handle a Dog as a Junior": {"description": "Becoming a Junior Handler is a great way to get involved with your dog! Not only will you benefit from the time you spend with your dog, but you can make new friends and new memories from the experience. There are so many dog sports to chose from, why not get started now?!", "content": {"Steps": [" Before you start competing with your dog in junior handling, you need to practice. You could go to your local ring craft class, especially if they have a special time for junior handlers. If there is none in the area then you can practice at home. ", " The first thing you need to do is to stack your dog . If your dog is a small breed, (all toy breeds, small terrier, dachshunds, small spaniels e.g. cocker) then you will need to practice stacking your dog on a table, starting with a lower one so the dog gets used to it. If you have a larger dog (e.g. Doberman, Labradors, retrievers) then you need to stack the dog on the floor. How you stack the dog depends on what type it is. Generally speaking the front legs are level and straight down from the shoulders, the back hocks should be perpendicular to the floor. Look at a picture of your breed standing and try to make sure your dog stands like that. ", " You can also free stand your dog, when they are more trained. Many good show dogs get into a show stand themselves, but it's fine if you tweak their legs a bit! ", " Another thing you have to learn are the show patterns. These are the straight up-and-down (pretty self explanatory) the triangle, the T, the L and the figure eight. The first two are the most commonly asked especially at companion shows. A good book which contains the patterns and every thing you need to know is \"Junior Handling the White Way\" by Marina White. ", " The golden rule of junior handling is to never cross between the dog and the judge. Therefore, if the judge moves to where you are standing behind the judge then you must move around to the front. This is important when executing all patterns. You must be careful with turns. This becomes easier with practice. Go in the garden with your dog and place a flower pot somewhere to practice the turns and ask family and friends to move around you while you stand your dog ", " Talk softly to the dog all the time while you are in the ring. This shows you can communicate with it. However,  do not shout or be silly. Not only will you look stupid but you will disturb the other dogs in the ring. ", " You need to be smartly dressed for handling. Jeans, trainers, or T-shirts do not look professional. Wear colors which contrast with the color of the dog's coat. An example is wearing cream trousers to show a Doberman(black and tan). A jacket of the same color presents nice, simple, elongated, eye appeal. Girls should tie their hair back. "], "What to expect when you enter your first junior handling competition": [" Wear your ring number on a show clip, on your arm, or clipped on with a safety pin.   ", " You will enter the ring with the other competitors and stand in a line with the dog stacked in front of you. The dog's side faces forward and its head positioned next to your right hand. Now is when the dog should be stacked. The judge will maybe ask everyone to move their dog around in a circle. Make sure to always leave enough room between the dog in front and you-three feet is a good goal. Move your dog at the right pace-you will need to trot a large dog so wait for the dog in front to go round a bit before you start. ", " The steward will ask the first person to go to the front and stack their dog. If you are new to the sport do not go first but watch what the exhibitors in front of you do. When the dog in front of you starts moving, it is time for you to set your dog up for the judge. The judge will look over your dog and ask you to do a pattern. When you return to him stand your dog again, say \"Thank you\" to the judge, and go to the back of the line ", " When the last person is doing their pattern, you need to stack your dog.  ", " If you are lucky enough to be placed, go where the steward designates, and stand your dog. You will then be given a rosette. If you do not win, don't lose heart, but say thank you to the judge and congratulate the winner. Always remember there will be another show and winning one isn't really a big deal in the general scheme of things. ", " Soon you will gain confidence and will enter larger shows.  "]}}, "How to Prepare Your Old English Sheepdog for a Show": {"description": "The Old English Sheepdog is a wonderful, fun-loving pet. The AKC states \" This breed is a strong, compact, square, balanced dog. Taking him all around, he is profusely, but not excessively coated, thickset, muscular and able-bodied. These qualities, combined with his agility, fit him for the demanding tasks required of a shepherd's or drover's dog. Therefore, soundness is of the greatest importance. His bark is loud with a distinctive \"pot-casse\" ring in it.\" So, you want to raise and show this lovable pooch? Read on.", "content": {"Steps": [" Think about what you are getting into. Are you doing this on impulse? This is a very large commitment, and Old English Sheepdogs are not for first-time owners, let alone for first-time breeders. Hopefully, you've had lots of experience with other breeds and breeding dogs in the past, or this is going to be a fun, yet hard challenge for you. ", " Plan out your costs. Owning, breeding, showing, traveling, vet bills, etc cost a lot of money. Make a chart based on weekly, monthly, and yearly costs for owning one dog, and decide if you really can afford even more. Talk to breeders for information on costs, and travel to a dog show to see if you really want to make this commitment. ", " Decide and evaluate your reason for breeding. If you want to breed conformation show-line dogs, you should probably get your bitch/stud from a champion-line breeder, knowing the commitment it takes to grooming, showing, and traveling to shows. Not to mention a grooming workshop for your breed, or expenses for trips to the groomer before a show. If you want to breed for herding, you should purchase your bitch/stud from a working line breeding kennel, yet knowing the commitment it takes to training, traveling, grooming, etc. of having a working sheepdog. You would also need to travel to your nearest open sheepdog classes to keep your herding dog entertained. ", " Get serious. Nobody cares for you to be just a \"pet\" breeder. You can be a show breeder and have pet-quality puppies that aren't fit for the ring, but you should always try to have nice, sound, healthy puppies for working or show stock. These are working animals that need a job to stay entertained and healthy. "], "Knowing Where to Get Your Dog": [" Look for a reputable breeder. The best places to spot one are in Dog Fancy classifieds, Dog World classifieds, AKC Gazette, or www.akc.org where you can find the breeder classifieds. Also, a great place to spot your breeder is at your local kennel club's dog show. Internet listings are not the best, as many of the dogs come from puppy mills. Also, never buy your dog from a pet store, as they always come from puppy mills with multitudes of health problems. Find a breeder that specializes in the area you would like to specialize in, whether it is herding, agility, obedience, or conformation.  ", " Make sure the breeder scans her sires and dams for health problems found in the breed! This is the most important aspect of breeding- do not buy from anyone who does not perform health scans on their dogs! You should do this also when breeding your future dogs. "], "Prep yourself": [" Prepare yourself for a new puppy, and possibly more in the future.  ", " Take a grooming course for your breed. If you are going to breed the Old English Sheepdog, you are going to need your dogs to be well groomed and presentable. You will usually be able to find courses from your local kennel club, or from the breeder you are choosing to get your dog from. ", " Puppy-proof the house. Make sure your house is safe for your puppy. Make sure electric cords are out of the \"chewing zone\", all plastic bits and paper are out of \"choking zone\", and that you have baby gates put up in places that are off limits to pooches. ", " Buy your supplies. There are many pages on wikiHow that will tell you what supplies that you need for your new puppy. Buy all your necessities for your new puppy that you will be bringing home. ", " Set up a vet appointment in advance. Set up a vet appointment before you get your puppy so that you do not have to wait over a month for Fido to get its last set of puppy booster shots. The date should be the day after you get your poochie. Your breeder (if local) will probably give you a preferred vet, but do your research and find the best veterinarian in your area. "], "Getting Your Dog": [" Visit the breeder's litter. After you've found your breeder, schedule a time where you can see their newest or upcoming litter. ", " Ask the breeder's advice. Ask the breeder which puppy would be likely to do the best in herding, breeding, showing, etc. Breeders will always try to help you find the best puppy, as they are committed to making their breed the best as possible. ", " Choose your puppy. Make sure your puppy is healthy, strong, playful, and a little curious. Never get a sick puppy. Signs of a sick puppy are: Discharge coming out of the nose, or eyes. Stinky/Waxy/Red ears Signs of diarrhea Weak limbs  ", " Bring your puppy home. Bring your puppy home. You should preferably pick the puppy up at the breeder's, even if it is a long drive. This will save the puppy the stress of shipping on a plane, which causes trauma, and sometimes even death. "], "Socializing Your Puppy": [" Enroll your puppy in a basic obedience course. Make sure it is a \"puppy only\" class, and that the instructor uses POSITIVE REINFORCEMENT only. This class should meet weekly. An easy obedience course like this will help your puppy learn how to react in a new environment, and how to react with other dogs and people. Eventually, you can enroll your puppy in higher obedience courses so that you can maybe even compete, although this is not necessary. ", " Schedule puppy play-dates! Call your friends up and schedule a puppy play date with their dog and your puppy. Make sure that their dog is current on all vaccinations. This will help your puppy learn to play and interact with other dogs in a non-threatening environment. ", " Bring your puppy with you to places. First, you need to make sure that it has all its shots, or it could pick up a disease. Bring your puppy with you to pick your kids up from school, when you go to work (if it is okay with your boss), and maybe even to a couple of dog shows. This will help your puppy feel easier in new environments, and to enjoy car rides. ", " Introduce your puppy to livestock (if it will be herding). You need to introduce your puppy to livestock at a young age so that it will not panic when you start training. ", " Introduce your puppy to cats and other small critters- you don't want any eaten ones showing up on your doorstep! This is optional. ", " Start grooming early. I don't know any groomer/breeder/handler/trainer who wouldn't stress this! Introduce your puppy to all grooming tools at a young age so that it will enjoy it in the years to come. Groom it gently each day for 10 minute intervals. "], "Starting Your Training Early": [" Enroll your puppy in a ringcraft class. Your local kennel club should have a weekly ringcraft class. Enroll your puppy asap. ", " Bring your puppy to herding class although his instincts may not have kicked in yet, bring your puppy to herding class so it can at least get used to the livestock.  ", " As mentioned above, you NEED to enroll your puppy in a basic obedience course!  ", " If you choose to do agility with your sheepdog, enroll it in a PUPPY class so that they will not have stress on their joints.  ", " Enroll your puppy in any class that you would like that is not mentioned, whether it be animal acting, schutzhund (although sheepdogs don't excel in it particularly), freestyle disc, or fly ball.  ", " Remember- whichever sport you choose to do, start early!  "]}}}