{"How to Fell a Tree": {"description": "If you want to cut down a tree, it's important that you use the right techniques and follow safety precautions because it's potentially dangerous. To fell a tree, you should scout out the tree and the area around the tree to make sure that it has a safe path to fall. Then, you'll need to create a notch in the side of the tree with a chainsaw or hatchet so that you can control how it falls. If you follow the right steps, you can safely cut down a tree.", "content": {"Determining the Fall Path": [" Check with your local government for required permits. Certain states and municipalities require that you get a permit before felling a tree. Search online for local or state ordinances and make sure to get the proper permits before you cut down the tree.   ", " Wear safety goggles, helmet, and kevlar chaps. Safety goggles and a helmet or hard hat will protect your head and eyes from falling debris, which is one of the main injuries that occur from cutting down trees. Kevlar chaps will protect your legs from chainsaw grazes.  You can purchase all of this safety gear online or at a hardware store.  ", " Survey the area around the tree for structures. Take a look at the area around the tree to make sure there aren’t structures or other trees in the area where you want it to fall. Things like power lines, fences, and roads should all be considered before you fell a tree. You’ll want there to be an area that’s cleared out where the tree is free to fall.  If there are a lot of structures around the tree, consider hiring professionals rather than doing it yourself. Cutting down a tree so that it falls into another tree could start a potentially dangerous domino effect.  ", " Examine the tree for stability and lean. Make sure that your tree is healthy and free of disease or the cutting down process could be unpredictable. Similarly, you’ll want to make sure that the tree isn’t leaning significantly in a certain direction because then you won’t be able to control the direction it falls in.  ", " Determine the fall path of the tree. The fall path should be free of structures, roads, and other trees. Make sure that there's enough space for the tree to fall on its side without colliding with anything else. Estimate the height of the tree, then use a tape measure to measure the distance from the base of the tree to an area that's free of objects. This will be your fall path.  To control the fall path, you'll cut a notch in the side of the tree that you want it to fall on.  ", " Pick up sticks and debris near the tree. Sticks, logs, and stones could trip you as you try to get away from the falling tree. Remove anything from around the tree that could cause you to trip or fall.  ", " Plan an escape route for after the tree falls. Once you get to know the area around you, you can establish a route to walk in as the tree is falling. You should never stand or walk in front or behind a falling tree. Make sure there is a clear path to walk in and step at least 15 feet (4.6 m) to the side of the tree as it falls.  "], "Using a Chainsaw": [" Cut on a notch at a 70-degree angle. Decide the direction that you want the tree to fall because this is the side of the tree that you’ll cut the notch. Turn on the chainsaw and carefully cut down into the tree at a 70-degree angle. The top of the notch should be the shallowest part of the cut, while the bottom of the notch will be the deepest area of the cut. The chainsaw should not go more than ⅓ through the tree. The bottom of the notch cut should be 1–2 feet (0.30–0.61 m) off the ground.  Hold onto the handle tightly with both hands so you have full control over the chainsaw.  ", " Make a horizontal cut ⅓ through the tree. Use the chainsaw and make a clean, horizontal cut at the base of the notch that you created. This cut will make the bottom of the notch straight. Do not go further than ⅓ through the tree.  ", " Make a bore cut through the other side of the tree. A bore cut is when you insert the tip of the saw blade into the tree instead of cutting the tree from its side. Line up the chainsaw blade 1–2 inches (2.5–5.1 cm) away from the edge of the notch cut, and push it all the way through the tree. Then, continue sawing into the opposite direction of the notch until you make a clean horizontal cut through the other end of the tree.  This will weaken the tree but won’t cause it to fall over.  ", " Hammer wedges into the bore cut. Insert a wood cutting wedge into the bore cut that you created and hammer it 1–2 inches (2.5–5.1 cm) into the bore cut. Go to the opposite side of the tree and hammer another wedge into the opposite side of the tree.  ", " Cut through the remaining portion of the bore cut. Position the chainsaw on the opposite end of the notch and cut through the remaining wood connecting the tree together. If you’ve done everything correctly, the tree should start to slowly fall in the direction of the notch.  ", " Stand clear of the tree. You’ll hear the tree crack and see it start to fall over towards the notch. As soon as you see this, turn off your chainsaw and walk down the predetermined path that you created earlier. Stand at least 15 feet (4.6 m) away from the tree.  "], "Felling a Tree with a Handsaw": [" Make a horizontal cut on the side you want the tree to fall on. Put the teeth of the handsaw 1–2 feet (0.30–0.61 m) above the tree’s roots and move it back and forth to create a horizontal cut. Continue cutting through the tree until you’ve made it ⅓ of the way through.  This may be easier to do with a 2-handled saw and a helper. Hold the saw with 2 hands.  ", " Hatchet a 70-degree front cut above the horizontal cut. Once the horizontal cut has been made, you can start hatchetting above the cut to create the notch. Use both hands and swing a hatchet above your head and down into the side of the tree at an angle. Continue cutting at the tree until you’ve made a defined notch, but don’t go past ⅓ of the tree’s width.  ", " Saw through the tree on the opposite side of the notch. Go to the other side of the tree and repeat the pattern, but this time saw all the way through the tree to the notch. As you get closer to the notch, get ready to quickly walk away because the tree will fall.  ", " Walk out of the way of the tree as it falls. Quickly walk down the path that you cleared out before. If you did everything correctly, the tree will fall in the direction of the notch.  "]}}}