{"How to Build a Simple Cigar Box Guitar": {"description": "Cigar box guitars are nothing new but there has been a resurgence in the art of building and playing them. From the mid 1800's until early 1900s, cigar box and home built guitars have been made by budding musicians who generally came from poor rural areas. The blues is typically associated with these fascinating instruments. They have shown up in many areas of the US, mainly in the deep south to the Carolinas. Some have been seen as far north as Virginia and Pennsylvania as those who could not afford a proper guitar would make their own.If you want to know more about the history of cigar box guitars, read \"One Man's Trash: A History of the Cigar Box Guitar\" by William J Jehle (self published).  Here's how you can make one.", "content": {"Steps": [" Determine if you are going to make a left or right handed guitar.  A right handed guitar has the neck oriented to the left. The tuning pegs will be on the left and the tail of the guitar will be on the right. A left handed guitar will be the opposite. Measure and mark accordingly! Take the box and remove the lid by cutting it along the paper seam in the back. This will help you cut the box and position the neck without having the lid in the way. Looking at the box front on, find the center of the left and right sides and mark it on the painters tape. mark 3/4\" from the center. This is where you will cut the box down for the neck. Mark on the outside of the left and right side 1\" down. Cut these areas out of both ends of the box. The holes on each end should be 1 1/2\" x 1\".   ", " Determine the scale of the instrument. The scale is the distance between the nut (tuning peg or head) end of the strings and the bridge. There are no rules as to length but 24\" is a good start so we will use that.  Put neck stock in the box with about 1 1/2\" sticking out the side and measure 3/4 the way into the box from where the tail end meets the box. This is where the bridge will be. Mark on the neck stock in pencil where the neck meets the outside of the box on each end. Do not worry that your neck seems deeper as the hole it sits in. It should be about 1/4\" deeper. Adjust as needed.  ", " Mark the neck. Remove the neck stock and measure from the bridge mark out 24\" along the neck. This point is where the nut will be. Remember the nut is where the strings end at the head end. ", " Trimming the head down. At the head end of the neck, you are going to make a series of cuts that will thin out the head so that you can apply the tuning pegs. You will need thin the head down to 5/8\" from its 3/4\" thickness. From the point where you have the mark for nuts, measure about 5 1/2\" out on the neck and cut there. Measure 5/8\" from the bottom of the neck in the head area and mark this the length of the head area on both sides.  You will need to remove the 1/8\" to 3/16\" from the top of the neck. Hold or clamp the neck in a vertical position and saw down the neck along the mark in the head area. Saw until you reach about 1/2\" from where the nut will be. Cut this area out from the top. Don't worry if you didn't get it straight or if the cut was even. Using hand tools is difficult and you can always make a new neck later.  ", " Tuning pegs. You will need to make a series of holes in the head area for the tuning pegs. Take two pegs that are for one side and one for the opposite side and arrange them on the neck so that they are not too close together (about 1/4\" apart). Something like left-right-left or right-left-right. Mark where the holes should be and drill 3/8\" holes in the head. Make sure the shaft of the tuning pegs are 3/8\". If not, use the appropriate drill bit.  ", " Mark the bridge position. Lay the neck in the box where you marked the outsides on the neck. Measure from the box edge to where the bridge mark is. Put the lid on and lay a piece of painters tape where the bridge should be using the same distance you just measured. Mark this point. This is where the eyebolt/bridge will be. ", " Make the tail end holes. Remove the neck and on the tail end in the are that sticks out, drill three 1/8\" holes roughly 3/8\" apart. They can be closer or farther, but make sure the center one is centered to the neck. You can drill in any spot or shape you want (see example picture). ", " Now we will start to assemble the parts and glue or screw them down. Place the neck back in the box and replace the lid. You can glue the lid shut if you want. Use rubber bands or painters tape to hold the lid shut. You can screw the lid onto the neck if you want or you can glue it as well.  ", " The fingerboard. Place the 1/4\"x2\" poplar strip on top of the neck so that it sits flush with the lid and mark it where the head was cut. Make sure it covers where the nut was marked. The nut will sit on top of the fingerboard. Once cut, glue it onto the neck by spreading the glue thinly on both the neck and the fingerboard using an old credit card or cardboard. Place them together, wipe off the excess glue and clamp using rubber bands. Allow to dry.  ", " Assemble the CBG. Once all the glue is dry, remove the tape from the lid and the rubber bands from the neck. Attach the guitar tuners using the screws provided. Glue the nut in place using a small amount of glue as well as the bridge. Use painters tape to hold them until dry.  ", " Sound holes. Once all the parts are dry, remove the tape and cut two holes in the lid for the sound holes (see picture). The holes can be about 1\" to 1 1/2\". Try to center them as best as possible. Try using painters tape to mark where you want the center of the holes to be. ", " Finished.  "]}}, "How to Learn to Play an Instrument": {"description": "Whether you want to join your school's band, have dreams of being a professional musician, or just want a new hobby, learning to play an instrument is a rewarding and stimulating activity. Choose an instrument that youwantto play and learn music you enjoy. Your desire to improve your skills will help you overcome any challenges you face.", "content": {"Choosing an Instrument": [" Get to know the different families of musical instruments. Musical instruments are categorized in families. Often, learning how to play one instrument in a family makes it easier to learn other instruments in the same family.  The family includes the , viola, and , as well as the (both acoustic and electric) and the ukulele. The is relatively easy to learn and can serve as a gateway to learning other stringed instruments. Some orchestras and groups also include a harp. Though it isn’t part of the “violin family” (instruments with that type of shape), it still adds a lot to the orchestra. The family includes the trumpet, , and tuba. The family includes the flute, , clarinet, and bassoon. The family includes the , , and harpsichord. The family includes all drums, cymbals, and maracas. are considered relatively easy percussion instruments to learn. The xylophone or is also a relatively easy percussion instrument.   ", " Decide which genre of music you'd like to play. Many different instruments are associated with a particular genre of music. If you know what type of music you'd like to play, you can better narrow down what instruments you're interested in learning.  For example, the guitar is a prominent instrument in rock and pop music. You can also play many rock and pop songs on the ukulele. If you enjoy country or bluegrass music, on the other hand, you might want to try the banjo or the violin. A violin and a country \"fiddle\" are the same instruments, although the style of play is very different. A piano or keyboard is a versatile instrument associated with many different genres, including rock, jazz, and classical. If you have more varied interests and want to learn several different styles of music, piano would be a good instrument choice.  ", " Connect to your ethnic culture with a traditional instrument. Traditional ethnic music is often played on distinct instruments that aren't used in any other setting. If you're interested in exploring your ethnic roots or learning more about your cultural traditions, you might try a traditional instrument.  For example, if you are Indian, you might want to learn the sitar. On the other hand, if you have Scottish ancestors, you might want to give bagpipes a try. If you have a Polish background, you might want to learn how to play the so you can learn some traditional polka tunes.  ", " Evaluate the relative popularity of the instrument. Choosing a more popular instrument may mean you face stiffer competition if you want to try out for a band or orchestra. At the same time, sometimes learning a less popular instrument in the same family will make it easier to learn that other instrument later on.  For example, the violin is a popular instrument and young violinists always face stiff competition when trying out for school orchestras. However, many of these same school orchestras don't have enough students who play the viola. You might also think about accompanying instruments. For example, if you want to learn how to play the bagpipes and don't live near an active Scottish community, you might have a hard time finding other people to play with.  ", " Visit a music store to try instruments you're curious about. Before you make a final decision on which instrument you want to play, take some time to actually pick one up and hold it. Even though you don't know how to play it, you can still get an idea of whether it's right for you.  Employees at music specialty stores typically have a musical background and play multiple instruments. They can talk to you about learning the instrument and give you a better idea of what to expect if you want to take it up, or you could go to a store with a friend who already plays an instrument, to easily know what to look for in an instrument.  ", " Watch musicians playing the instrument live. Try a small show or an open mic night where you can watch the performance up close and see people play who are at different levels of mastery. Watching skilled musicians perform can give you a better idea of what you can do with the instrument or you could watch youtube videos of established musicians who play in shows or events.  In a smaller setting, you may also be able to talk to the musicians. Ask them what their favorite (and least favorite) things are about the instrument, why they picked that particular instrument, and if there are any other instruments they play.  ", " Research maintenance and ownership costs for the instrument. The initial purchase price of an instrument can be a relatively small investment in comparison to how much it costs to keep and maintain it. Take these costs into account before you dedicate yourself to a particular instrument. An employee at a music store or a skilled musician can help you understand the true cost of owning that particular instrument.  Costs aren't solely financial. Factor in whether you have the space to store the instrument properly, how you can transport the instrument if you need to, and whether your practicing will disturb others. For example, if you live in a small apartment surrounded by neighbors, you likely wouldn't want to take up a loud instrument, such as the trumpet. In that situation, an electronic keyboard or electric guitar would be a better option because you could play with headphones.  ", " Find an instrument that is the right size for you. Many instruments come in different sizes to accommodate people of all ages and statures. When choosing the right instrument, consider your finger size, hand span, and the relative strength in your arms (especially if you'll have to hold the instrument while you play it).  Wind and brass instruments typically aren't suitable for younger players. Until your adult front teeth come in (upper and lower), you won't have the strength to hold the instrument in your mouth. If you're a younger musician, considering renting or borrowing an instrument rather than buying so you can trade it in for a larger size as you grow.  ", " Purchase your instrument and any necessary accessories. There are many beginner's kits available for different instruments that come with any necessary accessories you might need. Make sure you have everything you'll need to play and maintain the instrument, even if you won't necessarily use all the accessories right away.  For example, if you've decided to learn to play the ukulele, you'll need a case for your ukulele and maybe some extra strings, but that's about it. On the other hand, if you've decided to pick up the guitar, you'll need a case, guitar picks of different weights and thicknesses, extra strings, a string winder, a tuner, and a capo. While it doesn't necessarily have to be top-of-the-line, buy an instrument of good quality. A poor quality instrument may easily fall out of tune, have a flat tone, or be more difficult to play.  "], "Mastering the Fundamentals": [" Sit or stand with proper posture. If you're sitting to play an instrument, sit on the edge of a chair or bench with your feet flat on the floor. Keep your back straight and your shoulders relaxed so that your shoulder blades are tucked along either side of your spine. When standing, retain the same upper body posture as when you're sitting.  Slouching or hunching over when you're playing a musical instrument can lead to back pain and even injury. Poor posture also makes it more difficult to play your instrument, particularly when you start learning more advanced techniques. Check online for specifics on how to sit or stand while playing your particular instrument. You can also ask a local music instructor to give you tips on proper form.  ", " Hold your instrument correctly. If you're playing an instrument that you hold in your hands or strap to your body, learn the correct way to hold it from the beginning so you don't pick up any bad habits. Check online or talk to a local music instructor to learn how to hold your particular instrument like trumpet, trombone , tuba, flute, violin etc.  Holding an instrument incorrectly can affect the instrument's tone, make it more difficult to play, and eventually lead to repetitive motion injuries. When you're just starting out, holding your instrument correctly may feel weird. With time it will come to feel more natural. Keep your muscles relaxed as you hold your instrument. Any tension will make it more difficult to play your instrument, as well as cause physical strain.  ", " Make your instrument produce a sound correctly. Before you learn how to play music , you need to learn how to make the instrument produce sound. With some instruments, such as a piano or keyboard, this is relatively easy – you simply press a key. Others, such as woodwinds and brass instruments, may take some time to figure out how to get the sound right. However, remember to keep the flow of the sound, in that you switch intervals in between playing one note correctly and playing two or more notes together correctly. This will boost learning and confidence.  Before you get into making music, become familiar with your instrument and the different types of sounds it can make. For example, you can strum or pluck guitar strings to make a sound, but you can also rap your hand or fingers on the guitar's body to make a percussive sound. Different areas of the guitar's body will produce different tones, so don't be too fixed in playing one part of the guitar. Switch it up from time to time. Have fun with your instrument at this stage and don't get discouraged if the sounds you're producing aren't particularly pleasing to your ears. You'll get better with practice.  ", " Pick up your first notes, chords, or beats. Some instruments, such as the piano and the guitar, can play both individual notes and chords – depending on the style of music you're playing. However, most instruments, including the saxophone or the trombone, can only play one note at a time. Look for a simple melody to start playing your first notes.  The simple songs you play don't have to be something as boring as \"Mary Had a Little Lamb\" or \"Twinkle Twinkle Little Star.\" Some simple melodies include themes from video games and TV shows, also don't be afraid or reluctant to make up your own songs. If you find two or more notes sounding good together, keep playing until you have a song or at least an interesting sound.  If you're learning guitar or ukulele, do an internet search for \"3 chord songs\" or \"4 chord songs\" to find dozens of songs that you can start playing right away, even if you only know a few chords.  For percussion instruments, do an internet search for classic beats or fills to play on your particular instrument. You can also start by putting on a song you like and drumming out the beat as you listen. Don't worry about trying to mimic a professional drummer – start with a simple, stripped down beat and build from there.  ", " Hire a teacher to help guide your learning. A teacher can prevent you from developing bad habits and keep you accountable for your practicing and your progress. A good teacher will also help  motivate you when you're having difficulty.  If you're in school, you may be able to take a class offered by your school. If you're not in school (or if your school doesn't offer instruction in your instrument), find out if there are schools near you with group classes. Group classes are typically less expensive than individual private lessons. If there is a school of music near you, check to see if any students also offer lessons. Many music students offer private lessons to beginners to make a little extra money while they're in school, and they'll typically have lower rates than professional teachers. You can also search for music teachers near you online, or ask people you know who play the same instrument for recommendations. Some music teachers also post advertisements at music stores.  ", " Use online resources if you can't find a teacher. If there aren't teachers of your instrument near you or you can't fit the expense of a teacher into your budget, you can still learn to play an instrument. There are numerous free resources online, as well as apps you can download on your smartphone or tablet.  For example, if you're learning piano, you might try Zebra Keys or Piano Nanny. For budding guitarists, Justin Guitar provides video tutorials, articles, and other resources. Some apps require a subscription or only allow minimal access for free. However, you can still use them as a starting point even if you can't afford to add the premium content.  ", " Start practicing scales. Scales are the building blocks of music. Whether on a guitar , piano, or other instrument, when you practice scales, you learn how to play notes on your instrument as well as how those notes relate to one another. Although it may seem boring, if you don't master scales you won't have the proper foundation to be a strong musician.  You can practice other skills and techniques while playing scales to make the exercise a bit more interesting. For example, if you're learning to play the violin or any other instrument that is played with a bow, you could try to play the entire scale with one bow stroke.  ", " Keep your instrument in tune. If your instrument is out of tune, nothing you play will sound right. For the beginner, there are websites you can visit or free apps you can download to your smartphone that will help you tune your instrument. Make a habit of tuning your instrument every time you play it.  Some instruments, such as electronic keyboards, will never go out of tune. Others, especially stringed instruments, such as and , need to be tuned every time you play – sometimes more than once in a single practice session or performance. Even need to be tuned periodically to ensure they maintain the proper tone. If you have a , you likely won't be able to tune it yourself. Hire a piano tuner to come out at least once a year – maybe more frequently if you play every day, or if you have an older piano.  "], "Making the Most of Practice Sessions": [" Set a goal for playing your instrument. A goal gives you something concrete to work toward and can make you more motivated. Find a realistic goal that you can achieve with practice and training within a few months.  Make your goal as specific and attainable as possible. For example, perhaps your goal is to join your high school's band. If you start playing your instrument in the spring and practice each day, you may be ready to audition for the band in the fall. Having someone else involved in your goal helps keep you accountable. For example, if your goal is to learn how to play your favorite song, offer to play it for a friend after you've learned it.  ", " Designate a specific practice area. Ideally, choose a quiet, private area with few distractions where you can practice. Set up everything you need for practice so all you have to do is enter the space to start practicing your instrument.  This may be more difficult if your instrument is in a communal place. For example, if you're learning piano and the piano is in the living room, you don't have much choice for your practice area. In this situation, set a specific time when you will practice and ask others to stay out of the room as much as possible. Music schools have practice rooms available for students and may open these rooms up to the general public. If there's a music school near you, call and find out if you can access their practice rooms.  ", " Schedule 30-minute practice sessions 3 to 5 days a week. Try to practice at the same time each day so practicing your instrument becomes habitual. Ideally, you should practice every day, but you may need to work up to that.  With daily practice you'll retain more information and won't feel like you're starting over again with each practice session. Learning to play an instrument requires discipline. Be prepared to take out your instrument on days that you don't particularly feel like playing.  ", " Start each practice session with a brief warm-up. Playing a musical instrument can be physically demanding as well as mentally challenging. Do a few stretches or brief exercises to warm up the joints and muscles you'll use while playing.  A good warm-up can also reduce your risk of repetitive motion injuries, which are common among experienced musicians who've been playing for many years. There are many videos available online that show exercise and stretching techniques, particularly to limber up your fingers and hands.  ", " Focus on a single song each week that you want to learn. Plan your practice sessions at the beginning of each week so you can get the most out of your time. When you're just starting out, it may take you a whole week to learn a single song. When you get better, you may find that you can learn a song in a single practice session.  Avoid repeating the same mistakes – this reinforces bad muscle memory and will make it harder for you to play the song correctly. If you find yourself missing the same notes or beats, play the brief sequence slowly with the correct notes. Gradually increase your speed until you can play it correctly at the right tempo. Don't be afraid to practice a song out of order or focus on the end before the beginning. If a particular part of the song is challenging for you, you may want to work on that first before you tackle the easier parts.  ", " Include time for honing fundamental playing skills. After practicing the piece you're working on, spend the next 10 minutes of your practice playing scales or learning new techniques. Even when you start to get comfortable playing music you enjoy, you won't get any better if you neglect the fundamentals.  For example, if you're learning violin, you may want to try some drills to improve your bowing technique. If you've decided to learn how to read music, you might want to spend this block of time sight-reading music or working out of a music theory workbook.  ", " End each practice session with something fun. Spend the last 10 minutes of your practice session doing something you enjoy doing. This will help remind you why you wanted to learn to play the instrument in the first place. Taking some time to have fun can be especially helpful if you've had a challenging or frustrating practice session.  Your fun time doesn't even necessarily need to be spent playing your instrument. For example, you may want to watch a video of your favorite musician playing the instrument.  ", " Clean and store your instrument correctly after each practice session. Wipe down your instrument after playing and return it to its case. Keep your instrument out of direct sunlight or high levels of humidity.  Dry the inside of brass or woodwinds instruments carefully. If they are left damp, they could become unplayable. Don't place books or other objects on top of the case, even if it's a hard case. The weight could damage your instrument.  "], "Expanding Your Musical Knowledge": [" Teach yourself how to read music notation. It isn't strictly necessary to know how to read music to play an instrument. There are many famous musicians who never learned how to read music and play by ear . However, if you know how to read music you'll have a much easier time learning new songs.  Music notation is written on staff paper with 5 lines and 4 spaces in between. Each note sits on the line or space that corresponds with the tone of that note. There are 2 sets of lines representing the treble clef and the bass clef – the higher notes and the lower notes. Use mnemonic devices to remember the names of the notes and the order they appear on the staff. For the treble clef, the spaces spell the word FACE from bottom to top. The lines are EGBDF from bottom to top. Think of the sentence \"Every Good Boy Does Fine\" (or you can make up your own sentence that you might remember better). For the bass clef, the spaces are ACEG from bottom to top (\"All Cows Eat Grass\"). The lines are GBDFA (\"Good Boys Deserve Fudge Always\").  ", " Join a band or start your own. Once you have the basics down and can play a few songs, sharpen your skills by playing with others. If you're in school, you may be able to join a marching band, pep band, or school orchestra. Even if you're not in school, there may be community bands that you could participate in.  You can also put up fliers at music stores or music schools to find people to play with. It doesn't have to be a formal thing – just put the word out that you would enjoy the opportunity to play with others and learn new skills.  ", " Play your instrument in public for encouragement and feedback. If a bar or café near you has an open mic night, you can sign up to perform there. If you have stage fright or the thought of performing in front of others causes anxiety, film yourself playing alone at home. You can share the video with friends and family.  Be cautious about posting your videos on the internet for anyone to see and comment on, especially if you're a beginner. Many of the comments you'll get will be far from encouraging. Instead, share with people you know and love.  ", " Study the techniques of skilled musicians who play your instrument. Look for videos online where you can actually see how the musician is playing the instrument. Live sets or videos where the person is performing for a small audience are good for this. Watch for tricks that you can pick up and add to your own playing.  If you hear a song by a musician you like and wonder how they made a particular sound or musical phrase in the song, look for videos of them playing. Many musicians also have more technical videos where they actually demonstrate specific skills and teach viewers how to do them.  "]}}, "How to Play an Otamatone": {"description": "An Otamatone is a Japanese instrument that's shaped like a music note and sounds like a theremin or synthesizer. It’s important to know how to set up the instrument and adjust the sound settings to produce different notes. You use your fingers on one hand to play notes on the stem (or stem switch) while your other hand grips the base. Once you get a feel for it, you can incorporate techniques like vibrato, glissando, and squeezing the “mouth” to produce a wacky “wah” sound. The Otamatone was created to be a toy, so have fun creating all kinds of funky tunes!", "content": {"Familiarizing Yourself with the Otamatone": [" Identify the stem switch, mouth, and controls. The bulbous base of the instrument is called the mouth, which features a small slit that can open and close to produce sound variations. The power, volume, and octave controls of the instrument will be on the backside of the mouth. The stem coming up from the base is called the stem switch—your fingers will be moving up and down the switch stem to play different notes.  The control panel on the back of the base differs from model to model. The standard Otamatone will have a power/volume switch and an octave switch while the deluxe Otamatone has a power/volume knob, octave switch, a headphone jack, and an amp jack.   ", " Examine the back panel to determine if you have a standard or deluxe model. You’ll need to know which model you have to understand its parts and capabilities better. Deluxe Otamatones tend to be larger than standard models, but there are also several differences in their features and how they’re played.  A deluxe model will have 1 knob that controls both the power and the volume. A standard model will only have a power switch and a simple “high” or “low” volume setting. A deluxe Otamatone has a power light that shines red when the instrument is switched on. A deluxe Otamatone has 2 ports on either side of the octave switch—1 for headphones and 1 output (DC) jack.  ", " Insert the batteries into the back of the base. Use a coin or similarly sized item to open the battery hatch located on the back of the base just below the controls. Slide the battery box out of the base and insert 3 AA batteries (alkaline is preferred) facing the proper directions.  For the standard model, you don’t need to slide anything out—insert the batteries directly into the base in the correct position. The positive side of the battery with the bump should touch the flat end of the battery cartridge and the negative, flat end of the battery should touch the coil.  "], "Playing the Otamatone": [" Adjust the power control switch to the right to turn it on. Look at the back panel of the base where all the knobs are to find a power switch. If you have a standard model, slide it to the right until you hear a click. If you have the deluxe model, turn the power/volume knob to the right until the power light turns on.  For the deluxe version, if the light doesn’t come on, you may need to change the batteries.  ", " Turn the knob or slide the switch to the high or low volume setting. Locate the knob on the base (or \"tadpole\") of the instrument and look for a knob that denotes sound. On the standard version, it will be marked by a speakerphone symbol with 2 or 3 lines next to it. For the deluxe model, simply turn the power/volume knob to the right to increase the volume.  If you plan to record a song on your Otamatone, it's best to use the loudest setting.  ", " Hold the base in your left hand with your fingers on the dots. Grip the base (or \"tadpole\") of the Otamatone with your left hand. Make sure the mouth is facing away from your body. Place your index finger and thumb on the raised dots located on either side of the mouth.  The dots on the base are pinched to open the mouth of the instrument, which changes the sound from \"woo\" to \"wah.\" If you are left-handed, it may be more comfortable to grip the base with your right hand and the stem with your left.  ", " Hold the stem between your thumb and index finger. Place your right hand anywhere on the stem and lightly grip it between your thumb and index finger. Practice moving your hand up and down the stem using this light grip. Use your left hand to steady the instrument in an upright position to make it easier.  A light grip is important because you'll be moving your fingers up and down the neck to produce different notes.  ", " Push down anywhere on the stem to play a note. Start with your index finger placed at the very top of the stem switch to play the lowest note, which in most cases, is a C. Then, move your finger down to the next note to pay a C-sharp. Keep moving down in increments to hear each note in the octave. Lower notes are located at the top of the stem and the notes get higher as you move down the stem.  If you have a digital version, the stem will have keys on it like a piano. The standard and deluxe models simply have a smooth bar that responds to the pressure from your fingers. Deluxe Otamatones start at C and go all the way up to a G-sharp (covering a single octave and half of the next octave), but some deluxe versions start at different notes (like from F to A). Refer to your Otamatone instruction manual to see how your Otamatone is set up. The standard model only covers a single octave covering C to C. Due to it’s small size, you don’t need to slide your finger very far down the stem to reach the next note. You can access a higher or lower octave by sliding the octave switch to the right or the left on the back of the base. Practice playing scales up and down, covering each note. Some people find the notes to be fairly close together, so the more you get used to small jumps from note to note, the better Otamatonist you’ll be!  "], "Using Different Techniques": [" Play harmonies by placing 2 fingers on the stem switch. Use your index and middle finger to push down onto the stem in 2 different places. This will create a more rounded sound than playing a single note at a time. Playing harmonies is essential if you want to play more than just simple songs on the Otamatone.  For standard and deluxe models, it may be hard to calculate just where two notes are located in relation to each other. Start by placing your fingers about 2 inches (5.1 cm) apart and adjust the distance according to what you hear. Once you get an ear for it, you’ll have a better idea of where harmonic notes are located along the stem. If you have a digital version, push 2 keys that have 1 key between them for an easy harmonic sound. Practice playing harmonies up and down the stem by first playing C with E, then D with F, E with G, and so on. This will help your muscles memorize the space between notes. Use a small tuner to find where C is or, if your model came with a player’s manual, refer to that to find the notes. You can also find note charts by doing an online search for “Otamatone note chart.”  ", " Vibrate your index finger on the stem switch to play vibrato. Quickly lift, press down, lift, and press down on the stem with your index finger. Try to make the motion as quick and small as you can—it will take some practice!  Vibrato is a pulsing effect in which the pitch slightly vibrates up and down (opera singers are typically known for using vibrato). Practice by playing vibrato scales up and down the stem (i.e., playing each note in a vibrating fashion). Once you master that, try vibrato harmonies using 2 fingers!  ", " Slide your fingers up and down the stem to make a whistling sound. Instead of moving your fingers from one note to the next up and down the stem, glide them up or down from one note to the next. It may help to squeeze the base with your left hand to stabilize the instrument.  This technique is similar to glissando on the piano, where the player uses 1 or 2 fingers to slide up or down the keyboard. Practice doing glissando between a few notes at a time to help you memorize the spacing of the notes along the stem. For instance, glide from C to F-sharp, then from C-sharp to G, D to G-sharp, and so on. Search online for a note chart if you’re not sure where the notes are located on the stem. If you have a digital model, the notes are laid out like piano keys, so you can figure out which key is which note by looking at a standard piano chart. You won’t be able to slide your finger up and down the stem, but you can use 4 of your fingers to play ascending or descending notes in quick succession to produce a similar sound effect.  ", " Select a low, medium, or high pitch. Look at the base of the instrument to find a knob relating to 3 different pitch settings. Set it to medium for casual playing, low for a droning sound effect, and high for sustained high-pitched notes.  A high-pitched setting sounds great with vibrato, but you can play vibrato on any setting. The notes on the Otamatone cover a single octave at a time, so you may need to adjust the pitch mid-song to switch from higher to much lower notes.  ", " Use your left index finger and thumb to open and close the mouth. Pinch the “cheeks” of the tadpole on either end of the mouth to open the slit. This will change the sound from a “woo” to a “wah.”  Try opening the mouth while playing vibrato to produce a human-like sound. Practice pinching the cheeks while playing scales to get the hang of using both hands at the same time.  "]}}, "How to Choose an Instrument": {"description": "Learning to play an instrument is one of the coolest things you'll ever do. Whether you're just starting out in school, decided you wanted to play in a band, or have decided to learn to play music now that the kids have grown, it's a fun and rewarding thing to do. If you don't already know what you want to play, you're in great shape—that means everything is a possibility! See Step 1 for some helpful advice about picking the right instrument for you.", "content": {"Choosing a Variety": [" Start early with piano . Piano is a common starter instrument because it's easy to really see the music. Common in many cultures and styles of music, piano or keyboard is an excellent choice if you want to learn an instrument, regardless of whether you're young or old. Piano variations you'll be able to add to your repertoire later might include: Synthesizer Harmonium    ", " Rock out on a guitar . From classical to death metal, learning to play guitar opens all kinds of doors into new musics and styles. It's had an impact on pop culture more than probably any other instrument, and is a super-popular choice for first-timers everywhere. Pick up an acoustic guitar to stay mobile, or check out its electric cousin to get started bumming out your neighbors and playing heady licks. Once you've got guitar basics mastered, you could also add other instruments to your six-string canon:  ", " Consider picking up a classical instrument. One of the most viable careers in music performance revolves around playing classical strings, in orchestral, string-quartet, or other settings. The instruments of the chamber might be right for you if you've got an interest in classical sounds. While they may have a stuffy reputation, these are still commonly used in folk musics and other settings all around the world. The classical strings include:   . This is generally seen as the \"lead\" instrument in the world of strings. It's got an excellent range, is easy to hold, and is sublimely expressive in a way that few other instruments can even try to be.  . Somewhat larger than a violin, it's deeper and darker in tone than the violin. If you have longer arms, and larger hands, you might consider the viola rather than the violin.  . The cello is much larger than the violin and viola, and must be played sitting down, with the instrument between your knees. It has a rich, deep tone akin to a male human voice, and while it can't reach the heights of a violin, it is immensely lyrical. Double Bass. This is the lowest-sounding member of the violin family. In classical or chamber surroundings, it's most often played with a bow, and occasionally plucked for effect. In jazz or bluegrass (where you will often find a double bass), it's generally plucked and occasionally bowed for effect.  ", " Shake hands with a brass instrument. Both simple and complex, the brass family of instruments are basically long metal tubes that feature valves and buttons that alter the pitch. To play them, you buzz your lips inside a metal mouthpiece to create the sound. They're used in all types of concert bands and orchestras, jazz combos, marching bands, and as accompaniment to old-school R & B and soul music. Brass instruments include:   ", " Don't forget about the woodwinds. Like brass instruments, woodwinds are played by blowing into them. Unlike brass instruments, woodwinds are played through reeds that vibrate as you blow over them (except for the flute - it is a reedless instrument). Playing these instruments require developing stamina, because you are continually blowing into them. They make a variety of beautiful tones and are extremely versatile instruments to play jazz or classical music with. Woodwind instruments include:  , , or   ", " Get rhythm by taking up percussion. Keeping the time of most music groups is the job of the percussionists. In some bands, this will be provided on a kit drum, while other combos will feature a wider variety of instruments, banged on with mallets or hands or sticks. Percussion instruments include:  Vibraphone, , and   and Cymbals  and   ", " Consider new music instruments. People are making music with more things than ever before. You may have seen that guy on the street corner, with 5 gallon (18.9 L) paint buckets and saucepan lids, tearing up the rhythm. Drums? Maybe. Percussion, certainly. Consider playing: iPad. If you have one, you probably know by now there are some truly amazing musical instruments that defy categorization. Tap on the screen and a voice emerges from a puddle of blue on a green background. Flip apps, and now you're playing a vintage '80s synth that cost $50,000 then, and $.99 now—and sounds better. Have you got a couple turntables? To be a great DJ takes a lot of skill and a lot of practice, and anybody who tells you that's not music is wrong.  ", " Check out this list. As you can see, there are more instruments than you can shake a rhythm stick at. Some of the difficult-to-categorize are listed below: Erhu (Chinese two-stringed fiddle) Guqin (Chinese stringed instrument) Pipa (Chinese 4-stringed instrument) Guzheng (Chinese instrument, kind of like a plucked piano) Sitar Dulcimer Koto (Japanese harp) English horn Mellophone (a marching version of a horn) Alto horn Bugle Piccolo trumpet Flugelhorn  "], "Choosing the Right Instrument": [" Experiment with lots of different instruments before committing. Get your hands on a trumpet, guitar, or trombone, and make a few notes. It won't be music yet, but it'll give you some idea of whether or not the instrument is fun to play, and worth spending some time with.  Typically, if you want to sign up for band or orchestra at your school, call-outs are regularly held during which the directors allow you to experiment with instruments and select one. Go to one of these call-outs and check out all the different kinds of instruments. Most instrument stores are excited to share their instruments with you and let you give them a shot. They might even be able to show you a few things.  ", " Look into your possibilities. If you're starting out in a school band, check and see what instruments the band includes. Most concert bands in schools have clarinets, flutes, saxophones, tubas, baritones, trombones, trumpets, and percussion as starter instruments, and let you advance to other instruments like oboe, bassoon, and horn later on. You can begin making your decision from the instruments that are available. You can also ask the director which instruments they are short of—he or she will be very grateful if you can fill an empty spot.  ", " Keep your options open. You may want to play the baritone sax, but the band already has three players. You may have to first start on the clarinet, then move to alto sax, and finally switch to bari when a slot opens up. ", " Consider your size. If you're starting out in middle school, and smaller than the average student, a tuba or trombone not be the right instrument for you. You could try trumpet or cornet instead. If you're younger or still losing teeth, you may find it hard to play some brass instruments because your teeth aren't very strong yet. If you have small hands or fingers, the bassoon may not be for you, although there are bassoons made for beginners with some keys for small hands. Think of how braces will affect your tone, especially for most brass. Find out whether you'll need them, or when any current braces will come off.   "], "Finding the Right Fit": [" Play what you like. When you listen to the radio, Spotify, or your friend's mix tape, what do you hear that instinctively perks you up? Do you find yourself thrumming along to the bassline, or do you go into wild air-guitar frenzies? Perhaps you should look into stringed instruments. Do you thrash the air-drums and beat your fingers on the table constantly? These are all great clues about what your \"natural instrument\" might be, and it involves hitting things with sticks, hands, or both!  ", " Play what will be practical for your situation. You may have a natural affinity for drums, but your parents have said, \"No way—it's much too loud!\" when you told them. Be creative—either suggest digital drums which you can only hear through headphones, or re-think your needs, and start with something softer and not as jarring, like a set of conga drums. Play drums in the school band, but practice at home with a rubber practice pad. ", " Just pick one. While you can be very analytical about what to play, there's another thing to try that has a lot of benefits. Close your eyes (after reading this), and write down the first 5 instruments that come to your mind. Now, look at what you wrote.  One of those picks is your instrument. The first one came straight off the top: it might be what you really want to play, or it might be just what you associate learning music with. With each successive pick, you focused more on what you wanted. By the fifth choice, you may have been digging for an answer. It's a safe bet that all would be instruments you would enjoy, but which is the best choice? It all depends on who you are, and how you're going to learn.  "]}}, "How to Play the Theremin": {"description": "The theremin is an eerie-sounding instrument that you can play by using your hands to disturb an electromagnetic field created by its two antennae. Though many people see it as a novelty primarily used to create horror-movie soundtracks, you can play nearly any style of music on the theremin. If you learn to orient your body properly, identify key notes, and position your fingers to manipulate melody, you'll be on your way to making your own beautiful music with this unusual instrument.", "content": {"Positioning Your Hands and Body": [" Adopt a slightly split-legged stance for maximum stability. Face your theremin and position yourself roughly in between the pitch and volume antennae. Place the foot that’s on the pitch antenna side of the theremin a little closer to the pitch antenna, and place the foot on that’s on the volume antenna side a little farther away. This “split stance” will give you more stability than standing squarely with your feet underneath your shoulders.  If you extend your arm outward, your fingertips should just about touch the pitch antenna.  Your pitch antenna-side foot should be angled slightly to the right, so your toes are pointing toward the pitch antenna.   ", " Orient your dominant hand towards the pitch antenna. When playing the theremin, you will use your dominant hand to control the pitch antenna, which stands upright. You should be facing the theremin so that the pitch antenna is on the same side as your dominant hand. If this is not the case, turn around – you’re playing your theremin backwards! If you are left-handed, you will need a left-handed theremin. Most theremins are built for right-handed people, but you can assemble some theremins (such as the popular Moog Etherwave) yourself. Instructions on how to assemble a left-handed rather than a right-handed theremin will be included.   ", " Orient your non-dominant hand towards the volume antenna. If you’re facing in the right direction, your non-dominant hand will be on the same side of the theremin as the volume antenna, which extends horizontally from the side of the theremin.  If you hover your non-dominant hand just a bit over the volume antenna, your arm should be horizontal. If this is not the case, raise or lower the height of your theremin so you can hold your non-dominant arm out straight.   ", " Identify the theremin’s range by reaching toward and away from the pitch antenna. The closer you move your hand to the pitch antenna, the higher the notes will be. To find the upper end of your theremin’s range, extend your dominant arm fully. as described in the previous step. Then, to find the lower end of its range, slowly move your hand inward towards your body. When the theremin begins to sound less like it’s playing a solid tone and more like it’s vibrating or humming, you’ll know that you’ve found the lowest note.  ", " Adjust the size of the pitch field with the tuning knob, if needed. Ideally, you should reach the theremin’s lowest note when your hand is near the center of your body. If you reach the lowest note while your hand is still a ways in front of you, turn the pitch tuning knob to the right to compress the instrument’s electromagnetic field. If you have to reach behind you to find the lowest note, turn the tuning knob to the left to make the field larger.  The theremin produces an electromagnetic field that makes sounds when you disturb it with your hands. By adjusting the size of the field, you’ll ensure that you can access every possible pitch the instrument can make in the area between the pitch antenna and your body.   ", " Keep your body as still as possible. Because your whole body is an electro-conductor, moving any of your body parts can disturb the theremin’s electromagnetic field and alter the sounds you produce. For this reason, you won’t be able to dance or nod your head like a guitarist or a singer while playing your Theremin. Try to keep all of your body parts besides your hands, arms, and fingers as still as possible to avoid playing off-key notes and scales.  "], "Finding Fingerings and Playing Scales": [" Make a circle with your index finger and thumb, then extend your other fingers. Experienced theremin players use subtle changes in finger positioning to play different notes. Begin by putting your dominant-hand fingers in the “eighth position” by making a circle with your thumb and index finger. The circle should be parallel to the floor, and your thumb knuckle should point upward. Then, fully extend your little finger, ring finger, and middle finger.  Your knuckles should be facing forward and slightly towards the pitch antenna, and the back of your hand should be facing the pitch antenna.   ", " Find a high “c” with your dominant hand. Turn on your electronic tuner. Keeping your fingers in that same position, move your dominant hand closer to the pitch antenna until your tuner registers a “c” that’s an octave above middle “c.”  ", " Curl your fingers inward to find middle “c. ” Keeping your index finger and thumb in a circle, slowly curl your fingers in toward your palm. When they align with your index finger, start curling your index finger inward as well, slowly progressing towards a fist. Stop when your tuner registers middle “c.”  If you have small hands, you may not reach middle c until your fist is closed. If you have larger hands, you might reach it earlier.  ", " Experiment with aerial fingering positions to play scales. Now, your hand is in position 1, which produces the lowest note in a given octave. Position 8, on the other hand, will produce the highest note in that same octave. By extending your fingers in increments – a technique called “aerial fingering” – you should be able to play the six notes between high “c” and middle “c”. One entire octave is contained within the space of your hand!  Though the basic 1st and 8th positions tend to be somewhat similar for most theremin players, the exact positioning of your fingers that produces each note in between will differ based on the size of your hand. No specific finger position corresponds to an absolute pitch.   ", " Practice scales repeatedly to find the finger positions that work best for you. You’ll need to play many scales until you learn which fingerings yield which notes. Try extending or uncurling your fingers to different lengths, and listen carefully to how the pitches shift as your finger positions change. As you learn to associate the placement of your fingers with certain notes, playing accurate scales will soon become instinctive. "], "Developing Your Technique": [" Practice playing staccato notes. As you progress from scales into songs, you’ll learn how to use your non-dominant hand – the one near the volume antenna– to shape the articulation of your music. So, just as you would on any other instrument, you can play staccato notes on your theremin. “Pumping” your volume hand up and down each time you switch notes will produce these sharp, short sounds.  The downward movement of your volume hand towards the end of the note will cut the sound short and make it feel sharp and clipped.  ", " Work on playing smooth, continuous legato notes. To play an unbroken, flowing string of notes – a type of articulation referred to as legato – keep your non-dominant hand in a steady position above the volume antenna. This will ensure that nothing changes besides melody as you switch from note to note.  ", " Employ vibrato for a smoother sound. If you keep your hand completely still while playing each note, the theremin can sound especially cold and eerie. Allow your hand to shake or jiggle slightly in place while keeping your fingers in the correct position for the note you desire to play, and you’ll produce a warm, vibrating tone.  To perform a glissando – or a smooth, quick run of notes – you can vibrate your hand slightly while smoothly extending your fingers from Position 1 to Position 8.   ", " Start attempting to play simple exercises. Once you have played enough scales to become confident in the relationship between your finger positions and the pitches they produce, give some simple exercises or songs a try to practice switching between notes that aren’t sequential. Clara Rockmore, a famous theremin player and pioneer of electronic music, published a free book of instructions and exercises for beginning theremin players. Visit for simple, short tunes that will help you build your skills.  "]}}, "How to Practice an Instrument Effectively": {"description": "Playing an instrument can be a beautiful artistic activity that allows you to tap into your creativity. However, becoming skilled in this area takes a lot of time, effort, and most of all, practice. If you stay organized, complete basic sessions with warmups and cool downs, and finally challenge and help yourself where you can, you can learn to practice playing your instrument effectively.", "content": {"Organizing Yourself and Your Materials": [" Gather your tools and materials. Before you start practicing, make sure you have your sheet music, your music stand, your instrument, as well as a timer, a tuner, a metronome, and any other helpful tools you may need. Also keep a pencil, a pencil sharpener, and a clean eraser nearby. By gathering these items before you start working, you’ll keep yourself from having to break concentration to find them in the middle of practicing.  ", " Pick somewhere quiet to practice. By designating a certain separate room or area as your practice space, you can eliminate distractions and also prepare yourself mentally for mindful work.  Try practicing in a room of your house that people spend less time in, such as the formal dining room. Any area like this will keep you away from distractions such as a conversation between family members in the kitchen or a TV that’s on in the living room.  ", " Set a goal. It’s better to have something to work towards than to just start playing music without intention. Think about what you’d really like to accomplish during each practice session and focus on that goal throughout it. For instance, you might be really close to mastering a piece but still have a couple problem spots. Consider aiming to play the piece through perfectly one time during the practice session. If, for example, you want to improve the sound of your guitar, consider setting a goal to achieve a better sound by experimenting with different hand positionings. If you aren’t sure how to set your goals, ask you music teacher what you need to work on at the end of lessons and/or class. Write this down and refer back to it when you practice on your own.   ", " Create a practice schedule and stick to it. The amount you should practice depends on what your skill level is, how old you are, and how dedicated you are to progressing quickly. If you want to advance, you should play your instrument 6 days a week, whether that’s for 15 minutes or 2 hours each day. Pick consistent times and days that work best for you and always practice when you’re scheduled to.  If you want to practice for 6 hours a week, you might schedule practice time from 3:00pm to 4:00pm every Sunday-Friday.  "], "Completing a Basic Practice Session": [" Warm up first. Once you have everything set up and ready, spend about 5-10 minutes working on scales and doing other warm-up activities. You can also do some breathing and stretching exercises at this time.  ", " Work towards your goal. After you’ve warmed up, dive right into accomplishing your goal. Take your time and stay focused. This is the most important part of the practice session and should take the most amount of time, whether that means 20 minutes or an hour. ", " Use a practice notebook. Even if you’ve played a piece a lot, it’s better to read what you’re playing and not rely on your memory. By always using your practice book, you can use the mental effort it takes to remember the notes on something else, such as tone quality or tempo.  ", " Take notes in your practice book. As you work through pieces, use your pencil to highlight problem areas and give yourself reminders. These little bits of information should help you to play the piece better and with more awareness.  Write down things that may help you remember best practices, such as \"Take a short breath\" or \"add a crescendo.\"  ", " Play something fun and easy at the end. Once you’ve reached your goal, spend the last 10-15 minutes in playing your most favourite song/chord which you mostly like ever and just play with some happiness to finish with a positive attitude.  "], "Challenging and Helping Yourself": [" Play smarter. When you’re playing a challenging piece, don’t just play it all the way through over and over and over again while continuously making errors. This is a waste of time. Instead, take a step back and identify and analyze the problem. Then, brainstorm solutions, experiment with them, and implement the best one. For example, if a note comes out flat each time you play it on your trumpet, first identify what you want it to sound like. Then, try to think about the different possible causes of the sour note. Slightly adjust your fingering and your mouth until you discover an adjustment that allows you to play the note properly.   ", " Use technology to your advantage. There are several free or inexpensive apps that act as timers, metronomes, tuners, and more. Consider using these when you’re on the go so that you don’t have to tote around extra tools and materials. Also, check out different lessons and tutorials on sites like Youtube that can help you solve any specific issues you’re having without paying for a lesson. ", " Focus on your problem areas. It’s not always necessary to start at the beginning and play a piece through to the end over and over. If you’re having a problem with a couple measures in the middle of the piece, focus more on that section. This will save you a lot of time and allow you to make more progress.  ", " Read through the music without your instrument. When you aren’t practicing and you have a couple minutes of down time, take out your music or pull it up on your phone and just carefully read through it a few times to familiarize yourself with it more.  You can read through your music while you’re riding in the car to get to school or waiting in a long line at the post office.  ", " Make tasks harder by physically challenging yourself. Add a physical component to your practicing that you don’t normally have to deal with. By making a challenging addition to practicing your instrument, you’ll make playing normally feel easier. For example, try to play your instrument while standing on one leg.   ", " Practice at productive times of day. Everyone has more energy at certain times of the day than at others. Pay attention to what time of day you seem to be the most awake, focused, energetic, and clear-headed. Try to practice your instrument during these times.  ", " Practice only for as long as you can focus. In order to make progress during a practice section, you have to be completely focused and mindful. This might mean practicing for just 10 minutes when you’re younger and then working up to 45 minutes or an hour once you’re older and have developed better concentration skills.  If you can only keep your attention on something for 15 minutes at a time, then play for 15 minutes, put down your instrument and take a break for a couple minutes, and then play for another 15 minutes.  "]}}, "How to Hang Instruments on the Wall": {"description": "Hanging instruments on a wall is a great way to save space and show off your collection at the same time. The type of mount you use for your instrument depends on whether you play the instrument regularly, or if you just plan on displaying it. Once you have chosen your mount, you need to pay careful attention to placement, both for aesthetic and preservation purposes.", "content": {"Choosing the Right Mount": [" Use simple brackets for instruments you play regularly. While you can always give your guitar a fancier mount, it won't be very convenient if you have to undo a bunch of straps and screws each time you want to play your instrument. Instead, choose simple, padded wall bracket suitable for the type of instrument you have.  The brackets will typically be labeled based on their instrument, such as: guitar bracket. You can find brackets online and in stores that sell musical instruments. Consider getting a bracket with padded, flexible arms. Not only will they protect your instrument, but they will be easier to adjust for other types of instruments.   ", " Get a decorative wall mount to suit your room's theme. Wall mounts and brackets for instruments come in all shapes, sizes, and materials. Wooden mounts provide a nice contrast against brass instruments and electric guitars. If you have multiple instruments to hang, consider a mount with multiple brackets.  Some places sell mounts that are carved into novelty shapes, such as electric guitars or mustangs.  ", " Try a floating guitar mount for a minimalistic display. Floating mounts are a set of wall brackets made for guitars. The bottom mount holds the guitar up by the bottom strap screw. The top mount holds the guitar up by the neck or by the top strap screw. You can position them horizontally or diagonally. How far apart your screw the mounts into your wall depends on the distance between the 2 strap screws on your guitar. You may be able to use these on other types of string instruments, as long as they have screws for the shoulder strap.  ", " Display collectors' instruments in shadow boxes . If you have a valuable instrument, chances are, you are more interested in displaying it than playing it. In this case, purchase a shadow box that fits the dimensions of your instrument. Mount the shadow box on your wall with the instrument inside it. The glass or plastic panel in front of the shadow box will protect your instrument from dust.  A shadow box is a type of frame, except that it is much thicker. If you cannot find one that you like, you may be able to commission it from a frame shop. Most shadow boxes are black inside-out. Consider fitting your shadow box with a colored mat on the inside.  ", " Build a case into your wall for a more refined display. This will involve cutting into the wall and inserting a frame, so it is not recommended for rental units. It is a great option, however, if you don't have a lot of space in your room, or if you don't want things sticking out of the wall that could get easily knocked off.  Build the case between wall studs. Line the inside of the case with wood. Paint the inside of the case to match your wall, or try a different color for contrast. Install some lighting inside the case for a more elaborate display. Mount a picture frame with the back removed over the case to protect your instrument.  "], "Planning the Layout": [" Keep your instruments together in a single room. It would be even better if you group them together on 1 wall. This way, if you ever have friends over and musical inspiration strikes, you don't have to go all over your house and hunt down the instruments. Everything will be all in one place!  ", " Include a variety instruments if you are collecting from a band. While not absolutely necessary, this is a great way to turn your wall into a sort of museum. If you already have a guitar or 2 signed by your favorite band, consider getting another instrument that they play signed as well, such as a keyboard or a brass instrument.  ", " Group multiple instruments together in a comprehensive order. This will help make your wall look more organized. For example, if you have a collection of string instruments, hang them in order from smallest to largest. Here are some other ideas:  Group instruments by type. This includes acoustic versus electric guitars. Group instruments by color or wood type. Keep different bands separate. This is great if you have different types of instruments from multiple bands.  ", " Choose a location away from sunlight. Even if you keep your instrument behind a glass case, too much sunlight can cause it to deteriorate. Other factors you should take into consideration include temperature and humidity; both should be stable.  Some instruments require more humidity than others. Ask your instrument's manufacturer about the proper storage conditions.  ", " Keep your instruments away from high-traffic areas. Even if your instrument is slender, such as an electric guitar, it may still be easily knocked off its mount if you place it in a busy location, such as near a doorway or in a hall way. Instead, hang your instruments in an area that receives little foot-traffic. Avoid hanging large, bulky instruments in small, tight spaces, even if they are not busy. If you have to suck your breath in to walk past your instrument, it's not a good spot!  "], "Creating a Simple Guitar Mount": [" Place the mounting block against your wall. A mounting block is a piece of wood, typically sold with guitar wall brackets; it has 3 screw holes. Make sure that the block is high enough on your wall so that the guitar does not touch the floor when you hang it up vertically. Measure your guitar first, if you have to. Try to place the mounting block over a stud in the wall. Consider using a to locate the stud.  ", " Drill holes into the top and bottom screw holes. Do the top screw first, then place a level against the side. Rotate the mounting block until the level's bubble is between the guidelines on the glass tube. Once the bubble is centered, insert the second screw into the bottom screw hole.  You can use a regular or electric screwdriver for this. Use the screws that came with the guitar mount. If you did not get any screws with it, choose screws that are twice the thickness of the mounting block. Pay attention to the screws as you drill them in. If you feel the screws hit a wall stud, you are good; if you don't feel a stud, you'll have to insert drywall toggles.  ", " Remove the wall mount and insert drywall toggles, if needed. If you did hit a stud when drilling in the screws, remove the screws now and pull off the mounting block. Push the drywall toggles into the holes already in the wall, then screw them in the rest of the way.  Once you have the toggles in, replace the mounting block and reinsert the screws. Check the label on the drywall toggles' packaging. Some have a limited weight capacity.  ", " Screw the guitar bracket into the center hole. Take the padded Y-shaped bracket. Find the screw at the end, and insert it into the center hole on the mounting block. Rotate the bracket until it is screwed in tightly. Make sure that the arms are pointing upward.  ", " Hang your guitar on the bracket. Lift your guitar up, and slide it into the bracket. The arms should hold the guitar up by the neck, just below the headstock. If the arms on the bracket are too wide or too narrow, you may be able to pull them closer together or further apart. "]}}, "How to Make Music": {"description": "The first known musical instruments were bone flutes found 35,000 years ago, although man may have sung long before that.Over time, an understanding has developed of how musical sounds are made and organized. While you don’t have to know everything about musical scales, rhythms, melodies, and harmonies in order to make music, an understanding of some of the concepts will help you appreciate and make better music.", "content": {"Sounds, Notes, and Scales": [" Understand the difference between “pitch” and “note. ” These terms describe qualities of musical sounds. Although the terms are related, they are used somewhat differently. “Pitch” refers to the sensation of lowness or highness associated with the frequency of a given sound. The greater the frequency, the higher the pitch. The frequency difference between any two pitches is called an “interval.” “Note” refers to a named range of pitches. The standard frequency for A above middle C is 440 hertz, but some orchestras use a slightly different standard, such as 443 hertz, to produce a brighter sound.  Most people can determine whether a note sounds right when played against another note or in part of a series of notes in a piece of music they recognize. This is called “relative pitch.” A few people possess “absolute pitch” or “perfect pitch,” which is the ability to identify a given pitch without hearing a reference pitch.    ", " Understand the difference between “timbre” and “tone. ” These sound terms are generally used with respect to musical instruments. “Timbre” refers to the combination of primary pitch (fundamental) and secondary pitches (overtones) that sound whenever a musical instrument plays a note. When you pluck the low E string on an acoustic guitar, you actually hear not only the low E note, but also additional pitches at frequencies that are multiples of the low E frequency. The combination of these sounds, which are also collectively called “harmonics,” are what makes one instrument sound different from another kind of instrument.  “Tone” is a somewhat more nebulous term. It refers to the effect the combination of fundamental and secondary harmonics have on the listener’s ear. Adding more high-pitched harmonics to the timbre of a note produces a brighter or sharper tone, while damping them produces a more mellow tone.  “Tone” also refers to an interval between two pitches, also called a whole step. Half this interval is called a “semitone” or half-step.   ", " Assign names to notes. Music notes can be named in several ways. Two methods are commonly used in most of the Western world. Letter names: Notes of certain frequencies are assigned letter names. In English and Dutch-speaking countries, the letters run from A to G. In German-speaking countries, however, “B” is used for the B-flat note (the black piano key between the A and B keys), and an “H” is used to represent the B-natural note (the white B key on a piano).  Solfeggio (also called “solfege” or “solfeo”): This system, familiar to fans of ‘’The Sound of Music,’’ assigns one-syllable names to notes according to their successive positions within a scale. The original system developed by 11th century monk Guido d’Arezzo used “ut, re, mi, fa, sol, la, si,” taken from the first words of lines in a chant to St. John the Baptist. Over time, “ut” was replaced with “do,” while some shorten “sol” to “so” and sing “ti” instead of “si.” (Some parts of the world use the solfeggio names the way the Western world uses letter names.)   ", " Organize a series of notes into a scale. A scale is a series of successive intervals between pitches such that the highest pitch is at twice the frequency of the lowest pitch. This range is called an octave. These are some of the common scales: A full chromatic scale uses 12 half-step intervals. Playing an octave on the piano from middle C to the C above middle C, sounding all the white and black keys in between, produces a chromatic scale. Other scales are more restricted forms of this scale. A major scale uses seven intervals: The first and second are whole steps; the third is a half-step; the fourth, fifth, and sixth are whole steps; and the seventh is a half-step. Playing an octave on the piano from middle C to the C above, sounding only the white keys, is an example of a major scale. A minor scale also uses seven intervals. The most common form is the natural minor scale. Its first interval is a whole step, but the second is a half-step, the third and fourth are whole steps, the fifth is a half-step, and the sixth and seventh are whole steps. Playing an octave on the piano from A below middle C to A above middle C, sounding only the white keys, is an example of a natural minor scale. A pentatonic scale uses five intervals. The first interval is a whole step, the next is three half-steps, the third and fourth are each a whole step, and the fifth is three half-steps. (In the key of C, this means the notes used are C, D, F, G, A, and C again.) You can also play a pentatonic scale by playing only the black keys between middle C and high C on a piano. Pentatonic scales are used in African, East Asian, and Native American music, as well as in folk music.  The lowest note in the scale is called the “key.” Usually, songs are written such that the last note of the song is the key note; a song written in the key of C almost always ends on the note C. A key name typically also includes whether the song is played under a major or minor scale; when the scale isn’t named, it’s understood to be the major scale.  ", " Use sharps and flats to raise and lower note pitches. Sharps and flats raise and lower the pitches of notes by a half-step. They are necessary when playing in keys other than C-major or A-minor to keep the interval patterns for major and minor scales correct.  Sharps and flats are indicated in lines of written music with symbols called accidentals. A sharp symbol, which resembles the hashtag (#), placed in front of a note raises its pitch by a half-step. In the keys of G-major and E-minor, the F is raised by a half-step to become F-sharp. A flat symbol, which resembles a pointed lowercase “b,” placed in front of a note lowers its pitch by a half-step. In the keys of F-major and D-minor, the B is lowered by a half-step to become B-flat. For the sake of convenience, the notes that must always be sharped or flatted in a particular key are indicated at the beginning of each line in the music staff in the key signature. Accidentals then have to be used only for notes outside the major or minor key the song is written in. When accidentals are used this way, they apply only to occurrences of that note before the vertical line that separates measures. A natural symbol, which looks like a vertical parallelogram with a vertical line extending up and down from two of its vertices, is used in front of any note that would be otherwise be sharped or flatted to show that it shouldn’t be at that place in the song. Naturals never appear in key signatures, but a natural can cancel the effect of a sharp or flat used within a measure.  "], "Beats and Rhythms": [" Understand the difference between “beat,” “rhythm,” and “tempo. ” These terms are also closely related. “Beat” refers to an individual pulse of music. A beat can be either a sounded note or a period of silence called a rest. A beat can also be divided among multiple notes, or multiple beats can be assigned to a single note or rest. “Rhythm” refers to a series of beats or pulses. The rhythm is determined by how the notes and rests are arranged within a song. “Tempo” refers to how fast or slowly a song is played. The faster the tempo, the more beats are played per minute. “The Blue Danube Waltz” has a slow tempo, while “The Stars and Stripes Forever” has a fast tempo.  ", " Group beats into measures. Measures are groups of beats. Each measure has the same number of beats. The number of beats each measure has is indicated in written music with a time signature, which looks like a fraction without a line separating the numerator and denominator. The top number indicates the number of beats per measure. This number is usually a 2, 3, or 4, but may be as high as 6 or higher. The bottom number indicates what kind of note gets a full beat. When the bottom number is a 4, a quarter note (looks like a filled oval with a line attached to it) gets a full beat. When the bottom number is a 2, a half note (looks like an open oval with a line attached to it) gets a full beat. When the bottom number is an 8, an eighth note (looks like a quarter note with a flag attached to it) gets a full beat.  ", " Look for the stressed beat. Rhythms are determined according to which beats in the measure are accented (stressed) and which beats are not (unstressed). In most pieces of music, the first beat, or downbeat, is stressed. The remaining beats, or upbeats, are not stressed, although in a measure of four beats, the third beat may be stressed, but to a lesser degree than the downbeat. Stressed beats are also sometimes called strong beats, while unstressed beats are sometimes called weak beats. Some pieces of music stress beats other than the downbeat. This type of stressing is known as syncopation, and beats so stressed are called back beats .   "], "Melody, Harmony, and Chords": [" Define the song with its melody. “Melody” is a succession of notes that the person listening to identifies as being a coherent song, based on the pitches of the notes and rhythm with which they are played. Melodies are composed of phrases, which are groups of measures. These phrases may repeat throughout the melody, as in the Christmas carol “Deck the Halls,” where the first and second lines use the same sequence of measures. A common melodic song structure is to have one melody for a verse and a related melody serve as a chorus or refrain.  ", " Accompany the melody with harmony. “Harmony” is the playing of notes outside those of the melody to either enhance or contrast its sound. As noted earlier, many stringed instruments actually generate multiple tones when plucked; the overtones that sound with the fundamental tone are a form of harmony. Harmony can be achieved through the use of musical phrases or chords. Harmonies that enhance the sound of the melody are called “consonant.” The overtones that sound with the fundamental tone when the string of a guitar is plucked are a form of consonant harmony. Harmonies that contrast with the melody are called “dissonant.” Dissonant harmonies can be created by playing several contrasting melodies at once, such as when singing “Row Row Row Your Boat” as a round, where each group starts singing at a different time. Many songs use dissonance as a way to express unsettled feelings and gradually work toward consonant harmonies. In the example of the round of “Row Row Row Your Boat” above, as each group finishes singing its verse for the last time, the song becomes calmer until the last group sings “Life is but a dream.”  ", " Stack notes to form chords. A chord is formed when three or more notes are sounded, usually at the same time, but not always. The most common chords are triads (three notes) where each successive note is two notes up from the previous note. In a C major chord, the notes are C (the chord root), E (the major third), and G (the fifth). In a C minor chord, the E is replaced with an E-flat (the minor third). Another commonly used chord is the seventh chord, in which a fourth note is added to the triad, the seventh note up from the root. A C major seventh chord adds a B note to the C-E-G triad to make the sequence C-E-G-B. Seventh chords are more dissonant than triads. It is possible to use a different chord for each individual note in a song; this is how barbershop quartet harmony is created. More commonly, however, chords are paired with notes found in the chord, such as playing a C major chord to accompany the E note in a melody. Many songs are played with just three chords, those whose root notes are the first, fourth, and fifth notes in a scale. These chords are represented with the Roman numerals I, IV, and V. In the key of C major, these chords would be C major, F major, and G major. Often, a seventh chord is substituted for a V major or minor chord, so that when playing in C major, the V chord would be a G major seventh. The I, IV, and V chords are interrelated between keys. While the F major chord is the IV chord in the key of C major, the C major chord is the V chord in the key of F major. The G major chord is the V chord in the key of C major, but the C major chord is the IV chord in the key of G major. This interrelationship carries through the rest of the chords and can be mapped as a diagram called the circle of fifths.   "], "Types of Musical Instruments": [" Strike or scrape a percussion instrument to make music with it. Percussion instruments are considered one of the oldest forms of musical instrument. Most are used to create and keep rhythm, although a few can play the melody or create harmonies.  Percussion instruments that produce sound by vibrating their entire bodies are called idiophones. These include instruments that are struck together, such as cymbals and castanets and those that are struck by something else, such as steel drums, triangles, and xylophones. Percussion instruments with a “skin” or “head” that vibrates when struck are called membranophones. These include drums such as the timpani, tom-tom, and bongo, as well as instruments that attach a string or stick to the membrane that vibrates it when pulled or rubbed, such as the lion’s roar or cuica.  ", " Blow into a woodwind instrument to make music with it. Woodwind instruments produce sound by vibrating when blown. Most include tone holes to change the pitch of the sound they produce, thus making them suited for playing melodies and harmonies. Woodwinds are divided into two types: flutes, which produce sound by making the entire instrument body vibrate, and reed pipes, which vibrate material placed inside the instrument. These are further divided into two sub-types.  Open flutes produce sound by splitting an airstream blown over the edge of the instrument. Concert flutes and panpipes are types of open flute. Closed flutes channel air through a duct in the instrument to split it and make the instrument vibrate. The recorder and organ pipes are types of closed flute. Single-reed instruments place a reed into the instrument mouthpiece. When blown into, the reed vibrates the air inside the instrument to produce sound. Clarinets and saxophones are examples of single-reed instruments. (Although a saxophone’s body is made of brass, it is considered a woodwind instrument because it uses a reed to make its sound.) Double-reed instruments use two cane reeds bound together at one end instead of a single reed. Instruments such as the oboe and bassoon put the double reed directly between the player’s lips, while instruments like the crumhorn and bagpipes keep their double reeds covered.  ", " Blow into a brass instrument with closed lips to make music with it. Unlike woodwind instruments, which rely solely on directing a stream of air, brass instruments vibrate along with the player’s lips to make their sound. While brass instruments are so named because most of them are made of brass, they are grouped according to their ability to change their sound by changing the distance through which the stream of air must travel before exiting. This is done through one of two methods.  Trombones use a slide to change the distance the airstream must travel. Pulling the slide out lengthens the distance, lowering the tone, while pushing it in shortens the distance, raising the tone. Other brass instruments, such as the trumpet and tuba, use a set of valves shaped like either pistons or keys to extend or shorten the airstream length within the instrument. These valves may be pressed singly or in combination to produce the desired sound. Woodwind and brass instruments are often grouped together as wind instruments, since both must be blown into to make music.  ", " Make the strings on a string instrument vibrate to make music with it. The strings of string instruments can be made to vibrate in one of three ways: by being plucked (as with a guitar), by being struck (as with a hammered dulcimer or the key-operated hammers on a piano), or by being sawed (as with the bow on a violin or cello). Stringed instruments can be used for either rhythmic or melodic accompaniment, and can be divided into three categories:  Lutes are string instruments with a resonating body and a neck, such as violins, guitars, and banjos. They feature strings of equal length (except the low string on a five-string banjo) and varying thickness. Thicker strings produce a low tone, while thin strings produce a higher tone. Strings may be pinched off at marked points (frets) to effectively shorten them and raise their pitches. Harps are string instruments whose strings are bound in a frame. Harps typically have strings of progressively shorter length arranged vertically, with the bottom end of the string connected to the resonating body, or soundboard. Zithers are string instruments that are mounted onto a body. Their strings may be strummed or plucked, as with the autoharp, or struck directly, as with the hammered dulcimer, or indirectly, as with the piano.  "]}}, "How to Play Taps": {"description": "\"Taps\" is the name of a short but solemn piece of music (also known as \"Day is Done\" or \"Butterfield's Lullaby\") that's usually associated with the U.S. military. Since the mid-1800s, \"Taps\" has been played at end-of-day flag ceremonies and military funerals.The song is fairly easy to play — the only notes used in most versions are those of the C major triad (G, C, E, and G). However, playing with the proper dignity and respect that the piece deserves is a little harder, so start practicing today for best results.", "content": {"Before You Start": [" Get a musical instrument you know how to play. \"Taps\" can be played on virtually any instrument. As long as you can play a complete C major scale from one G note to the G an octave above it, you can play the tune. However, traditionally (and at most military occasions today), \"Taps\" is played on    ", " If you know how to read music, grab the sheet music. Being able to read sheet music makes playing \"Taps\" much easier, since the music to the tune is public domain and freely available online. One good source for the sheet music is at the official site for U.S. Army bands.  Note that the sheet music above uses the treble clef. If you can only read music that is written in bass clef, you will need to transpose the notes in the song (or just identify each note individually.) See Our article on the subject for a brief guide. Note also that there is an alternate version of \"Taps\" for bass clef instruments that uses the notes of the Bb major triad (F, Bb, D, and F again.)  ", " Listen to the song. If you're not familiar with the song already, it's a smart idea to listen to a recording of \"Taps\" before you start playing. Though the song uses only four different notes and 24 notes in total, listening to the song being played can help you get a sense for the rhythms used in the song and, more importantly, the dynamics and emotional timbres used for it. The site linked above has a good-quality recording of \"Taps\" played by a solo trumpet. "], "Playing the Song": [" Count the beat slowly in 4/4 time. \"Taps\" is almost always written in common (4/4) time and the key of C. A slow, steady tempo (e.g., quarter note = 50 beats per minute) that's appropriate for the song's solemn tone is generally used. A metronome can be useful for practice, if you have one. 4/4 time essentially means that there will be four beats per measure and that each beat will be equal to one quarter note. Start mentally counting, \"one, two, three, four\" as you read the music, keeping your tempo as steady as possible.  ", " Play G-G-C, holding the C. The song starts with one beat's worth of pick up notes: a dotted eighth note G and a sixteenth note G. These are followed by a dotted quarter note C above them held for three beats. The starting G is the on most versions of the sheet music, but it's possible to play \"Taps\" in any G-to-G octave that's comfortable for you. Note the pickup notes — this means that the song actually starts on beat , rather than beat one.  ", " Play G-C-E, holding the E. On the fourth beat of the first measure, the same rhythmic pattern as before repeats, but with different notes. First, play a dotted eighth note G, then a quick sixteenth note C, then hit the E above these notes and hold it for three beats into the second measure. ", " Play G-C-E three times, holding the last E. Next, the G-C-E pattern from above repeats several times, but with different rhythms. On the fourth beat of the second measure, play a dotted eighth note G, a sixteenth note C, and a E (held only for a single beat. Play this G-C-E (quarter note) pattern again. Finally, play the same G-C-E pattern, only hold the E (which is now a dotted quarter note) for three beats instead of just one. ", " Play C-E-G (ascending), then E-C-G (descending), holding the last G. On the fourth beat of the fourth measure, the song's short climax begins. This section is different than the patterns you played before. Play a dotted eighth note C, then a sixteenth note E above it, then hit a half note G above and hold it for two beats. Play descending E and C quarter notes after the high G on beats three and four of the fifth measure. End by playing a dotted quarter note low G on the first beat of the sixth measure and holding it for three beats. Note that the high G in this measure is exactly one octave above the low G you've been using for the rest of the song.  ", " Play G-G-C, holding the C. To end the song, play the pattern you used at the very beginning. Play a dotted eighth note (low) G, a sixteenth note G, and a dotted quarter note C, holding the last note for three beats. Congratulations — you've just played \"Taps.\"  "], "Playing With Emotion": [" Hold the long notes with fermatas over them. Playing the notes of taps exactly as they are written on the page is one thing, but playing them with is another entirely. To do this, you'll need to pay attention to the symbols on the page besides the notes as well. For example, on the song's sheet music, almost every dotted quarter note is marked with a symbol that looks like a downward crescent over a dot (or a small eye.) This is called a symbol and it means to Exactly how long you hold the note is up to you. Usually, to keep the song's solemn and dignified tone, it's best to play these notes for only a few extra beats, but feel free to play around with the fermata notes as you practice to find what sounds best. The fermata notes in the song are most of the dotted quarter notes: the C at the start of the first measure, the E at the start of the second, the E at the start of the fourth, and the C at the end of the song. Note that the low G at the start of the sixth measure doesn't have a fermata — if it sounds good to you, you can usually still get away with extending this note.  ", " Grow in intensity through the song, peaking at the high G note. Notice the markings below the staff on the sheet music that look like long, skinny < and > symbols. These signal you to perform and . This basically means that you should start the song at a medium volume (signified by the mf  symbol at the start), then get louder very gradually until you reach the climactic high G, which should be fairly loud (signified by the ff  symbol underneath it.) After this, decrease in volume to a moderately loud level until the end of the song. Don't go overboard with the loudest notes. You want to play strongly and powerfully, but if you play loud enough to hurt your listeners' ears, you'll diminish the seriousness of the song. In addition, on most instruments, extra-loud notes are hard to control tonally — you do not want to miss a note during the climax of the song.  ", " Let the final note slowly \"die\". Notice the under the final note on the sheet music. This is Italian for \"dying\" and it means exactly what it sounds like. When you play the final note, hold it longer than you normally would and let its volume gradually decrease as if it is \"dying away.\" When you finish playing the note, it should be very quiet — as if you're almost playing nothing at all. The contrast between the climactic high G and the final dying C note can be very powerful if done correctly. The effect this creates is one of powerful emotion giving way to gentle, almost tragic resignation. The special significance of this part of the song at funerals is obvious.  ", " Play \"loose\" with the rhythms for emotional effect. \"Taps\" is often played as a — that is, a slow, rhythmically simple song where the beauty of the tones is more important than the rhythms being played. This means that you can be creative when it comes to rhythm and tempo. As long as the relative lengths of the notes are preserved, don't be afraid to make individual notes longer or shorter than the music says if it gives the piece more emotional power. For example, one change you might make is to slightly slow down the tempo during the climax of the song to give the notes a \"bigger\", more powerful effect. There are many more changes you may want to make like this. The exact changes you make are up to you! In addition, it's worth remembering that since you'll almost always be playing taps solo, you don't need to worry about matching tempo with other players.  "]}}, "How to Play the Guzheng (Chinese Zither)": {"description": "The guzheng is an incredibly unique and interesting instrument to play. Many people like the sound of a guzheng because it can be soothing and relaxing. If you have access to a guzheng, this wikiHow will teach you the basics and how to get a great sound out of it.", "content": {"Learning the Basics": [" Know how to put on your artificial nails. Guzheng players will need artificial long nails so they can play the strings. The nails are usually a brown-white marble colour, and for beginners, you'll usually need 3 of them, including the special one for the thumb. Get the tape. The tape comes in many colours and is used to stick the nails to the fingers. You'll need about 6–8 centimeter (2–3 in) of tape for each nail. Stick one end of the tape to the nail. Put the nail before your first joint on your finger and wrap the tape around the finger.  Test the nail on the guzheng to see if it works. Simply pluck a string. Use the above steps for the middle and index fingers. For the thumb, follow the same steps, except you should turn the nail at a 45-degree angle to the right.   ", " Learn the basics of plucking the strings of the guzheng. When plucking the strings, you shouldn't use your wrist to give you strength, but instead, you should use your fingers to give you the strength to pluck the strings. Practice moving your fingers into a curve, then back up. These are the basic techniques for plucking: To pluck the string with your thumb, position your thumb at a place where it will be able to make a sound out of the string. If you put on your nail correctly, the thumb should be able to pluck the string.  The name for the thumb's plucking is \"tuo\". In music, its symbol is a shape of a right angle. To pluck the string with your index finger, tuck all the other fingers in your palm. Use your index finger to pluck the string, and during that, quickly move it so it aligns with the other fingers in the palm.  The name for the index finger's plucking is \"mo\". Its symbol is a slash. Pluck the string with your middle finger. Do the same as you would with the index finger, except use the middle finger.  The name for the middle finger is \"gou\". Its symbol is a rainbow-like shape. Try using your ring finger to pluck. Only do this when you have mastered the other 3. Pluck it the same way as your index finger.  This is called \"da\". It is represented by a mountain-like structure. During, before, and after plucking, your other fingers should be curved in your hand.  ", " Understand how to tune your guzheng. To tune your guzheng, open the box on the right-end of the guzheng. There should be many little silver keys. To do the steps below to tune it, you should have a tuner to check your notes and a lever to adjust the strings. Play a note on your guzheng while the tuner is on. If the machine flashes a green light, you can move onto the next note. If it flashes a red light, figure out what to do. If the line is pointing toward the left, it is flat and the string needs tightening. To do this, get your lever and position it on the corresponding silver key to the note. Push it forward a bit. Then check it again, then repeat. If the line is pointing to the right, it is sharp and it needs to be looser. Do the opposite of the above: push it backwards to loosen the string. Repeat for all strings.  ", " Learn to read guzheng music. In guzheng music, there are only 5 notes: C, D, E, G, and A. F and B can be made by manipulating the strings, but the basic 5 are the pentatonic C scale. In order to understand which note is which, find the green strings on your guzheng. Every green string represents an octave. Every green string is the note G. Counting down from the green string, the notes are A and C. Counting forward from the green string, the notes are E and D. In Chinese music, all the notes are represented by numbers. C is 1, D is 2, and so on. Note that G is still 5, not 4. Next, you'll need to learn the octaves of Chinese music. The highest note, C, on the guzheng is the string that is closest to you. The lowest note, also C, is the string that is furthest away from you. The highest C will have 2 dots above it in sheet music. So, that will be represented by 1 with 2 dots above it. The lowest C will have 2 dots below 1. The second note that is most towards you is A. Therefore, it will be 6 in Chinese music. It will have only 1 dot above it. The second note that is farthest from you will be D. It will be 2 and have 2 dots below it in Chinese music. Note that when you get more advanced, you will try G and A scales, which involve the lowest note being G and the highest being G. It can be done by manipulating the wooden blocks.  ", " Play a simple song. There are many simple songs you can find on the internet, so try one! Go for songs with a simple rhythm, as those are easier for beginners. Don't play something like \"Twinkle Twinkle Little Star\", as that requires an F. Since it requires more technique to play F on the guzheng, it's best if you don't try as a beginner. Learning plucking and getting basic knowledge of the strings are the top priorities.  "], "Learning More Advanced Techniques": [" Try doing a glissando. A glissando is when you simply start at one string then move the hand to pluck every single string until you stop at another string. It is similar to the piano glissando. When doing a glissando with your thumb, shift the other parts of your hand forward.  ", " Try plucking away from your palm. This is the opposite of basic plucking. This takes practice, but the result is worth it! Start by doing this with your thumb, then move on to other fingers. This can be done by any finger, though it is almost never done by the pinky.  ", " Play some chords. Using your right hand, use your thumb and another finger to play a chord (two notes together). There are 2 forms of this- playing a chord with your index and thumb, or middle finger and thumb. For 2 notes that have less than 4 other notes between them, use your index and thumb. For 2 notes that have 4 or more, use your middle finger. Make sure not to touch other keys when playing the chord.  ", " Try doing double plucking. This is when you pluck the same note using the same finger two times in a row. Make sure to do it quickly! This can be done by either plucking away and toward your palm. Make sure all the plucks after the first one are done quickly and without putting the artificial nail on the string before plucking. If you put it on the string before plucking after the first pluck, it will result in the vibration being lost and a bad noise.  ", " Incorporate your left hand. Here are a couple of ways you can do this: When playing the note E, on the other side of the guzheng (your left side), press down on the string. The note will turn to an F. To play B, pluck the note A while pressing down on the other side. Use your left hand on the right side to do some simple glissandos and chords/notes. Right after playing any note, lightly press down on the left side for a fun effect.  ", " Play songs that are quick-beat. These songs sound very good once you get the hang of it! To play these songs you'll need practice. "]}}, "How to Blow a Viking Horn": {"description": "Viking horns are usually carved out from a cow horn and produce a low note when you blow into them. Playing a Viking horn is similar to playing atrumpetor another brass instrument, but it can take a little practice to get used to. Once you develop your form and can play a note on the horn, you can change the tone and volume of it with some minor adjustments.", "content": {"Playing the Horn": [" Tighten the corners of your lips together to practice “buzzing” them. Keep your lips looser in the center and tight in the corners as if you’re saying the letter M. Vibrate your lips together to make a consistent buzzing noise. Put your hand in front of your mouth and check that you’re blowing out a consistent airstream or else you won’t be able to play the horn very well.  It may take a few tries before your lips start buzzing.   ", " Hold the narrow end of the horn tightly against your lips. Grab the horn by the narrow end, leaving about 1–2 inches (2.5–5.1 cm) between your hand and the tip of the horn. Press the hole at the end of the horn against the middle of your lips so no air can escape out the sides. Position the wide end of the horn so it’s pointing up so the sound of your horn resonates better.  You can buy a Viking horn online. While they are regularly made with cow horns, you may be able to find horns made from many different animals. You can also try putting the Viking horn on the side of your lips if your lips buzz more there. Don’t put any part of the horn in your mouth since it won’t play any notes otherwise.  ", " Buzz your lips on the horn to play a note. As you’re holding the horn against your lips, start buzzing them as you practiced earlier to produce a sound from the horn. If you don’t hear any noise from your horn, then readjust the horn on your lips and try again. Check that no air escapes out the sides of your mouth or else you won’t get a solid, strong tone. Practice holding the note on your horn as long as you can so you can perfect your form.  Viking horns can only play a single tone that depends on the size and shape of the horn. Longer horns take more air to play a consistent note, so take a deep breath before you start playing. Larger horns produce a lower tone while smaller horns are higher pitched.  ", " Click your tongue on the roof of your mouth to play separate notes. After you’ve practiced holding a consistent tone on your horn, click the tip of your tongue against the roof of your mouth just behind your front teeth while you’re playing. Each time you lift your tongue, you’ll block the air for a brief moment and play short, separated notes. Try clicking faster and slower to change the rhythm of the notes you’re playing.  Practice without your horn by putting your hand in front of your mouth while you practice clicking your tongue. You should be able to feel the breaks in the airflow each time your tongue touches the top of your mouth.  "], "Changing the Horn’s Sound": [" Purse your lips more to play higher octaves of the same note. While Viking horns only have a single tone, you may be able to play higher pitches by changing your mouth posture. Tighten the corners of your lips more and keep your lips pressed together to limit your airflow more. When you buzz your lips on the horn, the faster air will make your note sound higher pitched. Practice playing your horn while you tighten and loosen your lips to play 2 or 3 different notes.  Large horns may be more difficult to create a higher pitch than smaller horns. You can usually play 1 or 2 different octaves on a Viking horn.  ", " Put your hand in the end of the horn to lower the pitch. Turn your horn so the wide end faces toward your free hand. As you play your note, place the bottom of your palm on the outer rim of the horn’s wide end. Wrap your fingers over the rim so they’re inside the horn. You’ll notice the note change to a lower tone as you put your hand inside the horn and get higher when you remove it.  Don’t block the end of your horn completely or else it won’t make any noise.  ", " Get a horn with a mouthpiece if you want to play louder. Some Viking horns have a built-in mouthpiece that makes it easier to form a tight seal. Look for a horn with a metal mouthpiece and play it as you would normally. The mouthpiece will help amplify the horn so it’s louder when you blow into it.  If you want to add a mouthpiece to your existing horn, you may need to carve the hole on the narrow end to make one fit.  "]}}, "How to Play an Acoustic Bass": {"description": "The acoustic bass (not to be confused with the double or upright bass) is an integral part of many music styles, including folk, rock, jazz, country western, bluegrass, and even traditional mariachicancións. The instrument, which is prized for its rich, deep sound, is similar in construction to a standard acoustic guitar, only slightly larger and tuned one octave lower. As with any other musical instrument, learning to play is all about getting comfortable with the instrument and dedicating lots of time to practicing the fundamentals.", "content": {"Holding the Instrument": [" Take a seat in a comfortable position if you want to play sitting down. Perch yourself on a stool, chair, or similar seat and lay the instrument across your lap on its side. Use the thigh on your non-dominant side to support the body of the bass and put the neck at a slightly upward angle. If you're right-handed, for example, you'll prop the instrument up on your left knee, whereas if you're left-handed you'll rest it on your right knee.  Be sure to choose a seat that isn’t too low. Your thighs need to be at least parallel with the ground in order for you to sit up nice and tall above your instrument. Though the acoustic bass can be played either sitting or standing, it is most often played seated.   ", " Learn to play standing if it feels more natural for you. Some bassists prefer to remain on their own two feet. To play in a standing position, you’ll need to either attach a strap to your instrument or hold it firmly by the neck while pinning the body to your lower abdomen using the forearm of your plucking or picking hand.  When playing standing, the instrument should fall right at around hip-level. If you decide to use a strap, buy an adjustable one that will allow you to raise or lower your bass with ease.   ", " Grip the neck of the bass with your non-dominant hand. Hook the first knuckle of your thumb over the upper edge of the neck. Flatten the palm of your hand around the curved back of the neck and let your fingers close lightly over the strings. This is a good hand position to assume when you’re not actively playing.  If you’re right-handed, hold onto the neck with your left hand. If you’re left-handed, use your right hand instead. You'll use this hand to fret, or press down on the strings to change the pitch of the sound produced when you pluck or pick them.  Left-handed players will also need to be careful to buy or rent a left-handed instrument.  ", " Drape your other arm over the body of the bass. More specifically, your forearm should rest on the broadest part of the instrument where it widens out below the sound hole. This will put your dominant hand in the perfect position to manipulate the strings. Try to keep this hand as loose and relaxed as possible the entire time you’re playing.  You may need to shift your forearm up or down a little, depending on how long your arms are. Do what feels best for you. Some basses have heavily-contoured bodies that allow you to rest your arm more comfortably.  "], "Plucking and Fretting": [" Learn how to properly tune your bass . Before you begin playing, it's important to make sure that your bass is in tune. Turn the small pegs on the instrument’s headstock to adjust the length of each string and change the note that it makes when played open, or unfretted. Tightening a string (twisting the peg clockwise) will make it go up in pitch, while loosening it (twisting the peg counterclockwise) will make it go down.  Use a clip-on or electronic tuner to confirm that each individual string is tuned to the right note. Most 4-string basses use standard “E” tuning. In “E” tuning, the notes should run, “E, A, D, G,” from the first (thickest) string to the fourth (thinnest).  If your bass has 5 instead of the usual 4, you have the option of making the extra string either low (B, E, A, D, G) or high (E, A, D, G, C). For a 6-string bass, you would add both a low and a high string: B, E, A, D, G, C.  ", " Use your index and middle fingers to pluck the strings. Reach down and press the pad of your finger into the string, then pull it back and release it with a quick, fluid flicking motion. Do your best to keep your ring and little fingers out of the way while you're plucking. This will get easier with a little practice.  Rest your thumb on the first (thickest) string, or just above it on the body of the instrument. You can also use your thumb to gently mute the first string while playing the neighboring string. Focus on plucking smoothly at a moderate speed. Plucking too hard or fast may result in unpleasant string buzz, while plucking too slow or soft can stifle the sound and make it hard to hear.   ", " Pick the strings if it’s easier for you. If you haven’t yet gotten the hang of plucking or you’re used to playing a normal guitar, you may be more comfortable using a pick. Hold the pick between the thumb and forefinger of your dominant hand and drag the tip over the section of the string that lies just in front of the sound hole to pick the note.  Make sure you select a pick that’s thick enough to hold up to being raked repeatedly over the heavy strings.  Picking the strings as opposed to plucking them can help the sound come through a little better when playing with other musicians, but may not produce quite as deep or rich a sound.  ", " Fret the bass with your free hand. Press down lightly on the open space just above the fret with the tip of your finger as you pluck or pick the same string. This effectively changes the length of the string, making it possible to play different notes. Experiment with fretting the string at various points to get a sense of the sound it makes.  The lower down on the neck you fret, the higher the resulting note will be, and vice-versa. Learning to fret can be pretty tricky, especially if you’ve never played a stringed instrument before. Have patience and be prepared to spend lots of time refining your technique. The more you practice, the more intuitive it will begin to feel.   ", " Practice some scales. Scales are sets of notes that are ordered by key or pitch. Learning a few basic scales can help train you to navigate the fretboard while also giving you a practical understanding of how notes are arranged and played in relation to one another.  Some of the most useful scales for newcomers to pick up include the major scale, the major pentatonic scale, the natural minor scale, the minor pentatonic scale, and the blues scale.  Scales serve as the foundation to different styles and modes of music, so it will be very important to familiarize yourself with them as you develop your skills, especially if you plan on eventually writing your own original songs.  "], "Sharpening Your Skills": [" Teach yourself to read tabs . Tabs (short for “tablature”) are a type of musical notation designed specifically for guitars and other fretted instruments. Bass tabs are written using 4-6 horizontal lines that represent the instrument’s strings and numbers that indicate where to place your fingers on the fretboard. They're read from left to right, making it easy to see right away which note comes next in a particular sequence.  The pairing “G3,” for example, tells you to finger the third fret on the fourth string (G). If you encounter 2 or more numbers that are lined up vertically, it means that the corresponding notes should be played at the same time.  ", " Watch instructional videos online. Websites like YouTube can be excellent resources when it comes to finding free video tutorials for players of all skill levels. Just type in what you want to learn and take your pick of any number of videos on that topic. One advantage of following along with a video is that you can pause, replay, or jump ahead whenever you need to, allowing you to progress at your own pace.  To ensure that you’re getting sound information, search for videos uploaded by reputable music companies, or those with polished production that look like they were made by an experienced player. If you want to elevate your playing to the next level, consider signing up for an online course presented by a professional musician or music teacher. These sorts of programs often go into much greater detail about things like technique, mechanics, and theory.   ", " Take bass lessons. Run a quick search for “bass instructor” plus the name of your town or city to pull up the names of some qualified instructors in your area. Most music teachers are also musicians themselves, which means you’ll have the opportunity to learn key principles from someone who knows their stuff. A flesh-and-blood instructor will also be able to observe your playing and offer helpful tips, critiques, and practice exercises.  The bulletin board at your local guitar shop or music store can also be a good place to get  a lead on a teacher. You may also have some luck with sites like Takelessons.com that match students with prospective instructors. Just be sure to pull up a few reviews of each candidate before handing over your hard-earned money.   "]}}, "How to Study an Unusual Musical Instrument": {"description": "While everymusical instrumentis special and interesting in its own way, there are some people who like to stand out in the crowd. While there are definite drawbacks to playing a more obscure or even obsolete instrument, there are also several advantages. You'll have something new and exciting to offer to solo music festivals, you'll qualify for goodscholarship opportunitiesand have less competition, and you'll have a lot of fun as well.", "content": {"Steps": [" Acquire some prior musical experience. While not always necessary, it is highly recommended. If you already know how to read music and have at least a basic understanding of a more common instrument, you'll have a lot more luck with learning the new one. A little understanding of transposition and/or composition wouldn't hurt either, especially if you pick an instrument with little or no music written for it.  ", " Choose an unusual musical instrument to study. When making your decision, keep in mind questions such as the following: How \"weird\" do you want to be? (Do you want an unusual but still recognized concert instrument, or something so weird that only one man alive knows how to put it together?) How much can you afford to spend? (As more unusual instruments tend to be more expensive and in short supply) Will you actually be able to play this in public? (Or is it found in any band or orchestra?, if you wish to play in such a group.) Then, take a look at your options: .]] - Some instruments are called \"scholarship instruments\" by band directors as they are a part of a typical concert, , and/or , but they're not as common as, for instance, the trumpet or clarinet. These include the , contrabassoon, , Bass Saxophone, Soprano Saxophone (though this one isn't as common or necessary as some others), Flugelhorn, Mellophone,  Alto Clarinet, Alto Trombone, Alto Flute, Contrabass Clarinet,  Marimba. If you are already playing percussion instruments, you may wish to pick one unusual instrument to specialize in, such as the Vibraphone, Crotales, or Marimba. Most of these instruments have method books and a decent amount of music written for them. .]] - This is a good route to take if you already have experience on a \"basic\" instrument, such as the , , , or or . These families include specialized instruments that have much higher or much lower ranges. Take a look at the  families of the , flute, saxophone, and guitar. You can also take the bassoon and oboe a step forward, as they have unusual family members too. player.]] - Look into your family's history. You may find that there is an interesting instrument that is native to your family's home country. For instance, an Australian may wish to look into the . Similarly, you can look into instruments from other cultures and combine your musical experience with a learning one. You can also learn to play an older variant or ancestor of a current instrument, such as the shawm (oboe), curtal (bassoon), or rebec (violin, viola), or an instrument with a significant place in history, like maybe the musette de cour, (an indoor type of bagpipe connected with the French court used even for operas of the 18th century) that interests you. However, be warned that this can get expensive, especially if the instrument isn't mainstream or even manufactured anymore.  ", " Purchase or rent the instrument and all accessories needed to play it. Depending on the instrument, this could be as simple as a drive to the nearest music store, or you may find yourself paying thousands of dollars to ship one from the other side of the world. Be sure that you can either buy or make things such as reeds, if applicable. Keep in mind that you may be able to use reeds or mouthpieces from an existing instrument on yours, if they're similar enough. If available, a method book will be a huge help in learning to play. ", " Begin learning to play. Be patient, this can be difficult and will probably take a while. If you're having trouble, ask a band director, conductor, music professor, or fellow performer to help. You may also be able to contact an expert in your instrument via the internet. In time, you will develop a skill that few other people will share. ", " If you haven't been doing so already, join a group or start performing. Look around for opportunities: Check out school or professional bands and orchestras, instrument ensembles, jazz groups, or church groups, if you think they may need your instrument. Otherwise, look into opportunities for solo performances. ", " Stick with it. Be proud: you can play an instrument that few other people have mastered... or may not even have heard of. You may wish to branch out into other similar instruments, or get to the top with this one. It's your choice, but remember to be proud of your accomplishment. "]}}, "How to Adjust a Truss Rod on a Bass": {"description": "A truss rod is a steel bar that runs through the neck of a bass guitar and helps to stabilize it. Over time, the wooden neck of your bass will bend or straighten slightly because of factors like the constant pull of the strings and changes in temperature and humidity. Fortunately, you can easily adjust the truss rod with an Allen wrench to move the neck back in line so your bass can continue to produce quality sound.", "content": {"Measuring the Space": [" Hold the bass in playing position in your lap. Rest the bass guitar in your lap as though you were going to play it. Balance the body of the bass on your lap so you can use both of your hands to adjust the truss rod.  Laying the bass flat puts tension on the neck, which will affect the accuracy of your measurements and adjustments.   ", " Clamp a capo across the first fret at the top of the fretboard. Take a capo and squeeze the handle to open it. Place it over the 1st fret at the very top of the neck of the bass and clamp it into place so all of the strings are depressed over the fret.  A capo is a device that attaches to the neck of the bass to hold down the strings across a specific fret, which are the small metal lines along the neck. You can find capos at music supply stores and online.  ", " Press the E string down on the fret where the body and neck meet. The E string is the largest string and is the first string from the top when you’re holding the bass in playing position. With the capo in place across 1st fret, locate the fret where the body of the bass connects with the neck. Use your finger to press down on the string and hold it so it stays depressed.  ", " Slide a 0.015 in (0.38 mm) feeler gauge beneath the string on the 7th fret. A feeler gauge is a thin blade that’s used to measure small gaps. Take a feeler gauge and check to see if there is space between the E string and the metal of the 7th fret. If there’s space, then the truss rod needs to be tightened. If the feeler gauge lifts the string when you slide it over the fret, then the truss rod needs to be loosened.  You can find feeler gauges at hardware stores, department stores, and online.  "], "Turning the Truss Rod": [" Unscrew the truss rod cover if your bass has one. At the top of the neck of your bass, look just below the strings for a small slot. If there’s a small screw covering it, use a Phillips screwdriver to take off the covering to expose the truss rod. Set the cover aside so you can replace it later.  The truss rod look like a slot that fits an Allen wrench. Not all bass guitars will have a cover over the truss rod.  ", " Insert an Allen wrench into the truss rod adjustment at the top of the neck. Take an Allen wrench that fits the slot for the truss rod adjustment. Insert it so the wrench is sticking straight up so you can turn it left or right. Keep the wrench in place.  Different bass guitars may have differently sized truss rod adjustment slots, so you’ll need to use an Allen wrench that fits it.  ", " Turn the wrench to the left if the feeler gauge lifted the E string. If the feeler gauge raised the first string whenever you slid it beneath it on the 7th fret, then the truss rod is too tight and needs to be loosened to ease tension on the neck of the instrument. Rotate the Allen wrench counterclockwise, or to the left, about 1 inch (2.5 cm).  Use a gentle rotation so you don’t put too much stress on the truss rod at once.  ", " Rotate the wrench to the right to tighten the truss rod. If there was extra space around the feeler gauge whenever you checked the E string, then the truss rod is too loose and needs to be tightened to counteract the pull of the strings on the neck. Give the Allen wrench about a 1 inch (2.5 cm) turn to the right, or clockwise to tighten it.  Use small movements to adjust the truss rod so you don’t bend or warp anything.  ", " Recheck the space between the E string and 7th fret with your feeler gauge. Once you make an adjustment, leave the wrench in the adjustment slot and take another measurement. Press the E string down on the fret where the body and neck meet with your fingers and use your feeler gauge to check the space between the string and the 7th fret.  Check the space anytime you make an adjustment.  ", " Make adjustments until the E string is even with the fret. As you turn the Allen wrench to tighten or loosen the truss rod, take measurements with your feeler gauge. When the E string is even with the 7th fret and you’re able to slide your feeler gauge beneath the string without raising it or without any extra space around it, the truss rod is properly adjusted.  You may need to make several micro-adjustments to get the truss rod back in line.  ", " Remove the Allen wrench and replace the truss rod cover. When you’re finished adjusting the truss rod, take out the Allen wrench and remove the capo from the neck. If your bass has a truss rod cover, use your screwdriver to screw it back into place.  Don’t overtighten the screw on the truss rod cover or you could potentially crack the wood.  "]}}}