{"How to Organize a Flash Mob": {"description": "A flash mob is an organized routine of a group of performers working together on a large scale to surprise and amuse the general public for a temporary period of time with a spontaneous performance. Flash mob performances can include dances, songs or even record breaking attempts. While doing something with a lot of people on a large scale can be difficult, if you manage to pull off a flash mob, it can be very rewarding for both those participating and observing it.", "content": {"Steps": [" Understand the purpose of a flash mob. A flash mob is about performance and it usually centers around entertainment, causing amusing (harmless) confusion, or satirizing something that members of the audience will immediately understand and respond to. It is about spontaneity , engaging observers in a spectacle which expects nothing from them apart from enjoying what they're witnessing. Some things that a flash mob is : A flash mob is not appropriate as a marketing vehicle for a product or service (despite several attempts at this), political purposes or a . The reason is that these do not carry the element of entertainment or satire without strings attached for the observers. These sorts of events have their motive as an expectation that observers will then do something like buy a product, vote for someone or support a particular cause. A flash mob is an excuse for violence or damaging property. To participate in something that results in this is to be part of a rioting mob or crowd, not a flash mob. Never have the intent to create a violent or harmful event from a flash mob exercise. (Public authorities in some places have taken to naming crime sprees as \"flash mobs,\" but criminal behavior has nothing to do with flash mobs as performance art.)  ", " Decide what you're going to do for your flash mob occasion. The success of a flash mob event is dependent on the originality, liveliness, and attractiveness of the event. Avoid copying a flash mob event that has been performed somewhere else. Always make alterations to any flash mob performance that has inspired you so that it has your own mark of originality and local relevance. In all cases, the performance must be worked out in advance and either rehearsed or well explained in some manner (such as through online instructions) so that everyone knows their role and interactions with the other performers. The most typical flash mob performances involve such activities as: Choreographed dance: an example would be a large group all performing a dance in the park to support a lover proposing to his girlfriend. Singing something such as opera, yodeling, or a pop hit. Any style of singing is fine, but make sure it's interesting. An example would be breaking into song about the wonders of fruits and vegetables while in the supermarket. Acting out a particular scenario: such as lots of people walking invisible dogs on leashes.  : An example would be pretending to try to find a way through a wall that isn't there. Using an existing joyful event to spread love: An example would a wedding, graduation or celebration being taken to a street, mall or other public place to spread the joy!  : Trying to break a Guinness World Record by having the largest gathering doing \"X\" at the same time.  : All members become living statues and freeze.  ", " Watch previous flash mob events on YouTube . There is quite a collection available to watch and this will provide an excellent source of inspiration. It will also as give you ideas about how to handle your group of people and have the performance come together. Like all performance, timing and execution are critical to the success of a flash mob. ", " Organize your flash mob. You'll need willing performers to participate in the flash mob and for that, you can make good use of online resources. Use social media networks, emails, texting and websites to find people for your flash mob. You may also be able to draw on the resources of a class you're in, a performance or dance group you're a part of, or other groups of people you spend time with. Ask your friends and family if they'd like to be a part of it too. Use Facebook, , and websites to bring people together. People will be searching for a flash mob with the words \"flash mob\" or \"flash mob\" so be sure to include these in any message you're creating to find people. Improv Everywhere is based in New York City and while not all of its are flash mobs, some are and you might be able to participate with them if you're located in NYC. Check out . There are many local flash mob websites; just use a search engine to find them using your location name and the term \"flash mob\".  ", " Provide clear instructions to your group of people. The success of your flash mob event will require your participants to know exactly what to do. It is best if you can have a rehearsal beforehand, but if this isn't possible, then at least provide very clear instructions (either online or by email, etc.) as to what to wear, where to be at what time, what to do (for example: Be prepared to freeze, walk, dance , gape like a fish, etc, on the corner of 55th street and 3rd avenue at 7am), and how long to do the act for. If any participants need to interact together, it's best if they rehearse this for the sake of timing and accuracy. If the instructions are simple, such as everyone stand in one place reading a newspaper they've cut eye holes in, then the simplicity of the action will probably mean you don't need to rehearse. However, it's a very good idea for everyone participating to try to meet up somewhere prior to the event to quickly run over the details, what's expected of the event and participants, and what to do when it's over. It's also helpful to explain what to do if people get annoyed or the police try to shift the group. If the instructions are complex, especially where scenes need to be and organized, then consider having a smaller group of people you are certain can turn up to rehearsals and keep fairly quiet about the event, rather than having a much larger and harder to coordinate group. About 50 people can be organized fairly successfully, but higher numbers mean that things start getting trickier. It can be easier to coordinate a dance group you're already involved in. For example, getting a group of your practitioners from the local gym to perform in the street together might be a great chance for the participants to show off what they've learned already.  ", " Arrange any props or costumes needed. It's best to ask the participants to bring their own props or to organize their own costume gear (such as evening wear, swimsuits, wigs, whatever) but sometimes you'll need to provide things for everyone (such as dog leashes a collar for an invisible dog walk). If the props or costumes are difficult for people to find or make on their own, consider holding a workshop beforehand in which everyone has the opportunity to create the items needed. However, you should aim for simple clothes and items, or things that people already have in their wardrobe or house.  ", " Know the limitations of your location. Do a proper check of the area you're proposing to perform the flash mob in. There may be safety, legal, or physical limits on what can be done in the location. To avoid getting into trouble legally, it's important to not create unsafe obstructions, safety problems, or to hold up people in ways that prevent them from their usual business on non-public premises. While there is obviously a balance between encouraging people to watch and blocking people from getting on with their usual activities, you need to judge that your flash mob won't be the cause of emergency or unlawful situations. For example, if your flash mob would be likely to block emergency exits , then think again about where to locate the event. As mentioned above, tell your participants what to do in the event that the or some other authority requests that your group leave. The best option is to do as asked quietly and peacefully. In any case, a well-run, legitimate flash mob will be over and done with before these people even arrive.  ", " Organize quality videography for the event. It's definitely worth having the whole event filmed so that you can upload it to YouTube. Who knows? It might even go viral ! If nothing else, it will serve as inspiration for other flash mobs into the future. ", " Let go.  trust that the flash mob will go according to plan! As the organizer, you remain responsible for ensuring that the flash mob sticks to the plan and doesn't create problems for the public at the event. ", " Finish as if nothing ever happened. Once the flash mob event is over, don't allow the participants to sit around and talk or to start talking to the crowd. They need to mingle back with the crowd and head off into the sunset as if nothing ever took place. "], "Dance Flash Mob": [" Choose a song . Do you want it to be something up-tempo or more mellow? Do you want something well known or something that displays a certain style of music, such as opera?  ", " Find someone able to choreograph. If this is you, great. If not, get someone who knows how to help turn a group dance into something spectacular. ", " Choose your spot for the dance. A park in a major city is a great spot, especially during lunch hour or after work when everyone is heading home. ", " Gather a group of dancers . Flash mob dances can be any number of people but try to aim for at least 50-75. It may sound like a lot to arrange but the more people you have, the more effective the flash mob dance becomes. ", " Teach them all the dance in smaller groups of 4-30. This way you don't have to get too many people in the same room or area at once and they can also entertain the crowd from different perspectives. This is good for people who can't see the whole scene in front of them. ", " Choose a flash mob leader . This will be the best dancer in the group, the person who sets the beat and provides a following point for the remaining dancers. The leader can start the routine with a solo dance move, then attract the next group of 9 to 15 dancers who join in with the next move. Then, double the group's size with 16 to 30 dancers joining in. The trick to a good flash mob is to gradually get all of the dancers involved in the routine. Get the rest of them to join in in the last part of the song so that the entire group is finally involved. ", " Pretend as if nothing has happened. As soon as the song has finished, the dancers must disperse as normal members of the crowd to act as if nothing has happened. "]}}}