{"How to Give Directions": {"description": "Whether you’re telling someone how to get to your house or guiding a stranger to a local museum, you should know how to give good directions. Giving directions, though, is more complicated than just telling someone how to get to a certain location. To give good directions, you need to present the information in the way that’s best suited to how the other person processes information. For instance, some people do better with specific mileages, while others understand rough drive times best. You also have to communicate effectively and pick the most appropriate route in order to help the person stay on track and reach their destination.", "content": {"Guiding Them By Landmarks and Drive Times": [" Picture yourself going along the route with them. Most people follow directions best when they’re given in “route perspective,” which focuses on describing what you’ll see along the way and the travel time between these landmarks. If you were in the car or walking alongside the person, think of how you’d point out the route (“Turn right at the big church over here, then we’ll go that way for about five minutes…”) and use that to guide how you give the directions.  Instead of directing them from beginning to end, think of it as directing them from landmark to landmark.   ", " Tell the person about important and hard-to-miss landmarks. Landmarks will give the person an idea of the progress they’re making. They’ll also let the person know if they’re still on the path you advised them to take. Finally, landmarks will draw attention to each segment of the overall route that they’re trying to follow.  So, for instance: “Go this way for a couple minutes until the old post office with the big metal dome is on your left; then turn left and go for about 5 minutes until you see a McDonald’s and Wendy’s right across from each other…” Some landmarks to point out include: historic buildings, signs, or monuments; churches, synagogues, or other religious buildings; large businesses like a box store or car dealership; geographical/environmental features like hills or rivers; roadway characteristics like a bridge or a fork in the road.  ", " Specify whether something is on the left or right of the road. Don’t take for granted that the person knows what side of the road a turn, a landmark, or their destination will be on. To avoid getting the person lost, always specify which side of the street they need to either turn on or look for a landmark on.  Make it “look on your left for the gas station with the tiger statue above the sign,” not just “turn when you get to the gas station with the tiger statue.”  ", " Provide travel time estimates for the whole trip and each component of it. Specify the how much time the whole trip will take. In addition, specify how much time certain segments of the trip will take. This will give the person an idea of when they need to be ready to take a turn or merge onto a different road.  Let the person know that if they’re traveling the speed limit, they should be able to arrive at their destination in a certain amount of time. If they’ll have to make some turns, tell them how long they’ll be on specific roads before they should turn. For example: “The whole trip takes about 10 minutes. You’ll turn left here and go for about 3 minutes until…”  "], "Mapping Out Distances and Compass Directions": [" Create a mental map of the route, and share it. Some people are better at reading maps than others, and these people tend to also do better when given directions that are the verbal equivalent of looking at a map — called “survey perspective.” These are the kind of people who are good at “getting their bearings” and telling which way north is without a compass, and have a good “feel” for estimating that they just drove for two miles.  In this case, your directions will sound like the following: “Drive north on Hamilton for a little over 3 miles (4.8 km), then head east on Church Street…”  ", " Specify distance from point to point. Include units of distance in every step of your directions. For example, specify how many miles or kilometers the person will stay on a specific road before turning or getting to their destination.  City blocks and highway exits are also an acceptable unit of distance to use, even though the exact distance between them varies: “Go two blocks north, then get on the freeway and head west to the fourth exit…” A rough estimate is better than not giving any sense of the distance from one point to another.  ", " Refer to the cardinal directions. While it’s always a good idea to mention whether something is on the right or left, you should also provide cardinal directions (north, south, east, and west) when you explain a route to someone in survey perspective. And even people who do better with route perspective (following landmarks) often have a vehicle or smartphone equipped with a digital compass, and many road signs (like U.S. interstates) indicate a cardinal direction.  So: “Turn right at the the light onto 5th street and go south for half a mile, then merge onto route 35 South…”  ", " Draw a map. If you’re having trouble verbally communicating directions to someone who understands directions better in map format, just sketch out the route for them. A map will allow the person to visualize where they’re going. You’ll also be able to include details, such as the location of landmarks, on your map. In addition, the map will give the person something to hold on to so they don’t forget your directions.  The rudimentary map doesn’t need to be to scale, but you should write in general mileages and use a general map orientation (that is, with north to the top).  "], "Choosing the Right Route to Describe": [" Explain the route based on where the person is coming from. Before you start giving directions, you need to ask the person where exactly they’re coming from. This is important, as the specifics of your directions will depend on which way they are headed.  This isn’t an issue if a stranger stops you on the street, but it is important to know whether your mother-in-law will be leaving from her house or her office in the next town over.  ", " Give the simplest route. While it may seem tempting to give someone directions to your favorite shortcut, this could wind up doing more harm than good. Instead, give the simplest directions that are least likely to confuse the person. This way, you’ll minimize the chance that the person you’re giving directions to will get lost. When considering the simplest route:  Favor routes with less turns, even if they take a bit longer. Focus on routes where the person can stay on one road for a long time. Pick routes that avoid confusing intersections, roundabouts, or bypasses.  ", " Share the safest route. If there are several alternatives available and some of them are particularly dangerous, give the safest route. As someone who is not familiar with the area, the person you’re advising won’t know the dangers they’ll be driving through. Whether it's treacherous terrain, narrow roads, or high crime neighborhoods, take threats to the person’s safety into account.  The winding back road may save you five minutes versus using the highway, but you’ve driven that road many times and know all the curves and twists — and they don’t.  ", " Don’t suggest routes you haven’t taken. Focus only on routes that you are familiar with. Otherwise, you may wind up giving incorrect directions that could get the person lost. A good rule of thumb is to give directions for routes that you are most familiar with, rather than trying to describe a shortcut or another route you don't know as well.  Skip “Well, my buddy goes this way…” and stick with “I’ve gone this way many times, even if it takes a few minutes longer…”  ", " Warn the person about confusing parts of the route. If there is a particularly tricky part of the route you’re providing, tell the person in detail. In addition, tell them when (time or distance) to expect the confusing part of the route. Some points of confusion could include: Roads that merge with little notice Turns that are very slight Roundabouts   "], "Communicating Effectively": [" Speak slowly and clearly. When giving directions, don’t rush. Enunciate every word you say. Take time to explain important factors like potential hazards or detours. If you don’t speak slowly and clearly, the person may get confused or may miss an important piece of information.  ", " Avoid using words, phrases, or names that only locals will know. Use the names of roads as they’re marked on street signs and road maps. Avoid using road names only used by locals. In addition, don’t refer to people’s homes as landmarks. Any examples you use should be ones that can be recognizable to someone from outside your community. Even if all locals know the highway as the “Parkway East,” refer to it as “I-376 East,” which is what the road signs read.  ", " Don’t assume the person knows anything about the area. Even if you think they might be a bit familiar with the place, give directions as if the person knows nothing of local landmarks, main roads, or even the names of roads. Provide all of the information they need to get to their destination. They can always let you know if you’re giving more detail than is necessary.  Avoid things like “Remember where Joe’s old house was? You’ll turn right after that” and go with “You’ll turn right at the stoplight onto 11th Street, which comes about half a block past where Joe used to live.”  ", " Ask the person if they have any questions. Be direct and ask \"Do you have any questions about the route?\" Asking will allow the person to clarify any part of the route they might not fully understand. In addition, it will give them the opportunity to ask you for the location of any other places they may be interested in visiting. ", " Request that they repeat the directions to you. Suggest that the person summarize the directions you’ve just given to them. This way, you’ll be able to make sure that they understood you completely. Then, if they did misunderstand or mis-hear you, you’ll be able to correct them. If they seem to be struggling with the directions you’ve given in “route perspective” form, consider trying “survey perspective” instead — that is, replacing visual landmarks with mileages and north, south, etc.   "]}}}