{"How to Think of a Show Name for Your Horse or Pony": {"description": "If you are planning to show your horse, you may want to come up with a more interesting name than what you call your horse on a daily basis. If your horse is registered with a particular organization (e.g. AQHA, the Jockey Club, etc.) you will need to contact the organization to confirm their rules about show names. When choosing a show name for your horse, you can draw from multiple sources of inspiration. You can build off of your horse’s stable name or personality. You can draw inspiration from your horses breed or appearance. You can also ask friends for ideas or look through name books.", "content": {"Brainstorming Ideas Based on Your Horse": [" Use your horse’s stable name as the main inspiration. Most horses aren’t called by their show name every day. That is because these names are usually a bit long and impractical. However, you can use the name you typically call your horse by as a good source of inspiration.  Think about your horse's stable name and try combining it with descriptive and creative word(s) of your horse's glory in the show ring, your horses personality, or your horse's favorite things to do. For example, if you have a mare called “Autumn,” you could call her “Autumn Glory,” “Autumn Charm,” or “Autumn's Mischief.” If you have a gelding called “Blaze,” you could call him “Blaze's Pride,” or “Copyrighted with a Blaze.”   ", " Make the stable name more interesting. You can choose a totally different show name, but still use your horse’s stable name as inspiration. Think about your horse’s name, and then come up with a way of describing that name. For example, if you owned a filly named “Star,” you could call her “Born to Shine,” “Shine Forever,” “Bright Future,” or “Shining for Life.”  ", " Come up with several variations. You don’t have to choose your horse’s name in one day, so spend time coming up with different variations of your horse’s name. Write them all down no matter how good or bad you think they sound at first. If your horse’s stable name is “Dash” then there are lots of potential show names. For example, “Thunder Dash,” “Slap Dash,” “Mad Dash,” or “Silver Knight.”  ", " Consider your horse's abilities. If you want to show your horse, then they may have a skill that they are particularly good at, and this could serve as a good source of inspiration for your horse’s show name. If your horse is a jumper, you could call him “Jumping at Dawn.” If your horse prefers classic dressage, you could call her “Just a Classic.” Most race horses have names that are in some way associated with running (e.g. “Bluegrass Stampede”).  ", " Use your horse’s past as inspiration. If your horse has a particularly interesting past then you can include this in their name in some way. For example, if your horse was rescued from a bad situation, then you could combine their stable name with “Second Chance.” For example, “Risby’s Second Chance.”  "], "Using Physical Traits for Inspiration": [" Name them based on the name of the parents. It is quite common to choose your horse’s name based on their lineage. If you have access to the information, look for the names of the dam (the female horse) and the sire (the male horse). See if you can combine the names in an interesting way, or if these names inspire you. For example, if one horse was named “Midnight Lady” and the other was named “Crown Jewel,” you could call your horse “Midnight Jewel” or even “Crown Lady,” if your horse is female.  ", " Think about where your horse was bred and born. If your horse was born in a notable place, then consider using the name of the town or city in their name.  For example, if they were bred in Sligo, then why not call them, “Sligo Spot On” or “Sligo’s Star.”  ", " Consider the origins of your horse’s breed. Many horse breed names refer to where in the world that breed comes from. You can use the breed name or the name of the country as inspiration for your horse’s name.  For example, an Arabian could have a name that has something to do with an Arabian sheik or the desert. A Mustang could have a name like “Wild” or “Heart of America.” An Andalusian horse could be called something like “Andalusian Surprise” or “Spanish Beauty.” You can also add a bit of the language of that country to the name. For example, if you have a French bred horse, they could be called something that starts with “Le …” (for a male horse) or “La …” (for a female horse).  ", " Think about your horse’s color, interesting features, and markings. Many horses are named for something that makes them look unique. Spend time thinking about what physical features make your horse interesting. Maybe they have mane that falls in a unique way, or markings that form a shape, or maybe they have a beautifully colored coat. If using your horse’s coat color as inspiration try to be creative. Rather than choosing a name like, “Chestnut Boy” for your chestnut colored horse, try names like “Firebird” or “Dark Star.” With markings, you can always use common names of markings (star, snip, blaze, stripe, etc.) to add to your horse's barn name. This is a fairly common practice though, so your horse’s name is unlikely to be especially unique.  "], "Finding Inspiration Elsewhere": [" Look at books. You can go to the library and look through name books or you can purchase books, if you want. You might be able to find books that are specific to horse names, but it is not uncommon to give a horse a human name so don’t forget to skim through some baby name books.  Don't be afraid to use a unique name that isn't used nowadays. Looking through library books will save you money. Unless you have a lot of horses, you probably will only use the book once, so the library is a good option.  ", " Ask friends for help. Some people are great at coming up with cool names. Friends will probably have a fresh perspective, so don’t be afraid to ask for suggestions. If a friend gives you a suggestion, write it down on your list, and say, “Thank you!” Don’t suggest that you’re going to go with the name just to be polite. They may feel offended if they think you’re going to use their suggestion, and then find out you’ve chosen something else.  ", " Consider naming your horse after your stable or your sponsor. If you live on a ranch or farm that has a name, and you bred your horse yourself, you can name your horse after that. If you keep your horse at a stable, you can include the name of stables. If you are sponsored by someone, you might consider including that person’s name, the name of their ranch/farm/stables, or the name of their business as part of the show name.  For example, if you keep your horse at a stable called, “Winter Creek” you could call your horse “Winter Creek’s Surprise.”  "]}}, "How to Prepare for a Horse Show": {"description": "Anyone who has ever shown a horse knows the thrilling but sometimes stressful times right before you enter the arena. Rather than waiting until the last minute to prepare for a show, take steps from well before the event to get ready and you'll have your most relaxing and successful show yet!", "content": {"Preparing Your Horse Far in Advance": [" Groom on a daily basis year-round. If you want a truly show-ready horse, keep their coat in perfect order all the time. Grooming your horse every day does two things: increases emotional bonding, and increases the health and shine of their coat. A win-win situation, huh? Spend the most time with a curry comb to work out dirt and loose hair that cause your horse to appear dull and dusty. Be sure to pick your horse’s hooves on a daily basis as well. Keeping them clean will make it more comfortable for your horse, and better-looking in the long run. Spend time brushing the dock of your horse’s tail to stimulate hair growth. Your horse’s tail will end up becoming fuller and more healthy as a result of spreading the natural oils and stimulating the hair follicles.   ", " Feed your horse a coat-enhancing grain. There are many different feed products on the market that are full of the nutrients necessary to enhance the thickness and shine of your horse’s coat and mane/tail. If your horse is able (based on dietary circumstances), incorporate one of these grains into their regular eating throughout the year, at least several months prior to a show. You can also feed your horse small servings of dried bread crumbs. This really will make their coat shine, just be careful to not make your horse sick!  ", " Take care of your horse’s mane and tail. If the mane and tail of your horse are constantly ratted and full of debris, it will be very difficult to get them looking good in time for showing. Brush your horse’s mane and tail thoroughly every time you groom them, and rub in some cocoa butter once every few days. This will act as a conditioner, making their hair thicker and softer over time. When necessary, use a detangler to help reduce the number of knots.  their mane and tail occasionally (when flies are low) to keep the hair from getting in more knots.  ", " Keep up your horse’s medical treatment. A horse that is underweight, overweight, has worms, or any other illness/ailment won’t show as well. Make sure that you are keeping your horse’s health in mind throughout the year, instead of doing last-minute worming and medication the week of a show. A healthy horse will work better and be much more presentable than an unhealthy horse. You should also ensure that your horse is up to date on its vaccines and meets any other important health standards.  "], "Getting Your Horse Ready 1-2 Days in Advance": [" Bathe your horse. It's best to bathe the horse the night before so your horse is clean and ready to go.If you clean your horse before the night of the show, your horse could get dirty and you would have to clean them again. Beware of using shine-enhancing formula around the saddle area though, or you might run into the issue of a slipping saddle or saddle pad. Another benefit of bathing the horse the night before is that there is less time for them to roll about etc. to make themselves dirty again.  ", " Clip your horse. Clip the fetlocks  on your horse's legs closely, as well as the longer hairs that grow on your horse's muzzle, face, ears, and throat. Clip the hair that falls onto your horses hooves straight. Clipping is important! Always clip your horse a nice, clean bridle path - for stock horses, the length of the ear but for light breeds about an ear and a half. Clipping adds definition to your horse's body shape and improves the overall presentation before the judge. Do not trim your horses if they are heavy horses, such as Friesians or Clydesdales. If you're planning on a full-body clip, do so 1-2 weeks prior to the show. Clipping the entire body gives the coat a dull appearance until the oils are spread out again and the coat grows back a bit.   ", " Whiten any white socks or sections on your horse. A white horse or horse with socks that appears brown, grass-stained, or dingy won’t score as well with judges. Use a whitening shampoo to thoroughly scrub all white areas on your horse, allowing it to set and soak in for about 5 minutes before rinsing it off. Then, coat white socks or stars with cornstarch or French chalk to keep the white looking white. If your horse gets their socks dirty before the show again, use baby powder to cover it up. Wrap white socks with standing wraps to keep your horse from dirtying and staining them before a show.  ", " Take care of your horse’s mane and tail. Wash the mane and tail with a specialized shampoo, and use a whitening product if your horse’s hair is white. Add in a detangler to make sure that there are no knots to get your comb caught on. Then, use a metal pull brush to thin out too-thick manes, or use a specialized mane razor to accomplish the task. Finish off by braiding or banding the mane and tail for the show. By braiding the mane and tail a few days in advance, even if you intend to have their mane and tail loose, it will keep it from getting tangled and add a lovely wave to the hair. If you’re banding the mane, cut off excess hair after banding. This will help it to look more precise and avoid the need to cut it twice. Wrap the tail with a tail bag or long sock to keep it from coming undone or getting caught on anything.  "], "Packing for the Show": [" Prepare your horse's food and water. Because shows are often stressful areas for horses (with all the other horses and people present), it is important to try to keep as normal of a feed schedule as possible. Get all their regular food and at least two buckets for water. When you get to the show, try to feed them at the same times as you normally would at home. ", " Gather all your tack. The worse thing is showing up to a show missing some of the necessary tack and equipment that you will need. Make a checklist of everything you will need for the show, including any riding or exercise gear and blankets. Put all of these together and check them off your list prior to leaving, just to make sure you’ve gotten everything you could possibly need. Clean and polish all tack before heading to the show for the best presentation. Check with your show circuit's regulations; some bits, aids and pieces of tack are prohibited. For example, 4-H has severe restrictions on the types of bits used, and some riding clubs or associations don't allow figure-eights, draw reins, etc.  ", " Get a trailer companion prepared, if necessary. Driving long distances in a trailer can be especially stressful for some horses. Rather than arriving at your show with a frightened, anxious horse, help to minimize their anxiety by bringing another horse along for the ride. They’ll be much more calm upon arrival than if you hadn’t. ", " Prepare the necessary stall equipment. Call the event venue that you are showing at, and see if you need to bring your own bedding for the stall. Many shows require that you bring your own shavings to fill the stall with, as well as any hooks or chains, and a wheelbarrow/bucket and pick for cleaning. See what will be available for communal use at the show and what you need to bring from home - and make sure what you’re bringing meets any guidelines the venue may have. ", " Get a first aid kit prepared, for both horses and humans. No matter where you travel, it is always important to have a first aid kit prepared for your horse. Bring all basic supplies to treat for basic cuts and abrasions as well as bruises or swelling. Be sure to do the same with a human first aid kit, should you encounter an accident of some sort. ", " Bring a change of clothes. You’ll be away from home, so it’s best to prepare for everything and anything. Pack a spare set of show clothes in case something happens to your own, making them unusable for the show. Additionally, you could choose to pack a pair of more comfortable clothes/shoes for the ride to and from the venue. "], "Getting Yourself Ready": [" Dress for Western classes. For western competitions such as Western pleasure or Western horsemanship, always wear an outfit that makes your horse stand out and color coordinates with your saddle pad. This will add great style to your overall presentation. For a local show, a button up western shirt, nice show pants, boots, and a belt may be very acceptable. But for more competitive shows, everyone will be wearing more elaborate garments such as form fitting silkies and vests, expensive chaps, etc. If your budget will not allow you to make these purchases, as long as your outfit compliments yourself as well as your horse, then you have nothing to worry about. Dark colors on light horses, and lighter colors on dark horses tend to draw more attention to them. It's not recommended to wear an all-black outfit in the show ring. Most of your competition will also be wearing it and you will want to stand out among everyone else. A deep purple or midnight blue is a great alternative. If you are confident in your skills and the skills of your horse, try drawing a bit of extra attention with a brightly colored shirt is a good option. You will stand out in the crowd and be more memorable in a sea of similar colors.  ", " Dress for English classes. You should wear a dark and/or traditional coat (navy, black, hunter green, tan, gray, brown, or copper) and breeches that complement, generally a light neutral or white color. Your shirt should have a stock collar and pin or a ratcatcher collar. Your boots should be highly shined and your gloves should match your boots; black is the recommended color. Do not wear boots that have a high heels. The glove should successfully keep any bare flesh from being seen between your hands and the sleeve of your jacket. For saddle seat you need a full suit: day coat and matching pants with shined jodhpur boots and either a derby hat for the female riders, or a fedora for the male riders, that accents your outfit. Helmets for English classes should be a dark color (i.e. black, navy). Check the guidelines for your event to see what the specifics are.   ", " Do your hair properly. Always have your hair up, make sure to get all fly-aways before showing, unless you are showing hunter/jumper or dressage. For more competitive shows, all hair should absolutely be under your helmet, or tightly fastened into a neat bun in a hairnet at the back of your head, just barely below your hat or helmet. Often for younger children or for riders on ponies, braids with bows is considered to be more appropriate. "], "Preparing Day-of": [" Feed your horse. Overfeeding or underfeeding at an event is a surefire way to make your horse uncomfortable, and therefore less show-ready. Follow their regular diet plan, adjusting feeding around events if  necessary. Your horse will be happier and easier to work with after having eaten. ", " Do a final grooming. Don’t bathe your horse, but brush them down really well to make their coat gleam. Spend the most time using the curry comb, and make sure to address all parts of their body. Spend extra time on white areas and apply more baby powder, corn starch, or French chalk if necessary. ", " Polish your horse’s hooves. English and western riders often sand the horses hooves to make them smooth, then apply hoof polish. Black hoof polish can be applied on naturally black hooves, while clear polish should be applied to hooves any color other than black. This should all be done on a clean hard surface. Put down rubber or heavy foam mats on the ground in your grooming area, to allow the hoof black to dry. Once the hoof black is completely dry, dirt may be wiped off with a dry towel. If you don’t want to polish your horses hooves, rub in some lanolin oil to add extra shine. Appaloosas are not permitted to use hoof polish of ANY color, other than clear, and even that is frowned upon. Check with your breed registry for specifications and regulations.  ", " Take time to relax. Shows and events are intended to be enjoyable; if you’re nervous you will not only enjoy the event less, but your horse will mirror your emotions and you likely won’t show as well. Make sure you've gotten enough sleep the night before, and enough to eat and drink before the competition. Do some deep breathing exercises and visualization to relax; listen to music or repeat a mantra if that helps you. Be sure to help your horse relax as well, going for a walk or lunge with them if necessary.  Don't worry about the other competitors. Act as if you were riding alone in your home arena. It will calm your nerves, and encourage you to pay attention to your own riding. Of course, be alert, and avoid running into the other riders in the ring.  "]}}, "How to Be an Equestrian": {"description": "Being an equestrian requires a great amount of personal dedication. You will spend both time and money in order to live an equestrian lifestyle. For equestrians, riding is a passion and a sport. To become a true equestrian you will need to immerse yourself in the details of how to properly care and communicate with horses. Choosing a particular equestrian sport, such as dressage, will help you further hone your skills. With practice and the support of a horse-loving community, you can reach your equestrian goals.", "content": {"Increasing Your Horse Care Knowledge": [" Do your research. Learn everything that you can about horses. Go online and look up information about different horse breeds and their characteristics. Watch videos showing horse behaviors. Subscribe to two or three well-known horse magazines. These publications will provide useful information while also letting you know about horse events in your area. Being an equestrian requires that you are a life-long learner of all things horse related. Never stop researching or asking questions. For example, if your horse reacts oddly to a certain harness, look up possible reasons online.   ", " Join an equestrian community. Making friends with fellow equestrians at your local barn is always a good idea. They can be excellent mentors for you. Being an equestrian is not a solo activity and you will require the assistance of many people in order to be a success. You can also get involved in equestrian communities online, especially by participating in one of the many horse blog networks.  If you own a horse and choose to board it, your fellow riders at the boarding stable will become your community. To find a good boarding stable, search online for boarding and training facilities by state. You will want to choose a stable close to your home to make visiting easier. Visit your stable options to assess their cleanliness and general atmosphere.  You can also build a community by going to a stable for riding lessons. In this case, you will want to very carefully choose your riding instructor. Make sure that they are a member of the Certified Horsemanship Association (CHA). Request references and ask questions about their experience level as well. To keep the conversation going, before you head to the barn each day, think about a few questions to ask other riders. For example, you might say, “How long should I cool down my horse after a one hour work-out?”  ", " Spend time around horses. Take lessons at a local barn or volunteer to help out at a non-profit stable. If a neighbor owns horses, offer to help them out. You want to spend as many contact hours around horses as possible. Doing so will make you attuned to their behaviors and will help you hone your caretaking and horsemanship skills. For true equestrians, riding is only part of the experience. You will also need to get your hands dirty mucking stalls, grooming, and feeding/watering. Don’t shirk these responsibilities or other riders will not take you seriously. It is great to own a horse, but make sure that you have contact with other horses as well. Expose yourself to different horse personalities and alternative skill sets. For example, if you are interested in barrel racing, both you and your horse would benefit from spending time with an experienced racing team.  ", " Pay careful attention to the physical and mental needs of horses. As an equestrian, you are responsible for the well-being of the horses around you. Make a daily, weekly, and monthly calendar in which you note major health appointments. Use this calendar to also keep track of how much, and what items, you feed your horse every day. And, keep an eye out for your horse’s mental status. If your horse begins to act out violently or is really lethargic, it may need some extra attention or even a change of stall. Treating all health concerns seriously is important for the horse, but also for your safety. Animals in pain are more likely to lash out, injuring their caretakers in the process. Get to know all of the equine professionals who care for horses, including veterinarians and farriers. Vets take care of a horse’s vaccinations and dental work while farriers watch over a horse’s all-important hoof care. Horses will often take a wide variety of supplements and vitamins. It is important to note what a horse takes in so that you can trace its outward effects.  ", " Respect the animals that you work with. No matter whether you are riding your personal horse or a shared barn horse, you need to treat all animals with the respect that they deserve. Keep calm when working with them and never act out of violence. Count to five if you get frustrated and try the same action once again. Take note of the physical strength and size of a horse as well. They can hurt you without even meaning to if you aren’t careful. For example, when you walk beside a horse, watch the placement of your feet. If a horse steps on your foot it can lead to bruises and even fractures.   ", " Serve as an apprentice. Some local horse programs offer formal apprenticeship programs. However, you can usually arrange your own. Find a trainer or horse professional who you admire and feel comfortable working with. Tell them about your interests and ask them to teach you everything that they know. In return, offer to help them care for the horses.  When you are a more experienced equestrian, make sure that you return this favor by accepting apprentices yourself. Or, even less formally, act like a mentor to younger riders.  "], "Excelling at Equestrian Sports": [" Stay in shape. Although you hold the reins in your hands, you control your horse by moving your core body. Start incorporating core-strengthening exercises, such as the wood-chopper and plank, into your regular routine. You will be able to ride longer with fewer sore muscles as a result.  Remember that riding a horse is excellent exercise, but does not include weight resistance. So, it may help you to develop muscles, but will not build bone density.  If you want an exercise boost, muck out a stall. It provides both cardio and weight resistance.  ", " Get access to a horse. Spending time caring for a horse and working on your riding skills is a necessary part of becoming an equestrian. If you have the resources, you can always purchase your own horse and pay to stable it nearby. If you do not own a horse, go online and search your location along with “barns” “stables” “horseback riding” and “equestrian clubs.” Find a location that fits your price range and schedule and go on a visit.  To get real results you will need to spend time with horses on a regular basis, more than just once a week. Schedule “horse time” into your calendar and be consistent in attending. Some riding locations will allow you to spend time with different horses each week while others will encourage you to stick with the same horse. Ask about the policies before you commit. Select equestrian programs at the college level will provide access to a stable of pre-selected horses. If you are interested in joining a collegiate equestrian team, look into this option.  ", " Choose a type of riding. Eighteen styles of riding are currently regulated by the United States Equestrian Federation (USEF). You can focus on western style reining (executing precision loops with your reins while horseback) or even vaulting (holding on to a modified saddle while performing gymnastic moves) or countless other options. Ask your mentors and peers for information, watch equestrian events, and read all that you can about the various sports.  The standard Olympic equestrian events are: dressage, show jumping, and eventing. Dressage is essentially dancing in sync with your horse. Show jumping involves a horse and rider jumping over various obstacles on a course. And eventing is a combination sport requiring endurance and jumping on untamed terrain.  Western style riding requires that the horse and rider navigate a variety of obstacles and demonstrate proficiency in corralling. Western dressage riding places an emphasis on a smooth gait and clear communication between horse and rider. Western reining is judged on control during the demonstration of reining patterns.  Other styles of riding include hunter, which mimics the process of a hunter pursuing prey on horseback, and English pleasure style, which places an emphasis on smooth transitions. You can even focus on carriage pleasure driving, which takes into account a driver’s skill in managing a team or single horse.   ", " Wear the right equipment. Many of your equipment choices will coincide with your sport. Take equipment recommendations from your mentor or other equestrians. If you plan to participate in competitions, make sure to read the guidelines carefully or you could face disqualification or point penalties. Remember to invest in a quality helmet. It needs certifications from both the American Society of Testing and Materials (ASTM) and the Safety Equipment Institute (SEI). If you choose to ride competitively and/or often, it is also a good idea to buy a body protector. You wear this vest over your torso and it helps to absorb the energy from a fall or kick. Many different models are available online. You will also want to wear some sort of leather shoe, preferably with a small heel. Riding boots are standard for many equestrian sports, although western riders often go with cowboy boots.  You can purchase riding gloves online or at a local tack shop. Gloves are especially useful in the winter and are also required for some equestrian sports.  Here is an example of sport-specific dress: General Western style riders prefer leather chaps, cowboy hats, and brightly colored western-themed shirts. Western dressage riders often wear themed-riding jackets as well. In addition to the above, Western reining riders must wear a collared shirt and necktie.  For safety reasons, try to remove most of your jewelry. If your hair is long, tie it back and secure it under your helmet.   ", " Practice, practice, practice. As often as you can, get out with a horse and practice your intended sport. Do repetitions of the same action so that it becomes second nature for you both. Look for weaknesses and target those areas in particular. For example, some barrel horses don’t like turning left, so it is all the more important to practice that direction. It is best to practice at least once a week with a trainer who has experience in your specific sport. If you belong to an equestrian team, it is possible that you will have group lessons as well as individual ones. In addition to working out with a trainer, you should practice at least 2-3 times a week on your own. This is yet another reason to choose a stable near your home.  ", " Learn from other equestrians. Go to equestrian competitions and cheer for your peers. Go the barns afterwards and talk with the riders and their helpers. If you are unable to travel to competitions, watch them on TV or stream them live online.  "], "Living as an Equestrian": [" Do what you enjoy the most. Sit down and do some serious thinking about what you like about horses. Do you enjoy a particular sport? Or, do you find the most happiness out of training horses? Perhaps you really like treating horses for illness? Not all equestrians are the same and you don’t have to compete to be an equestrian. Equestrians love horses and live a horse-centered lifestyle. If you are considering a competition sport, you will want to think about whether or not you should stay amateur long-term or transition to a professional at some point. Seek the advice of other trusted equestrians as you make this decision.  ", " Acknowledge the time requirements. Horses require a great deal of care. They will interrupt your daily schedule and will demand attention even on holidays. Look over your daily calendar and consider realistically how much time you have to devote to an equestrian lifestyle. This is an especially important to consider if you are thinking about becoming a horse owner. Horses are social creatures and don’t do well cooped up in a stall without visits for long periods of time. This can seriously damage your relationship with your horse and may even put you in danger while riding.  ", " Consider your personal finances. Evaluate what monies you have available to devote to your equestrian pursuits. Being an equestrian can be quite expensive, depending on your specific interests, so you want to be realistic early on. For example, certain sports such as dressage require advanced training that can be rather costly. If you are on a limited budget, all is not lost. Look for an riding center that provides long-term or group discounts. You can also offer to work part-time at a facility in order to get additional horse contact hours.  ", " Pursue advanced training. If you decide to become a professional equestrian, whether you take a competition track or decide to be a trainer, you will most likely need to pursue a degree in equestrian studies. Many schools over both associates and bachelor degrees in equestrian fields. You can gain even more experience by participating in a school’s riding club.  ", " Enjoy the equestrian lifestyle. Every time that you are around a horse do a quick internal reminder that you are here because it makes you happy. You may face difficult moments, but stay grounded in your love for horses and horse culture. This will help you to continue to make the best decisions for you and the horses that you work with. "]}}, "How to Memorise a Show Jumping Course": {"description": "Show jumping is a popular equestrian event that challenges both the horse and the rider to quickly go through a course of jumping obstacles. Since many jumping events don’t show the course until the day of the show, it can be difficult to memorize the path you need to take. With careful planning and some easy memorization strategies, you won’t forget the order of the jumps you need to make!", "content": {"Plotting and Walking the Course": [" Take pictures of the course layout. Course layouts are usually released the day of the show jumping event so riders don’t have much time to prepare. Take a picture of the overhead layout that’s posted as well as the actual course. Use the pictures as a reference so you can learn the order of the jumps and how they’re laid out in relation to one another.  Try to get pictures of the course from as many angles as you can so you can learn it better.   ", " Draw the path you’ll take to hit all of the jumps. Use your finger to trace the path over the picture you took. Follow the numbers and arrows on the obstacles so you know the order you need to complete them in. Refer to the text on the course layout to see what obstacles are included or excluded from your run.  Look for apps available on Apple or Android, like Jump Off and CourseTool, that allow you to upload the picture of the course layout. Then you can draw the path you’ll run with your finger and save it for future reference. Some course layouts may have a dotted line to trace the path you’re supposed to follow while others may not.  ", " Say the path you’re taking out loud. While you go over the course, talk yourself through the turns and lines you need to complete. Say them out loud so you have a better chance of remembering them later on. After you’ve gone through the course a few times, look away from the layout and try to recite the path you’re taking from memory.  ", " Watch other riders run the jumping course if you can. If you’re lucky, you may have an opportunity to watch other riders go through the course before you. Pay attention to how they make their turns and the obstacles that they’re jumping in order. That way, you can get an idea of how you should plot your path when it’s your turn.  Sit in different locations so you can see the course ran from all angles.  ", " Walk the course before you have to run it. Before it’s your turn to run the course, you’ll have an opportunity to walk through it at least once. Count your strides so you know how far the obstacles are separated from one another. Then you can plan how you’ll run them while you’re on your horse. As you walk, pay attention to the obstacle numbers and colors so you can remember them when it’s your turn.  Some events will let you walk through the course multiple times so you can focus on the terrain and other strategies to use to get the fastest time. Carry a picture of the course layout with you while you walk it so you can locate the next jumps easily.  "], "Using Memorization Techniques": [" Find lines between jumps instead of memorizing each one individually. Memorize paths between jumps that are in line with one another rather than trying to remember individual jumps. For example, If you have 2 or 3 jumps in a row, think about the direction you need to go, such as a diagonal line toward the corner. Grouping the jumps together reduces the amount you have to memorize and makes it easier to remember.  Aim to cut the amount you have to memorize by half. For example, if there are 12 jumps on the course, try to memorize them as 6 paths you need to take.  ", " Use word associations to remember the path you want to take. Think of rhymes or alliterations you can use so you know what movements you need to make as you go through the course. Coming up with clever phrases can help you make an association with the obstacle so it’s easier to recall while you’re making your run.  For example, you may say something like, “Stay right a smidge after the bridge” to help you remember how to turn your horse or, “Lope left after logs” so you don’t forget to change speeds. Put your rhymes to a simple tune so you can recite the lines easily. For example, you could use the tune of “Mary Had a Little Lamb” using your own rhymes.  ", " Remember the colors of the obstacles. Write down the colors of the poles on each jump so you can use them as a memorization device. Rather than trying to remember the individual jumps and numbers, think of their colors in order so you can recall them later on. Without looking at the course, list the colors out loud so you can memorize them.  ", " Try working through your route backward. Choose one of the last jumps on the course and recite the path you’re going to take from there. When you reach the end of the course, go back to the jump before the one you started on and run through the course again. This can make it easier to remember the middle of the course rather than always rehearsing from the beginning.  ", " Ask a friend to quiz you on the route you’re going to take. Give the picture of the course to a friend or family member and have them ask you which path you’re taking. Recite the jumps in order using the memorization techniques you’ve used. Have them ask specific questions, like where a certain jump is, so you can memorize the course from any starting point.  "]}}, "How to Judge a Horse": {"description": "Judging a horse's conformation takes practice, but anyone who has spent time around horses can learn to do it. Judges usually look for a combination of balance, structure, muscling, gait, and breed-specific features. Practice comparing different parts of horses to hone your skills.  As you look at different horses, think of descriptive phrases to note their admirable qualities and defects and you will be on your way to becoming a great horse judge!", "content": {"Evaluating the Horse's Balance": [" Learn about special considerations for the breeds you judge. Although there are some similarities among different breeds of horses, each breed has its own ideal qualities. Find out as much as you can about the breed you will be judging to ensure that you know what to look for. You can also check with the horse's breeding association for a judging manual.  For example, if you are judging American Quarterhorses, then you would need to note the prominence of the horse's withers. Prominent withers are a sign of a well-balanced American Quarterhorse.  If you are looking at Hunter in Hand horses, then a longer, leaner, more angular build would be desirable. The ideal Arabian has a high, arched neck that joins with high withers, and long, sloping shoulders. Morgan horses are known for their high, angular shoulders that blend into a short back and the neck almost looks as though it is on top of the withers, rather than coming out of them.    ", " Look for equal lengths of the horse's shoulder, back, and hip. Stand beside the horse about 10 ft (3.0 m) away so that you can see the horse's profile. If these 3 areas appear to be equal in length, then the horse has a balanced conformation. If 1 area is shorter or longer than the rest, then you would deduct points for this imbalance.  You can describe the horse's balance conformation by saying something like, “Showed more balance with smooth, symmetrical parts,” or “Lacked overall balance and symmetry of parts.”   ", " Ensure that the face is no longer than the shoulder, back, and hip. The face starts at the top of the horse's head where it begins to slope downwards and goes to the tip of its nose. Compare the length to the length of the sections of the horse's body you just evaluated. The horse's face should be equal in length to these other sections.  If the face appears longer, or shorter than these sections, then the horse is not well-balanced. Note the appearance of the face with something like, “Face in proportion to other parts,” or “Face is out of proportion to other parts.”   ", " See if the top of the neck is twice as long as the bottom of the neck. Still looking at the horse from the side, compare the top part of its neck to the bottom or underside of its neck. In a well-balanced horse, the top part of the horse's neck should be 2 times the length of the bottom part of the neck.  If the top part of the neck is less than 2 times longer than the bottom of the neck, then this would mean the horse is unbalanced. Describe the neck by saying something like, “Longer neck,” or “Shorter neck.”   ", " Check to see if the back of the horse is shorter than its underline. Identify the horse's back, which is the section between the withers and flank. Then, look at the horse's underline, which is the section of its stomach between its legs. In a well-balanced horse, the back should be shorter than the underline.  If the back is equal to or longer than the underline, the horse is not well-balanced. Describe the back with something like, “Had a longer back in relation to its underline,” or “Had a shorter back in relation to its underline.”   ", " Identify a heart girth equal to the distance to the ground. Still looking at the horse from the side, locate the heart girth. The heart girth begins at the withers and extends straight down to the bottom of the horse's chest. Then, compare this section to the distance from the horse's underline to the ground. The heart girth and the distance from the underline to the ground should be the same.  If the heart girth is shorter or longer than the distance to the ground, then the horse is not well-balanced. Describe the heart girth with something like, “Showed greater capacity in heart girth,” or “Lacked capacity in heart girth.”   "], "Checking the Horse's Muscling and Structure": [" Look for a deep V in between the pectoral muscles. Walk around to the front side of the horse and look at it from about 10 ft (3.0 m) away. Look at the area in the center of the horse's chest and see if there are any visible muscles. You should notice a deep V between the pectoral muscles if the horse is well-muscled.  If there is no V or if you cannot see visible muscles, then the horse is not well-muscled. You can use terms like, “Full-chested,” or “flat-chested” to describe the horse's pectorals.   ", " Identify the horse's visible muscles from a side view. Walk around to the side of the horse again, and check for muscling in the horse's shoulder, forearm, loin, and hindquarter. These should be easily visible from a distance of about 10 ft (3.0 m).  If you cannot see any muscles from the side, then the horse is not well-muscled. An overall statement on the horse's muscling might be something like, “Showed a greater volume of muscle to frame,” or “Showed a lower volume of muscle to frame.”   ", " See if the horse's stifle is wider than the hip. The stifle is the width of the horse's buttocks when you view the horse from behind. Stay 10 ft (3.0 m) back from the horse for safety and look at the horse's stifle. Compare the width of the stifle to the hips, which are about 1 ft (0.30 m) above the stifle. The stifle should be noticeably wider than the hips in a well-muscled horse.  If the stifle is equal to the hips, then the horse is not well-muscled. You can describe the stifle by adding a statement like, “More muscling at the stifle,” or “Less muscling at the stifle.”   ", " Note the angle of the shoulder and whether it is 45 degrees. A 45 degree angle is desirable in a horse's neck. Walk back around to your position about 10 ft (3.0 m) away from the side of the horse and look at its shoulder from this position.  If the angle of the horse's neck is less than a 45 degrees, then its structure is off and this will affect its stride. Try describing the angle of the neck by saying something like, “More correct angle at the neck,” or “Less correct angle at the neck.”   ", " Look for square-shaped hips. Still viewing the horse from the side, look at its hips. The hips should look square. Imagine drawing a square over the horse's hips to help you visualize this. If the hips would not fit within a square, then they are likely rounded, which is not ideal.  You can describe the horse's hips by saying something like, “Squarer-placed hips,” or “Rounder-placed hips.   ", " Note the appearance of other parts of the horse for a more in-depth evaluation. How detailed you want to be in your evaluation of a horse depends on the requirements of the association you are judging for and your own preference. Consider if there are other aspects of the horses that you need to factor into your judging, such as:  Hoof angles Wither length and prominence Head and neck size Hoof and pastern Top line Legs Back Throat latch Hock placement  "], "Considering the Horse's Action, Quality, and Refinement": [" Watch the horse walk to check for a long, straight, and even gait. Be sure to get a look at the horse from the side and back to carefully evaluate the horse's gait. When viewing the horse from the side, the horse should take long strides using the front and back legs equally. When viewing the horse from behind, you should notice that it is moving in a straight line and that it does not deviate to 1 side as it travels.  You may also need to watch the horse trot, gallop, or run depending on the breed or competition. Keep in mind that there might be some variation in the ideal stride based on the horse's breed. For example, if you are judging an Arabian, Morgan, or Saddlebreed, then more flexion in the hocks and knees is desirable. However, for stock and hunter breeds, less flexion is the norm.  Describe the specific features of the horse's gait in your evaluation, such as by saying, “Longer, truer stride” for a horse that takes long strides and moves in a straight line. Or, simply say something like, “Did not travel straight” if the horse deviates to 1 side as it moves.   ", " Check the horse's body for a thick, glossy coat. The horse's coat should look shiny and healthy. Walk around the horse to check the coat on all sides, or note the appearance of the coat as you watch it walk.  If the horse has any bare or scant patches on its body or if its coat appears dull, then this would be important to note in your evaluation. Describe a horse with a great coat by writing, “Higher quality haircoat,” and describe a horse with a patchy or dull coat by writing, “Lower quality haircoat.”   ", " Look for hard, flat bones and a muscular body. Any visible bones or tendons should look hard and flat, and not knotty or fleshy. The horse's body should also have a hard appearance, and there should not be any parts that look fleshy or fatty.  A horse that is at a healthy weight will easily meet this criteria, but an overweight horse will likely have some noticeable fatty or fleshy sections. To describe a horse that has a hard, muscular body, you might write, “Showed a greater volume of muscling throughout its body.” Or, to describe a horse with poor muscling and fleshy or fatty spots on a horse, you could write, “Lacked quality to muscle.”   ", " Examine the horse's skin for tightness. Tight skin is desirable in horses, especially in the face, lower legs, and joints. Look at the horse from the front and sides to evaluate its skin for tightness. The skin should be evenly taut all over.  If you spot any sections of skin that are sagging or loose, then this would be important to consider in your evaluation. To describe visibly taut skin, write something like, “Noticeably taut skin over the neck and face.” Or, to describe a lack of tightness of skin, you might write something like, “Lacked tautness in neck area.”   "]}}, "How to Show a Miniature Horse": {"description": "A miniature horse is a horse that measures less than 34–38 inches (86.4–96.5 cm) and the composition of a normal horse. Mini horse shows are where you show everyone how beautiful your miniature horse is in a competition. It is a very interesting sport and it can be fun to train and groom your miniature horse for a show. You can also win prizes such as; ribbons and money.", "content": {"Steps": [" Look at the requirements for the show. Some shows have height, weight, breed, and gender requirements. You can usually find these on the web page for the show or your registration forms. In most mini horse shows there are divisions for different heights, colors, and genders.  ", " Make sure your miniature horse is healthy. Make sure you are giving it the right amount of feed and hay but be sure not to overfeed it. You can look online, in books, or talk to a vet to find out how much you need to feed it. ", " Make sure your mini horse listens well, the judges will pay very close attention to the way it obeys you. Practice turning and stopping. Make sure that when you stop the mini horse stops with you and doesn’t pull on the lead rope. ", " Get the right equipment. Getting the right equipment for your mini horse is very important also. You can find brushes, mane combs, horse shampoo/conditioner, hoof polish, hoof picks, lead ropes, and halters at farm supply stores such as; Tractor Supply and Family Center, but you may want to look elsewhere for a more decorative halter and rope. The scissors, towels, baby oil, and baby powder can be found at any store. ", " Call your farrier or vet and get your mini horse’s hooves trimmed. It is good to make sure that they are not too long or overgrown. ", " When preparing for the show you need to trim your mini horse’s mane and tail. Trim it so that it looks nice and neat but also flows normally, don’t worry if you don’t get it right the first time it takes practice. Practice at home a few months before the show; eventually you will learn how to cut it to make it look right. ", " The morning before the show you will need to bathe your mini horse. Some horses do not like to be bathed so you need to tie them to a post and slowly introduce them to the water by just turning it on a little until they get used to it. After you have wet them down you need to put shampoo on them and lather it all over their coat, mane, and tail, you can use your hands or a soap brush. Then rinse them and do the same with the conditioner and then rinse again. After you are done you will want to use the towels to dry your mini horse, so they don’t get muddy or sick. ", " Brush your horse. The next step is brushing; you need to brush your mini horse to remove any dust, dirt, or hair still on the horse. Use soft, slow strokes so that you do not spook or aggravate it. After you’ve brushed you should comb out the mane and tail so that there are no tangles, you can use hair de-tangler if needed. ", " Before you go out into the ring you need to do last minute touch ups. You use the baby powder for the white legs and faces of your mini horse to make it look cleaner and flawless. You use the baby oil on the dark parts of the horse to make it look darker and smoother. Finally you put the hoof oil on black hooves to make them look shiny and for white hooves you make sure that they are clean and have no mud. ", " When you go out you will walk around the ring one way with your mini horse until the judge tells you to go the other way. The judge may give you instructions such as trot or turn in a circle. Then the judge will have all of you come to the middle to announce the winners. "]}}, "How to Pack for a Horse Show": {"description": "When preparing for a competition it is important that you have everything. Here are the things you will need in order to be ready for your show .", "content": {"Steps": [" Pack all of your tack the day before. In your tack you'll need; A clean and polished   that are thoroughly cleaned Show, spare, and warm-up  A with a clean bit & reins! A in good repair with no frayed elastic or broken buckles!  in supple and good repair condition  (If you use one)   ", " After you've packed up your tack, next you'll need to pack your grooming kit. Here's what to pack in your grooming kit;  (and a spare or two, just in case) Yarn, comb, hook & scissors for braiding  ", " After you've finished packing up your tack and grooming kit, you'll need to pack all of your stable, feed and shipping items. Here's what to pack;  (Make sure to bring an extra.)  (Pack your grain in a paper bag, duct-tape it shut, and label the bag properly.)  ", " Now that you've packed your feed, stable, and shipping items, you'll want to make sure to pack the supplies you'll need for yourself in the show. Here's what to pack if you need  ", " If you're packing \"Special Dressage Clothing\", you'll need to pack the following things; Also don't forget warm-up and cleaning clothes so your show clothes don't get dirty.  "]}}, "How to Groom a Horse for a Show": {"description": "Competing in horse shows is a fun yet challenging activity that requires dedication. In order to win, it's important that your horse is properly groomed. If you’ve never competed before, it might help to have an experienced professional assist you in the grooming process. If you take your time and follow all of the guidelines, your horse will be ready by the time you have to compete!", "content": {"Washing Your Horse": [" Bathe your horse the day before the show. Bathing your horse a day in advance will make it look as clean as possible and prevent you from having to rush the day of the competition. Don't ride the horse after you bathe it or it will get dirty again.  Cover the horse after washing it so that it stays clean before the day of the show.   ", " Buy livestock or horse-specific shampoo. Most human shampoos can be harmful to a horse’s sensitive skin and should be avoided. To be safe, purchase livestock or horse-specific shampoo online or from an equestrian supply store. This will prevent the shampoo from irritating the horse’s skin.  Horse-specific shampoos include NAF wash, Horse Health Lavender Shampoo, and Hawkins Organic Winter Warmer.   ", " Tie up your horse so that it stays still while you wash it. Attach the horse’s leader to a sturdy pole or fence post. This will keep the horse in place and prevent it from running around as you groom it. If this is your first time washing your horse or you have a skittish horse, consider having a person who’s familiar with the horse hold onto the leader.  You can also give the horse extra food to distract it while you wash it. Your horse will eventually get used to being washed and may even come to enjoy it.  ", " Wet your horse down with a hose. If it’s cold where you are, you should wash your horse indoors so that it doesn’t get cold. Turn on the hose and run it for a couple of seconds until the water is room temperature or cooler. Slowly drip the water over the horse’s entire body and head so that it’s wet. This will allow you to lather your shampoo on the horse.  Make sure that the water pressure isn’t too high or you may startle the horse.  ", " Lather your horse’s mane and tail. Wear a pair of powder-free rubber gloves. Then, put 2-3 drops of the horse shampoo into the palm of your hand and rub them together to start the lather. Rub the shampoo into the horse’s mane until it’s well lathered. Repeat the process on the tail and make sure there are plenty of suds. Finally, lather the area around the buttocks and thighs, as these parts of the horse often collect dirt and could be uncomfortable for your horse.  ", " Rub the shampoo on the horse’s coat with a washing mitt. You can purchase a horse-friendly washing mitt online or from an equestrian supply store. Dip the mitt in a bucket of water and horse shampoo then run it across your horse’s body, starting from the shoulders and working your way towards the rear of the horse. Remember to also lather the horse’s legs and its stomach.  A mitt will help you cover a large surface area and feels good to the horse. If you don’t have a mitt, you can also use your hands to lather down the horse. Avoid shampooing the horse’s face so that you don’t get shampoo in its eyes or mouth.  ", " Scrub down the horse’s muzzle with the washing mitt. Rinse the shampoo off the mitt so that you don’t accidentally get soap in the horse’s eyes. Wet the mitt with the hose then gently rub it against the horse’s muzzle, making sure to be especially careful around its eyes. Scrub down the area in between its eyes and work your way down towards its nose and scrub the underside of the horse’s chin.  ", " Rinse all the shampoo off your horse. Run a hose over the entire body, muzzle, and rear of the horse. Work the shampoo out with your hands until there are no more suds left and the horse's hair looks smooth.  Leaving shampoo on your horse’s hair could irritate it later.  ", " Pat your horse down with a towel and let it dry. Run a towel over the horse's body, legs, and muzzle to dry it down. You can also get a sweat scraper, or a tool used to remove excess water from a horse's coat to dry it down. Hold the sweat scraper by the handle and run it across the horse's body. When the entire washing process is complete, your horse's coat will have a shiny luster.  If you're washing your horse in a cold climate, make sure that the indoor space is heated as it dries off. You can purchase a sweat scraper online or at an equestrian store.  ", " Cover your horse to keep it clean until the show. A horse blanket will cover the horse's body and a tail bag will keep the horse's tail clean and free of dirt until the day of the show. Wrap the blanket around the horse and secure it by the fasteners so that it stays in place. Then, put the horse's tail in the tail bag and carefully tighten the top of the bag. To keep the horse's legs clean, wrap them in stockings or standing wraps.  You can buy a horse blanket, tail bag, and standing wraps online or at an equestrian accessory store.  "], "Clipping the Horse’s Hair": [" Purchase horse-specific clippers. You can purchase clippers online or from an equestrian supply store. A pair of heavy-duty horse clippers will be able to cut through the thick hair of the horse. Look online, read customer reviews, and buy a pair of clippers that meets your needs and budget.  Human hair clippers may not be able to cut through the horse’s thick hair and may not have the right sized attachments for your horse.  ", " Shave the horse’s muzzle with size 10 clippers. Slide the size 10 attachment onto the blades of the clippers. Turn the clippers on and let it run for a few minutes so your horse can get used to the noise. Once the horse seems calm, rub the clippers in an upward motion on the horse’s nose to trim the whiskers. Once you're done with the whiskers, trim the hair on the jawline and under the horse’s face, making sure to cut away any wispy hairs. The hair on the horse's face should be an even length all around. Finally, shave the side of the horse’s face to finish trimming its muzzle.  The clippers should not hurt the horse. Clipping the horse’s whiskers is sometimes suggested or required in horse shows.  ", " Trim the hair around the horse’s ears. Use size 10 clippers for the ears. Run the clippers from the tip to the base of the ear in a downward motion. Cut around the outside of the ears and aim to get the hair an even length. This will give the ears a sleek and neat look.  Long and wispy ear hairs could make your horse look messy.  ", " Trim the horse’s bridle path. The bridle path is the area on top of the horse’s head in between their ears, where the bridle sits. Remove the size 10 attachment from the horse clippers and pull the halter back to shave the 1.5 in (3.8 cm) area where the halter usually lays. The hair that you shave should run flush with the other hair on the horse's head. This will give a distinct separation between the front and back of the mane.  Do not cut more than this 1.5 in (3.8 cm) are on your horse’s mane.  ", " Shave the hair on the back of the horse’s legs and around its hooves. Stand on the side of the horse and run the clippers up the back of the horse’s legs without any attachment on your clippers. The hair on the back of the leg should run flush with the hair on the front and sides of the leg. Then, trim any long hairs hanging over the horse’s hooves so that there is a straight, neat line separating the horse’s leg and hoof. This will give its legs a smoother look.  Don't stand behind the horse or you may get kicked.  "], "Combing the Horse’s Hair": [" Run a curry comb over the horse’s body and rear to remove loose hairs. A curry comb is a soft plastic or rubber comb that you can use to remove shedding hair from your horse. Put the comb on your hand and run it over the horse’s body in small circular motions. Continue to do this until you’ve run the comb over the entire body and hindquarters of the horse.  You can purchase a curry comb online or at an equestrian supply store. Do not run the curry comb over the horse’s tail, mane, face, or legs.  ", " Run a hard bristled brush over the horse’s body and legs. A hard bristled brush, or dandy brush, will remove the dirt from your horse’s body. Start in the front of the horse and work your way towards the rear. Start by brushing down the horse’s neck and body in short, swift strokes towards the grain of the hair. Repeat this across the entire body, rear end, and legs of the horse.  Do not use a hard bristled brush on the horse’s face because it could irritate it.  ", " Spray horse conditioner in the horse’s rear, legs, and haunches. A horse conditioner will soften your horse’s coat and give it a shiny luster. You can buy spray-conditioners online or at an equestrian supply store. Hold the bottle of conditioner 6 in (15 cm) away from the horse and spray the conditioner on the haunches, or front shoulders, legs, and rear. Do not spray the conditioner on top of the horse where the saddle goes or it will become too slippery.  Don’t spray the horse’s face because you can get the conditioner in the horse’s eyes. Do not spray horse conditioner on the horse’s mane or it will become to slippery for your saddle.  ", " Use a soft brush to brush the entire horse. A soft bristled brush has softer bristles that won’t irritate your horse’s face. Start on the face of the horse then work your way down its neck and shoulders. Continue to run the brush over the horse’s body in small strokes to remove finer pieces of dirt and dust.  ", " Comb out any knots in your horse’s tail with a wide-toothed comb. Hold the hair away from the base of the tail with one hand and comb out the knots with the other hand. This will prevent you from ripping out the hair from the root and hurting your horse. Comb out the sections closest to the roots and work your way down the tail. Continue combing the tail with the comb until there aren’t any knots in it.  You can spray some conditioner in the horse’s tail to make it easier to comb.  ", " Comb the mane to one side. Use a wide-toothed comb to pull the mane to one side of the horse. Work out the knots with and pull the mane so that it stays to one side. As you pull the mane, loose hairs will fall out. The mane may give you resistance before it is trained and stays in place, but continue working at it until it sticks.  You may have to pull somewhat hard to get some of the knots out.  "], "Adding the Finishing Touches": [" Rub baby oil on the horse’s muzzle and ears. Pour a couple of drops of baby oil into a rag. Take the rag and rub the outside of the horse’s ears and on the side and front of the horse’s nose or muzzle. Get the ears and muzzle saturated with the oil until they are shiny.  This will make the horse's groomed face stand out more.  ", " Clean the horse’s hooves with a hoof pick. Purchase a horse hoof pick online or at a horse accessory store. Stand on the side of the horse so that it doesn't hurt you if it bucks. Use one hand to control the horse’s hoof and use the other hand to hold the pick. Lift your horse’s leg and use the pick to dig out the dirt in the grooves on the bottom of the hoof so that the \"U\" indentation on the bottom of the hoof is clearly visible and doesn't have any more dirt in it. Repeat this process on all of your horse’s hooves.  You should clean out your horse’s hooves every time you ride it or it could cause it discomfort.  ", " Polish the horse’s hooves. Purchase a black hoof polish online or at a horse accessory store. Lay down a piece of cardboard or sheet so you don’t get polish on the ground. Dab a rag or brush in the polish to saturate it. Then, run the brush or rag in a straight line around the top edge of the hoof where the hoof and leg meet. Fill in the rest of the hoof so it has a solid black color. When you're done, let the hooves dry off for a few minutes so that the polish doesn't rub off.  ", " Braid your horse’s mane for a unique look. Make sure to read the rules of the competition you’re entering to make sure that braiding your horse’s mane is allowed. To braid their mane, tie it into small, 1 in (2.5 cm) ponytails and use an elastic bands to secure them. Separate each ponytail into 3 parts and wrap the side parts around the middle part to make a simple braid .  You can also use more complex braids like a French or Dutch braid to really wow the judges. You can dampen the mane if you’re having trouble putting it into braids.  "]}}, "How to Follow Arena Etiquette While Horseback Riding": {"description": "Unless you're lucky enough to have your own arena at home, you'll have to share the arena you ride in with other riders. You must be alert for other riders and their horses and obey a certain set of rules to keep everyone safe. There are many rules, both written and unwritten, for riding in an arena with others. These guidelines make sure that everyone has the same expectations and can ride together without too much stress and uncertainty.", "content": {"Entering and Exiting the Arena": [" Put on your helmet. If you’re in the arena, you should be wearing a helmet. Even if you are not mounted or even planning on riding, your presence in the arena requires a helmet.  ", " Mount outside the arena or in the middle of the arena. You should not mount where you will be in another rider’s way. Mount outside the ring and then walk into the ring on your horse. You can also walk your horse into the middle of the ring (where there is usually less traffic) and mount. Some rings also have designated mounting blocks in a specific place.  Have someone hold your horse to keep both you and the horse safe while mounting. This will also protect already-mounted riders and horses nearby.  ", " Adjust your stirrups and/or girth either from the ground or in the middle of the arena. If you need to adjust your girth or your stirrups, always do so in a place that is not blocking other riders. Try to be fairly quick about adjusting your girth and stirrups.  ", " Go with the current direction. If you walk into the arena and most horses are travelling to the left, travel to the left with them. It is easiest for all parties involved if you mostly go with the flow of traffic.  ", " Give right of way to people on horses when you are on foot. If you are walking your horse in or out of the arena, be cognizant of people riding around you. Wait for a break in traffic before you cross the track to leave the arena. ", " Close the gate behind you. Whether you are entering or exiting the arena, make sure that you close the gate behind you. You may need to dismount to do this. You should always close gates, even if you come upon it already open.  "], "Riding in the Arena Respectfully": [" Let faster horses travel on the outside of the track. If you are walking or trotting, let cantering and galloping horses travel on the outside track, closest to the fence. However, if they are jumping in the center of the arena, you should probably remain on the outside track if you are walking.  ", " Always pass “left to left. ” The “left to left” rule applies when you are travelling around the ring in a different direction than someone else. If you are facing another rider head-on, you should pass such that your left shoulder is closest to their left shoulder. In other words, if you see an oncoming rider, go to your right side of that person.  Someone may override this rule in the ring by calling, “Rail!” Be aware of this possibility and always keep an eye on your surroundings.  ", " Pass other horses on the inside. If you need to pass a horse that’s travelling more slowly than you are, pass the horse on the inside. In other words, do not go between the fence and the other horse. Go to the left of the slower horse, closer to the middle of the ring. Be sure to communicate with the rider you’re passing by saying “On your left” or something similar, so that she knows where you are. ", " Give only quiet commands to your horse. Many horses could get spooked or upset if you yell at your horse, smack your horse loudly with the whip, or give wild hand gestures in an effort to get your horse to move. Be quiet and respectful when giving commands to your horse. Do not yell or make loud noises.  ", " Be prepared for an emergency. Always be aware of your surroundings. If another rider falls off their horse, dismount immediately and hold your horse, trying to keep him calm. Know where the first aid kit is.  ", " Maintain a safe distance from other horses. You should be at least one horse length (but preferably two) away from any other horse at all times when you’re in the arena. Other horses can become upset if you pass too close to them. Horses can also kick pretty far out to the side and behind them. Keep a safe distance away from other horses while you’re in the arena.  ", " Let other riders know where you are going. This applies especially in situations where you might be jumping or turning unexpectedly. If you are going to jump over a cross-rail in the arena, yell, “Red crossrail!” Be specific, loud, and clear. You can also say, “On your inside!” to a rider you’re passing. "], "Following Arena Etiquette While Showing": [" Know the rules. Each discipline and each barn has different rules about the show arena. Look up the specific rules of the horse show you’re attending. Be aware of what other riders are doing and how it differs from your home barn. If you have a question, ask. It’s safer to ask than to assume. For example, many barns have a rule where you need to let riders know that you're coming into the arena by saying \"Door\" or \"Coming in!\" Many barns also have rules where you can't be on your cell phone while you're riding. Dogs are also prohibited at many barns because they can spook the horses.  ", " Do not enter the warmup ring unless you are competing. The only people in the warmup ring at a show should be the people who are competing. Do not bring your horse into the warmup ring if he is not competing, even if you are and are riding a different horse.  ", " Do not allow your trainer to come into the ring with you. Your trainer should be on the outside of the ring, giving you directions. However, do not stop on the rail to talk to your trainer. Other people may be riding in the ring, and you should try not to be disruptive.  ", " Make sure you and your horse are wearing numbers. You should always have your number displayed at a show. Some shows require numbers for both horse and rider, but some only require one. Make sure that you know the rules and obey them. "]}}, "How to Show Horses": {"description": "Are you considering showing as a discipline? Found out how you and your horse/pony can wow the judges by reading the following tips and steps!", "content": {"Steps": [" Start the day before. Good show preparation starts the day before, and good preparation is absolutely essential for success!Firstly, make sure that all tack is cleaned to perfection and give the horse a bath. Next, prepare all equipment such as the rider's clothing and check that you have everything that is needed - now is the time to go and buy last minute items.Also , make sure that your lorry /trailer is ready for the next day to avoid any unwanted delays.  ", " The night before- always stable the horse the night before with a day sheet to keep the coat clean and stable bandages (optional)for horses with white legs.  ", " In most cases, it is best to arrive at the yard with a lot of time to spare on the morning of the show. this will allow for unexpected difficulties with loading/plaiting etc. Plait the horse if necessary . ", " Let your horse get used to the surroundings. Once you have arrived at the showground (with a lot of time to spare, of course), give your horse a chance to get used to the surroundings. ", " Warm the horse up sufficiently , then return to the lorry to do final preparations.  ", " When in the ring, always have good manners (you and the horse). Only overtake if it is essential and make sure your horse wears a red ribbon if he kicks. ", " You will be asked to do a group go-around, which will include all four gaits.  ", " Do your individual show. You will then be pulled into the middle of the ring and invited to do your individual show. This should include all four gaits and is best to be kept short and simple. It should show the judge that the horse responds perfectly to his rider.Please note that in some classes , the ride judge will ride the horse, not you.Always finish with a square halt and salute the judge. ", " Walk around the outside. The judge will then get the class walking around the outside again and will then pick the winner. Placed horses will then get pulled up and a rosette will be given. Non winners will leave the ring.  ", " Take 'a lap of honor'. A lap of honour will then take place in a controlled canter. "]}}, "How to Build a Show Jumping Gymnastic Exercise": {"description": "A gymnastic exercise is any related distance between two or more jumps that is used to improve the jumping technique of both horse and rider. While there are literally thousands of gymnastic exercises available, the exercise used in this article is particularly useful for of its effectiveness in improving multiple things:", "content": {"Steps": [" Place a pole on the ground in the middle of one side of your flat space or arena, but at least 10 metres (32.8 feet) away from the edge or fence line. This is called the 'placing pole'.  ", " Taking your tape measure, measure a distance of 2.5 metres (8.2 feet) parallel to your placing pole and put the first cavaletti there.  ", " Place the second cavaletti 3 metres (9.8 feet) in front of the first.  ", " Take your last cavaletti and place it 3.5 metres (11.4 feet) after the second. Make sure at this point that your cavaletti and placing pole are in a dead straight line. ", " Measure a distance of 6.5 metres (21.3 feet) in a straight line out from both ends of the third cavaletti, and mark this spot. You can use your boot to do this in sand, or spray paint if working on grass. ", " Put a pole on the ground between the two points you have marked.  ", " Take two of your jump stands and put them either side of this pole. Set them up so the cups are facing inward and are directly in line with the pole. ", " Lift the pole into the jump stand cups. At this point you may like to add fillers, such as low gates or a small wall. This will save you from needing to add extra poles when you go to make to jump higher . This jump is called an 'upright'. ", " Put another pole directly in front of the upright. Make sure it is right in close to the base of the jump. This pole will be your 'groundline'. ", " Taking your tape measure, measure a distance of 7 metres (22.9 feet) in straight line out from both ends of the upright. Mark these spots in the same way as you did with the upright (using either your boot or spray paint). ", " Place a pole between the two marks, and add a jump stand at either end of the pole as you did with the upright.  ", " Place the pole in the jump stand cups, and set the cups quite low. Place another pole in the same jump stand, but in the cups above. ", " Put another pole down as a ground line  in the same way as before.  ", " Take your last two jump stands and put them parallel to, but right up against the jump you have just built. Put a pole in the cups. This jump is called an 'oxer'. ", " Taking your tape measure, stretch it out from one end of the placing pole to on end of the bottom of the oxer. Check that your distances are 2.5, 3, 3.5, 6.5, & 7 metres between all the obstacles. ", " Switch your tape measure to the other side and check that the distances are the same.  ", " Set the heights of the jumps. The cavaletti should be on the highest setting. To begin with, the top pole of the upright should be no more than 90 centimeters (35.4 in) off the ground. Set the oxer at the same height. "]}}, "How to Make a Horse Relaxed at a Horse Show": {"description": "At horse shows, your horse can get very anxious or worked up if those are the emotions its rider is expressing. Shows are much more enjoyable when you have a calmed horse. Whether this is your first show or your horse's first show, here are a few tips and tricks to keep your horse content, and to minimize the possibility of injuries or falls.", "content": {"Multi-day Shows": [" Let your horse get used to the showgrounds and get it familiar with anything that could possibly be a spook factor.   ", " ensure that you know which arena(s) you will be competing in. If you can, ride in your assigned arenas to let your horse check it out. This is also a good time to sort out any objects or places that may cause your horse to spook. ", " If you stay calm, your horse stays calm. Remember to keep taking deep breathes and let your horse have a rider it can be confident in. ", " When schooling day rolls around, check before hand to see which ring(s) your horse will be going into.  ", " While you're schooling, make sure to end on a good note. It might not be something huge, but getting your horse to walk past the scary fence post once is better than spending an hour making sure your horse is 'bombproof' to it. Know when enough is enough. ", " Keep in mind that a horse is a horse. What may be nothing to you is a possible threat to your horse. Slowly confront your horse with the object instead of yelling or getting frustrated. That will only get your horse anxious. ", " When your horse is getting a little spooky, keep trotting until they're more focused on you. Half halts, gait transitions and many small circles in different places in the arena can keep your horse focused on you, not distractions that might spook it. Also do things like getting the hind end over to prevent bolting. ", " If it's a dressage show, make sure your horse is familiar with the judge's box.  ", " Ride or walk your horse to the judge's box (while it's empty) and let it examine the box thoroughly.  ", " Lunge and/or warm up thoroughly your horse before the first class. If your horse has jitters, you'd want to get them out before you start showing. ", " Flexing and a lot of transitions keep your horse occupied and supple before your classes. you don't want them entering the arena stiff-muscled. ", " Make sure you have all the papers necessary in order for your horse to show.  "], "Show Time": [" To help yourself -and your horse- stay calm and collected for your classes, take deep breathes and tell yourself to ride just like you would at any other schooling day at home.  ", " Remember to keep a deep seat, quiet hands, and heels down. It helps if you can picture certain places in your course or pattern to remember these things- for example, if you were running a barrel racing pattern, at each barrel remember; Seat, hands, heels "], "Bottom Line": [" It's not the ribbon, it's the ride. Ride for your benefit, not your trophy collection's. ", " Realize that if your horse is injured, but could still pull through a class or two, it's your job to understand your horse's limits.  ", " Whatever you do, be sure it is for the best, not only for you, but your horse as well.  ", " One-Day Shows are the best for a young, green horse--that is, if they're properly run, because of the more laid-back they are, and their short length.  ", " If you have a green horse, check out the show grounds before you enter, to make sure they're safe.  ", " Book a stall, and enter in a bundle of classes.  ", " Take your horse on a relaxed hack the day before. If you're all practice and no rest right up to the day of the show, it's only by nature that your horse will be anxious ", " On the day of the show, you can lunge your horse(s) after unloading to stretch their legs out and get some of the jitters out.  ", " We all know the horses that are just jittery or spooky by nature, and sometimes you just have to let your horse be a horse (within limits). There's a difference between a horse that naturally prances and a horse who's being a brat. ", " If your horse is tense and over alert to it's surroundings, take it for a ride away from the rest of the competitors and horses.  ", " If the management allows it, ride in the ring before show time to see how your horse reacts.  ", " If not, enter in a walk-trot class or something similar, just to see how your horse reacts.  ", " If there isn't enough times to put your horse back in the stall, go for a walk or get moving.  ", " Don't go too far away though--you could miss your round!  "]}}, "How to Get Your Horse Used to a Show Atmosphere": {"description": "Sometimes horses can get very skittish when you take them to their first shows, so always know what to do. If your horse has issues when you go to a show, make sure you know how to handle his behavior. It is a good idea to set out a long term plan to get a horse ready to go to a show. Start out small, with schooling shows, or even just taking your horse to a strange place where there is no show (like a local open space). It is often a good idea to start with a show you are not competing at, since your horse will pick up on your nerves as well.", "content": {"The first time": [" Consider bringing your horse to the first show just to be there. This means not entering your horse in any classes but going through all the relevant procedures, such as transportation, housing in a stall, feeding during the day, allowing the horse to see lots of people, getting your horse used to the noise, etc. Give your horse treats to reward him each time that he does something good.   ", " Stay with your horse at all times. When it is your horse's first show, staying by his side will help your horse to feel relaxed. "], "Settling the horse in": [" Try to park your trailer/van in a quieter spacey area of the park with more space if you cannot stall your horse. Do not cramp him. ", " Unload your horse and lead him directly to his stall and give him some hay .  Do not put him in a strange stall until you have carefully checked it for nails and dangerous objects. Have it bedded, with a bucket of water, and a hay net before you put him in it. You may want to use a shank across his nose or under his chin as you lead him from the trailer. Also, use trailing boots.  "], "Going to the show": [" Head on over to the show. Keep your horse occupied with toys and hay. ", " Deal with negative reaction quickly. If your horse starts neighing, let it slide unless it gets really serious. In this case, it may not be a good idea. Wait for a moment of calmness and stop the trailer. This shows that good things (trailer stopped) happen when he is calm. Go over to your horse, wait for calmness once again, and then pet him. If he neighs, back away. When your horse has stopped freaking out, try again. ", " Lead him around and let him get used to things. Do this after he has had some time to settle in his stall and has had a few treats and some hay. A little neighing is OK, but make him pay attention to you. Be kind and firm. He may get overexcited. Make sure to give him plenty of space, and let him see everything around him. The walk should end on a good note, meaning stop when he is behaving well, if you can.  "], "Preparing for a class": [" Lounge your horse in an area with horses around, but not in it. That way, he feels safe, especially if you plan to ride him. When he is calm on the longe, then move him to where the horses are. Do not use a horse show as a venue to longe (lunge) your horse if he is not safe on the longe at home. Remember, if you can not control your horse, you have no business taking him to a show endangering other people who paid good money to come. The longe should be no more than 20 minutes.  ", " Before your class, ride in a quiet arena. Walk, trot, and canter. Halt. Pet him and tell him he's good. Sit up straight, and try jiggling the reins. Nudge him and gently say walk, but do not be a passenger. That means, do what you want, do not let the horse control you. If you see any improvement at the walk, try a slow trot. More improvement? Try some collection. When you succeed, slow back to a walk and try a canter. If your horse misbehaves uncontrollably, bring him to a walk and wait until he is calm, then hop off. Pet him a little, then try again, much, much slower.  ", " Finally, join a different ring where other horses are also being ridden. Practice passing the other horse. Again, end on a good note. "]}}, "How to Plan and Hold a Horse Show": {"description": "Organizing a horse show is a highly detailed affair. Regardless of your show's level, delegation and several months of planning are essential. Organize your staff and hire officials, and book a venue that suits your show's scope and size. Appoint a show secretary to handle the host of clerical duties involved in any horse show. Planning for emergencies and keeping humans and horses safe are top priorities. Muster your setup and cleanup teams on the day of the event, and make sure everyone is poised to handle any issues that arise.", "content": {"Organizing the Staff": [" Designate or hire a show manager. The show manager is the point person responsible for the show's overall operation. For higher level shows, affiliated clubs or associations often require show managers to be trained professionals. Less formal events aren't so strict about training requirements.   ", " Appoint a show secretary. Horse shows involve a host of clerical duties, from handling entry materials to organizing awards, back numbers, and judge cards. The show secretary should be a highly organized individual with a sharp eye for detail.  They'll also need assistants to handle duties such as registering exhibitors on the day of the event. You (or the secretary) can recruit volunteers from your 4-H club or other affiliated organization to fill these positions.  ", " Select a safety coordinator. For small events, the show manager often oversees safety precautions. However, for events that draw hundreds of people (including exhibitors and general public), a safety coordinator should be appointed who has no other duties. They'll manage health certificates, work with emergency personnel, acquire insurance, monitor the weather, plan for emergencies, and ensure veterinary professionals are on call.  ", " Assemble a marketing team. You can most likely handle marketing and promotions using volunteers. Have someone with graphic design experience create a press release and fliers. Others can reach out to local businesses about sponsoring the event or making donations. You'll also need a team to post fliers at horse schools, farms, and other related locations. ", " Assign volunteer gate attendants, ring crew, and other assistants. The number of volunteers you'll need will depend on the level of your show. Setup and cleanup crews are absolute musts. Any show requires attendants to make sure public attendees and exhibitors park in separate areas. If obstacles need to be moved during the show, you'll need a ring crew. The public shouldn't park near where the exhibitors set up their trailers and keep their horses. Failure to keep the public and horses separate can increase the risk of accidents.  "], "Hiring Officials": [" Hire a qualified judge. Find a judge appropriate for the competition you're hosting. Check with your 4-H club or competition association, which post lists of qualified judges annually. Get in touch with a judge, discuss your organization and the show's details, and negotiate payment.  You'll also have to cover travel and meal expenses. If the show is a multi-day event, you'll have to provide hotel accommodations. The judge often designs course layouts, so have them submit designs and any other requirements well in advance of the show.  ", " Appoint or hire an announcer. If the venue has a PA system, you can just have a volunteer from your 4-H club or other organization act as the announcer. If there's no PA system, hire an announcer who can provide their own microphone, speakers, and other audio equipment.  ", " Choose a grounds manager, ringmaster, and stewards. Depending on the show's size and scope, you'll need a ringmaster and grounds manager to supervise classes of exhibitors enter and leave the ring. They'll also oversee any necessary repositioning of jumps and other obstacles. Depending on the level of your competition, you might be required to hire professional stewards to assist the judge. Your 4-H club or equestrian chapter can put you in touch with professionals if licensed personnel are required. If you're planning a less formal show, you can appoint volunteers to manage the ring.  "], "Managing the Facilities": [" Choose a venue that can accommodate your show. For larger shows, book a horse show venue with adequate seating, plenty of space for exhibitor trailers and public parking, and restrooms. If you're hosting a smaller show at your farm or one owned by a member of your club, you'll need to rent bleachers, folding chairs, or other seating. You'll also need to rent portable restrooms.  Horse show venues usually have obstacles on hand, but you'll need to ensure they're suitable for your specific competition.  ", " Acquire jumps, obstacles, and other equipment if necessary. If your venue doesn't supply suitable obstacles, or if you're hosting the show at your farm, you'll need to rent or buy the necessary equipment. Search online to find a supply company in your area.  If the venue doesn't provide a tractor to drag equipment in place, you'll need to rent one or find a member of your organization who can provide one. Work with the judge if you need help deciding what equipment you need.  ", " Set up a concessions stand. A concessions stand will keep your guests' bellies full and is an excellent fundraising opportunity. If the venue doesn't have a designated concessions stand, set up tables, a grill, and coolers. Appoint volunteers to work the grill and handle transactions.  To save on your food budget, ask local restaurants and grocery stores to make donations. Reach out to them months in advance so they can fit you into their charitable donations allowance.  "], "Completing Clerical Duties": [" Distribute entry requirements and process forms and fees. Send out entry requirements to local horse schools, clubs, and farms well in advance of the show. The secretary will be the point person for processing entry forms and fees. They'll also use the entry forms to compile a class list, or list of exhibitors organized by their age and event groups. ", " Order ribbons, trophies, back numbers, badges, and judges' cards. The secretary will also need to order required equipment and materials in advance of the show. Provide a minimum of several weeks for shipment so there's some wiggle room in case of a backorder.  You wouldn't want an exhibitor to compete without a number or to present an award without having a ribbon.  ", " Get local businesses to sponsor the event. Sponsorships are another good fundraising opportunity. Reach out to local businesses (horse-related businesses might be of particular interest) about paying for their names to be posted on the class list or otherwise advertised at the event.  ", " Promote the show with local clubs, farms, and media. Create a press release that includes the show's details, contact info, and information about your organization, and send it to local newspapers and news channels. Post fliers at local businesses, farms, and horse clubs. Create a Facebook event, and have your staff share the event on their social media channels.  "], "Handling Safety Concerns": [" Decide if you need emergency personnel at the show. If your show is affiliated with an equestrian association, find out if they require medical personnel to be present. For small events, especially those close to a hospital, an emergency team usually isn't necessary. If you expect hundreds of people to attend, it's wise to have an ambulance and emergency response team on the grounds. Keep in mind you'll need to factor emergency personnel fees into your budget. If you don't have emergency personnel present, contact your local emergency services before the event so they'll be on call. Advise them not to use sirens and lights in case of emergency, since they can startle horses.  ", " Purchase event insurance coverage. You might be required to purchase event insurance, depending on your local laws, your venue, and your affiliated associations. Even if you're not required, it's wise to insure your show if at all possible. Minimum insurance requirements will depend on your event's size, your location, and your venue and organization's requirements. For example, the USEF (US Equestrian Federation) requires a minimum of $1,000,000 third party general liability coverage and $50,000 on equipment and property.   ", " Hire an off duty police officer or other security. Your insurance, local ordinances, or affiliated organization might require you to hire security for your event. Contact your local police or sheriff department to set up off duty security service.  If you're not required to have an off duty officer, you could hire private civilian security guards. While they're usually a more affordable option, keep in mind private security guards often don't have as much training and experience.  ", " Require exhibitors to submit health certificates. Your exhibitors should submit current health certificates to prove their horses are in good health. They should submit proof of rabies vaccination and a negative Coggins test.  Make sure you note these in your entry requirements.  ", " Have a farrier and vet present or on call. For larger shows, a farrier, or shoe specialist, and an equine vet should set up stations on the grounds. Your association might require their presence. If you're holding a smaller show, have a local farrier and vet on call in case of any problems.  ", " Monitor weather forecasts. Light rain won't interfere with some competition events, but storms and lightning will shut down your show. The safety coordinator should monitor forecasts leading up to the show. If there's any chance of inclement weather, they should track storms using a radar mobile app or weather radio.  Scheduling a rain date is wise if you've booked an outdoor venue.  ", " Inspect the grounds for safety hazards. Several days before the event, check the ring, stalls, lots, and other locations for anything that could endanger horses or attendees. Examples include holes, rocks, sharp objects, and broken fences. Work with the venue to correct any issues you spot. Do another double check the day before the event.  "], "Running the Show": [" Set up equipment and stations in advance. Position jumps and other obstacles the night before the event. The morning of the event, set up the registration tables, or where exhibitors receive their back numbers, class and prize lists, and other info. Set up the concessions stand, coolers, and grill a few hours prior to the event. The morning of the event, have a crew available to receive and set up seating, portable restrooms, and other equipment you might have rented.  ", " Hold a staff meeting at least a half hour prior to the show. Assemble the committee and make sure setup duties have been completed. Run through the show's order from opening ceremonies and individual events to the awards presentation. Review safety plans, locations of emergency and veterinary personnel, and which areas are designated for exhibitors only. ", " Conduct the show and address any issues that arise. The moment has finally arrived! Hold opening ceremonies and individual events, and present awards when the scores are tallied. Be available to handle issues from the judge needing a bathroom break to an audience member fainting. ", " Break down the facilities. When the show's over, the exhibitors will load up their trailers and guests will make their way to their cars. Clean up trash, break down tables, and manage the return of obstacles, tractors, bleachers, and other rented equipment. If the venue has staff on hand, work with them to return the space to its normal conditions.  ", " Evaluate the show's operation. Identify ways to make any future shows you plan even better. Check the show's expenses and income, and look for ways it could be more profitable in the future. Talk to all staff members about what worked well and what needs to be improved. Ask questions such as:  Were there any operational hiccups? Were transitions between individual events smooth? Was the show fully staffed? Over-staffed? Were exhibitor entries and public attendance in line with expectations? Could the show have benefited from more advertising?  "]}}, "How to Become a Horse Eventer": {"description": "You all want to know what horse trials are and how to start huh? Well this article will teach you what you need for eventing: dressage, showjumping, and cross country!", "content": {"Steps": [" Go to useventing.com and find a few certified eventing trainers in your area. When you find one you like, start taking regular weekly lessons with them.  ", " After a while of taking lessons, go ahead and lease a horse from your trainer. This will allow you to experience ownership without jumping into it unprepared. After a couple years of lessons and leasing, start shopping for an event horse with your trainer. ", " Have the appropriate tack. See \"things you'll need\" for more details. ", " Have a safe horse trailer. Make sure it can hold at least 2 horses even if you'll only be pulling one, and it has a spacious tack room. Also make sure you have an appropriate vehicle to pull it with. ", " Have the appropriate apparel for yourself. See \"things you'll need\" for details. ", " Have some money. This is an expensive thing to do so, you need to have money and lots of it. The recommended budget at most barns is at least $20,000 a year. ", " Take 1-2 lessons per week, and ride 6 days a week. This will keep you and your horse in shape and ready for shows. ", " When you and your horse are ready, enter a USEA recognized horse trials at the Beginner Novice level. To tell if you're ready, make sure you're schooling Novice level dressage movements, jumping 2'11\", and jumping Novice x c because you always want to school one level above what you show. ", " Be prepared to fall off your horse. Accidents do happen, so it's better to be prepared. To be safer, always wear an appropriate, good quality helmet (recommended brand is Charles Owen), a skullcap on cross country, and a protective vest and air vest on cross country. ", " You must be in good shape, really good shape. The cross country phase is especially taxing on mind and body, although the thrill is so worth it! Riding a good 5 or 6 days a week and eating healthy should keep you thin and fit for riding. "]}}, "How to Sign up for a Horse Show": {"description": "There are hundreds of different horse shows out there.  There are breed shows, 4H shows and discipline shows (i.e. Hunter/Jumper, reining etc.)  But most horse shows have similar registration processes.  Listed below are some basics for signing up for a horse show.", "content": {"Steps": [" Contact the agency or person hosting the show. Please note that many horse shows are hosted by management companies that simply rent the venue.  People at the site of an arena may or may be able to help you register for the show.  ", " Request a registration form or a 'prize list' as they are often called at large Hunter/Jumper shows.  ", " Fill out the registration form with all of you and your horse's information. You should also be able to sign up for whatever classes you would like to show your horse in on the registration form. ", " If the show is several days or even weeks long, you must make arrangements for your horse's stabling. Included in the registration form will be information about stalls at the show site.  If you need a stall for the show be sure to indicate the number of stalls you will need as well as the duration of time you will need them.  And don't forget the bedding! You can bring your own but many shows will sell you bedding...though it can get expensive.  Please remember that the show site is not responsible for your horse when you use their stalls..you are.  You must still tend to his feeding, watering and the cleaning of his stall. ", " Once you have completed the registration form, simply return it. Depending on the show, they may require a deposit with your form or they may require you to pay a fee. ", " Remember to keep the portion of the prize list that has the schedule and description of classes. This is your guideline for the show day. ", " On the day of the show, register with the show office. The show office will assign you a number to wear when in the ring. ", " Also, it is general practice to leave an 'open check' with the show office. This is a signed blank check to cover your fees should you leave the grounds without paying.  If you are not comfortable with the 'open check' you can leave a check to cover your full show expenses and simply ask for a refund later for any classes you cancel. ", " Remember you must give notice if you intend to scratch a class. If you do not alert the show office within the  allotted time that you are scratching, you will be charged for the class whether you showed in it or not. "]}}, "How to Choose Horse Riding Gear": {"description": "Choosing clothes and equipment for horseback riding can be stressful.  There are many different items that you'll need, and there are many options available!  When choosing gear, it is important to keep in mind your budget, the occasion, and the quality. This article will cover the basics needed for English riding.", "content": {"Basic Riding Clothes": [" Wear long pants or jeans: Choose pants or jeans with a lose fit to make it easy to get in/out of the saddle.  ", " Choose close-toed shoes with a smooth sole and 1\" heel: Always wear close-toed shoes while riding or working with horses; if a horse steps on bare feet/toes, it can cause serious injury. ", " Get an approved riding helmet. It's best to have someone at a tack store measure your head and help you to pick out an appropriate helmet. Always wear a helmet made specifically for horseback riding; they offer more protection than helmets made for riding bicycles. "], "Traditional Lesson and Clinic Clothes": [" Prepare a higher level of dress for more formal lessons. Clothes should be conservative, fitted, and weather-appropriate.  It is appropriate to tuck shirts into breeches and accessorize with a belt. ", " Pick out a shirt. Options for shirts: For casual lessons, solid-colored tee shirts may be appropriate, though very casual, so not always advised. Collared polo shirts are very popular and are universally appropriate. For warmer months, long-sleeved, breathable, quarter-zipped shirts are a smart choice. They can be purchased through equine retailers or tack stores. For cooler months, a great formal lesson look is a button down layered with a color-coordinating sweater. Jackets or coats are appropriate when the weather is cold, but make sure that they are fitted.  ", " Consider your pant options:  Breeches. Breeches with knee patches are common across disciplines, whereas full seat breeches are typically reserved for higher level riders and dressage disciplines. Opt for solid, conservative colors. Tan, black, navy, and grey are all safe choices. Be sure that your breeches have belt loops.  ", " Select your boots/footwear:  If riding is just a casual hobby, or you are not interested in showing, leather paddock boots and half chaps are a great choice.  There are a wide variety of styles and brands to choose from.  It's best to go to a tack store and try different combinations until you find a fit and style that you like. If you are interested in showing or are willing to make an investment in your boots, tall field boots are ideal.  It is important to get fitted at a tack store so that they can help you find a pair that fits you well and suits your needs. Be sure that your footwear is made out of real leather and is good quality.  ", " Get any other accessories needed:  Gloves are usually optional, but are useful when the weather is especially hot or cold, or when you are riding a horse who is heavy on the forehand or likes to pull.  There are different styles available, from synthetic, to leather palms with crochet backs, to all-leather gloves. Belts are essential when tucking your shirt into your breeches. Choose belts which coordinate with your outfit. Black is usually a safe bet.  Be sure that your belt is the right width to fit through your belt loops. Hairnets. Choose hairnets which match the color of your hair. They are available in two-knot, one-knot, and no-knot. One-knot nets are the most popular and comfortable. Helmet. Black, matte helmets are common and look more professional than brightly-colored, shiny helmets.  "], "Show Attire (Hunter-Jumper/Equitation)": [" Expect to see slightly higher prices for this kind of clothing. Show clothes are typically more expensive than lesson-level clothes; however, there are a variety of options to fit any budget. ", " Find a shirt that suits. Wear a long-sleeved show shirt. Choose a shirt made of breathable material. There are even shirts which are ventilated under the arms to promote air flow. Make sure it compliments your shape, fits under your jacket, is long enough to tuck into your breeches, and does not \"gap\" in the front. There are different colors available, but white is the best option. Choose a shirt with a wrap collar rather than one with a traditional choker collar. If you decide to monogram the collar, make sure that it is small and conservative. In certain rings, riders can be disqualified for having visible monograms.  ", " Pick a jacket: Unless it is extremely hot and the judge issues a jacket waiver, show coats are required when showing hunter-jumpers or equitation. Choose a coat that fits well, is long enough, and has long enough sleeves. Choose a coat which is conservative in color. Navy is the most common color in hunter-jumpers/equitation, but black is becoming popular (black is traditional in the dressage arena). Three-buttoned jackets are traditional.  ", " Pick your pants. Tan or khaki breeches are the only acceptable colors in hunter-jumper/equitation.  Be sure that your breeches are mid- or high-rise so that there is no gaping in the back. One of the most popular brands for show breeches is Tailored Sportsman. ", " Get some tall boots. These are essential in the show ring. Boots must be black. Boots should be tall enough to create a clean line from the top of your knee down and should be fitted through the ankle. They should be field boots (zipper in the back with laces in the front). Be sure that your boots are cleaned and polished for shows. If you are able, it is wise to invest in custom-fitted boots.  ", " Get any other needed accessories:  Black belt. Hairnets are required. Hair must be neat and tucked into helmet. Black leather gloves are required. Pearl earrings are a traditional and elegant addition to a show look. Helmet. Helmet should be black or a dark grey, depending on the brand. Charles Owen and GPA are both popular brands depending on your budget.  "]}}, "How to Feed Your Horse During Show Season": {"description": "It is important that you maintain your horse's health during show season, whether you are on the road or at home. You will want to make sure your horse stays well-hydrated while on the road by bringing water from home, flavoring water at the show, and adding electrolytes to your horse's water. While on the road or at the show, it is important to maintain your horse's feeding schedule and type of feed. If you decide to change your horse's diet for show season, you should do so gradually.", "content": {"Maintaining Your Normal Routine": [" Feed your horse its regular diet while on the road or at shows. When you are traveling to an event or while at a show, it is important that your horse's diet remains the same. Abruptly switching forage can cause colic and other gastrointestinal issues in horses. Maintaining dietary consistency is key to your horse's health and performance during show season.   ", " Maintain your horse's normal feeding schedule. It's extremely important that your horse maintains its feeding routines while on the road and at shows. You should bring enough hay, supplements, feed, and chaff to feed your horse during the entire time you are away from home. Feed your horse on its regular schedule.  ", " Offer your horse salt daily. Horses require about 1-2 ounces of salt each day. Be sure you bring enough salt with you to ensure your horse will meet minimum dietary requirements while you are away from home. This can include providing a simple salt block. Try to avoid salting their water, which could cause them to stop drinking. Instead, provide them with a block or salt supplement that allows for optional intake.  ", " Hand-graze or hand-walk your horse at the show. If it is possible, get your horse out on a walk or to graze while you are at the show. Both promote digestive health, and will help your horse maintain its regular schedule. Walking and grazing can also help horses shed the bad attitude that sometimes comes with being confined at a show for an extended period of time.  "], "Making Necessary Nutritional Changes Gradually": [" Make any changes to diet or feeding schedule gradually. If you decide to change the type, amount, or frequency of feed for your horse, you must do so over an extended period of time. Abrupt changes to a horse's feeding schedule or food type can lead to colic or founder.  To change the amount of food, decrease or increase a little at a time over several weeks. To change the type of food, try replacing ¼ of the old food with the new food every 2 days over the course of 8 days.  ", " Reduce excitability with a diet low in sugar and starch. The sugar and starch content of your horse's diet can be linked to higher levels of excitability. This can become a problem during show season for some horses. To prevent excitability, try feeding your horse a feed that contains a sugar and starch level lower than 20% and a fat level of 10% or higher.  ", " Increase stamina by adding fat to your horse's diet. A diet higher in fat can allow horses to process glycogen more efficiently, and increase their overall stamina. Try feeding your horse a feed with a fat level of 10% or more. You can also increase the amount of fat in your horse's diet by adding a fat supplement.  ", " Consider a B12 supplement. This supplement can increase energy levels in horses, and helps fight fatigue. If you are looking to heighten your horse's energy level, consider giving them a B12 supplement. You can give your horse a B12 supplement by injection. You can also administer B12 gel to your horse through the mouth via a syringe.  "], "Keeping Your Horse Hydrated During Show Season": [" Offer your horse water on a regular basis. It is important that your horse is hydrated while on the road and while stabled at show locations. Give your horse fresh, clean water every two hours while you are traveling to a show. While stabled at the show, fresh water should be available around the clock. Offer your horse water between events or classes.  Horses should drink 8-30 gallons of water per day, depending on activity level and climate.  ", " Bring water from home. Sometimes horses are reluctant to drink water away from home. The water can smell or taste different due to locale and chlorination. If you are traveling to a trail ride, show, or event, consider bringing along water from home. This will help ensure your horse remains hydrated during the time it is away from home. You can transport the water in a large water tank that will fit in the back of a truck. ", " Consider flavoring the water. If your horse is reluctant to drink water away from home, consider adding a flavoring agent to it. A few days before travel, begin flavoring your horse's water at home. This will help ease your horse into drinking flavored water while on the road. Just make sure the flavoring doesn't contain caffeine or other additives that might trigger a drug test.  Wintergreen and vanilla are good flavoring choices. You can also use apple juice or molasses, but both will add sugar to your horse's diet. Alternatively, you can add one or two handfuls of sweet feed into the water and let it soak to create a kind of \"sweet tea\" that many horses enjoy.  ", " Add electrolytes to the water. Dehydration and extreme heat can occur during show season, disrupting your horse's electrolyte balance. Add dissolvable electrolytes to your horse's water at least a week before the show. Make sure you offer a bucket of plain water alongside the supplemented water.  You can also deliver electrolytes to your horse through the mouth with a syringe. Powdered electrolytes can be fed to the horse as a dressing on grain.  ", " Soak hay as a mash to encourage more water intake. Some brands of hay are perfect for travel because they soak well in water. These can be used to make a slurry that will encourage your horse to drink a bit more while they travel with you.  ", " Always have a bucket of plain water available along with enhanced water. If you have added anything to your horse's water, including electrolytes, flavoring, or hay, you need to offer them a bucket of clean, fresh water too. Make sure they have access to at least one 20 gallon (75 L) bucket of fresh water at all times. "]}}, "How to Make Horse Shows More Affordable": {"description": "The only thing more expensive then owning a horse is competing one! As well as membership fees, entry fees, starting fees, transporting the horse and eating out, there is the continual training costs in-between, essential if you want to be successful. By planning ahead and cutting down on a few luxuries you can make your horse show just as fun and more affordable, allowing you to go to more shows then ever!", "content": {"Steps": [" Braid and trim your own horse. Although you can pay professionals to do this for you,. It is easy to learn how, even if it won't look as good at the start. If you have always done your one braiding and trimming by the time you get to higher levels you will be as good as the professionals.  ", " Take some food or buy food from local shops rather then vendors. Take lots of bottled water . ", " Share transport with other people. If you want to go to a competition more than a few miles away you will have to transport your horse in a horsebox or trailer. These are expensive to buy, run and maintain and also to hire. Asking some one who is going to the same competition as you is best as you can act as each others grooms and both benefit. Otherwise you can cash in a favour and ask if they would be willing to drive your horse, or let you borrow their rig. Make sure you are comfortable manoeuvring the trailer around before you take it out with your horse inside. ", " Look at what's available locally before going further afield. Showing around the area means cheaper towing fees, and its great for the environment , too. "]}}, "How to Succeed at Your First Horse Show": {"description": "Attending your first horse show can be both exciting and daunting—there is so much to experience! Start planning several months ahead of time so you and your horse can practice for the show and get everything together that you’ll need. Decide beforehand what you’d like to accomplish at the show, whether that’s placing in a competition or simply meeting others and learning the ropes. Most of all, remember to have fun, enjoy yourself, and gain invaluable experience—hopefully this will be your first horse show of many.", "content": {"Getting into the Right Headspace": [" Envision your ideal show and set goals for yourself. Before you even start practicing and planning, think about what you’d like to be true of your first horse show. Perhaps you’d like to place in the competition, or maybe you just want to meet other horse enthusiasts and learn from the experience. Try to think of 3 goals for your first show, and then write them down somewhere you’ll see often.  For example, you could write down that you’d like to successfully show in a particular riding style, meet a new friend, and expose your horse to the showing environment so you can continue attending shows in the future. Maybe you’ll win the showing, but keep in mind that you’re getting your first arena-experience, and that is worth more than trophies and ribbons.   ", " Be patient with yourself and your horse. Remember, you and your horse are both going to be experiencing a lot of new things. Chances are, something will go wrong and you’ll have to adapt, or maybe a particular skill will be harder than you anticipated. That is okay! Start practicing once you decide to enter a show, and work diligently to prepare yourself and your horse.  When you find yourself getting frustrated during the preparations and showing process, remind yourself that you’re doing the best you can, and so is your horse.  ", " Decide to focus on yourself rather than your competitors. Horse shows are busy places. There will be a lot happening and there will be other people around who have a lot more experience than you. If you can, try to remember that even those really experienced people were once beginners, just like you. Instead of viewing them as competition, try to see them as people you can learn from and try to not compare yourself to them.  Remember, everyone is on their own journey and has different experience levels and skill sets. Before you know it, you’ll be one of those experienced riders, too!  ", " Be ready for the unexpected. How can you prepare for the unexpected? Resolve to do as much as you can to prepare yourself and trust in your own abilities. Understand that not everything will go as planned, and things will come up that you couldn’t have anticipated. Decide beforehand to be flexible and open to changing situations.  With preparation and a good attitude, you’re ready to start practicing and prepping for your first show!  "], "Practicing and Preparing": [" Look for a green horse show for your first competition. Depending on where you live, you may need to travel a little distance to get to a horse show. When researching options, look for beginner shows. This will give you an opportunity to show along with other riders and horses who may not have much experience, and the atmosphere is usually a little more relaxed. “Green” means inexperienced or new. These shows will help you learn the building blocks of showmanship. You’ll get to expose yourself and your horse to the atmosphere without all the pressure of an expert show.  ", " Study English or western riding to learn what’s expected of you. If you’ve been taking riding lessons , chances are you’ve already been training in either English or western style. There should be competition guidelines available online or in person for you to reference. Study them and make a plan to practice the necessary skills. The two main horseback-riding styles are:  English style: the saddle is narrower, and you use the reins a lot more to control the horse. More coordination is generally required for English-style riders. Western style: the saddle is larger and distributes your weight over more of the horse. You generally use your weight and legs to guide the horse.  ", " Make a list of all the various items you and horse need for the show. Visit or call the arena beforehand to see what is provided and what you’ll need to bring with you. Do this at least two weeks before the show so you have time to gather everything together. Among other things, you’ll need:   kit Clothing for yourself Feed and water buckets Paperwork Transportation First aid kits for both you and your horse Folding chairs Snacks or meals for yourself Sunscreen  ", " Train with your horse to prepare them for the show’s routine. The more you can subject your horse to the rhythm of the show, the more comfortable both you and your horse will be the day of the competition. After you get the guidelines, start training your horse for those specific skills.  For example, if there is an obstacle course followed by a jumping course, always practice those tasks in that order. Even things like getting your horse used to a loudspeaker can be really helpful. If your horse isn’t used to other horses and riders, you may want to find a way to expose them to more people so they aren’t overwhelmed by all the hustle and bustle of a show.  ", " Create an itinerary for the day before and of the show. Several weeks before the show, sit down and make an extensive plan. Include travel and rest time, grooming time, and show time. Having a plan before you leave will help relieve anxiety and help you focus on the present moment. Things to include in your schedule are:  Time to get your and your horse’s things packed Travel time with a buffer in case you get delayed Grooming time before the show Time for meals for you and your horse Itinerary for the day of the show Breakdown time before you head home after the show  ", " Groom your horse and take care of cosmetic issues before the show. One to two days before the show you should give your horse a bath and do any necessary grooming. Consider braiding their mane even if it’ll be down for the show, because that will keep it from getting tangled while you’re traveling.  You’ll do more last-minute grooming when you’re at the arena, but this will help you prepare.  "], "Showing Successfully": [" Show up early so you’re not rushing around the day of the show. If you’re traveling from out of town, you may even want to make arrangements to arrive the night before. Chances are, you can stable your horse at the arena and stay at a hotel nearby. If you’re competing in town, plan to arrive several hours before your start time so you can settle in and get ready without feeling rushed.  Slow and steady is a better mindset for your horse, too. They might not react well to being rushed or they might just refuse to pick up the pace, which could make your experience more harried than you’d like.  ", " Introduce your horse to the arena and walk it around before the show. After you’ve arrived and unpacked, take your horse out of the stable and walk them around. Take them down the path to enter the arena. Let them meet other horses and riders. This will help them be more comfortable and less anxious about the new surroundings.  This is also a great time for you to meet new people. Don’t be afraid to talk to others, introduce yourself, and ask questions. You never know when you might meet a new friend or learn something helpful!  ", " Feed and do last-minute grooming an hour or two before the show. It’s a myth that you shouldn’t feed your horse before a show. Keeping your horse on a regular feeding schedule as much as you can and not depriving them will make them more comfortable. Feed your horse two hours before they’re set to enter the arena so the food has some time to settle, and start the finishing touches of the grooming regimen after they’ve eaten.  Don’t forget to eat something yourself! If you feel nervous and don’t have much of an appetite, try to make yourself eat something with some protein in it. The last thing you want is to get light-headed while you’re out in the arena.  ", " Get rid of distractions and focus your attention on the task at hand. Once you’re actually headed for the arena, focus on your horse and the event before you. Try to ignore the other riders and horses, and keep your goals in mind.  If you have trouble concentrating, try mentally narrating what you’re experiencing. This is a great way to focus your mind on what you’re doing at any given moment.  ", " Remember to breathe and enjoy yourself! Don’t forget—this is just one competition! There will be many others to come, and you’ll learn something new at each one. Your horse will pick up on your energy, so try to be calm and remind yourself what you’re there for.  After you get home from the show, take a few minutes to write down the highlights of your experience and how you did with your goals. The next time you do a show, you can refer back to this list and add to it as you gain more experience. This is a great way to see how you’ve grown.  "]}}, "How to Win a Horse Event": {"description": "When you compete in a horse show, you're most likely hoping to win. You can increase your chances by practicing for your events ahead of time—getting your horse used to the routine for any particular event is the best way to perfect your skills. Prep for the actual show by making a packing list, grooming your horse, and showing up early for your event. When you get to the day of the competition, you'll be ready to give your best!", "content": {"Practicing for the Event": [" Pick an event to compete in. In most events, you will guide your horse through a series of obstacles in a large, contained pen. You're most often judged on accuracy, speed, and form. Depending on what kind of riding you're already doing (Western or English), you may already have an event in mind that you'd like to train for. Some of the more popular event concentrations are:  Dressage: focuses on how well your horse listens to your instructions and how well you carry yourself while you're riding. Eventing: generally a 3-day competition where you compete in multiple events, like dressage, jumping, and obstacle courses. Jumping: where you and your horse complete a series of different levels of jumps and are scored on form, control, and obedience. Reining: you guide your horse through several different movements, like circles, stops, spins, and turns. There are also events for different experience levels, like junior events for people under 18 and amateur events for newer riders who are older than 18.   ", " Sign up for a competition and pay the required fees to secure your spot. You will need to make a payment to reserve your spot in the stable, as well as a spot for parking your RV or trailer. There may be other costs associated with the competition, too, and spaces are generally limited, so make sure you sign up for an event months in advance. You can expect to pay anywhere from $150 to $300 just for the registration fee.  Smaller, local competitions generally cost around $100, so consider entering one of those if this is your first time competing. Your fee also pays for judges, advertising, and the staff who help pull the event together.  ", " Learn the order of the routine you need to complete for your event. Any event you sign up to compete in will have details regarding the order of the obstacles or course. Don't wait until the month before a show to figure out the logistics for your event—you need enough time to practice any problem areas and then put together the entire routine with your horse.  You can also look online for videos of past events to familiarize yourself with the pace of the competition. This can be really helpful if you've never shown before.  ", " Break down the routine and practice it in parts. If your horse isn't used to competing, it may need some time to build up its endurance. Start each training session with a warm-up, and then break down the parts of the event into 5 to 10-minute sessions. Always stop before your horse is over-tired, which can be seen in heavy or fast breathing, lethargic movements, or a general unwillingness to listen to your instructions.  For example, if your event consists of jumps and barrel runs, work on the jumps for the first 10 minutes of your session, take a small walking break, and then return to the jumps. The next session, work on barrel runs.  ", " Run through the routine 3 times per week the month before the show. Once you've practiced each part of the routine individually, it's time to put things together. Start acclimating your horse to the full routine by putting it through its paces several times a week. This will help you cut down on timing and identify any problem areas you need to address before the show.  The more you practice the event in the order it'll happen, the more comfortable you and your horse will be on the day of the competition.  ", " Practice problem areas with your horse to get them ready. When you notice there is an area you aren't quite getting, try slowing things down (if you can). For example, if your horse continually knocks into barrels or posts, which can often detract points from your total score, try practicing the routine at a slower pace.  It can be really helpful to have someone video you when you're doing a run-through. Watch the video of yourself and take notes of things you need to work on, from your own posture and presence to any clumsy or hesitant movements.  ", " Visualize yourself succeeding and stay positive. A big part of success is keeping a positive outlook. You've been putting in the time to practice for your event, so focus on the good you and your horse have accomplished in your training. You'll feel much better going into the competition, which in turn will make you more relaxed and likely to succeed.  Your horse can pick up on your energy, so it's also important that you stay calm. Use reassuring words and an even, warm tone when you speak with your horse, and make sure to reward them when they do things right.  "], "Packing and Prepping for the Show": [" Check the rules and regulations for tack, clothing, and grooming. Some competitions will require you to have a change of clothes for different parts of the event, while others might require your horse's tack to look a certain way. Read over all the paperwork as well as the FAQs for your event to make sure you're taking everything into consideration.  If there is something you need that you don't have, order it right away so it arrives in time for the competition.  ", " Make a list of all the things you'll need to bring to the competition. This will help you stay organized as you prepare for the show . You'll have a lot going on with practicing and prepping, so do what you can to keep yourself on track. Try making a list on your phone of things you need to get or where other items are being stored so you don't forget them. Things to remember to bring:  Registration paperwork Required health permits First aid kit (for both you and your horse) Grooming kit Food for your horse Feed and water buckets Tack Your own clothes Sunscreen Snacks and water for yourself Folding chairs Don't forget that you'll need to arrange for transportation, too! If you don't have your own trailer, you'll need to rent or borrow one for the duration of the event.  ", " Groom your horse thoroughly several days before the show. Give your horse a full-body bath and wash its mane and tail. Clip your horse's legs (you may even want to do this a full week before the show), face, and ears. Clean, buff, and polish its hooves, and apply a conditioner to its mane and tail. You'll still do last-minute grooming at the horse show, but this will be a great start to getting your horse ready.  Look into dust-repellent products if you're going to be competing in a dry, dusty environment. You can also hire a professional groomer to come out and give your horse a once-over a few days before the event.  ", " Pack your bag and your horse's gear the day before you leave. Get out that list you made earlier and start packing up your gear. This is also the time to iron your clothes and make sure everything is clean and in good working order. If you're staying at a hotel overnight, pack a separate bag with whatever toiletries and clothes you need so that you don't have to unpack all your gear to get to it.  Ask for help from family or friends if you need an extra pair of hands to get ready in time. Plus, it might make the packing process a little more fun!  ", " Leave extra time for unexpected things on your travel day. Plan to arrive at the facility the day before your event if you can. If not, at least leave several extra hours between your arrival time and show time. If you're able to, give yourself a big buffer so that you can deal with anything unexpected, like needing to stop at the store or deal with a flat tire.  If you're traveling with others, set an agreed-upon time for everyone to meet up at a designated spot.  "], "Competing in the Event": [" Check in as soon as you get to the arena to get your competitor number. You don't want to forget to check in so make your first stop the registration area. You'll get your number, paperwork, schedule of events, and a map of the facility.  If you have a lot of paperwork, keep track of it all by creating an event binder. You can use this to organize training schedules, packing lists, and event details.  ", " Settle your horse into its stable and give it food and water. Your horse should eat and drink 2 to 3 hours before the event. If you arrive earlier than that, keep your horse on its regular feeding schedule, and then give it another chance to eat at that 2 to 3-hour mark.  If this is your horse's first event, it can be an overwhelming time. Walk them around a little bit to get a sense of the space. This can also help you get rid of some pre-event jitters.  ", " Warm up an hour or two before your event starts. There should be a schooling ring available for you to warm up in that is next to the arena where your event will be. This is an important time for you and your horse to start gearing up for the main event. Walk, trot, and canter around a little, and do some light jumps if that is something you're comfortable with.  Make sure to take a few minutes to stretch your body, too. You'll feel more limber and relaxed as you head into the event.  ", " Brush down your horse and make sure its ready for the event. The last hour before the show, get dressed, deal with your own personal grooming, and then address your horse. Make sure its hooves are clean, give it a final brush down, and tidy up its mane and tail if any hairs are out of place. You may also want to apply a shine-coat last minute so it looks pristine as you get ready to head out to the arena.  Presentation is often a big component of events. Judges will mark you down for sloppy clothes or a poorly-groomed horse.  ", " Stay focused on the tasks at hand and avoid distractions. You may be tempted to watch the people you're competing against or to look at the judges, but try and just focus on what you're meant to be doing. Remember your training, and commit to doing your very best when you get out into the arena.  Even if you make a mistake, that doesn't mean you won't win. Recover from whatever happens, move on to the next moment, and treat it as a new opportunity to succeed.  ", " Have fun, enjoy yourself, and learn from the process. Hopefully, you'll be celebrating at the end of the event when you win! Be gracious to others around you, and compliment the other riders and horses. After you get home from the event, take a few moments to write down what went well and what will help you continue succeeding in the future.  Don't forget to reward your horse with a few extra days of rest before you start training for your next show. Chances are, both you and your horse will need a little extra downtime after all the excitement from the show.  "]}}, "How to Do a Right Hand Push Gate Open at a Horse Show (in Hand)": {"description": "A gate is a common obstacle in trail courses, and how you perform the gate-push will have a factor on how you place. Often the pattern or judge will specify a right-hand push, but when neither has a preference, by default you should do the more professional right-hand push.", "content": {"Steps": [" Approach gate at desired gait, halt.   ", " Walk around the front of the horse to the off-side (right side), and then grasp the lead with your left hand. Make sure you walk around the horse you switch hands. ", " Raise the right hand and unlatch the gate.  ", " Walk through, pivot the horse towards you, and re-latch the gate.  ", " Halt horse, walk around front of horse to normal (left) side, and then grasp the lead with your right hand. Again, make sure you walk around the horse switching hands. ", " Pivot the horse away from the gate, and continue course. For extra professionalism, take a second to stand still and acknowledge the judge while smiling, and then resume the course! "]}}, "How to Campdraft With Your Horse": {"description": "Campdrafting is a uniquely Australian horse sport that puts the skills of both horse and rider to the test and is a great test of how good a cattleman you truly are. Campdrafting involves two main stages firstly \"The Camp\" or cutout yard where the rider selects his beast, separates it from a mob and works it, and \"The Course\" or arena, where the rider guides his beast in a pattern. Campdrafts are judged by a single judge on horseback. Instead of a whistle to signal disqualification of the end of a run, the judge will crack a stock whip, if the stock whip is cracked you are disqualified (cracked off).", "content": {"Steps": [" Before you even think about beginning to campdraft, you need to ensure that both you and your horse are up to the job. Riders need to be very competent and confident and should have some experience working cattle. A horse will preferably have had experience working cattle. Horses should have the ability to turn on their back legs, stop and start quickly similarly to a cutting horse. Indeed, many cutting horses, or, more commonly cutting bred horses, often make fine campdrafters, providing they have the speed to keep up with a beast in the arena. The most common breed used for campdrafting is the Australian Stock horse, closely followed by the Quarter horse, however almost any smart horse with a bit of cattle sense can make a campdrafter.  ", " If you have never seen a campdraft before, it is probably a good idea to go for a look first. Many small towns in Australia run a campdraft at least once a year and there are campdraft exhibitions at all the major royal shows. Campdraft calendars can be accessed at the following sites-<www.abcra.com.au> (Australian bushman's campdraft and rodeo assn.), <www.campdraft.org.au> (Southern Campdrafting assn.), <www.campdraft.com.au> (Australian campdraft assn.), <www.campdraft.com.au> (Australian campdraft assn.), NB- As these sites are different associations they all have different campdrafts. ", " Go to a small campdraft first. So, you're all set, you've got an idea what to do and you're at your first draft. It's probably best if you go to a small local one for your first time. The competitors will tend to be more friendly and it is a lot more fun, even if the cattle are often more difficult. ", " Like any sport, you will need to warm your horse up before you run. If you have time, you should take at least half an hour to do this, and longer if your horse is unused to the atmosphere. Once the initial warming up is done, a great place to work your horse is in the arena, returning cattle that have already been run into holding pens. Everyone is usually welcome to help out but it can get crowded in the mid morning before the weather is too hot. This is great to get your horse on cattle and to get him used to the atmosphere. ", " Once you and your suitably warmed up horse are ready, you should head to the camp. How long you spend here is personal preference. Some people arrive half an hour before their run, others arrive just as they are about to go in. My personal preference is to arrive 10 runs before mine, to give both you and your horse ample time to relax and for you to pick a beast. ", " Pick the right horse. Picking a beast is probably one of the hardest parts of drafting. Often this is a personal preference, with people choosing a certain breed of cattle or maybe heifers or steers. A general rule of thumb is to pick the beast you would want to take home to slaughter. You don't want a little mouldy beast as the smaller ones can run very fast and are often dangerous. A beast that is over fat is likely to knock up outside and prevent you from completing the course. You want a beast that turns away from the horse and rider (but does so calmly- the beast that bolts away will do just that outside), is alert and not in amongst the mob. in an ideal world this is what you would pick. also, never be afraid to ask, most campdrafters are more than happy to help a newbie. ", " OK, so you've picked your beast and the announcer has just called your name.  RELAX . If you get tense, so will your horse, and you WILL stuff up. Ride in with one hand on your waist to relax you. If the judge isn't looking, you can ride amongst the mob to help chose a beast, just be careful not to start working until he says go. ", " Start when you are told to and not before. The judge will tell you to start when the previous competitor's beast is off the course. Usually he will call out to you to start, or it may simply be a nod. Either way, be ready when he says go. There is nothing more infuriating than someone trying to pick a beast when the judge is waiting. Shorten your reins, using two hands and calmly try to cut your beast from the mob. If he is on his own you can simply ride up to him and push him down the camp. You may need to bring more than one beast up the front. This is OK, but should be avoided. It looks bad and it works your horse up. Once your beast is separated you need to turn it about 2-3 times at the front of the camp. Once you become more experienced you can get a bit more 'fancy' but for your first little while its best to keep it simple. ", " You have finished your yard work, you need to call out for the gate at the front of the camp to be opened. Yell out \"GATE\" or \"RIGHT\" or whatever else, just make it loud and clear as the gatemen are more than likely chatting or half asleep. ", " Now is the scary part. You are outside in the arena. For the purpose of this we will assume it is a left hand course (the judge will tell you if the course is left or right hand). Your aim is to turn the beast around the first peg , then bring him round in a figure 8 and go round the second peg before going through the \"Gate\" (two pegs\"). The whole course is similar to a barrel course. Use common sense to turn the beast. If you want him to turn a gradual left, hang back about the length of one beast back and one out from his head, on his right hand side. If he turns to quick, change sides to correct him. Sometimes it is necessary to \"Shoulder\" the beast, or push him with your horse's shoulder. DO NOT ATTEMPT THIS UNLESS YOU AND YOUR HORSE ARE VERY EXPERIENCED. This is one of the major causes of accidents. ", " HAVE FUN. Remember, you are not doing this to make money. If you win that's a bonus, if you get the whip in the camp then bad luck, try again next time. Don't lose heart. If you stick at it long enough you will get there. ", " Now go and waste some money on entry fees.  "]}}, "How to Prepare for a Western and English Horse Show": {"description": "Its always fun to get ready for the horse show you entered. It is also one of the most important time for the show, so here are some tips and other stuff to help calm your nerves and make sure you don't forget anything.", "content": {"Steps": [" Make sure you register into the horse show. Try to send it in and have them get it before the marked date for that may get you a discount on the overall price. If you do not get the form in it is also fine to bring it to the show filled out and enter at the horse show.  ", " Set aside some money. You may want to enter a few other classes or get a soda and a hot dog at the food stand if you don't bring your own lunch. ", " Give your horse a bath. If your horse is white or has quite a bit of white or grey on him/her don't be afraid of giving them a second bath. Otherwise you just need to make sure they are squeaky clean with no manure stains or other noticeable things. On white horses, they sell specific products to clean their coats more and deeper, since you can see all the dirt because of their light color. It is always a good idea to give them a bath the day before the show because this can be quite time consuming. ", " Braid your horse's mane and tail. This is optional for schooling shows but may come in handy for the judges scores. If you horse is in a stall and will not dirty or mess up the braids, put them in the night before. Again this is very time consuming. If he might, get up a little earlier and do it in the morning of the show. ", " Lay out your outfits and put them in bags the night before. If you plan to wear them to the show (not recommended) you might just leave them out to put them on before you leave. Remember to prepare for what events you are entering. Its no fun to walk into a western pleasure class dressed for jumping. ", " Set out all your things and clean them. .. DEEP CLEAN! Polish boots and wash clothes. Wipe helmets and iron coats. Lay them all in a box or bag you can put into the vehicle very quickly if time pressed. Best if put in clothes or boot bags. They even make helmet bags. You can get these at your local tack shop for a reasonable price. ", " Load your trailer the night before. Clean your tack and polish everything to the extremes! Soak your bits and check your horse. Organizing always made everything easier, so make sure you put everything in its place and remember its there, for you will probably need it at the horse show. ", " Do you have a long drive from your house to the show or from the house to the barn to the show? Set aside some books and games you can do while driving over there. Its better to play games and not think about the show because of experience I know how you always think of what could go wrong. If not think of what you can do with your friends. And who you will cheer on. Think of how much fun you are going to have. ", " Check everything twice before you go to bed and put in all you accessories, like stock pins and hair nets. You may also want to load it all in the trailer or truck the night before so it is less time in the morning. ", " Eat a hardy dinner and go to bed early. It may be really hard to sleep do to anxiety. Don't worry about it. Picture yourself holding up the trophy or ribbon for 1st. Think of positive things and you will dream of positive things and have a better experience at the show. ", " Eat a big breakfast and get dressed. Go out to you horse and check him/her for manure stains and any signs of illness. It is a good idea to groom the horse before you put their hauling equipment on. Load the horse fifteen minutes to half an hour before you have to go, depending on the horse's ability to load. Check everything again. Make sure you aren't forgetting anything and check the trailer. Put in a little hint of hay for you horse and away you go. ", " When you get there braid (if you hadn't already), bathe (if you hadn't already), and groom again. Go get your number from the secretary's booth. Thirty minutes to forty five minutes before you class, get dressed and do your hair. Spray some hair spray in you and your horse's mane / hair. Put on your horse's tack and let them walk around and see the environment. ", " When you walk up to the gate, tell the person standing with the clipboard you are here and give them you number verbally. Then you can walk around and warm up your horse so his/her muscles don't tear. ", " When the person with the megaphone announces your class, don't get freaked out. Its just a class. You ride, the judge scores, if you didn't win, there are TONS of other chances you will have. If you are disappointed at your score. Don't get mad at the judge. Tip your helmet and walk out when dismissed.  If you are really mad and need to let it out, do it in the bathroom or in the empty horse trailer. If you really believe the judge scored you wrong, ask the secretary to talk to her at lunch break. It is unlikely but you could try to get the reason you scored what you did. Some judges even go up to you and tell you what you did wrong during the class before ribbons are awarded. That tells you what you did wrong and what to keep doing. "]}}, "How to Prepare Yourself for a Horse Show": {"description": "Preparation for a horse show includes both you and the horse. Having a list will keep you focused and reduces the nerves that you'll forget something.", "content": {"Creating a list": [" Make a list of all things that are needed to be done and that you need to take to the show. Do this a week or so prior to your horse show, no later than 5 days beforehand.  ", " Make sure that everything you need is placed on the list. This might also include extra halters, show clothes and food. ", " Review the list under \"Things You'll Need\". This very detailed list will assist you in making your own personalized list. "], "Preparing yourself": [" Remain calm or you will make your horse nervous. Horses can sense your attitude, so keep confident! ", " Keep your show clothes clean. Get bags to carry all of your show clothes in and to keep them clean and wrinkle-free. You spent a lot of money on those clothes, so take good care of them. ", " Carry your makeup and hair stuff in garment bags.  ", " The day before the show, have everything packed in the car. Check off what is packed in the car. Always have extra water for yourself and healthy foods so that you have energy throughout the day(s).  "], "Preparing the gear": [" Clean all things properly with the correct cleaner so that nothing gets ruined. Wash saddle pads, iron and wash clothes, and everything else. ", " Have a clean neat place to put it all, like in your tack box (if big enough), or in your spare room in the house.  ", " Bring your work saddle and your show saddle. If you use the same saddle you work in to show, be sure you clean it good before your classes. ", " Get an under pad for showing to prevent your saddle blankets from slipping off or getting all wrinkly.  ", " Bring an extra halter and lead rope just in case you lose your halter or it breaks.  ", " Make sure that you bring bucket hangers because a lot of the show stalls are portable and will not have bucket hangers. They will not allow you to screw or nail anything into/onto their stalls so make sure the hangers are portable (wire, bailing tyne, etc.). ", " Get some sort of a grooming box. This could be a toolbox, tackle box, or some other sort of box. It is intended to help you carry around your brushes and to stay organized. ", " Have more than one hoof pick. They are easy to lose and you should always carry one in your pocket. ", " Put all of the bathing items in some sort of bucket or a bag. This will help you stay organized and makes it much easier to carry around the items. Have two different colored sponges so you won't get them mixed up. One should be to wipe your horse's face and the other one should be to wipe your horse's behind.  "], "Preparing your horse": [" Try to keep your horse as clean as possible. Always take all cleaning items with you, to fix last minute mishaps and messes. ", " Have your horse clean a day before the show and put him in a place where he won't be able to get dirty again. Or, put a light sheet/fly sheet over him, if he is not able to be kept inside. ", " Make sure the mane bands match your horse's mane color.  ", " Do not put show shine in the saddle area of your horse or you will lose your saddle during the show.  ", " Bring plenty of fly spray.  "], "On the day of the show": [" The day of the show, make sure that your horse has hay and water if it is a hot morning or a long ride.  ", " Make sure your horse has the proper protective gear on when trailering. This is important, in case they hit their feet on each other, and for safety precautions. ", " Always leave early in case there is an accident, traffic, etc. Give yourself adequate time for sign in. ", " When at the show, make sure you have help. The horse is the number one priority. Have the stall ready if one is available, or if you have a place it is set up with hay and water. ", " Feed your horse at least 1 1/2 - 2 hours before a show starts. Give your horse some time to digest. ", " Before classes, start clean up your horse and yourself.  ", " Don't be late to any of your classes.  ", " Don't panic when something goes wrong. Just stay relaxed. Travel away inevitably brings up new situations and challenges; just be ready to deal with them. ", " When ready, go into the arena. Be confident and stay happy. Smile and think positive. "]}}, "How to Mentally Prepare Yourself for a Horse Show": {"description": "We all get the dreaded nerves before a horse show, but it is important not to let them get to you as your horse will know and your ride won't be as good. Relax, and have a good ride!", "content": {"Steps": [" Breathe. So many people forget or ignore this step, even thought it is so important. Just take a deep breath and focus on how well you will do.  ", " Study your course or your dressage test thoroughly. If you have it memorized, then you can focus on your ride instead of where you need to go next. ", " Create a playlist before the show and listen to it on the ride there. By listening to music, it will calm you down. Make sure you put music that will calm you instead of music that will hype you up. ", " Keep track of your things, especially your number. The last thing you want to worry about is where your number is, so make sure everything is organized before the day of the show. ", " Bring a Distraction. Whether it's a friend or a stress ball, be sure to keep yourself busy when you have down time so you won't focus on the nerves. ", " Always carry a show bill. You don't want to be scrambling around trying to get your horse ready when you realize your class is next. ", " Practice the day before and the day of the show to get your horse used to the facility (if you are traveling). The last thing you want is for your horse to spook at something. Also pay attention to how your horse reacts so you can decide if they need to be longed. ", " If you are very nervous, be careful with how much you eat before you ride. The last thing you want is for you to get sick because you ate too much. But also, don't eat too little because that can also cause discomfort. ", " Smile! A genuine smile will positively affect the judge's opinion of you. It will also make you happier and less nervous. ", " Have fun. It's not all about winning. Have fun while you're riding and you will perform better. If you do good, great! If you don't, that's okay. We all have those days. Learn from your mistakes, and try again. "]}}}