{"How to Make a Sandwich": {"description": "A sandwich is a quick meal that you can make easily with a variety of ingredients you have around your home. Sandwiches usually consist of meat, cheese, vegetables, and condiments in between 2 slices of bread. You can experiment with different ingredients in your sandwich or you can follow a recipe to make a well-known classic. Once you make your sandwich, enjoy it hot or cold with your favorite side!", "content": {"Making Meat Sandwiches": [" Use sliced meat and cheese for a classic lunch sandwich. Cold cut deli meat and cheese is standard in a lot of simple sandwiches since they’re easy to assemble. Try different deli meats, such as ham, turkey, or roast beef, to see what you like the best and layer a few slices on your bread. Then pick your favorite type of cheese to put on top of the meat. Spread mayonnaise or mustard on one of your bread slices and assemble your sandwich.  Some classic combinations you can try are ham or turkey with Swiss cheese, or roast beef and Cheddar. Toast the sandwich if you want to melt the cheese and heat the meat. Layer multiple slices of meat, cheese, toast, and vegetables to make a .   ", " Try a BLT for a tasty toasted sandwich. Cook 3-4 strips of bacon in a frying pan or in your oven until they’re crispy and set them on a paper towel to absorb some of the grease. Lightly toast your bread so it’s golden brown and crunchy. Place bacon, tomato, and lettuce on top one of the bread slices and put mayo on the top slice of your sandwich to finish your BLT.  Include avocado slices or use turkey bacon if you want to make your sandwich healthier. Try different kinds of bacon, such as maple-infused or hickory smoked, to change the flavor of your BLT.  ", " Make a sandwich with egg and bacon for a breakfast option. Start by cooking the bacon in a frying pan or in your oven until the strips are crispy. Either fry your eggs or scramble them so it’s easier to put on your sandwich. Toast your bread and layer the bacon and eggs on the bottom. Top your sandwich with cheese and mayonnaise to finish it so you can enjoy breakfast.  Put vegetables, like tomatoes, onions, or peppers, in your eggs to make your sandwich have a fresh flavor. Use a biscuit or an English muffin instead of bread if you want your sandwich to feel more like a breakfast meal.  ", " Have a reuben for a salty and tangy sandwich. Cut 2 slices of rye or pumpernickel bread and spread butter on them. Set one of the slices buttered side down in a pan, and layer slices of corned beef and Swiss cheese on top of the slice. Spread sauerkraut and Russian dressing on top of the meat and cheese before topping it with the other slice of bread. Heat the sandwich over medium-low heat and flip it over when one side gets crispy.  Compress the sandwich with another skillet while it’s cooking to flatten it and make it easier to eat. Try having reubens with different meats, like roast beef or chicken, if you want to experiment with flavors. Include pickles on your reuben if you want another sour, tangy flavor to go with the sauerkraut.  ", " Cook a tuna melt for a delicious fish sandwich. Drain a can of tuna so it doesn’t have any liquid left. Mix the tuna with mayonnaise, salt, and pepper to give it some flavor before spreading it onto your slices of bread. Include slices of your favorite cheese and vegetables before toasting the bread in a pan over medium-low heat. Flip the sandwich once it’s golden brown on one side and let it finish cooking.  Mix hot sauce into your tuna if you want to make your sandwich spicier. Chop onions and peppers to mix in with your tuna if you want to add crunch to your sandwich.  "], "Making a Basic Sandwich": [" Choose your favorite type of bread for the sandwich. Any type of bread will work for your sandwich, so pick the one that you like the most. If you want something healthier, look for whole grain or multigrain to get helpful nutrients and fibers. You can either used pre-sliced bread or buy an entire loaf to cut your own. Use 2 slices of the bread you choose and lay them flat on your plate so you can easily build your sandwich on top of them.  Look for different types of bread, like sourdough, pumpernickel, or rye, to see how they affect the overall flavor of your sandwich. If you want to make a large sub sandwich, cut a baguette horizontally down the middle to use as the top and bottom pieces. Try using buns or rolls instead of sliced bread if you want to make smaller sandwiches. Look for pitas or tortillas if you’d rather have a wrap.  ", " Spread your condiments directly onto the bread. Try condiments like mayonnaise, mustard, ketchup, or a dressing to add more flavor to your sandwich. Spread a thin layer of the condiments on the bread with a knife so they cover the entire slice. Be careful not to use too much of a  condiment or else it will drip out or spill easily when you try to eat the sandwich. You can put the condiments on both slices of bread or just one depending on how much you want to use.  Experiment with different condiments to find new sandwich flavors. For example, you may use pesto, hummus, or Greek yogurt instead of a standard condiment. You can also put a condiment directly on another component of your sandwich if you want the flavors to interact. For example, you may put hot sauce directly on meat to make it spicier.  ", " Put meats and cheeses on the bottom of the sandwich. Choose one of the bread slices to use as the bottom for your sandwich so you can start assembling it. Start layering thin slices of meat or cheese on the bottom slice bread so they’re less likely to slip out while you’re eating it. Look for low-sodium or low-calorie options if you want to make your sandwich healthier. Use at least 2-4 slices of meat and 1 piece of cheese so the bread isn’t the dominant flavor.  Common sandwich deli meats include turkey, ham, roast beef, or bologna. Try different types of cheeses with your sandwich. Common choices are Swiss, American, Cheddar, Muenster, and Provolone. You can also use whole pieces of meat, like or piece of steak, to make a heartier sandwich. If you’re not using meat in your sandwich, then put heavier vegetables on the bottom, such as cucumbers or tomatoes.  ", " Add vegetables to your sandwich to add more texture. Classic sandwich vegetables include lettuce, tomato, and onions, but you can include whatever you want when you make your own. Layer the vegetables on top of the meat and cheese, keeping the heavier vegetables near the bottom and the lighter ones at the top. Try to include at least 1-2 vegetables in your sandwich so you can have a healthy meal and so you have different textures when you bite into it.  If you want to add leafy greens, try using lettuce, spinach, arugula, or basil. Add tomatoes, onions, and peppers to add fresh flavors to your sandwich. You can either sauté the vegetables or leave them raw. Put avocado slices or alfalfa sprouts for different textures and flavors.  ", " Season the sandwich to enhance the flavor. Shake a small amount of salt and pepper onto the sandwich to make it taste better. Try different spices or herbs you may have, like basil, oregano, or cayenne pepper, if you want to give your sandwich an additional kick. Only use a tiny pinch of each spice so the flavors aren’t too overwhelming.  ", " Toast the sandwich if you want it hot or crunchy. Heating up your sandwich can help make the bread crispy and make it more enjoyable to eat. Place your sandwich on a baking sheet and place it in an oven preheated to 400 °F (204 °C) until the cheese is melted or the bread is golden brown. Take the sandwich out of the oven and put the slice of bread on top to finish your sandwich.  You can also toast your sandwich in a pan over medium-low heat. Be sure to spray the pan with cooking oil or butter so the bread doesn’t burn. If you want to toast your bread, wait to put on vegetables like lettuce or tomatoes so you can have a fresh flavor.  ", " Cut your sandwich so it’s easier for you to eat. Once your sandwich is completely assembled, press down on the top piece of bread to compress the sandwich so it’s easier to cut. Use a serrated knife to cut through the sandwich so it doesn’t fall apart. You can either cut the sandwich diagonally or into rectangles depending on what you prefer. After you cut the sandwich, eat it and enjoy your meal!  You don’t need to cut the sandwich if you don’t want to. If you want to save some of your sandwich for later, wrap it in foil or a plastic bag and keep it in the fridge to preserve it.  "], "Trying Vegetarian Sandwiches": [" Make a peanut butter and jelly sandwich for a simple meal. Choose chunky or creamy peanut butter depending on what you prefer, and spread a thin layer of it on a slice of your bread. Then pick your favorite type of jelly and spread it on the other slice of bread. Assemble the sandwich and serve it.  Use jam or preserves if you want actual fruit pieces in your sandwich.  ", " Enjoy a grilled cheese if you want a classic sandwich. Choose a slice of your favorite cheese and place it between 2  slices of bread. Butter the outsides of the bread slices and put it on a pan over medium-low heat. Flip the sandwich once it’s golden brown on one side and let the cheese melt completely before serving it.  Serve your grilled cheese with tomato soup so you can dip your sandwich. Make a tomato and mozzarella sandwich for an Italian-style grilled cheese. Include vegetables, like onions, peppers, or tomatoes, to make your sandwich healthier. Put apples on your grilled cheese for a sweet and savory sandwich.  ", " Have a California veggie sandwich for a healthy, loaded option. Spread a thin layer of mashed avocado on one of the slices of bread to start. Layer vegetables like sliced cucumbers, lettuce, tomatoes, onions, and shredded carrots to add as many flavors as you want. Top your sandwich with Greek yogurt or goat cheese to add a different flavor to the sandwich before serving it.  Use pickled vegetables to add a sour flavor and a crunch when you bite into it. If you want to have a creamy, earthy flavor on your sandwich, try spreading goat cheese on one of the bread slices.  ", " Eat an egg salad sandwich for a rich flavor. Chop hard-boiled eggs into small cubes and mix them with mayonnaise, lemon juice, mustard, green onions, and celery. Season your egg salad with salt, pepper, and any other spices you want before chilling it in your fridge for 1 hour. Put the egg salad on your slices of bread and top it with lettuce to finish your sandwich.  Try the egg salad in a lettuce wrap if you want a low-carb meal. Mix cayenne pepper and paprika in your egg salad if you want to give it a kick.  ", " Make a hummus pita for a Mediterranian-style sandwich. Toss shredded carrots, radishes, and red onion in a bowl with parsley, lemon juice, and olive oil to dress the vegetables. Open a slice of pita bread and spread hummus on the inside before putting some of your vegetable mixture in. Add chopped tomatoes, avocado slices, and other herbs into the pita to finish your sandwich.  You can buy pita pockets to make it easier to enjoy your sandwich. Try different flavors of hummus to change how your sandwich tastes.  "]}}, "How to Make a Panini": {"description": "Make a delicious panini with a number of creative and innovative recipe ideas. This healthy and quick meal is sure to fill you up and satisfy your family and friends for lunch or dinner. You can also make a dessert panini to enjoy at the end of the night! Many cookware stores sell panini presses, but you actually don't need one. Try the methods below to make a delicious panini in just a few minutes.", "content": {"Making your Panini": [" Choose your bread. A panini can be made with Italian bread, ciabatta, focaccia, sourdough, or any kind of bread you like. If you are using a roll of bread, slice your bread into 3/4 inch thick slices. You can also cut your bread length-wise.  Keep round tops turned in. If you try to grill round-topped bread, like baguettes, you’ll find it can be a real challenge to keep them from rolling over and spilling out the contents of your panini. To solve this problem, turn round-topped bread inside out so that the flat surfaces make contact with the grill.   ", " Spread olive oil on the inside of your bread. Use a brush or butter knife to distribute a small around of olive oil over the inside surface of your bread. You want to achieve a thin coating here, so make sure not to glob a lot of olive oil onto the bread. If you use too much oil, your bread will get soggy!  ", " Add your cheese. Put one slice of cheese on each piece of bread, against the olive oil. Adding a piece of cheese to each side of the sandwich helps it stick together better while cooking. You can use grated cheese too. If you prefer, you can put cheese just on one side.  ", " Add your filling. You can get as creative as you want with your panini and use a combination of sliced meats or shredded meat, or make a vegetarian panini with sliced zucchini. Add two slices of meat or zucchini to one piece of bread. You can increase the amount of filling if you prefer a thicker panini.  ", " Add some extra flavor. Try some diced onions or fresh cilantro. You can also sprinkle in some salt and pepper, garlic, or add a dash of your favorite hot sauce. If you are interested in adding vegetables like lettuce, spinach, or tomatoes to your panini, wait until you have cooked it. This will ensure that the vegetables stay crisp and don't get soggy.  ", " Close your sandwich and butter the outsides of the bread. Make sure you don't overfill your panini by too much or the inside of the sandwich won't warm properly when cooking. You can also use margarine.  "], "Cooking your Panini": [" Preheat a panini press (optional). Cooking your panini in a panini press is simple and easy. Just place your sandwich inside and close the lid. Cook for about 3-5 minutes. Cook according to the manufacturer's instructions until golden and crisp.  ", " Preheat your skillet. Add butter or oil to your skillet and heat it over medium to low heat until the oil starts to shimmer or until the butter melts. Don't let the butter brown. Without a panini press, your best option is to use a grill pan, but you can use a regular frying pan if that's all you have. Place your sandwich into the heated grill pan. ", " Heat a separate cast iron pan on another burner until hot. Since you aren't using a panini press, you will still need something to press your sandwich down. This is where the cast iron pan comes in. You can use a metal pan or skillet, but a cast iron pan works best. Be careful when handling your pan. Cast iron pans can get very hot so you may need to use an oven mitt to grab it once it's heated.  ", " Press your panini. Place you heated cast iron or metal pan directly onto your sandwich. The weight of the pan on top of your sandwich will create the same effect you'd get from a panini press. Keep in mind, there are additional alternatives to a cast iron pan. Here are some other things you can try: Use a pan lid for a press. This works best if you cook your panini for a few minutes on each side while pressing down on the lid.  Use a pot. If you have a large spaghetti or soup pot, you can put some rocks inside and press your panini with it. Try out the ultimate makeshift panini press by wrapping a brick in aluminum foil and using it to press down your sandwich.   ", " Cook your panini. Let your panini cook like this for about 3-5 minutes or until the bottom piece of bread gets golden brown and the cheese melts. ", " Flip. Lift the cast iron pan away and use a spatula to flip your panini over. Place the cast iron pan back into your panini. Cook your panini until the cheese is melted and the underside is golden brown. ", " Add the vegetables. Remove your panini from the pan and carefully peel it open. Drop in your lettuce, spinach, or any other vegetable you desire. Adding greens last will help they stay crisp. ", " Cut your panini with a straight-edged knife. A sharp, straight-edged knife, rather than a serrated one, will ensure a smooth separation for your finished panini. Serve with a side of chips, a cup of soup, or a delicious salad and enjoy! "], "Getting Creative with your Panini": [" Experiment with a variety of bread. You can use virtually any type of bread you desire. You can even use a bagel. Visit a fresh bakery and try a pretzel roll, pita bread, or even plain white bread. The options are endless! ", " Get creative with the cheese. Try sharp cheddar or a spicy pepper jack. Grate your own cheese or layer on the slices. Mix different cheeses for a more interesting flavor. Try any cheese you like. Try adding some shaved Parmesan, manchego cheese, or soft goat cheese.  ", " Make it crunchy. Add a few minutes to the cooking time to get a rich golden brown. Letting the bread crisp up will create a crunchy panini that is gooey and soft on the inside. ", " Add some vegetables. Try sliced tomatoes, cucumber, onions, or mushrooms. Add these ingredients raw or grill them first. You can even add a few basil leaves or some sliced bell pepper. Be careful when adding \"wet\" ingredients. They might make your sandwich soggy. If you are adding tomatoes, cucumbers, or anything with a high water content, scoop out the seeds first.  ", " Add some fruit. That's right, fruit! Slice some apple or pear for a sweet and refreshing twist on a meat or vegetarian panini. Try adding grilled eggplant in place of meat for a delicious vegetarian panini.  ", " Go crazy with the fillings. You can use any leftover meat you have. Shred chicken or steak or add some crispy bacon. Try adding chopped anchovies for an interesting flavor. Try roast beef, pastrami, or any meat you prefer.  Make sure all the meat you add to your panini is fully cooked.  ", " Top it with some sauce. Spread some pesto sauce inside your sandwich or try your favorite spicy mustard. You can even add some fig jam for an added sweetness. Try BBQ sauce or hot sauce too! ", " Sprinkle on the seasonings. You can't go wrong with a pinch of salt and pepper. But, you don't have to stop there either. Try a dash of garlic or onion salt. Try dusting a bit of garlic salt on the outside of your bread over the butter. Use seasonings sparingly, you can easily overpower your panini with too much salt or garlic.  ", " Make a dessert panini. Use white bread or cinnamon raisin bread and coat the inside with hazelnut spread. Fill your sandwich up with sliced banana and marshmallows and drizzle some chocolate syrup on the inside. Cook until the outsides are golden brown and the marshmallows are melted.  ", " Have a panini party! Invite a group of family and friends to try out your most creative panini. Buy a selection of bread and fillings and challenge your friends to make the most creative and delicious panini. "]}}, "How to Order a Subway Sandwich": {"description": "Ordering a sandwich at Subway can seem like a daunting task if you’ve never done it before. Even if you have ordered one, you know that you have to make a plethora of decisions when building your sandwich. Luckily, you can build the perfect sub by carefully selecting your bread, meat, and toppings based on what you’re in the mood for.", "content": {"Picking Your Bread and Meat": [" Select a footlong or 6-inch sandwich depending on how hungry you are. Subway is well known for offering a choice between a 6-inch and footlong sandwich. The first step is figuring out how hungry you are. If you’re typically capable of eating an entire sandwich and happen to be very hungry, order a footlong. If you’re just stopping by for a light lunch, order a 6-inch sandwich.  ", " Pick the type of bread that you want for your sandwich. Every Subway offers honey oat, Italian herbs and cheese, 9-grain wheat, and Italian bread. Italian and honey oat are classic sandwich choices, while 9-grain wheat provides a healthier option. Italian herbs and cheese has the strongest flavor profile. Select your bread based on what you’re in the mood for, and what kind of sandwich that you’re getting.  Some Subways offer other bread options as well. You may run across hearty Italian, jalapeno cheese, or rosemary and sea salt. These breads all have unique flavor profiles, and you can choose one if you want to try something new.  Subway also offers a flatbread, but it isn’t as healthy as some of their other breads, like the Italian bread. Choose it for the texture, not the healthiness factor.  Some Subways offer lettuce wraps, regular wraps, and gluten-free bread if you’d really like to keep the calories to a minimum.   ", " Order one of Subway’s menu items to determine your meat. Choosing an item from the menu determines the meat base that they’ll use on your sandwich. Most of the menu items are named after their meat, like the Classic Tuna or Rotisserie-Style Chicken. Some of the sandwiches have slightly ambiguous names, like the Cold Cut Combo or Spicy Italian. If you want to know the traditional contents of each sub, you can either ask the sandwich artist or consult a menu. If you’re getting turkey, ask to upgrade it to the Subway carved turkey. It’s a deli-style cut that offers a better texture, and it usually doesn’t cost very much.   ", " Ask for a specific kind of meat if you don’t want a menu item. Alternatively, you can simply say that you want a particular meat, and the Subway sandwich artists will create a custom sandwich using that meat as the base. You can pick and choose as you like, but keep in mind that you may be charged for ordering extra meat. ", " Substitute your meat with a veggie patty if you don’t want meat. While it isn’t usually offered on any traditional sandwich on their menu, Subway has a veggie patty that can be swapped for any meat on the menu. It’s a meatless option, and is high in protein and carbohydrates.  You don’t have to order meat if you don’t want it. You can always start by jumping right into the vegetables. The Veggie Delight is a vegetarian sandwich that features no meat.  "], "Adding Your Toppings": [" Choose the kind of cheese you want on your sandwich. Every Subway has American and Monterey cheddar cheese, but most of them also have mozzarella, cheddar, pepper jack, provolone, and swiss. Select a cheese that you think goes best with the meat on your sandwich. If you’re not sure what kind of cheese belongs on your sandwich, ask your Subway artist what it traditionally comes with.  ", " Have your sandwich toasted if you’d like it heated. After you pick your bread, menu item, and cheese, your sandwich artist will ask you if you’d like it toasted. Deciding between toasted or untoasted boils down to whether you want your sandwich to be warm or not. The oven will make your bread a little crispy and usually adds a delightful texture to your sandwich.   ", " Start with larger vegetables to add to your sandwich. You’ll want to start with the larger vegetables so that your sandwich is properly stacked and won’t fall apart. Start by choosing from lettuce, tomatoes, cucumbers, peppers, or red onions.  You can always specify how much of an ingredient you want to add. Say, “Only a little lettuce” or, “Please add more tomatoes,” and they’ll adjust your order accordingly. You may get charged extra for adding an additional serving of veggies, but not for taking some off of your sandwich.  ", " Cover your larger vegetables with smaller toppings. Once your bigger toppings are added, you’ll be given the option to add pickles, olives, banana peppers, or jalapenos. Add whatever toppings you enjoy to your sandwich. Remember, jalapenos will add some spice to your sandwich while banana peppers tend to be sweet.   ", " Choose your sauces based on your preferred flavor. Subway offers chipotle, light mayonnaise, regular mayonnaise, ranch, oil, and vinaigrette. They also have mustard, vinegar, and sweet onion, which are fat-free choices. Choose whichever sauce sounds good on your sandwich.  Some Subway restaurants have additional sauces, like barbeque, honey mustard, or Italian. If you’re looking for a specific sauce, ask to see if they have it even if it’s not listed on the menu.  Try to avoid mixing sweet toppings with spicy or salty sauces and vice versa. A Sweet Onion Teriyaki Chicken sandwich with banana peppers and olives probably won’t pair well with a spicy chipotle sauce.  ", " Finish your sandwich with oils or spices if you’d like. Oil and vinegar are listed as sauces on Subway’s menu, but they’re usually offered to the customer at the end of the sandwich-making process. They’ll usually be offered alongside oregano, salt, pepper, and other spices. Consider adding some spices or oils if you want a final dimension of texture or flavor on your sandwich. ", " Ask them to make it like the photo if you don’t want to choose your toppings. Alternatively, if you don’t feel like dealing with any of the choices involved in making your sandwich, you can ask your sandwich artist to make your sub the way it is in the photo. They’ll automatically add the traditional ingredients and you won’t have to worry about choosing each individual topping. "]}}, "How to Make Subway Sandwiches at Home": {"description": "If you've ever craved a Subway sandwich but don't want to spend the time or the money going to the actual store, try making your favorite sandwich at home. Try some of the classics or get inventive and make your own. All you'll need is some great bread, the right toppings and a little creativity.", "content": {"Creating Your Sub-Making Station": [" Gather your selection of breads. Subway offers five staple selections of bread (as well as some limited-time only choices). In order to create your own Subway sandwich making station, you’ll need to purchase some great. The five main breads offer at Subway include : 9-grain wheat 9-grain honey oat Italian Italian herbs and cheese Flatbread   ", " Get cheesy. Cheese is arguably one of the best parts of any sandwich. Don’t skimp on your selection while making your subs. Of course, if you come across a cheese you want to have more than the ones offered at Subway, get it! Subway’s selection varies from store to store, but depending on where you are, you might come across: American Monterey cheddar. Feta Mozzarella Natural Cheddar Natural Pepper Jack Natural Provolone Natural Swiss.  ", " Satiate your hankering for meat. Of course, the main staple of a sub (apart from the vegetarians varieties) is the meat. There are of different kinds of cold cuts (and some hot ones) to choose from. Aside from the hot selections that include  meatballs, steak , chicken teriyaki , and buffalo chicken, the cold cuts you should lay out for your own subs include: Turkey Black Forest  Salami Roast beef Bologna Pepperoni Bacon  ", " Don’t forget the toppings. Of course, no sandwich would be as interesting if it didn’t have some delicious toppings. Fresh vegetables are a must so head to your local farmers market to get your supplies for your sandwiches. Items you should look for include : Cucumbers Lettuce Tomatoes Red onions Green Bell Peppers Spinach Banana Peppers Jalapenos Olives Pickles  ", " Lay out the finishing touches. To complete your awesome Subway sandwich, you’ll need some really great sauces. Stick to just one, or try a combination of many--the choice is up to you. Don’t forget salt and pepper along with the sauce of your choice. Among the sauce selections are: Oil Vinegar Regular or light mayonnaise Mustard Honey mustard Ranch Chipotle Southwest  "], "Putting Your Sub Together": [" Lay down a large piece of wax paper. This will accommodate the length of the bread and will keep any dropped topping from getting on the table (so you can just stick them back on the sub). Lay your bread down on the paper and slice it in half lengthwise so that it opens up like a mouth (to gobble up all of those tasty ingredients). ", " Lay the meat out on the bread’s ‘top’. Once you have opened up your bread, flatten it down so that it stays open. Place your slices of meat on the half of the bread that has the top. The amount of meat you put on is up to you (since you’re making it at home and there’s no limit to how much you can put on!). Spread the meat out so that it covers the top. ", " Put the cheese on top of the layer of meat. At Subway, their cheese is cut into triangles. If you are going for really authentic, then cut your cheese into triangles. Whether you do this or not, lay the cheese out over the meat slices. If you did cut them into triangles, tessellate the cheese. This means to alternate the slices so that they don’t overlap.  ", " Toast your partially done sandwich if desired. If you like your cheese melted, turn on your oven and place your sandwich on a baking sheet. Stick it in the broiler or toaster oven for a couple of minutes (until the cheese melts and the bread starts to toast). If you prefer your sandwiches less toasty, skip this step. ", " Lay your veggies out on the bottom half of the bread. Make sure they are spread out. Again, since you are making your sandwich at home, there is no particular order you have to put your veggies on your sandwich in (plus everyone wants different things on their sub). In general, you might consider starting lettuce on first and then working your way through the larger vegetables and on to the olives/pickles/smaller things you might want.. ", " Finish your sandwich with some delicious sauce. Again, the amount of sauce you put on your sandwich depends on your personal preference. Don’t hopelessly drown your sandwich though or your might end up with some really soggy bread. Put your sauce on top of the meat and cheese side and close that baby on up. It’s time to eat. You might want to consider cutting your sandwich in half to make it more manageable.  "], "Trying Traditional Subway Recipes": [" Try an Italian BMT. Choose the sort of bread you want (Italian or Italian herb and cheese are popular choices for this sandwich) and then layer slices of spicy pepperoni, Genoa salami, and Black Forest ham. Make it with cheese, or choose to skip the formaggio (cheese in Italian) and go straight for the veggies. Top it all off with some oil and vinegar.  ", " Give the Subway Melt a try. This sandwich is packed with delicious meats and gooey cheese. Try out the 9-grain wheat and lay down some slices of ham, turkey, and bacon. Next, layer some slices of your favorite cheese on top and pop the whole thing into the oven for a couple of minutes. When the the sandwich comes out all melted and toasty, throw on some veggies and your favorite sauce for the final, delicious touches.  ", " Get into some finger-lickin’ fun with the Meatball Marinara sub. Whip up some fantastic meatballs and pour some marinara on top. Next, add your favorite cheese (mozzarella is always a good way to go) and stick it in the oven until the cheese melts. Delicious!  "]}}, "How to Eat Vegan at Subway": {"description": "One of the biggest difficulties of being vegan is finding eateries that cater to your dietary preferences. Luckily, restaurants like Subway provide quite a few options that are suitable for people who are trying to steer clear of animal products. Start with Italian or 9-grain wheat bread, then add your choice of fresh veggies and cruelty-free condiments like Deli Brown Mustard, Sweet Onion sauce, or oil and vinegar. Complete your meal with a cup of black bean soup, a bag of vegan chips or some apple slices.", "content": {"Picking out Your Bread": [" Stick with basic Italian bread if you don’t eat honey. Subway’s Italian bread is completely free of eggs, dairy, or honey. This makes it an ideal choice for strict vegans whose diets don’t include sweeteners processed by animals or containing animal byproducts.  If you order “white” bread at Subway, your sandwich will be made with Italian bread. All Subway sandwiches are available in 6” or 12” sizes.   ", " Go with 9-Grain Wheat if honey is a part of your vegan diet. The 9-Grain Wheat is another responsible option, assuming you have no problem with honey. It contains more healthy whole grains than the Italian bread, and can lend rich, earthy notes to your sandwich.  Since the 9-Grain Wheat bread is slightly sweet, it can be a good way to balance out sandwiches filled with savory ingredients.  ", " Try the Sourdough or Roasted Garlic if your local Subway carries them. Subway’s tasty Sourdough and Roasted Garlic breads are both vegan-approved, which is good news for bread lovers looking for something a little different. The only downside is that they’re not available at all stores, so you might not be able to make them one of your go-to choices.  Some Subway restaurants may sell Sourdough and Roasted Garlic bread as part of a limited-time promotional special.  ", " Order your sandwich as a wrap. For a lighter lunch, choose one of Subway's Signature wrap flavors—regular, spinach, tomato-basil, or habanero (select stores only)—and get it stuffed with whatever fillings you're craving. Wraps have fewer carbs and calories than bread and are easy to eat on the go.  ", " Choose a salad bowl instead of a sandwich. Subway also offers many different salad options. You can add the same toppings to a salad that are available for sandwiches. Simply order a chopped salad and add whatever vegan options you love best!  "], "Choosing Your Toppings": [" Pile on your favorite vegetables. Subway’s standard veggie options include lettuce, tomatoes, cucumbers, green bell peppers, red onions, spinach, black olives, pickles, jalapeños, and banana peppers. Some restaurants also offer items like avocado, carrots, beetroot and sweet peppers, as well.  For a quick and easy meal, ask for a Veggie Delite sandwich on Italian or 9-Grain Wheat bread. The Veggie Delite is totally meat-free, so ordering it will be easier than listing every component you want individually to your sandwich artist.  ", " Give the new Malibu Garden Patties a shot. A growing number of Subway restaurants (over 540 in the U.S. alone, according to Subway themselves) have begun carrying premade veggie patties, known as Malibu Garden Patties, specifically for vegan customers. A couple of these patties can provide a little extra substance if you don’t feel like chowing down on vegetables alone.  Subway’s Malibu Garden Patties are made with a flavorful mixture of finely-diced vegetables, fresh herbs, and whole grains. Some outlets serve patties named other things, ask about vegan options in store. If you’re not sure whether your Subway location carries Malibu Garden Patties, call and check with them ahead of time. Don’t get the Malibu Garden Patties confused with the Vegimax Patties, which use eggs and milk as a binding agent.   ", " Add guacamole for a serving of healthy fats. Subway’s guacamole is nothing but Haas avocados, jalapeño puree, garlic, onion, and sea salt. Not only that, but it’s full of hearty-healthy monounsaturated fats, making it as nutritious as it is delicious.  There will typically be an extra charge for adding guacamole to your sandwich.  ", " Finish with your choice of vegan-friendly condiments. A surprising number of Subway’s many condiments and sauces qualify as vegan. These include the yellow mustard, Deli Brown Mustard, Sweet Onion Sauce, Fat-Free Italian Dressing, Subway Vinaigrette, Buffalo Sauce, and oil and vinegar.  Mix-and-match multiple condiments to give your favorite sandwich options a little zip.  "], "Pairing Your Sandwich with Vegan-Friendly Sides": [" Grab a bag of chips. If you like a little something crunchy to go along with your sandwich like most people, you’ll be glad to know that Classic Lay’s, Baked Lay’s, and Original SunChip are all vegan offerings. Just be sure to avoid flavored varieties, which often contain cheese and other dairy products.  Making your chips part of a combo meal along with a small drink is usually cheaper than purchasing them separately.  ", " Order a cup of Low-Fat Black Bean Soup. The Low-Fat Black Bean Soup is another health-conscious option offered by select Subway restaurants. A serving of black bean soup has only 210 calories and a single gram of fat, which can make it an attractive alternative to chips if you also happen to be counting calories.  Soups tend vary by season or location, but the Low-Fat Black Bean Soup is a staple of many Subway restaurant menus. As of 2018, soups are only no longer being offered at all Subway locations, so have a backup side in mind.  ", " Ask for a bag of apple slices. Apple slices are ordinarily one of the optional side items that comes with a kids meal, but you can get them with any sandwich or salad upon request. Having a bag of apples with your sandwich is a good way to reduce the number of calories you’re consuming while also making sure you get your fruits and vegetables for the day.  Subway’s packaged apple slices contains a mixture of red and green apples.  "]}}, "How to Make an Indian Vegetable Sandwich": {"description": "Spicy Indian sandwiches are a favorite for munching on the go in India. Street vendors serve both of the recipes below in cities. These sandwiches are well-put together and perfect for eating just about anywhere.", "content": {"null": [" Prepare the masala. Combine one dry red chili, one teaspoon of coriander seeds, two cloves, half an inch of cinnamon stick, half a teaspoon of cumin, and four teaspoons of black pepper. Add the mixture to a small pan and roast it for two minutes over medium heat. Grind the results into a fine powder.  If you don't want to spend time making the masala yourself, you can find already prepared mixtures at Indian food stores.  ", " Add the potato to water and put it on to boil. You'll be mashing it, so boil it until it is soft enough to easily smash it with a potato masher. You'll need to make about a cup mashed. Put it in a bowl and add to it half a teaspoon of salt, one tablespoon of the masala mixture, one tablespoon of tamarind paste, and three teaspoons of sugar. Set it aside. ", " Warm two tablespoons of oil in a pan over medium heat. Add in half a teaspoon of cumin seeds and wait for them to crack open. After this, add in the potato mixture and blend it together. Leave it on low heat to keep it warm. ", " Bring half a cup of water to a boil in a separate pan. Dump in the potato mixture from the last step. Let it simmer over low heat for two minutes, or until it reaches the consistency of a thick paste.  ", " Prepare the bread. Slice some thick sandwich buns into halves. Hoagie rolls work very well for this type of sandwich. Butter both sides of each slice and toast them in a frying pan over medium heat. ", " Make the sandwich. On one half of the buns, add a quarter cup of the filling. Top it with three tablespoons of coriander chutney, one quarter cup of pomegranate seeds, one quarter cup of fine sev, and one quarter cup of crushed, roasted peanuts. Add the other halves of the buns to complete the sandwiches.  Fine sev is available at Indian food stores. If you or anyone you plan to serve this to is allergic to peanuts, feel free to omit them.  "]}}, "How to Make an Egg Sandwich": {"description": "Egg sandwiches are proof that breakfast doesn’t have to be boring! Hearty, healthy, and packed with protein, an egg sandwich is a satisfying meal that provides the energy you need for the rest of your day. Make a simple fried egg sandwich or an egg and bacon sandwich for breakfast, or a classic egg salad sandwich for lunch. As long as your have eggs and cheese, you can find everything you need to make an egg sandwich right in your pantry!", "content": {"Making a Classic Fried Egg Sandwich": [" Toast the bread. Place the two pieces of bread in a toaster or toaster oven. Turn on the toaster to a medium toast setting. While the bread is toasting, prepare and fry the eggs.  Keep checking on the bread while you are preparing the eggs to make sure it doesn’t burn! If the toast is done before the eggs, remove it from the toaster. If you are toasting the bread in a toaster oven or inside your regular oven, top one piece of bread with the slice of cheese when it is partially toasted. The heat of the oven will melt the cheese.   ", " Heat canola oil on a skillet. Place a medium sized skillet on the stove over medium heat. Once the skillet has heated, pour the tablespoon of canola oil into the skillet and swirl to coat the bottom.  ", " Crack both the eggs into the skillet. Once the oil has heated, crack the first egg onto one side of the skillet. Immediately crack the second egg onto the other side of the skillet. Cracking the eggs on opposite sides of the skillet lets each egg fry separately and prevents them from running into each other.  ", " Season the eggs with salt and pepper. While the eggs are frying, sprinkle on a pinch of salt and pepper. You can add additional spices such as thyme or paprika if you wish, but be sure to also use salt and pepper since they help to bring out the flavor of the egg.  ", " Flip the eggs. After the whites of the egg become opaque, flip each egg with a spatula. Flip quickly so that the egg yolks don’t run, and make sure that the eggs aren’t overlapping as they cook.  ", " Cook the eggs until you are satisfied with the yolk. Some people prefer their egg yolks soft and slightly runny, while others prefer firmer yolks. Let the eggs fry until the yolks have reached a consistency that you're satisfied with.  Remember that runny yolks are delicious, but they can be messier to eat than firm yolks!  ", " Assemble your sandwich. Lay out your toasted bread on a plate, and place the slice of cheese on one piece if you haven’t already melted it on the bread. Transfer both of the fried eggs onto the piece of bread without the cheese. Then put the piece of bread with the cheese on top to finish the sandwich.  Some people like to add ketchup or hot sauce to their egg sandwich. Add your condiment of choice to give your sandwich extra flavor.  ", " Slice and serve immediately. Cut your egg sandwich in half, then serve immediately. Fried egg sandwiches are best when eaten hot, since they can become soggy if left out.  "], "Making an Egg Patty and Canadian Bacon Sandwich": [" Heat a skillet and spray with cooking spray. Place a small skillet over medium heat and allow to heat for about three minutes. After heated, spray the skillet lightly with olive oil cooking spray.  ", " Spray a biscuit cutter. Spray a round, aluminum biscuit cutter with the olive oil cooking spray, then place the biscuit cutter in the skillet. Try to use a 2 ½ inch or 3 inch (6.35 cm or 7.6 cm) round metal biscuit or cookie cutter. The aluminum cutter will help the egg to keep its shape when it’s baking.  ", " Break the egg into the biscuit cutter. Crack the egg and carefully pour it into the biscuit cutter. You can also crack the egg into a bowl and whisk it, then pour it into the biscuit cutter if you want the yolk to be blended with the egg whites.  ", " Cover the biscuit cutter with foil and cook. Cut a piece of aluminum foil that is slightly larger than the biscuit cutter, then place the foil on top of the biscuit cutter. Shape the foil around the aluminum cutter so it stays in place, then cook the egg for 3-4 minutes. ", " Slice the English muffin and toast it. While the egg is cooking, slice the English muffin in half and place it in the toaster. Remove the muffin once it has finished toasting, even if it finishes before the eggs are done!  If you are cooking the English muffin in the toaster oven or in your regular oven, you can place the slice of cheese on one piece of the muffin so that it melts. To toast the English muffin in a regular oven, preheat the oven to 350 degrees F (176 degrees C), then place the muffin on a baking sheet inside the preheated oven and bake for ten minutes.   ", " Check on the egg. Remove the foil after 3-4 minutes and check on the egg. By this time, the whites should be set and the yolk should still be a little soft. If you prefer a firmer yolk, keep cooking for another minute.  ", " Remove the biscuit cutter and the cooked egg from the skillet. Use tongs to remove the biscuit cutter from the skillet as it will be hot and could burn your fingers! Then use a spatula to transfer the cooked egg to a plate. Sprinkle the egg with salt and pepper.  ", " Cook the bacon on the skillet. Place the slice of Canadian bacon on the already heated skillet. Let the bacon cook for about one minute, then flip it over and cook it on the other side for another minute. If the bacon is not crispy after two minutes, keep cooking until it is crispy.  ", " Assemble and serve the sandwich. If you have not already melted the cheese onto the English muffin, place the slice of cheese on the bottom half of the muffin. Then place the bacon and egg on top of the cheese, and finally put the top of the English muffin onto the sandwich. Serve immediately.  "], "Making an Egg Salad Sandwich": [" Hard boil two eggs. In a pot on the stove, hard boil two eggs . After the two eggs have boiled, remove the eggs from the water and let them cool. Letting the eggs cool before you make the egg salad will help the eggs be firmer and easier to chop.  Run the eggs under cold water to speed up cooling.  ", " Chop the boiled eggs. After the eggs have cooled, peel them, then chop them into small pieces. Use a sharp knife and try to cut make the cubes of egg equal sizes so that the texture of the egg salad is consistent.  ", " Mix in the mayonnaise. Place the chopped boiled eggs in a medium mixing bowl and gradually add the mayonnaise, mixing continuously. Keep adding the mayonnaise until you are satisfied with the consistency.  ", " Mix in the mustard and relish. Add the mustard and relish and stir to combine all of the ingredients. Taste the egg salad and add more salt, pepper or other condiments like hot sauce or red wine vinegar as you wish.  ", " Toast the bread. If you want your bread to be toasted and crispy, place the two pieces of toast in the toaster. If you don’t want your bread to be toasted, leave the bread as is. ", " Put the sandwich together. Spoon the egg salad onto one piece of bread, then place the other piece of bread on top. Slice the sandwich in half and enjoy!  If you want the egg salad to be cold, store it in the fridge for an hour or so, then make the sandwich. Lettuce and tomato taste great on an egg salad sandwich!  "]}}, "How to Make an Egg McMuffin": {"description": "Egg McMuffins are a classic breakfast favorite, easy to eat on the go and full of filling ingredients. If you'd like to make your own egg muffin sandwich at home, you'll only need the English muffin, Canadian bacon, an egg, and some American cheese. Spend a few minutes frying and assembling the ingredients before enjoying this quick sandwich. To make a few flavorful adjustments, you could use different bread, another cheese, swap the meat, or add fresh vegetables.", "content": {"Making a Classic Egg McMuffin": [" Toast the English muffin. Split 1 English muffin in half and spread 1 teaspoon of butter over each half of the muffin. Heat a skillet over medium heat and add the English muffin halves with the butter side down. Toast the muffin halves for 3 to 4 minutes, so they become golden and a little crisp. Remove the toasted muffin halves to a sheet of aluminum foil so the buttered sides are facing up.  If you want both sides to become crispy, just flip them over and let them toast another minute.   ", " Heat the Canadian bacon. Turn the heat up to medium-high and add the last 1 teaspoon of butter to the skillet. Place 1 slice of Canadian bacon to the skillet and fry it for one or two minutes. Use tongs to flip it over several times, so the edges crisp up. Place the Canadian bacon on top of one of the toasted English muffin halves.  Watch the Canadian bacon carefully as it cooks, since it could quickly burn.  ", " Saute the egg. Set a large metal egg ring, small clean can, or large metal biscuit cutter into the skillet and spray it with cooking spray. Crack one egg into the circular container and sprinkle a little salt and pepper over it. Cook the egg for about 3 minutes, so the egg sets.  For a simple egg ring, just wash out a small tuna can that's empty. You can just unmold the cooked egg by turning the can over.  ", " Assemble the sandwich. Use a spatula to lift the cooked egg onto the Canadian bacon that's on your English muffin. Unwrap a slice of American cheese and lay it on top of the egg. Quickly put the other English muffin half on top of the cheese and wrap the aluminum foil over the sandwich. This will seal in the heat and help to melt the cheese.  You can eat the sandwich immediately or place the wrapped sandwich into an airtight container. You can freeze the breakfast sandwich or store it in the refrigerator for up to a day.  "], "Trying Variations": [" Use a different bread. While English muffins are a good size for an Egg McMuffin sandwich, you could use another small bread. Split a biscuit in half and replace the muffin. Or toast a few slices of your favorite bread to use. You could also use: Mini pita bread Croissants Small bagels  ", " Swap out the Canadian bacon. Use a different breakfast meat on the sandwich for a little variety. Cook some turkey sausage, pork sausage or bacon in the pan that you use to saute the egg. Set the cooked meat on top of the bottom half of the English muffin or bread. For a vegetarian version, just leave the meat out.  ", " Melt a different cheese. Changing the cheese is one of the easiest ways to make the biggest difference in flavor. Instead of using American cheese, add a slice of your favorite cheese. You could use crumbled soft cheeses (like blue cheese, goat cheese, or feta). Or you could add a slice of one of these firmer cheeses: Cheddar Jack Swiss Gouda  ", " Add sliced vegetables. Although a traditional Egg McMuffin doesn't have any vegetables, you can easily add some. Just slice your favorite vegetables and add them to the sandwich or saute them for a few minutes before placing them on top of the egg. You could add:  Sauteed mushrooms Sliced tomato Sauteed bell peppers Sauteed onions Fresh sprouts  ", " Squirt a little sauce. To add a really unique flavor, squirt a condiment onto the English muffin before you assemble the sandwich. For a spicy sandwich, add a little sriracha sauce. Or for a typical sandwich, spread a little mayonnaise and mustard. You could also add: Ketchup Horseradish sauce Harissa Relish  ", " Finished.  "]}}, "How to Eat Bagels": {"description": "Bagels are small, golden brown circles of bread that are crisp on the outside, and soft on the inside. While bagels are typically associated with breakfast food, you can eat bagels for any meal of the day with any number of savory or sweet toppings. For an optimal bagel-eating experience, be sure to heat and slice your bagel before enjoying your bagel open-faced or as a sandwich.", "content": {"Heating and Slicing the Bagel": [" Toast your bagel if it is not fresh from the oven. Bagels taste best when they’re warm, as their insides get hard and tough once they’ve cooled off. Unless you’ve purchased a fresh-baked bagel - meaning less than six hours old - you’ll want to toast your bagel before eating it.   ", " Place your bagel in an oven set to 375 °F (191 °C) for 4-5 minutes. Toasting your bagel before slicing it will give your bagel a crisp exterior, and moist, chewy center. Reheat your bagel in a convection or a toaster oven until your bagel is crisp and hot to the touch.  ", " Slice and toast your bagel in a pop-up toaster for a quicker product. If you only have a pop-up toaster oven, slice your bagel before attempting to toast it. While it’s preferable to toast the bagel before slicing in order to retain the moisture of the bread, reheating a sliced bagel in a pop up toaster oven will not ruin your bagel. ", " Use a sharp, serrated knife to slice your bagel in half. If you want to add toppings to your bagel, cut your bagel in half horizontally. Place your bagel on a cutting board and stabilize the top of the bagel with your non-dominant hand. Use a sharp knife to make a clean slice through the side of the bagel.  If you plan on eating your bagel whole and without any toppings, skip this step and eat your bagel!  "], "Adding Toppings": [" Butter your bagel for a simple, tasty combo. Spread butter on the inside of a fresh-baked or freshly-reheated bagel. Use a knife to spread a thin layer - about 1 tablespoon (15 ml) - of butter evenly on both sides of your bagel, and enjoy your bagel.  ", " Spread 2 oz of cream cheese on your bagel for a classic taste. Allow your bagel to cool for 2-3 minutes so that your cream cheese won’t get melty, and then use a knife to smear cream cheese evenly on both sides of your bagel.  ", " Prepare an open-faced smoked salmon bagel for an elevated bagel. Transform a humble bagel with the delicious combination of sliced lox and cream cheese. Spread cream cheese on both sides of your sliced bagel, and top each half with 1 oz. of cream cheese and 1 oz. of smoked salmon.  Traditional garnishes for a bagel with lox include sliced tomato, capers, lemon juice, and thin slices of red onion.  ", " Top your bagel with peanut butter and sliced banana for a sweeter option. Spread 2 tablespoons (30 ml) of peanut butter evenly on both sides of your bagel, and top with fresh slices of banana. You can also experiment with variations on the PB&B bagel by subbing the banana for a smear of jelly or jam, or by using Nutella instead of peanut butter.  ", " Transform your bagel into an egg sandwich . If you’re in need of a hearty breakfast, the bagel is a great vehicle for an egg sandwich. Top your bagel with fried or scrambled eggs, breakfast sausage, cheese, and tomato.  ", " Use your bagel as the bread for any sandwich . If you have a hankering for any kind of sandwich, make a bagel sandwich by layering ingredients between your sliced bagel halves. Feel free to get creative with toppings and condiments!  "], "Finishing the Sandwich": [" Eat your bagel open-faced. After adding toppings to your sliced bagel, you can choose to eat your bagel open-faced, as if the bagel were two slices of toast. Any of the topping combinations listed above can be enjoyed as an open-faced bagel. ", " Eat your bagel like a sandwich. Once you’ve dressed your bagel, put the two halves together and eat your bagel like a sandwich. This is a great option for eating a bagel with many toppings, as the closed sandwich style helps guarantee proper bread-to-topping ratios when you take a bite.  Bagel sandwiches are also great for on-the-go meals, as they’re easier to transport than open-faced bagels.  ", " If you are hungry for a bagel sandwich, slice the bagel vertically in half before eating it. While this step is not absolutely necessary, cutting your bagel vertically in half once you’re finished adding toppings will allow for an ideal toppings-to-crust ratio when you bite into your bagel.  "]}}, "How to Use Pita Pockets": {"description": "Here's how to properly store and heat pita bread pockets to optimize freshness and taste.", "content": {"Steps": [" Freeze the bread if you do not plan to use the package within 2-3 days of purchase.   ", " Refrigerate if you plan on using the bread within 3-5 days.  ", " Always toast pita to restore the taste and aroma. To defrost: Microwave for 15-20 seconds or   toast pita from a frozen state on med-high. ", " Fill or spread the pita pocket with your favorite foods and enjoy!  "]}}, "How to Make an Egg and Cheese Croissant Sandwich": {"description": "Breakfast is the most important meal of the day. Yet, people tend to skip it because of their busy schedule. If you master this delicious 5-minute recipe, you will stay healthy even when in a rush.", "content": {"Prepare the Croissants": [" Slice the two croissants horizontally into two halves. You can use a butter knife if you have one. If you don't, use a regular knife.  ", " Toast the croissants until they are light brown.  You can either use a toaster or an oven for this step. If you are using an oven, set the broiler to low. Place the croissant halves in an oven proof tray, Toast for 2 minutes or until the color changes.  "], "Prepare the Egg": [" Crack the egg. You should crack it into a small microwavable bowl since you will be microwaving the egg. You can also crack it into a different bowl then transfer it into a microwave safe bowl. ", " Add salt and pepper. There is no measurement of how much salt and pepper you should use - simply add however much you wish. If you would like to add other seasonings, you can add those in this step. ", " Add any vegetables that you may wish to add. This step is completely optional but it does give the dish more flavor. ", " Using a whisk or a fork, mix the ingredients together. Keep mixing until you cannot see the egg white anymore. You should mix at least for one full minute. ", " Cover the bowl with a lid. This step is very important. If you do not cover the bowl while microwaving, your egg might not be thoroughly cooked. If you do not have a lid for your bowl, use a microwave safe plate to cover it.  ", " Microwave for 40 seconds. Not all microwaves work the same way. If the egg is not cooked within 40 seconds, add 10 more seconds. ", " Remove the egg from the bowl. Make sure the egg stays intact. The egg should look like a patty. To easily remove the patty, you can flip the bowl and gently tap on the bottom until the egg falls out. If you break the shape, scramble the egg and follow the remaining steps.  "], "Assemble the Sandwich": [" Cut the egg patty into 2 equal halves. Use a knife to do this. Make sure you take precautions as the egg might be hot. You can also wait for the egg to cool down to do this step. ", " Cut the cheese slice into half. You can choose any type of cheese or more then one slice of cheese. ", " Place the cheese slices and egg patties on the croissant halves. You can choose which one you want to place at the bottom. Most people usually prefer cheese at the bottom and egg on top of the cheese. You can customize it however you want. ", " Microwave it for 15 seconds. This step is important because it allows the cheese to melt. However, if your egg patty is hot, the cheese will melt on its own and you can skip this step. ", " Put the last croissant half on top. Lightly put pressure on top of the croissant like you would with a regular sandwich. Serve it while it is still warm. ", " Finished.  "]}}, "How to Make a Jam Sandwich": {"description": "The jam (fruit preserves) sandwich has long been a staple lunch item or snack food. It can made with just jam, or other food items can be added to change both texture and flavour.", "content": {"Simple Jam Sandwich": [" Place the slices of bread on the plate.   ", " Spread a spoonful of jam or preserves on one side of each slice of bread.  ", " Press the slices of bread together.  ", " Cut in halves or quarters. Quarters are easiest to handle if the jam is really chunky or threatens to ooze out.  ", " Serve. Put on a plate for serving. "], "Afternoon Tea Jam Sandwich": [" Place the slices of sandwich bread on the plate.  ", " Spread the jam or preserves over the slices.  ", " Press the slices together.  ", " Remove the crusts from the sandwich bread.  ", " Cut into neat rectangles or finger sticks.  ", " Arrange neatly on a plate or a sandwich/cake stand.  "], "Grilled Jam and Cream Cheese Sandwich": [" Place the slices of sandwich bread on a work surface.  ", " Spread the cream cheese on 2 bread slices.  ", " Spread the strawberry jam or preserves on the other 2 slices.  ", " Press the 2 slices together. Press one cream cheese to one strawberry jam/preserves slice.  ", " Melt the butter in a frying pan or skillet. Use medium heat.  ", " Spread butter over the top of each sandwich.  ", " Put the buttered sandwiches into the frying pan/skillet. Fry over medium heat until the base turns golden brown. This will be about 4 to 5 minutes.  ", " Flip over and fry the other side.  ", " Remove from the heat when golden brown both sides. Plate up and serve. Allow the diner to cut the sandwich; the cheese will ooze a little. Be careful; jam or preserves retain heat well. "], "Nut Butter and Jam Sandwich": [" Place the slices of sandwich bread on the plate.  ", " Spread the nut butter on one slice.  ", " Spread the jam or preserves on the other slice.  ", " Press the two slices together.  Cut in halves.   ", " Serve.  "]}}, "How to Use Kale in Sandwiches": {"description": "Kale is a great source of potassium, fiber, and antioxidants, and it has grown in popularity over the years because of the nutrients it offers.While many people add it to smoothies or salads, you can also add it to that lunchtime staple: the sandwich. Add baby kale for a raw, tasty crunch, use it in place of bread, or even add it to a grilled cheese sandwich!", "content": {"Adding Kale to Your Favorite Sandwich": [" Top your favorite sandwich with baby kale. Rinse the kale and pat it dry with a paper towel, and then use it as a topping. You can substitute it for lettuce or sprouts, or use it in addition to other toppings. Baby kale is soft enough that it doesn't need to be cooked down before you eat it.  You can even add kale to a peanut butter and jelly sandwich for some extra fiber without changing the flavor of the sandwich too much. Just put a thin layer in between the peanut butter and jelly.   ", " Add cooked kale for a tasty, nutritious topping.  Curly kale is a little too tough to eat without first removing the stem and cooking it down a little bit. Trim off the stem from each leaf and add it to a hot pan with some olive oil, salt, and pepper. Sauté the kale for 4-5 minutes until it starts to wilt. Remove it from the heat and let it cool down before adding it to your sandwich.  You can store extra cooked kale in your fridge in an air-tight container for 1 week.  ", " Wrap your sandwich in kale instead of using bread. Rinse and pat dry 1 or 2 large kale leaves and lay them flat on a plate. Place your toppings on the kale (meat, cheese, veggies, spreads, or whatever else you like in a sandwich). Roll the leaf up into a wrap, and then cut it in half to make it easier to handle.  A cup of kale has 33 calories in it—much less that even 1 piece of bread! Plus, if you're gluten-free or vegan, a kale wrap lets you still enjoy a sandwich.  "], "Constructing a Basic Sandwich with Baby Kale": [" Rinse your handful of kale and the uncut tomato and pat them dry. Turn on the kitchen sink to a cool temperature and quickly run the water over the fresh produce. Use a paper towel or clean dish towel to pat the produce dry. Set the kale to the side.  If you have a salad spinner, you can put the kale in there rather than patting it dry. Rinse the produce even if the bagging says it has already been cleaned—germs and dirt can get onto cleaned produce during the shipping and stocking process.  ", " Cut several inch (1.3 cm) thick slices of tomato. Use a sharp kitchen knife and cutting board. Cutting thicker slices of tomato to keep it from falling apart on your sandwich. You can always use more or less tomato, depending on your preference.   the rest of the tomato in a plastic bag in the fridge for up to 1 week. If you don't like tomato, you can substitute lots of other veggies, like cucumber, avocado, peppers, or even sliced onion. Or feel free to add as much variety to your sandwich as you like!  ", " Set your 2 slices of bread on a plate to construct your sandwich. You can really get creative here—you could toast your bread before constructing your sandwich; you could use a bagel instead of bread; you could even use homemade bread. Store bread in an airtight container either on the counter, in a cupboard, or in the fridge to keep it fresh for longer. Never leave bread exposed to the air for long without covering it.  ", " Place your cheese and deli meat onto 1 slice of the bread. Put the slice of cheese against the bread and put the meat on top of that. The moisture from the deli meat could seep into the bread and make it soggy, so putting the cheese on first keeps that from happening.  If you can't eat or don't like cheese or meat, there are plenty of other options for you to choose from to construct your sandwich! Consider adding , , , or falafel. The options are endless!  ", " Add your tomato slices and then the rinsed kale on top of the meat. Arrange the produce so there is an even layer over the entire sandwich, rather than stacking all the toppings in the middle. Don't be afraid to really pile the kale on here—it compresses easily so you can add a lot and still hold the sandwich easily.  Making the kale the top layer protects the bread from getting soggy from the tomatoes.  ", " Apply your condiments and add the second piece of bread. You can always go condiment free, but if you like a little extra flavor, spread or drizzle your sandwich with mayo, mustard, ketchup, hot sauce, or any other condiment you like.  Don't forget about pickles, olives, and sun-dried tomatoes! These toppings can add a lot of flavor to a simple sandwich.  "], "Making a Kale Grilled Cheese Sandwich": [" Rinse the kale and remove the stems. After running cool water over the kale to wash off dirt and debris, pat it dry and move it to your cutting board. Using a sharp kitchen knife, cut alongside the thick stem on either side of the leaf. Discard of the stems and put the kale leaves to the side.  Instead of discarding the stems, you could set them aside to with other veggie trimmings later.  ", " Cut your onions into inch (1.3 cm) slices. Put the onion onto your cutting board and peel off the outer layer. Then slice the onion in half lengthwise. Cut off the stem (or the “hairy” part of the onion). Cut the onion across the grain until you reach the root end. Set the sliced onion to the side.  Chew gum while cutting onions to prevent teary eyes. Or freeze the onions for 10-15 minutes before you cut them.  ", " Boil a pot of water, add the kale, then remove the pot from the heat for 4 minutes. You'll notice the kale turns a bright green color. This process helps soften the kale so when you bite into your sandwich you can easily tear it with your teeth.  ", " Drain off the excess hot water and rinse the kale under cold water. When you're done, it should no longer be warm to the touch. Use a paper towel or clean dish towel to dry the leaves, and then set them to the side.  Because kale is such a hardy leaf, it makes it a lot softer without compromising any of the nutrients.  ", " Add 2  tsp (9.9 mL) of cooking oil to a skillet over medium high heat. Tilt the skillet in different directions to coat the bottom evenly with the oil. You can test if the oil is hot by dripping a few drops of water into the pan—if it sizzles, it is hot!  Use whatever kind of cooking oil you prefer: olive oil, canola oil, avocado oil, or even grape seed oil are all viable options.  ", " Put the onion into the hot skillet and sauté for 10 minutes, stirring often. Add salt and pepper if you like some extra seasonings with your onions. You'll know they are done when they are slightly browned and soft. Stir the onions frequently during the 10 minutes to help the heat distribute evenly. Remove the skillet from the heat once the onions are cooked.  Depending on the size of your skillet (using a small one versus a large one), you may need to cook the onions for longer. Just keep an eye on the cooking progress and continue cooking them until they are all soft and brown.  ", " Spray 1 side of each slice of bread with cooking spray. You can either place the bread down on a cutting board or on the counter. Lightly spray the bread, just enough to coat it without drenching it or making it soggy. If you don't like to use cooking spray, you can always use butter or a butter substitute for this process.  Don't forget to wipe down your counter after you finish cooking to clean up the excess cooking spray.  ", " Pu 4 slices of bread oiled-side down in a skillet and add cheese. Set the burner to medium-low heat. Sprinkle cup (59 mL) of cheese on 4 slices of bread. Some cheeses that shred and melt well are cheddar, gouda, provolone and mozzarella, but use whatever cheese you prefer! There are even non-dairy cheese options you can purchase at the grocery store.  You can add more cheese or multiple kinds of cheeses for variety.  ", " Stack the kale, sautéed onions, and top piece of bread on the cheese. Use a spatula to press down on the sandwich to push the ingredients together. Don't worry if the sandwich appears to be really large. The heat from the skillet will help shrink the sandwich as it continues to cook.  The cheese on the bottom and the onion mixture on the top will help the toppings adhere to the bread.  ", " Put the lid on the skillet and cook for 5-7 minutes, flipping the sandwiches once. Check the sandwiches after the first 3 minutes and flip them over so both sides cook evenly. Put the lid back on and continue cooking for another 2-4 minutes, or until the cheese has melted and the sandwich has melded together.  The steam in the pan helps melt the cheese, so if you don't have a lid for the skillet try placing aluminum foil overtop to create the same effect.  ", " Remove the sandwiches from the heat and serve them! You could cut the sandwiches in half, pair it with a simple salad , or simply eat it on its own. This is a great way to get some kale into your sandwich without sacrificing on flavor. Wrap leftover sandwiches in aluminum foil and store in the fridge for 1-2 days. The bread will get soggy from the onions, so reheat it directly in the oven at 300 °F (149 °C) for 10 minutes. This will help to crisp the bread back up.  ", " Finished.  "]}}, "How to Make a Chip Butty": {"description": "A Chip Butty is a chip sandwich.", "content": {"Steps": [" Butter your bread. Make sure you have a good layer of butter on each slice of bread - chip butties are well known for being sopping with butter! Only real butter will do, no cheating with margarine.  ", " Add the chips. Place a heaping layer of hot chips on your bread. Chips (called french fries in the USA ) are what give the chip butty its name. The chips should make up the main portion of the sandwich. ", " Add optional toppings. A chip butty should be enjoyed with a few dollops of ketchup or HP sauce; however, you can add an extra surge of flavour by adding cheese , sliced meats , tomato, or your favourite sauces. Salt & pepper would not be out of place on a chip butty, either. ", " Finished.  "]}}, "How to Place a Subway Sandwich Pick‐Up Order on the Subway App on an iPhone or iPad": {"description": "In a hurry and need to get a Subway sandwich requested for pickup at the store? This article will explain the details so you can just travel to the store, go in and pick up the sandwich with little hassle.", "content": {"Preparing the Order": [" Open the Subway app on your device. Both the iPhone and iPad have the same app design for their icons. You may have to get the free app from the app store. The app is a white \"S\" consisting of two rounded arrows pointing in opposite directions in white and orange inside and is bordered by a greenish background. Make sure that you are signed into your account. To place an order, you must provide an account to which to grab the financial data necessary for the purchase.   ", " Tap the all-caps \"Start Order\" button at the bottom of the screen. The button is a green bar with white lettering. Don't worry too much about the scrolling \"Deals for You\" bar that keeps twirling. Once you press this button, you'll be transported to the sandwich choices page.  ", " Tap the \"All Sandwiches\" choice. There are other options meant for other item types in the list, but the one you'll want (for sandwiches) is listed under \"All Sandwiches\". ", " Pick a sandwich from the list. Tap the item you'd like to customize and purchase. ", " Ensure the Ingredients are okay to begin. You will find a list of ingredients just below the sandwich name and followed by a visual example of the described item. ", "Make sure to choose your sub length just above the \"Add to Bag\" and \"Customize\" buttons. ", " Add the item to the bag if you like the ingredients. Tap the \"Add to Bag\" button at the bottom of the screen, after checking out the ingredients listed below the sandwiches name. "], "Customizing the Order": ["Tap the Customize button if you'd like to customize it a bit. ", " Choose your bread. Tap the bread portion of the example, then swipe either to the left or to the right, depending on the choice shown. Choose whether you'd like it Toasted (filled in red) or Not Toasted (grey) on the button below the swipe portion, then choose Looks Good. ", " Tweak the meat amount of each item. Tap the meaty item and tap either Deluxe or Double Meat. Regular is chosen by default. ", " Tweak the condiments. Often, lettuce, tomatoes, spinach, peppers, and onions are added, but choices vary by sandwich-made. You can select either Less or More to decrease or increase the amount of each item on the sandwich. Regular is selected by default. ", " Add toppings such as cheeses, veggies and sauces/seasonings. “All Extras” in the extras tab cost extra money, however, if you tap to add cheese or some sauces or seasoning, you might not have to pay any extra. ", " Tap the \"Add to Bag“ (price) button at the bottom of the screen.  With cheeses, you can have regular amounts or \"extra amounts\" of cheese added to your sandwich, by selecting either “Regular” or “Extra Cheese” after tapping your choice.  ", " Choose to add an extra if you'd like. Such choices include doubling the meat in a Deluxe or adding Guacamole, Pepperoni, Bacon or another choice. However, all the options they provide in the next dialog box. Once done, tap Continue at the bottom of the screen. "], "Preparing for Pickup": [" Ensure all items from the next page are correct. You will want to ensure the pickup location is right, as well as the approximate time for pickup. ", " Add items to the order. Make a sandwich a meal, if you'd like by following the prompts after tapping the plus sign to the right of the “Make it a Meal” choice. Keep in mind though, that making it this meal will cost you extra, but you'll get chips and a drink included. ", " Choose additional menu items, if necessary with one of the three choices below. These three choices include Sides and Drinks, and Menu (for everything else). ", "Choose one of your bookmarked favorites from a former order from the Favorites button below the Sides, Drinks and Menu buttons. ", "Add a special instruction, if necessary. ", " Apply a reward, if available. If there's money, you'll see the \"Rewards\" box. Tap the \"Apply\" button to apply the reward. This is only available when you have a Subway rewards card attached to the account. ", " Ensure your bill is right. You will see your total, combined with tax. ", " Tap your payment method. in the box at the very bottom. By default, it'll select a Subway Gift Card if one has been previously applied to the account (since the rewards card has a gift card-like account to add prepaid funds) or select “Change” to change the card to something different. In Subway's app, you can choose between the three most-common choices: your Subway Gift Card (if present), or a Visa or MasterPass (formerly MasterCard) card, or tap “Add Payment Method” to choose PayPal or another card. Tap the payment card choice. If there's no valid card information for a choice, you can tap the item. ", " Make sure the bank account has enough to cover the payment. Next to “Place Order” once enabled and green, you'll see the total price you'll be paying to purchase the order. ", "Tap \"Place Order\". "]}}, "How to Make a Veggie Melt": {"description": "A grilled cheese is a classic sandwich, but it can sometimes seem a little lacking in substance and nutrition. The next time you have a craving for one, consider trying a veggie melt instead it. It has all the same cheesy goodness of a grilled cheese, but paired with delicious sauteed veggies that make it more satisfying and better for you. You can use your favorite vegetables in the sandwich, but a base of onions, asparagus, mushrooms, bell pepper, and kale is a good place to start.", "content": {"Preparing the Oven and Mayo Spread": [" Set the oven rack in the center  and place a baking sheet on it. To ready the oven for baking the veggie melt, place the rack so it's in the middle of the oven. Next, set a large baking sheet on rack so it will preheat along with the oven.  To make cleanup easier, you can line the baking sheet with parchment paper or foil in case any of the cheese drips out of the melt as it bakes.   ", " Preheat the oven. In order to ensure that the oven is hot enough to bake the veggie melt, it's important to preheat it. Set the temperature to 450 degrees Fahrenheit (230 degrees Celsius) and allow it to fully preheat.  ", " Mix the mayonnaise and mustard. Add ¼ cup (58 g) of mayonnaise and 3 tablespoons (54 g) of whole-grain mustard to a small bowl. Whisk the two together until they are fully blended, and set the mixture aside.  You can prepare the mayonnaise-spread up to a day in advance. Cover and store it in the refrigerator. Instead of the mayonnaise-mustard spread, you can use either the mayo or mustard separately if you prefer. You can also use an entirely different spread or dressing for the sandwich if you prefer. Pesto, balsamic vinaigrette, or even jalapeno cream cheese are tasty options.  "], "Sauteing the Veggies": [" Heat the oil. Add 2 tablespoons (30 ml) of olive oil to a large skillet. Heat it on medium until the oil begins to shimmer, which should take approximately 3 to 5 minutes.  If you prefer, you can roasts the veggies for the melt instead of sauteing them. Toss them with olive oil and roast them on a baking sheet at 450 degrees Fahrenheit (230 degrees Celsius) for approximately 10 minutes, or until they are tender.  ", " Add the onion and cook it until it's soft. Once the oil is hot, add half a small onion that's been diced to the skillet. Let the onion cook for 3 to 4 minutes, or until it softens.  Be sure to stir the onion occasionally as it heats to ensure that it cooks evenly.  ", " Mix in the asparagus, mushrooms, and peppers and season the mixture. When the onion is soft, add 8 ounces (224 g) of asparagus that's been cut into 2-inch (5-cm) pieces, 8 ounces (240 g) of fresh mushrooms that have been thinly sliced, and a medium red bell pepper that's been cut into ½-inch wide strips to the pan. Season the mixture with ½ teaspoon (3 g) of kosher salt and ¼ teaspoon (½ g) of freshly ground black pepper, and stir well to ensure that the ingredients are fully combined.  You can use substitute with or add your favorite veggies to the melt. Some other options that work well include chopped broccoli, plum tomatoes, and fennel.  ", " Cook the veggie mixture until it's tender. After you've mixed and seasoned the veggies in the skillet, let them cook for approximately 5 minutes, or until they become tender. Stir the veggies occasionally to ensure that they cook evenly.  ", " Stir in the garlic and kale, and cook the mixture until the kale wilts. When the veggies are tender, add a minced clove of garlic and 3 cups (300 g) of shredded kale leaves. Saute the mixture for 2 to 3 minutes or until the kale wilts, and remove the pan from the heat.  You can substitute other greens, such as spinach or arugula, for the kale. You can saute the veggies up to a day in advance. Place them in a covered container and store in the refrigerator, but bring them to room temperature before assembling the sandwiches.  "], "Assembling the Sandwiches": [" Apply some butter to one side of the bread slices. To assemble the sandwiches, lay out 8 pieces of your favorite bread. Use 2 tablespoons (28 g) of softened, unsalted butter to cover one side of each piece.  Some breads that work well for the veggie melts include sourdough, whole-grain, and Italian. For the best results, though, make sure the slices are at least ½-inch (13-mm) thick.  ", " Spread the mayo spread on the other side of the bread slices. After you've applied the butter to one side of the bread slices, turn them over. Add the mayonnaise-mustard spread that you made earlier to the other side, and place the bread, butter-side down, onto the preheated baking sheet from the oven.  Make sure to use a potholder or oven mitt to remove the baking sheet from the oven because it will be extremely hot.  ", " Top half of the bread slices with the veggies. After you've set the bread slices out on the baking sheet, divide the veggie mixture between four slices of the bread. Spread them in an even layer over the mayo-mustard mixture so the vegetables don't fall out the sides.  You should have four slices of bread that don't have any veggie topping on them when you're done.  ", " Sprinkle the cheese over the veggies. Once the veggies are spread on the bread slices, divide 1 ½ cups (170 g) of grated Gouda cheese between the covered slices. Sprinkle the cheese evenly over the veggies so they're all covered.  You can substitute another cheese for the Gouda if you prefer. Mozzarella, Swiss, and Havarti are tasty options.  "], "Baking the Sandwiches": [" Bake the sandwiches until the cheese is melted. After you've layered the veggies and cheese on half of the bread, return the baking sheet to the preheated oven. Allow the sandwiches to bake for 5 to 8 minutes, or until the cheese melts and is bubbling.  If you prefer, you can grill the sandwiches in a nonstick saute pan. Put both pieces of bread together first, and then heat them on medium for 2 to 3 minutes on each side, or until the cheese melts.  ", " Top the veggie and cheese covered bread with the other slices. Once the sandwiches are finished baking, transfer the veggie and cheese-covered pieces to a cutting board. Place the untopped slices of bread on top of them and press gently to close the sandwiches.  When you place the untopped bread slices over the topped pieces, make sure to set them down with the mayo-mustard spread-covered side face down.  ", " Cut each sandwich in half and serve. When the sandwiches are closed, use a sharp knife to cut each one in half. Place the melts on individual plates, and serve.  The veggie melts pair very well with soups, especially tomato.  "]}}, "How to Make a Waffle BLT": {"description": "Something about serving a BLT (bacon, lettuce, and tomato) sandwich on a fluffy waffle screams brunch any time of day or night. Surprise your family tonight with this traditional sandwich served with a sweet little twist.", "content": {"Picking Out Ingredients": [" Pick out your waffles. You can approach this task a few ways.  You could head to the frozen aisle at your grocer or you could make your own waffles from scratch using a waffle iron and your own recipe. If you choose to use frozen waffles go for the best brand you can find.  Look for ones that are light and fluffy; sans chocolate chips or any other dressings.    ", " Pick up bacon, a fresh head of lettuce (your choice) and a ripened tomato. Consider getting all the ingredients from the market, ready to cook or slice. ", " Select a dressing such as mayo, mustard and/or your own “special secret sauce. ” "], "Making Your Sandwich": [" Cook the bacon. Only use the number of bacon pieces you plan to add to your sandwich.  Perhaps two or three will do the job. Cook bacon until crispy but not burned.  Drain cooked bacon on a paper towel or an iron rack that is supported by a pan (so the grease drips below).   ", " Cut lettuce for your sandwich. Consider tearing the leaves into small pieces so you end up with bite-sized chunks instead of big leaves. ", " Slice the tomato. Depending on the way you like your BLT, cut thick slices especially if this is a ripe, juicy tomato. ", " Prep your sauce. Consider putting the sauce on the side of the plate so you can either apply at some point or you could even slather it on the side of your sandwich. ", " Cook the waffle(s). If you are making your own waffle from scratch and using a waffle iron, making one waffle per sandwich will work well.  However frozen waffles (unless you found frozen Belgium waffles) may require two to make the sandwich. Slice the homemade waffle into two pieces once it’s cooled.   ", " Stack the bacon, lettuce and tomato onto the sliced waffle (or single waffle). Make sure you alternate between the bacon and tomato slices with a bit of lettuce.  Add the top, spoon the sauce on the side and attack! "]}}, "How to Make Sandwich Wraps": {"description": "Lots of restaurants are offering wraps, basically sandwiches (and sometimes salads) in a tortilla. They're easy to make, though, and require no cooking experience. So stay home or brown bag your lunch and save money, eat healthily, and have fun trying all kinds of different combinations.", "content": {"Choosing the Ingredients": [" Choose your ingredients. The next time you're at the market, look for foods you like. A good rule of thumb is that if they would work well in a sandwich , they would work well in a wrap, but because a wrap is enclosed, you can also include things that might not handle well on a sandwich.  ", " Lay out a tortilla. The anchor for a good wrap is usually a large flour tortilla, though you can use corn if you prefer them. You may be able to find colorful variations that include things like tomatoes or spinach. If you don't want to buy tortillas, or you can't find them, remember that you can also make your own . Whatever tortilla you use, lay it on a plate or clean cutting board and arrange the contents on top of it.  Warm the tortilla in a pan with a bit of oil, if you want it warm.   "], "Meat and Fish Fillings": [" Add meats, if you eat them. You can use cold cuts or you can prepare your own meat by grilling , pan-frying, or any other method you want. Don't forget to season the meat if you're cooking it yourself. Chicken, turkey, beef, ham, and pork are casual options. ", " Add seafood, if you like it. Shrimp and fish make good, lighter additions to wraps.  You can also use canned tuna or salmon , inside or outside of a tuna salad mixture. Generally, use meats or seafood.  Seafood tends to have more of a delicate flavor and texture that can be overwhelmed by heavier meats.  "], "Vegetable or Fruit Fillings": [" Add veggies, pile them high. The sky is the limit, metaphorically, so try all kinds of things. This is a great way to pack some delicious nutrition into a compact package. You can make an entire portable salad right there inside the tortilla if you want. Try lettuce of all kinds, spinach, sprouts, chopped bell pepper (cooked or raw), broccoli (steam it lightly if you prefer), tomatoes, olives, mushrooms, and anything else you like.   ", " Try fruits, fresh or dried. While they're not as frequent an addition to sandwiches or salads, you may find you like the bit of sweetness or tartness that fruits add. Try bits of pear or apple, grapes, raisins, or any other fruit you think might taste good with your combination of fillings. "], "Other Fillings and Seasonings": [" Add nuts and/or seeds. Slivered almonds, toasted, chopped walnuts, sunflower seeds, or sesame seeds can add a pleasant crunch and a bit of elegance to your wrap. ", " Add cheese, dressings or other condiments. Watch the fat content if you're dieting. If you love mayonnaise, cheese, cream cheese, or ranch dressing , you can compromise and use a smaller portion. Otherwise, try to add flavor with less fatty foods. Try mustard, barbecue sauce, low fat sour cream, yogurt, kefir, light salad dressings, or oil and vinegar. ", " Add any seasonings you want. Salt and pepper are common choices, but don't forget other fresh or dried herbs and spices, like basil , oregano , cinnamon, or chili powder. "], "Wrapping the Wrap": [" Visually divide the wrap into three strips. Place the fillings down the center strip, stopping short of the ends. Fold about three inches of each end in toward the middle. Then roll the rest of the tortilla over around the fillings. Roll snugly. ", " For a restaurant look, slice the entire wrap in half on a diagonal.  ", " Finished.  "], "Reader Suggested Wrap Combos": [" For a ham, lettuce and tomato wrap (HLT wrap): Use three pieces of ham. Lay down lettuce pieces, then the ham slices, then cheese over the ham. Lay a slice of tomato, pepper and cucumber on top of the cheese, all stacked. Sprinkle oregano, salt and pepper over the wrap. Add a little oil if wished. Wrap up and enjoy. "]}}, "How to Make a Kraft Dinner In The Microwave": {"description": "Do you want to make Kraft dinner in the microwave? You're wrong but fine. Here's an article explaining how. It is very delicious.", "content": {"Steps": [" Pour the Kraft Dinner noodles in your microwave-safe bowl.   ", " Fill your measuring cup with 3/4 cups of hot water.  ", " Pour the water into the bowl.  ", " Put your bowl in the microwave.  ", " Microwave for 3 minutes. After it's done, take it out using some form of heat protection. (Oven mitts, etc.) ", " Stir the noodles. After it's done, microwave for 3 more minutes. ", " Repeat steps 5 and 6.  ", " Drain.  ", " Take it out of the microwave, and add the cheese sauce. Using your measuring cup, Add about half a cup of milk, and desired amount of butter. ", " Stir until no noodles are white anymore, and add desired flavourings.  ", " Enjoy!  "]}}, "How to Make Pizza Lunchables": {"description": "We all remember how we used to take lunchables to school as a kid. But now that some of us may be older the art of making it may have disappeared.", "content": {"Steps": [" Open the box of Pizza lunchables. Remove the cardboard with either your hands or with scissors then peel off the plastic carefully starting at a corner.  ", " Take a crust out from the box. Choose how many pizzas you want to make depending on how hungry you are. ", " Find the pizza sauce and rip the top across the dotted line. Carefully tear the sauce packet open with your hands across the dotted line or use a pair of scissors. ", " Pour some of the sauce on one pizza crust. Apply pressure to the sauce packet to allow the sauce to come out. ", " Spread the sauce on the crust with the top of the sauce packet. Run the sauce packet or your fingers over the pizza crust making sure the pizza sauce is evenly distributed. ", " Add the toppings. Locate the cheese and pepperoni in the lunchable and sprinkle some of the cheese over the pizza sauce then lay the pepperoni on top. ", " Cook the pizza. Place the pizza onto a microwave safe plate and pop it into the microwave for 15 seconds or until the cheese is melted. ", " Serve. Remove the pizza from the microwave and enjoy your childhood snack! "]}}, "How to Make Sloppy Joes": {"description": "Sloppy joes are an all-American favorite! Prepared with ground beef, ketchup, tomato sauce, and a few other common ingredients, these delicious sandwiches are a barbecue staple, but also work as a quick dinner or lunch fix. Sloppy joes are also a great way to use up leftover hamburger meat and buns and are almost impossible to screw up. Just remember - the sloppier, the better!", "content": {"Steps": [" Cook the meat in a large saucepan over medium heat. Make sure all the meat is cooked thoroughly. Drain all the grease and fat out from the pan.   ", " Add the remaining ingredients to the pan.  ", " Mix everything together while getting the mixture to a boil.  ", " Turn down the heat to a simmer. Cover and allow to simmer for at least 10 minutes; if you want the mixture to be drier, you can continue for about 30 to 40 minutes.  ", " Remove the pan from the heat. Fold the mixture a few times so the simmered ingredients aren't sitting in one part of the pan.  ", " Toast the hamburger buns. Toasting the bread will give it that crispy taste as you sink your teeth into the sandwich.  ", " Scoop a generous amount of the sloppy joe mixture on each of the bottom hamburger buns. Gently lay the top hamburger bun on top of the mixture.  "]}}, "How to Make a Cuban Sandwich": {"description": "Cuban sandwiches are a favorite in Miami and Tampa, where you can buy them at restaurants or from street corner vendors. Although it's a relative of the regular ham and cheese sandwich, the perfect combination of flavors and the crisp warmth of the grill rockets theCubanointo sandwich heaven.", "content": {"Traditional Cuban Sandwich": [" Cut a fresh loaf of Cuban bread lengthwise. Cuban bread is long and thin, and turns crisp in the panini press without getting uncomfortably hard. You can find similar bread at a Latin bakery. The next best substitute is a long, soft French or Italian loaf (but nothing as narrow and hard as a baguette), followed by a hoagie roll. Cut it about 7 inches (17.8 cm) long, or to a size that matches your appetite. Leave one long edge of the bread intact for a tidier sandwich.   ", " Brush butter on the outside of the bread. This will stop it from sticking to the sandwich press. It's easiest to do this before adding the ingredients. If you're using nonstick cooking spray instead, spray it on the inside of the sandwich press.  ", " Spread the yellow mustard. Spread about 2 tbsp (30 mL) of regular yellow mustard evenly over both sides of the bread.  Almost all recipes include mustard, but you can serve it on the side if you're using extra-flavorful pork.   ", " Add cheese to both sides. Cover both halves of the bread with mild Swiss cheese. Many traditional recipes use an equal ratio of cheese, ham, and pork, but you can cut the slices thinner if you prefer. ", " Cover one side with dill pickles. Slice two large dill pickles to make eight or ten long, thin slices (or buy them pre-cut into \"sandwich stuffers\"). Lay these onto one side of your sandwich. ", " Add a layer of ham slices. Fold four slices of very thin ham over the pickles. You can use any ham you like, but the most traditional choice is a mild, sweet-cured ham such as York ham, bolo ham, or any honey-cured ham.  You can even .  ", " Pile on the roast pork. Now for the star of the show. Warm several slices of roast pork in a pan over low heat, then add it to the sandwich. For extra flavor, use pork marinated in Cuban mojo sauce, or drizzle on the sauce in the pan. The sauce's main ingredients are garlic and sour orange (or orange, lemon, and lime where sour orange isn't available).  You can use pulled pork if you don't have any sliced pork.  ", " Heat a sandwich press or similar tool. Although traditional Cuban sandwiches are made with a grill press called a , most cooks outside of Florida have to make do with one of these options: Sandwich press or panini maker Waffle iron, with the metal plates flipped so their flat sides are inward (if possible) Griddle or frying pan, with a heavy cast iron skillet or foil-wrapped brick to press the sandwich down  ", " Press the sandwich. Once the press is hot, put in the sandwich and press it down to about a third of its original thickness. Cook the Cuban sandwich until the bread is brown and slightly crisp, and the cheese is melted. This usually takes two or three minutes on each side. Remember to butter the bread or add nonstick spray to the press surface if you didn't do it earlier. If the sandwich is falling apart or a little too large for the sandwich press, wrap it in foil.  "], "Variations": [" Make a medianoche . The (\"midnight\") has the same filling as the Cubano, but placed on smaller pieces of a sweet, yellow egg bread. If you don't live near a bakery that sells (or the Mexican version, ), use challah rolls. ", " Add salami, Tampa-style. In Tampa, Florida, some people make Cuban sandwiches with an Italian flair. Add a layer of Genoa salami between the ham and pork to try it out (but don't tell the sandwich purists in Miami).  ", " Make your own variations. Mayonnaise? Tomatoes? Lettuce? Sacrilege according to some, but it's your sandwich. Just give the traditional recipe one try before you bring it into the mainstream of American sandwiches. The cheese is an easy place to experiment. Try Jarlsberg, provolone, or baby Swiss if you aren't a fan of Emmentaler (the cheese most commonly sold as Swiss in the United States).  ", " Grill the ham. To add a little sear, grill the sandwich open-face for a minute or two, with the ham touching the grill. Do this before adding the pork and pressing as usual.  "]}}, "How to Make Cabbage Sandwiches": {"description": "Cabbage sandwiches are very easy and simple to make in a short period of time and they also taste great.", "content": {"Steps": [" Cut into thin stripes or shred the cabbage. The quantity should be enough because it's going to be the main ingredient. Put this in a big bowl. Chop capsicum into medium size.  ", " Add mayonnaise to the cabbage and capsicum and mix it well.  ", " Take a slice of bread and put the cabbage filling and spread evenly.  ", " Put tomato ketchup and mustard sauce and spread evenly.  ", " Add a cheese slice or grated cheese into the filling.  ", " Take another slice of bread and close it and spread a little amount of butter above the sandwiches.  ", " Grill the sandwiches or use the sandwich maker.  When the cheese melts and the bread slices looks crispy, then these are ready to eat with lettuce salad or french fries.   ", " Finished.  "]}}, "How to Make Corn Fritters": {"description": "Crispy and tasty, corn fritters can be served with a sweet chili sauce or as an accompaniment to a main meal. In this article, you can take your pick between two recipes, either pan-fried or deep-fried, or perhaps even try both to see which you like the most. These tasty fritters are ideal quick fix foods for a lazy Sunday morning brunch, for a late night supper, or for any other time you'd like to enjoy corn fritters. See Step 1 of your preferred method to get started.", "content": {"Pan-Fried Corn Fritters": [" Sift the corn flour, flour, baking powder, salt, ground coriander and cumin into a bowl. To do this, place the ingredients in a sieve over a bowl and then gently run a spoon along the bottom of the sieve to gently move the ingredients into the bowl. This recipe makes 4 servings or around 24 fritters.  ", " Add the egg. Break an egg into the mixture and whisk it together to incorporate the egg. You're on your way to making the batter. ", " Add a few drops of lemon juice and water. Just squeeze a lemon slice into the mixture and then pour the water in. If the mixture is still too thick, you can add more water to thin it out. ", " Add the sweetcorn , spring onions and chopped coriander to the batter. These are the last of the ingredients you'll need for the batter. ", " Mix well. Use a whisk to fully mix the ingredients together. The result shouldn't be too thick, but should be a bit on the thin side. If it seems too thick and chunky, then you can add a little bit more water. ", " Heat the oil . In a frying pan, heat the oil over medium to high heat. Give it at least one minute to heat up. ", " Cook the fritters. When the oil is hot, add 2 tablespoons of the mixture for each fritter and flatten it with the back of a spoon. This will give the fritter a pancake-like shape. Just watch out for spurting oil when you place the fritters into the pan. ", " Cook each fritter for about 2-3 minutes on one side before turning it over. Cook until golden brown on both sides. ", " Drain the fritters. When the fritters are cooked, use a slotted spoon to remove them from the pan and absorb any excess oil with paper towels. ", " Serve. Serve them with chili sauce and garnish with coriander or parsley leaves. You can also always enjoy this delicious recipe on your own. These fritters are perfect for breakfast or as a snack during any time of day. If this recipe is too complicated for you, but you like the technique, you can make pan-fried corn fritters using only these ingredients:  15.25 ounces of whole kernel corn 2 eggs 2 tablespoons of flour Salt Pepper 2 tbsp. of vegetable oil  "], "Deep Fried Corn Fritters": [" Mix the flour, sugar, and baking powder together. Place these ingredients in a large bowl and stir them until they are thoroughly combined. Whisking them all together works best. This recipe makes 6 servings or around 36 fritters. ", " Add the eggs, milk, salt, and cayenne pepper. Once you've combined the first set of ingredients, you should stir the next set together until you've thoroughly combined everything again. ", " Add the corn and chives to the batter. You can use canned corn or corn fresh off a cooked cob. Now, use a mixing spoon to fold the ingredients into the batter until they're fully incorporated. They don't have to stick together completely; thanks to the milk, the mixture should be a little bit loose. If it's too chunky, add a bit more milk to loosen it up. ", " Heat 3–4 inches (7.6–10.2 cm) of canola oil in a pot to 365 degrees. Use a deep fry thermometer to make sure the oil doesn't get hotter than this; if it does, the fritters will burn right away. You can go ahead and start heating the oil while you make the batter to save time since it'll take a little while for it to heat up. ", " Drop spoonfuls of the batter into the oil. You can use a cookie scooper or a regular spoon to scoop out each spoonful of dough. It will expand and should be no bigger than a ping-pong ball. Once you've scooped it out, drop it into the oil. You can throw in as many spoonfuls at a time as will comfortably fit into the pot. ", " Cook each spoonful of batter until it's golden brown on both sides. Give each spoonful about 2-3 minutes on each side before flipping it over, allowing it to brown evenly. You have to keep a close eye on them during this time to make sure they don't burn. ", " Drain the fritters on a paper towel. Use a slotted spoon to remove the fritters from the oil, shaking off the excess oil, and place them on a paper towel over a plate. ", " Serve. You can enjoy these tasty corn fritters on their own, or you can sprinkle them with a spoonful of powdered sugar or lightly drizzle them with maple syrup. Enjoy them for breakfast, as a snack, or during any time of day. "]}}, "How to Make a Jelly Sandwich": {"description": "You want to make a quick peanut butter and jelly sandwich for lunch, but you open up the cupboard and the peanut butter is gone! What should you do? Don't panic. Just follow this simple guide to create a jelly sandwich, which can be just as delicious as a PB&J if done correctly.", "content": {"Steps": [" Grab your materials.  It's the exact same materials you need to make a classic P&J (just without the peanut butter): one to two slices of bread, flavor jelly of choice, a butter knife to spread the jelly, and a plate and napkin to eat it once it's done. Place the bread on the plate. One piece will make a quicker, smaller sandwich, while two pieces will make a larger, more filling one.   ", " Prepare your jelly.  Most kinds of jelly come in a jar. In order to open it, grab the lid and twist. For other kinds that may come in a bottle, you just flip open the lid and squeeze out your jelly. At this point you need to place the jelly on the bread. If it's in a jar, you may need to use the butter knife to get it out. Just leave it in a little heap in the center of the bread for now, making sure you have a good jelly to bread ratio.  ", " Spread the jelly.  Using the butter knife, spread the jelly as evenly as possible over each slice of bread. It doesn't have to be perfect, but you don't want too much jelly all in one bite. Try to spread outwards from the center of the bread for the best results. This step can sometimes get a bit messy. If you get any jelly on your hands or on the crust of the bread, you can wipe it up with your napkin.  ", " Finish up your sandwich.  If you are making your jelly sandwich with two slices of bread, place one of the pieces of bread on top of the other, making the sides with jelly meet. Try to align the crusts of the bread so that no jelly leaks out. If you are making your jelly sandwich with one piece of bread, you can finish it off in two ways.  The first is to break the bread in half, then place one half on top of the other so that the sides with jelly meet. You want to align the two halves just like above. This method words best with harder bread. The second is to fold the bread in half, aligning the sides with the jelly. This method works best with softer bread, as harder bread may crumble when folded. The only thing left to do is enjoy your edible masterpiece!  "]}}, "How to Make Cucumber Sandwiches": {"description": "If you've never had a cucumber sandwich, the concept may seem a little bizarre: a sandwich based around a vegetable known for its mild flavor. Don't knock it until you've tried it — this treat makes a great companion to tea and is just as good on its own as a low-calorie snack. Learn the traditional English recipe for the sandwich along with a few basic recipe variations to keep your meals interesting.", "content": {"Basic Cucumber Sandwich": [" Peel and slice a fresh, washed cucumber. Traditionally, cucumber sandwiches use thin, crisp slices of cucumber with the dark green peel removed. Use a potato peeler or a small, sharp knife to shave off the peel. You can use thick slices or leave the peel on if you wish — it's up to you. The peel won't hurt you, but its texture is slightly tougher than the flesh of the cucumber.   ", " Drain the liquid from the cucumber slices. Drop the slices into a colander in the sink. Let them drain for about 10 minutes, then remove them to a plate and pat dry with a paper towel. Getting your cucumber slices as crisp and dry (on the outside) as possible is important for a good sandwich. Soft, wet slices of cucumber are exactly what you want — they'll leave you with a dull, soggy mess.  ", " Make your cream cheese spread. In a small bowl, combine cream cheese, Worcestershire sauce, mayonnaise, garlic powder, and onion salt. Stir well until smooth and uniform. ", " Spread the cream cheese mixture on both pieces of bread. You can be as generous as you like with the spread. One of the nice things about putting the spread on both pieces of bread is that it traps the moisture from the cucumber slices in the middle of the sandwich so that they don't make the bread soggy. This is something you can do with many fat or oil-based spreads (like peanut butter).   ", " Sandwich the cucumbers between the bread slices. Lay down a few slices of cucumber on one of the pieces of bread. You can be generous here — you want a little cucumber in every bite. When you're done, lay the other piece of bread on top (spread facing down, of course). Congratulations — you just made your first cucumber sandwich!  ", " Remove the crusts and cut the sandwich into small pieces. There's no \"wrong\" way to eat a cucumber sandwich, but in England, the sandwich is often eaten in small, crust-less squares, triangles, or fingers. Cut the sandwich how you wish (or leave it how it is) and serve immediately.  If you're serving guests, repeat the steps above for more sandwiches, working through your loaf of bread. If needed, make more spread or cut more cucumber slices. In the section below, you'll learn a few tips for \"spicing up\" the basic cucumber sandwich recipe. Use these variations as you wish — you may even want to try serving a platter with every different kind of sandwich for variety's sake.  "], "Recipe Variations": [" Sprinkle dill over the cucumbers for a subtly fresh flavor. Dill pairs excellently with the smooth, subdued flavors of a typical cucumber sandwich. After all, it's a crucial ingredient in dill pickles (which are made from cucumbers). A pinch or two of dried dill sprinkled into the sandwich will add some of this unique pickle-y flavor to the dish. For an eye-catching presentation, try serving the sandwiches open-faced (without the top piece of bread) and laying a single sprig of fresh dill across the cucumber slices. It'll look gorgeous (and taste great, too).  ", " Use lemon pepper for a tangy twist. With their crisp, cool taste and texture, cucumber sandwiches are the perfect summertime snack. Adding a little lemon pepper to the spread or sprinkling it over the cucumber slices gives your sandwiches just a hint of sourness, making them even more refreshing. Lemon pepper can be bought for fairly cheap at most mid- to high-end grocery stores. You can also make it yourself from lemon zest, salt, and pepper.   ", " Add Italian-style salad dressing for savory flavor. If the standard cucumber sandwich doesn't have enough flavor for you, try adding a splash of your favorite Italian salad dressing as you're mixing the spread. This will give it a slightly more savory, substantial flavor without ruining the overall smoothness that makes a cucumber sandwich so great. ", " Use pumpernickel rye bread for a traditional combination. Cucumber sandwiches are great with any good-quality white or wheat bread, but for an old-fashioned taste, use pumpernickel rye. Its heavy, sweet flavor contrasts well with the light, crisp bitterness of the cucumbers and the smoothness of the spread. Rye breads aren't always sold at neighborhood grocery stores, but you should be able to find it at many higher-end locations.  ", " Try with chopped mint for added coolness. Cucumbers are cool and crisp on their own, but with the added flavor and aroma of fresh mint, they're practically ice cold. Chop a few sprigs of mint and sprinkle them over the cucumbers or add them on top of each sandwich as a garnish. If you can, chop the mint into small, fine pieces. It's a little difficult to chew through whole mint leaves when they're in the middle of a sandwich.  ", " Try the sandwich with Marmite spread (if you're bold). Marmite is an infamous, strong-flavored spread made from yeast extract that is popular in the U.K. and some Commonwealth countries. Some people love it and some people hate it — it doesn't leave many tasters without a strong opinion. People who enjoy Marmite have been known to add it to cucumber sandwiches. If you want to try it but you've never had Marmite before, using a small amount is recommended. Marmite is often described as having a very salty taste with fishy qualities. It also has a strong odor that, to some, is unappealing.   "]}}, "How to Make a Pita Wrap": {"description": "This is how to make an ultra delicious pita wrap.", "content": {"Steps": [" Go to the grocery store and get sliced turkey meat from the deli, also provolone cheese, lettuce, and pitas.   ", " Take the pita out of the bag by untying the twist tie, and then take a knife and slice the pita open, cutting around the edges.  ", " Take the cheese and meat out the refrigerator and take two pieces of cheese and two pieces of meat out of the baggies by pulling the Ziploc to the bag apart.  ", " Place the cheese in between the sliced pita layers and then put the meat on top of the cheese.  ", " Place the pita in the microwave on a paper towel and microwave for 10 seconds so the cheese is nice and gooey.  ", " Take the pita out of the microwave (use caution, it will be hot) and place on a plate. Then take the lettuce out of the refrigerator and wash it off with water. Dry it off with another paper towel and then rip up about 3 inches (7.6 cm) long worth of lettuce. ", " Place sliced lettuce in the middle of the pita along with the cheese and meat.  ", " Roll the pita like a rolling pin and voila! The best pita wrap alive. ", " Finished.  "]}}, "How to Make a Stromboli": {"description": "Ah, stromboli.A delicious traditional recipe that makes your mouth water at the sound of the word. Basically, it is a pizza rolled into a hollow bread with a filling inside. But, of course, you have to make it just right. Now, you can make your own stromboli, and serve it to your family.", "content": {"Making the Dough": [" In a large mixing bowl, stir yeast and honey into warm water. If you have a stand mixer, that's best. Let it sit for 5-10 minutes or until bubbles form on the surface and the mixture begins to foam. These are the signs to look for to know that the yeast is doing its job.  ", " Pour in salt, oil and half the flour. Mix it well, and once that flour is fully combined, start adding the rest of the flour in bit by bit until you get the stromboli dough to the consistency you want. It should be a little tacky, but when you touch it nothing should stick to your fingers. Using a standing mixer will greatly eliminate your woes. This is doable by hand, but it'll be a workout. Be patient.  ", " Knead for 6 minutes. Turn a timer on and keep those arms working until it buzzes -- resist the temptation to stop any earlier. After six minutes, the dough should be smooth and easy to work with. It may be tempting, but don't cave. If you overwork the dough, it becomes harder to work with, the consistency becomes undesirable, and it won't raise properly.  ", " Lightly grease the bowl and the dough. If you don't, it'll dry out. Cover the dough with plastic wrap, set it on your counter, and let it rise for 1-2 hours. Try to use it as shortly after this period as possible -- it's freshest when recently risen. "], "Pizza Stromboli": [" Preheat the oven to 450° Fahrenheit (232° Celsius).  ", " Remove the dough from the refrigerator and place in a medium-sized bowl. If it's been on the short side of two hours, check to see that it's adequately raised. ", " Coat the dough with the olive oil. Recover it with the plastic wrap, and let it rest at room temperature for 15 minutes. It'll be a bit more manageable when it cools slightly. ", " In a small saucepan over medium heat, combine the tomatoes and their juices. Add the oregano and salt and bring to a boil. Stir it occasionally, thoroughly combining the spices. ", " Reduce the heat in the saucepan and simmer. Crush the tomatoes with a wooden spoon until the sauce thickens. This should take about 10 to 15 minutes. ", " Shape the dough into one 12-to-14-inch round and place on a baking sheet. Cover with the sauce and top it with the cheese and the meat of your choice -- pepperoni, sausage, salami and chicken all work well. But any filling you can imagine works, too. ", " Brush the edges of the dough with the egg. Crack it into a separate bowl, whisk it up, and brush the yolk onto the dough to give it a golden color. Don't throw it out after this step! You'll need it for the top, too. ", " Braid or fold the dough. For instructions on this, scroll toward the bottom of the page. The stromboli can take very different forms, depending on your desired method. Once put together, brush the top with egg and sprinkle the Parmesan and parsley over the egg-brushed surface. These additions will fool your friends into thinking it's restaurant-made.  ", " Bake until it is golden brown or crisp, about 20 to 25 minutes. Keep an eye on it, especially if your oven runs hot or cooks unevenly. ", " Transfer to a cutting board and sprinkle with basil. Slice the bread into rounds and divide among individual plates. This recipe should make about 6 servings -- depending on how hungry everyone is, of course.  "], "Ground Beef & Pepper Stromboli": [" Preheat the oven to 400°F. Grab a cookie sheet and spray it with nonstick cooking spray. If you'd prefer, line a sheet with parchment paper (no muss, no fuss, just throw it away after). ", " Prep your ingredients. Chop up your bell pepper(s) and, if applicable, shred the mozzarella. Measure out your ingredients and set aside for swift assembly. The pepper works best for this recipe if it's in thin slices, not chunks. But any shaped pepper is better than no pepper at all!  ", " Brown your ground beef in a medium-sized skillet over medium-high heat. Make sure to stir frequently to cook it evenly, browning it on all sides. Drain away the juices, fat, and set aside. ", " Form the dough. Place it on the sprayed cookie sheet and get to work. Starting at the center and working outward, form a 12x8-inch (30 by 20 cm) rectangle by pressing out the dough with your hands. ", " Spread the sauce over the dough. Make sure to leave a crust! You want the sauce to within 2 inches of the long sides and 1/2 inch of the short sides. Place the cooked ground beef lengthwise down the center (about 3 inches in width) and to within 1/2 inch of the edges on the short sides. Top with cheese, bell pepper and Italian seasoning -- or whatever whets your appetite. If you'd like your dough to be braided, leave extra room on the sides.  ", " Fold the dough. See the next section for possible folding methods. Once folded, if you'd like a golden color, whisk up an egg and brush it on the top just before baking. Add on any spices or cheeses for a flavor-y crust. ", " Bake for 15 to 20 minutes or until crust is golden brown. If your dough seems a bit overstuffed, be especially careful. Keep an eye on it and flip it halfway through, if necessary. Remove from the oven and let cool. Slice as you see fit. This recipe should serve 6.  "], "Rolling or Braiding": [" For a roll, start with the thinnest strip of dough. You want the largest section of non-filled dough to be at the end of the roll. This gives it a nice thin-to-thick shape and helps the dough maintain form in the oven. Brush with an egg yolk, if desired. Resume cooking instructions.  ", " For a braid, pile your fillings in the center. Start making parallel horizontal cuts about 1 1/2 inches (3.75 cm) from the filling and at 1 1/2 inch (3.75 cm) intervals down both sides. Leave a 1 1/2 inch (3.75 cm) uncut edge at the top and bottom for the ends. ", " Then, fold the uncut top and bottom edges over the filling. Starting at the top, start braiding the cut ends. Fold one strip over from the right side, then the left, and repeat, slightly overlapping a bit each time. Continue in this motion to create a braided effect, tucking in the last strips underneath the bottom, uncut edge. Cover with a kitchen towel or cheesecloth and allow the stromboli to rise for 30 minutes. Resume cooking instructions.  "]}}, "How to Make a Chicken Wrap": {"description": "It's easy to grow tired of salads and sandwiches for lunch. To make lunch interesting again, try a chicken wrap. Grill a wrap filled with chicken, ranch, and mozzarella for a hearty meal or create a lighter wrap filled with tomatoes, lettuce, cucumber, and yogurt sauce. If you like spicy chicken wraps, cook the chicken in Louisiana-style hot sauce. Fill the buffalo chicken wrap with lettuce, blue cheese, and ranch dressing.", "content": {"Grilled Chicken Ranch Wraps": [" Divide the chicken, ranch, cheese, and cilantro between 4 tortillas. Lay the tortillas on a work surface and put about 1/2 cup (62 g) of the chopped chicken on each. Top the chicken on each tortilla with 1 tablespoon (14.8 ml) (15 g) of ranch dressing and 2 tablespoons (29.6 ml) (14 g) of mozzarella cheese.  If you'd like to include minced cilantro, put about 1 tablespoon (15 ml) (4 g) on each wrap.   ", " Fold each tortilla to secure the ends and side. Bring 2 sides of the tortilla up so the filling settles in the center. Then tuck the ends of the tortilla towards the center. Hold these in place and use your thumbs to roll a long side of the tortilla over the filling. Keep rolling the wrap over so it's completely closed.  ", " Heat a grill pan and cook the wraps for a few minutes on each side. Put a grill pan on the stove and turn the burner to medium or heat a small grill to medium. Spread a little oil or cooking spray on the grill so your wraps don't stick and place the wraps on the hot grill. Cook them for 1 to 2 minutes on each side.  The tortilla will become crisp and golden brown once it's grilled long enough.  ", " Slice and serve the chicken ranch wraps. Turn the burner off and put the wraps on serving plates. Cut each wrap in half and serve them immediately.  Store the leftover wraps in an airtight container in the refrigerator for up to 2 to 3 days. Keep in mind that the wrap will become softer as it's stored.  "], "Making Healthy Chicken Avocado Wraps with Yogurt Sauce": [" Mix the yogurt, mustard, honey, salt, and pepper to make the sauce. Measure 1 cup (245 g) of plain yogurt into a bowl and whisk in 1 teaspoon (5 g) of mustard, and 2 teaspoons (14 g) of honey. Taste the sauce and add salt and pepper according to your taste.  Set the sauce aside while you make the chicken wraps.  ", " Warm 4 whole-wheat tortillas or chapati. To make the tortillas or chapatis easier to wrap, heat them in the oven, microwave, or skillet just until they're warm enough to bend easily. ", " Divide chicken, veggies, and avocado between the wraps. Lay the 4 warm tortillas on your work surface and place 1/2 cup (62 g) of chicken on each wrap. Lay 1 lettuce leaf, a few of the halved cherry tomatoes, long cucumber slices, and a few slivers of avocado on each wrap.  Cut the cucumber lengthwise into thin slices.  ", " Drizzle sauce over the filling and fold the tortillas into wraps. Top the wrap fillings with a few spoonfuls of the yogurt sauce. To fold the wraps, tuck the ends of each tortilla towards the center. Then fold 1 side over the filling and keep rolling until the wrap is enclosed.  ", " Serve the wraps with more yogurt sauce. Leave the wraps whole or slice them in half before serving. Offer more of the yogurt sauce on the side for dipping or drizzling.  Refrigerate the leftover wraps in an airtight container for up to 2 to 3 days.  "], "Creating Spicy Buffalo Chicken Wraps": [" Sauté pound (230 g) of cubed chicken for 6 minutes. Heat teaspoon (2.5 ml) of canola or vegetable oil in a nonstick skillet over medium heat. Add the chicken breast to the skillet and cook it until it's almost cooked throughout. Stir the chicken frequently as it cooks to prevent it from sticking to the pan.  ", " Stir in the hot sauce and simmer the chicken for 3 to 5 minutes. Add 2 tablespoons (30 ml) of Louisiana-style hot sauce into the skillet and keep heating the chicken until the sauce begins to bubble. Stir and cook the chicken until it reaches 165 °F (74 °C) according to an instant-read meat thermometer. Turn off the burner. Keep the skillet uncovered so the sauce thickens as it cooks.  ", " Divide the lettuce, chicken, ranch, and cheese between 2 tortillas. Lay the tortillas on your work surface and put 1/2 cup (18 g) of shredded lettuce on each tortilla. Divide the buffalo chicken mixture between the tortillas and then pour 1 teaspoon (4.9 ml) of ranch salad dressing on each. Sprinkle 1 tablespoon (14.8 ml) (9 g) of crumbled blue cheese on both wraps.  ", " Roll and serve the spicy chicken wraps. Tuck both ends of the tortillas towards the center and then fold 1 long side over the filling. Continue to roll the tortilla over the filling to completely seal up the filling. Serve the wraps immediately.  Refrigerate the leftovers in an airtight container for up to 2 to 3 days.  "]}}, "How to Make a Croissant Sandwich": {"description": "A warm, buttery croissant with delicious melted cheese, ham, plenty of creamy mayonnaise, and delicious scrambled eggs. A simple recipe for a healthy and mouthwatering breakfast!", "content": {"Steps": [" Lay out your equipment.   ", " Take a sharp knife (not a butter knife) and cut the croissant in half, then place each slice (inside facing up)next to each other on a paper plate.  ", " Scoop out the mayonnaise or Miracle Whip with a spoon and splatter it on each side. Take as much as you like. Use a butter knife to spread the mayo/miracle whip. ", " Take a piece of ham and lay it on the bottom half of the croissant.  ", " Take a slice of cheese and lay it on the top half. Why does it matter which side the ham or the cheese goes on? It doesn't, but put the cheese on the top half and then see what happens to it when the sandwich is finished... it's hilarious! ", " Take the two halves off of the paper plate and put them into a toaster. When the cheese is melted, remove it from the toaster. Check it regularly, while following the next steps. ", " Take a small, microwavable bowl and crack the egg on it. Stick your thumb into the crack and break it open, allowing the yolk into the bowl. Throw the eggshell into the sink by the garbage disposal or in the compost/trash. Wash your hands carefully. ", " Stab the egg yolk with a fork and stir thoroughly. Add as much salt and pepper as you like. ", " Cover the bowl with a paper towel and place it in the microwave for a minute.  ", " When both the sandwich halves and the scrambled egg are finished, set them both on the paper plate on the counter/table. The eggs will be hot coming out of the microwave, so place them on the stovetop. Use the fork you stirred the eggs with to pry the sides of the eggs from the bowl and plonk it right down onto either side of the sandwich. ", " Put both halves together (be careful, the scrambled eggs might slip). If you placed the cheese on the top half, note that it looks like it was melted upside down. There's a little natural humor for you to start the day with! ", " Give it about half a minute to a minute to cool, then enjoy your homemade croissant sandwich!  ", " Finished.  "]}}, "How to Make Norwegian Open Faced Sandwiches": {"description": "Scandinavian open-faced (Smørbrød)sandwichesoffer your guests the opportunity to fix sandwiches the way they like them. Below are some basic and traditional ideas for serving this meal. Open-faced sandwiches are popular throughout Scandinavia and almost all sandwiches are similar in theme. Here are some Norwegian sandwich favorites!", "content": {"Smoked Salmon": [" Smoked Salmon (Lox), thinly sliced  , thinly sliced Tomatoes, sliced  , sliced Lemon slices  , green and black  , sliced Red and green bell peppers, sliced, for garnish Whipped  Chives or  Assorted breads   ", " Lay out the assorted sandwich making ingredients.  ", " Fold in the chives or dill into the whipped cream cheese.  ", " Spread cream cheese on bread slices.  ", " Top with salmon slices and favorite sandwich fixings.  "], "Smoked Salmon with Egg": [" Smoked salmon, sliced thin Hard-boiled wedges or   slices  ", " Lightly  butter bread slice.  ", " Lay smoked salmon slices a top a slice of white bread.  ", " Top with hard-boiled egg wedges or scrambled egg.  ", " Garnish with dill .  "], "Shrimp Sandwich": [" Cooked , shelled  , cooked and shelled  slices Toasted slices  ", " Lightly spread mayonnaise on toasted bread slice.  ", " Top with shrimp, crab and lemon slices.  "], "Reindeer Sandwich": [" Roast meat, sliced  wedges, poached  preserves  slices Butter  ", " Lightly butter bread slice.  ", " Top with Reindeer meat, poached apple slices and preserves.  "], "Ham and Egg": [" Cooked slices Scrambled eggs  slices  ", " Lightly butter bread slice.  ", " Top with sliced ham and scrambled eggs.  "], "Cheese": [" Select your favorite thinly sliced cheese such as Geitost, Jarlsberg, Havarti, Cheddar, Fontina or Lappi Select sliced , , , or egg Select or leaf, optional Butter  ", " Lightly butter bread slice.  ", " Top with favorite sandwich toppings. Apples and Cheddar would be a good combination or try Jarlsburg with sliced tomato . "]}}, "How to Create Nutritious Wraps": {"description": "Wraps are a fun way to change up your typical sandwich.  Instead of two pieces of bread, wraps use a thin tortilla or flatbread to hold ingredients together.  You can also use low-calorie options like lettuce, seaweed and even spring roll wrappers instead of the traditional tortilla or flatbread.  Incorporate some nutritious wraps into your meal plan for a fun and creative twist on your meals.", "content": {"Choosing Nutritious Ingredients": [" Select your type of wrap. When you're making a wrap, there are a variety of items you can use to wrap up your tasty ingredients.  Try to keep calories to 100 – 180 calories per item so your entire wrap doesn't get too high in calories. Mix it up and experiment with all the different ways you can wrap your food. You can try: Tortillas or wraps.  These are the traditional wraps used in these types of recipes.  They are very thin bread generally made from either corn or wheat.  Try to go for 100% whole wheat or whole grain as these tortillas/wraps will have more fiber and protein.  Flatbreads or lavash bread.  Both of these are similar to tortillas, but may be slightly larger or thicker.  Again, choose 100% whole wheat or whole grain items. Pita bread.  Pita bread can not only be stuffed with ingredients, but can also be used to wrap items too.  Whole grain is the preferable choice here as well. Lettuce.  If you're looking to watch calories or your total carbs, consider using lettuce as a wrap.  It's crunchy and naturally low in calories and carb-free. Try butter lettuce, iceberg lettuce, kale, Swiss chard or romaine lettuces. Spring roll wrappers. These are also low in calories and carbohydrates. It may take some practice to use them, but they offer a fun twist on your traditional wrap. Seaweed.  Just like with sushi, you can use sheets of seaweed as a wrap too.  Plus, seaweed has a variety of benefits, including fiber, minerals, and phytonutrients.   ", " Choose a low-calorie condiment. Wraps can be a healthier or more nutritious choice than a sandwich.  Don't waste more than 50 calories on the total amount of condiments you add to your wrap; however, adding a ton of high fat condiments, sauces or dressings will defeat the purpose.  Stick to lower calorie condiments like: Mustard.  There are tons of flavors of mustard — spicy, yellow, dijon — but all are naturally low in calories. Mustard is high in sodium, however, so look for low-sodium options. Go for 1 – 2 tablespoons. Mayo with olive oil.  Although mayo gets a bad rap about being high in calories and fat, try the mayo made with olive oil.  It's lower in calories than regular mayo and has some heart healthy fats.  Use 1 – 2 tablespoons (29.6 ml).  Hummus.  Bean dips, lentil dips or hummus may not be your most traditional condiment, but it can add some moistness to your wrap in addition to giving you a boost of fiber and protein.  Smear on 2 – 4 tablespoons (59.1 ml) of hummus.  Salsa.  If you like a little kick to your meals, try adding salsa to your wraps. Check the ingredients to make sure there is no added sugar.  Add about 2 – 3 tablespoons (44.4 ml) of your favorite salsa. Hot sauce.  Another spicy kick you can try out is hot sauce. It's low in calories but adds a lot of flavor to your meal.  Stick to 1 tablespoon or less, unless you like it super spicy! Low-fat dressings.  Using a dressing in a wrap is common; however, they can get high in calories.  Look for low-fat dressings or yogurt-based dressing for less of a calorie hit.  Keep your serving under 2 tablespoons.  ", " Select a source of lean protein. Protein is an essential nutrient to include at each meal.  Always aim to have 3 – 4 oz of protein in every wrap.  Plus, it'll help keep you feeling satisfied throughout the day.  Choose a lean protein to add to your wrap to manage your overall calories. You can try: Poultry and red meat.  These are the most common wrap fillings.  Choose all natural and low-sodium deli meat, sliced chicken or turkey or lean red meat.  They will typically have fewer additives and sodium.  Choose three to four slices of deli meat or a piece of meat the size of your palm. Scrambled eggs.  If you're feeling like a little breakfast, try adding scrambled or hard boiled eggs to your wrap.  They're high in protein and healthy fats.  One to two eggs will meet your 3-4 oz serving size.  Sliced cheese.  If you're avoiding meat or just want to change it up a bit, try adding some sliced cheese to your wrap.  It's another great source of protein and also high in calcium.  Aim for two to three slices.  Beans or lentils.  If you want to skip the meat, try filling your wrap with 1/2 cup of beans or lentils.  They're not only high in protein, but also high in fiber.  Tofu or tempeh.  Another great vegetarian source of protein is tofu and tempeh.  Both made from soy beans, they're a great alternative to meat.  Slice up 3 – 4 oz or a block about the size of your palm. Seafood.  Besides tuna salad, you can add grilled fish or seafood to your wrap.  They're still high in protein and some seafood (like salmon) are also high in heart healthy fats.  Measure out 1/2 cup of tuna salad or 3-4 oz.   ", " Add in some vegetables. It's important to get an adequate amount of vegetables in each day.  By stuffing in 1 cup of these nutrient powerhouse veggies to your wrap, you can help meet your daily goal of four to six servings. Try: Salad.  Wrap up a Greek, Cobb or Caesar salad in your wrap. Sliced raw veggies.  Vegetables can be bulky.  Slicing them into thin strips helps them fit evenly in your wrap. Roasted vegetables.  Make a vegetarian meal by filling your wrap with roasted or grilled vegetables.  Top with some cheese and hummus for extra protein.  "], "Getting Creative with Wrap Recipes": [" Use Vietnamese rice noodles. Perfect for spring roll wrappers or lettuce, rice noodles are low in calorie and filling.  Toss 1/2 cup of cooked rice noodles with your favorite Asian dressing or sauce. Divide the rice noodles in half and layer each half into a butter lettuce leaf. Top each lettuce leaf with 1/4 cup of cooked ground pork seasoned with salt and pepper. If desired, top your lettuce wraps with 1 – 2 tablespoons shredded carrots, a few leaves of cilantro and a sprinkling of toasted sesame seeds.  ", " Go vegetarian with quinoa or tabbouleh. Put a Mediterranean spin on your wrap by adding in some quinoa or tabbouleh.  These whole grains are high in fiber and protein and can help keep you satisfied longer.  Lay out a whole wheat pita bread and top with 1/2 cup of premade tabbouleh. Top with 2 tablespoons of a shredded parsley and basil.  Then sprinkle on 2 tablespoons of feta cheese. Tucking the ends of the tortilla in, roll up until the wrap is completely closed.  Slice in half and enjoy.  ", " Make a lower calorie classic. A very common and tasty wrap is the buffalo chicken wrap; however, it's usually filled with fried chicken strips and high-fat blue cheese.  Try this version for a lower calorie wrap: Smear a 12\" whole wheat tortilla with 1 tablespoon of light mayonnaise and top with 3 – 4 oz of sliced grilled chicken strips and 1/4 cup of packed down and shredded romaine or iceberg lettuce. Drizzle on 1 – 2 tablespoons of buffalo sauce, 1/2 ounce of blue cheese and two to three diced cherry tomatoes. Tucking the ends of the tortilla in, roll up until the wrap is completely closed.  Slice in half and enjoy.  "], "Storing and Transporting Wraps": [" Consider keeping ingredients separate until ready to eat. The one downside to packing lunches is the possibility of opening up your lunch to find a soggy sandwich or wrap.  Experiment with these tricks to keep your sandwich crunchy and fresh: Pack your wrap components separately.  If you're unsure of how to keep your wrap from getting soggy, pack everything separate.  This is a sure way to keep your ingredients fresh and crunchy.  Put juicy or \"wet\" ingredients in the center.  Put juicy tomatoes, pickles or marinated proteins in the center of your wrap.  You may want to consider sandwiching them between lettuce leaves to keep their moisture contained.  Mayo is higher in fat and can keep your wrap from getting super soggy; however, other condiments — like dressings or vinaigrettes — can make your wrap soggy.  Use very little or consider keeping them on the side if possible.  ", " Roll your wrap tightly in tin foil or plastic wrap. If you're packing your wrap to-go, make sure you tightly wrap it up so it stays in a formed roll and the ingredients do not spill out. Plastic wrap is a great tool to use.  You can keep your wrap fresh and tightly rolled together by fitting the plastic wrap snugly around your wrap. Aluminum foil is another material that you can use to keep your wrap contained.  Foil is especially good if you're keeping your wrap warmed. Parchment paper also works well.  But you'll need to secure the ends with some tape to make sure it doesn't unfold in your lunch box.  ", " Keep your wrap cold. If you're bringing your wrap to work or packing it up for a picnic, it's important to make sure that it stays cold.  If your wrap, or any food, gets too warm and stays warm, you could get sick.  If your wrap contains meat, vegetables, salads (made with mayonnaise) you'll want to keep the temperature under 40°F (4.4°C)if possible.  If it remains between 40 – 140°F  (4.4 – 60°C), this is the \"danger zone\" where bacteria can grow.  Include at least two cold sources when packing your wrap.  You can pack in two freezer packs or a freezer pack and a bottle of frozen water.  Refrigerate your wrap as soon as you're able or make sure to plan on eating it before your cold sources melt or get too warm. Foods that do not need refrigeration are whole fruits and vegetables, peanut butter, unopened canned tuna or chicken, pickles, mustard and hard cheese.   "]}}, "How to Make Tea Sandwiches": {"description": "Want to make some classic sandwiches to go with your tea? Follow these easy steps to learn how to make 3 different kinds of delicious tea sandwiches.", "content": {"Smoked Salmon Sandwich": [" Spoon the mayonnaise into bowl.   ", " Add dill, lime zest, and lime juice. Combine well with spoon. ", " Spoon a generous amount onto the slices of white bread. Use spoon to spread it evenly, using the back of your spoon. ", " Place smoked salmon over 2 of  the slices, and add the sliced cucumber on top of the slices with salmon.  ", " Put the slice without salmon and cucumber on top of the slices with salmon and cucumber.  ", " Slice in half using a knife.  "], "Egg Salad Sandwich": [" Add chopped egg into the medium bowl.  ", " Add mayonnaise, Dijon mustard, chopped chives, and  salt and pepper. Combine well with spoon. ", " Spoon a generous amount over 2 of the slices, and spread well.  ", " Sprinkle the bacon bits over 2 slices.  ", " Close the sandwich.  ", " Cut diagonally.  "], "Avocado Shrimp Sandwich": [" Place mashed avocado into bowl.  ", " Add 1 tbsp lemon juice.  ", " Add cayenne pepper and salt.  ", " Combine well.  ", " Place shrimp in another bowl.  ", " Add mayonnaise, chopped coriander, and salt.  ", " Stir well.  ", " Spoon the avocado mix onto 2 slices of bread, and spread well.  ", " Heap shrimp mixture on top.  ", " Press down lightly with spoon.  ", " Place the other slices on top.  ", " Slice in half.  "]}}, "How to Make a Turbo Sandwich": {"description": "This article will show you how to satisfy your taste buds.", "content": {"Steps": [" Get a slice of bread  ", "Add butter ", "Grill the slice of bread ", "Get another slice of bread ", "Toast it ", "Add mayo to both sides ", " Get one more slice of bread and grill it.  ", "Cook 4 bacon strips until they are cooked but still tender ", "Place them on the grilled bread ", "On top of the bacon add a slice of cheese ", "On top of the cheese add a breaded chicken breast ", "Add the toasted slice ", "Add Lettuce and tomato ", " Put the last grilled slice on top.  ", " Finished.  "]}}, "How to Make a Portobello Mushroom Sandwich": {"description": "Portobello mushrooms can be a delicious substitute for meat in a sandwich. These sandwiches can be expensive in restaurants, but you can make them at home without spending a lot of time or money.", "content": {"Steps": [" Clean the mushrooms by rinsing them in cold water and cut off the stems. Set them aside in a dish. Make sure to remove the gills with a spoon if the mushrooms still have them.  ", " Apply the pesto to both sides of the mushrooms using a basting brush or a spoon.  ", " Grease the frying pan using the non-stick cooking spray or a little cooking oil on a paper towel.  ", " Heat the pan over medium heat. Once heated, place each bun inside-down on the frying pan to toast. Depending on the size of your frying pan, you may be able to toast two buns at once. ", " Check the buns frequently to be sure they are not burning. Once they are toasted to your satisfaction, remove them from the pan and put each of them on a plate, open-faced. ", " Add the mushrooms to the frying pan while it is still hot from toasting the buns.  ", " Turn the mushrooms using a spatula every few minutes to make sure they cook evenly.  ", " Slice the tomato and/or the onion while the mushrooms are cooking. Place the tomato and/or onion slices on the top halves of the buns. ", " Continue to turn the mushrooms frequently until you notice that they have turned from firm and hard to slightly \"floppy\" when turned with a spatula. The cooking time for the mushrooms will vary depending on the size and thickness of each mushroom. Smaller and thinner mushrooms will cook quickly, while larger thicker ones will take a bit more time. ", " If adding Swiss or other sliced cheese, place a slice of cheese on each mushroom shortly before you remove it from the pan. Allow a few moments for the cheese to melt a bit before removing the mushroom from the heat. ", " Remove the mushrooms from the pan and place them on the bottom half of the bun.  ", " If you are using feta cheese , sprinkle a bit of feta on the mushroom once you have placed it on the bun. Placing the mushroom upside down on the bun works best for feta since the ridges on the underside will help it stay on the sandwich. ", " Serve the sandwich open-faced for a more pleasing presentation.  ", " Finished.  "]}}, "How to Make a Kosher Reuben Sandwich": {"description": "Kashrut (Hebrew \"Kosher\") dietary laws prohibit mixing dairy and meat, but a Reuben Sandwich is exactly that, a mixture of dairy and meat. This makes it inherently non-kosher.  By substituting dairy or meat ingredients with a Pareve (Yiddish: \"neutral\") food, it is possible to enjoy a kosher Reuben sandwich.", "content": {"Steps": [" Decide whether you want to have a dairy or a meat version. This depends on the type of meal you are having.  ", " Gather the basic ingredients, as well as the ingredients for your desired version.  ", " Squeeze the moisture out of the sauerkraut. Lay the sauerkraut on several layers of clean paper towels. Wrap the sauerkraut inside the paper towels and squeeze gently over a sink or bowl to get the excess liquid out. Squeeze out as much moisture as possible. If too much excess remains, it can seep into the bread, causing it to turn soft and mushy. ", " Butter half of the bread slices. Spread butter or margarine on one side of one slice to be used in each sandwich. Gently line the slices up butter-side down on a piece of wax paper. The buttered side will need to be on the outside as the sandwich cooks, so when you assemble the sandwiches, the non-buttered side needs to face up. If you do not use wax paper, you may end up losing too much of the butter after you lift the sandwich up. ", " Layer the beef or cheese.  If you are making a dairy version, layer the cheese, sauerkraut, and dressing. Evenly divide the corned beef and place it on the bottom of the sandwich.  Lay one piece of Swiss cheese, sauerkraut, and roughly 2 Tbsp. of prepared Thousand Island dressing. If you are making a meat version, layer on the corned beef, sauerkraut, and dressing. Evenly divide the corned beef and place it on the bottom of the sandwich. On top of the corned beef, lay the sauerkraut, and roughly 2 Tbsp. of prepared Thousand Island dressing.  ", " Butter one side of the other slice of bread. Place one top of the sandwich with the buttered side facing out. As with the first half of the bread, the buttered side must face out in order to come into contact with the hot skillet. ", " Melt another 2 Tbsp. of butter/margarine in a griddle. Add the butter/margarine and heat over medium until it melts completely. Note that you can also use a shallow frying pan or skillet if you do not have a griddle. By buttering both the sandwich and the griddle, you create more evenly toasted bread with a softer texture and a more buttery flavor. ", " Cook the sandwich until both sides are toasted. Once the cheese begins to melt and the sides along the bottom look golden brown, carefully flip the sandwich over and cook the other side. The other side should also be golden brown before you remove it from the pan. ", " Serve hot. Remove the sandwich from the pan and slice in half before serving. "]}}, "How to Make Avocado Tea Sandwiches": {"description": "Cucumber sandwiches are a staple for tea parties. Instead of going with the usual menu, however, why not try something different? Avocados give tea sandwiches a mild, yet surprising, touch. They are typically paired with cucumbers, but you can also add them to egg salad sandwiches as well. This wikiHow will give you lots of ideas for making avocado tea sandwiches. Once you know the basics, you can even make up your own!", "content": {"Making Avocado-Cucumber-Alfalfa Sandwiches": [" Prepare the spread. Place the cream cheese into a mixing bowl. Add the salt and pepper. Stir the three together with a fork or mini whisk until everything is evenly combined. You can save time by using an electric mixer or a food processor, but be careful not to over-mix it.  ", " Spread the cream cheese mixture onto each slice of bread. You will need about 1 tablespoon (15 grams) of cream cheese for each slice of bread. Try to spread the cream cheese across the entire slice, with no bread showing.  ", " Top four slices of bread with baby spinach. Set out four slices of bread, cream cheese-side-up. Arrange the baby spinach on top in an even layer. It's okay if you overlap them a little, but make sure that they are spread flat and smooth across the cream cheese; don't just dump them on.  ", " Add the sliced cucumber and avocado. Arrange the cucumber slices on top of the baby spinach, then add the avocado on top. Again, try to get a thin, even layer of each ingredients.  ", " Distribute the alfalfa sprouts evenly across each sandwich. You will use about ¼ cup (10 grams) of alfalfa sprouts for each sandwich.  ", " Top the sandwiches off with the remaining bread slices. Make sure that you are placing these slices cream-cheese-side-down. Gently press down on each sandwich to seal them together. ", " Cut the crusts off, then slice the sandwiches into thirds. Cut the crusts off first so that you get equal-sized rectangles. This will give you a nicer presentation. Next, cut the sandwiches widthwise into thirds.  ", " Garnish and serve the sandwiches. Cut 12 thin slices of cucumber; do not peel it this time. Place each slice on top of each sandwich. Top the slices off with a leafy herb or a pea tendril. Insert a toothpick, if desired. Arrange the sandwiches artistically on a plate. Serve them immediately.  "], "Refreshing Herbed Avocado Sandwiches": [" Puree the avocado, lemon juice, and salt. Slice the avocados in half, then remove the pits with a knife or spoon. Scoop the meat into a food processor, then add the lemon juice and salt. Blend until everything is smooth, scrapping down the sides of the bowl occasionally.  ", " Add the cucumber, and pulse for a few more seconds. Roughly chop up enough cucumber to fill ½ cup (75 grams). Add it to the food processor. Puree it for a few more seconds until the cucumber is finely chopped. Pause the food processor and scrape down the sides of the bowl with a rubber spatula.  ", " Mix in the mint and dill. Chop up some fresh mint and dill. Add both to the avocado mixture. Pulse everything for a few seconds, or stir the herbs in with a spoon. You want everything to be combined, but not mushy or soupy.  ", " Let the avocado filling sit for 10 minutes. This allows the flavors to blend together. For an extra-refreshing sandwich, leave the mixture in the fridge during this time.  Give the mixture a taste after the 10 minutes are up. If it's not salty enough, stir in some salt.  ", " Spread the avocado filling onto each slice of bread. Use a spoon or melon scoop to evenly distribute the avocado filling onto 12 slices of bread. Spread the filling around with a mini rubber spatula or butter knife. Try to get the filling from corner-to-corner, edge-to-edge, so that no bread shows. ", " Top six of the sandwiches with sliced cucumber. Wash a small cucumber and cut it into thin slices. Arrange the slices in a single layer across six of the sandwiches. You may not end up using all of the cucumber slices for this. ", " Top the sandwiches off with the remaining six slices of bread. Make sure that you are placing these slices avocado-side-down. Gently press down on each sandwich to seal it in. ", " Cut the crusts off, then slice the sandwiches into fourths. Cut off the crusts first so that you get equal-sized rectangles. Next, cut the sandwiches into fourths. You can cut them from corner-to-corner to make triangles, or widthwise to make strips.  ", " Serve the sandwiches. Arrange the sandwiches artistically on top of a nice plate. If you want to, garnish them with some herbs, such as mint or cilantro, or pea shoots. These sandwiches go especially well with Lady Earl Grey; it's lighter than regular Earl Grey with citrus undertones.  "], "Making Avocado and Egg Salad Sandwiches": [" Prepare the avocado and eggs. Hard boil three eggs. Let them cool, then peel them and chop them into cubes. Slice two avocados in half. Remove the pits with a spoon or knife. Slice the avocado into cubes, then turn them out of the skin. ", " Prepare the filling. Place the cubed egg and avocado into a bowl. Add the sour cream, chili powder, red pepper, hot sauce, salt, and pepper. Stir everything together with a fork until you get the texture you like. The more you stir, the smoother it will become.  These sandwiches will be very spicy. You can always use fewer spices or omit them altogether.   ", " Scoop the filling onto four slices of pumpernickel bread. You can do this using a spoon or a melon scoop, but make sure that each slice gets the same amount. Save the other four slices for later. ", " Spread the filling across the four slices. You can do this using a mini rubber spatula or a butter knife. Try to get the filling as close to the edges and corners as you can. ", " Top the sandwiches off with the other four slices of bread. Gently press down on each sandwich to seal it together. ", " Cut the crusts off, then slice the sandwiches into thirds. Slice the crusts off first, so that you get four, equal-sized rectangles. This give you a smoother finish on all four sides. Once you have the crusts off, slice the sandwiches widthwise into thirds.  ", " Serve the sandwiches. Because of how rich these sandwiches are, you do not need to garnish them. If you want to, however, you can arrange them on their sides on a plate, then sprinkle them with them crushed red pepper.  "], "Making Avocado-Cucumber-Salmon Sandwiches": [" Prepare the spread. Place the mayonnaise, lemon juice, and pepper into a small bowl. Stir them together with a fork or mini whisk.  ", " Spread the mayonnaise over each slice of bread. Use a butter knife to spread a thin layer of the mayonnaise over the top of each slice of bread. Try to get the mayonnaise from edge-to-edge, corner-to-corner, with no bits of dry bread showing. ", " Pit, peel, and slice the avocado. Cut an avocado in half. Remove the pit with a spoon or a knife. Pull the skin off, then cut the avocado into thin slices. You can cut it lengthwise or widthwise. ", " Slice the cucumber. Wash the cucumber first, then peel it, if desired. Cut off 12, very thin slices. Try to use a seedless cucumber, if possible. If the cucumber has large seeds, you will need to core it first. ", " Start building your sandwiches. Place four slices of bread, mayonnaise-side-up on the cutting board. Lay down the avocado slices first; try to distribute them evenly between the four sandwiches. Top each sandwich off with three cucumber three cucumber slices and a piece of salmon. If you hate salmon, you can leave it out.  ", " Finish your sandwiches. Top each sandwich with the remaining four slices of bread. Make sure that you are placing them mayonnaise-side-down. ", " Cut the sandwiches into fourths. Use a shape knife to cut each sandwich into quarter from corner-to-corner. This will give you 16 triangular tea sandwiches. If you want a nicer touch, you can cut the crusts off first, but you don't have to do this. ", " Serve the sandwiches. Arrange the sandwiches artistically on a plate. If you'd like to, you can garnish each one with an additional cucumber slice and a toothpick. "]}}, "How to Make Fairy Banana Sandwiches": {"description": "These are great for children's parties, for fussy eaters, and just for fun. They are also a useful way to use up overripe bananas. This recipe makes one sandwich, four quarters; double up etc. for more sandwiches for a party.", "content": {"Steps": [" Mash the banana.   ", " Mix the mashed banana with the honey, cinnamon and sultanas.  ", " Spread on a slice of bread.  ", " Add the other slice and cut into quarters to serve.  "]}}, "How to Make a Healthy Sandwich": {"description": "Sandwiches are a very popular and quick meal.  Whether you're grabbing a egg sandwich for breakfast or a turkey BLT at lunch, sandwiches are convenient, quick, and easy.  Unfortunately, not all sandwich breads or fillings are considered healthy.  Depending on what combination you choose, your sandwich could end up being high in calories, fat, sugar, sodium, and carbohydrates; however, if you choose lower-calorie, more nutritious breads, wraps and fillings, you can end up with a much more healthy sandwich.  Make small changes to your what you currently choose for your sandwiches to make a better meal.", "content": {"Choosing Nutritious Breads and Wraps": [" Choose 100% whole grain breads and rolls. Your basic sandwich is generally made with bread, on a roll or in a wrap.  If you're going to choose one of these items or something similar, boost the nutrition of your sandwich by choosing whole grains. Whole grains are a more nutrient-dense and healthier option compared to refined grains (like white bread).  They're less processed and contain all the parts of the grain.  Whole grains are typically much higher in fiber, minerals and even protein compared to refined grains. Breads high in fiber keep you full longer and therefore helps stop snacking. Snacking can result in overeating, which can contribute to obesity. If you're going to choose an item like bread, a wrap, English muffin, bagel, flatbread or deli thin, go for 100% whole grains. Look at the food label to make sure your item is 100% whole grain.  The ingredient label should list only 100% whole wheat or 100% whole grain flour.   ", " Try out a tortilla or a wrap. If you want to minimize your bread intake or just try something a little different, consider using a tortilla or a wrap.  You can wrap up your sandwich fillings for a quick meal. Both tortillas and wraps are flat and are not as high in carbohydrates or calories compared to many types of bread or rolls.  They're also a little bit less filling since they're just less food overall.  Again, choose 100% whole grain if you can.  Many corn tortillas are automatically whole grain as well. Be wary of what size wrap you buy.  Many come in 6\", 8\" or even 12\".  The bigger they are, the more likely it'll count as two servings of grains.  Stick to a 6\" wrap to minimize calories and carbohydrates.  ", " Use portion controlled deli thins. Many bread companies are jumping on the low calorie, low carbohydrate band wagon by developing \"deli or sandwich thins.\"  These are rolls or bread that are very thin, low in calories and carbohydrates. These deli thins are a great substitute for regular bread.  Many companies make them in 100% whole grain versions, have added fiber and protein.  Sandwich thins are also usually low in calorie as well.  Some may only have about 100 calories for both pieces.  This may be lower than other breads or rolls you've used in the past. Again, read the ingredient list to make sure that these products are truly 100% whole grain.  ", " Consider using lettuce instead of bread. Another way to add more nutrients (and fewer calories) to your sandwich is by using a lettuce wrap.  This is a fun twist on a classic sandwich that can also make it healthier. Lettuce, like other vegetables, is naturally low in calories. Many lettuces, especially dark greens, are also high in nutrients like fiber, vitamins and antioxidants.  You use a lettuce wrap just like you would a tortilla.  You can place your sandwich fillings and toppings in a large lettuce leaf and roll up. Not all lettuces are great for wraps, but collard greens, Swiss chard, mustard greens, kale, butter lettuce, or iceberg lettuce all have large leaves that can be rolled.  ", " Try making \"naked\" or open-faced sandwich. If you're overly concerned about calories or carbs, there is one additional method for serving your sandwich.  You can try a naked or open-faced sandwich instead of the traditional sandwich. A naked sandwich is one that doesn't have any bread or wrap.  It's just the filling. For example, you could do turkey and cheese roll ups stuffed with sliced raw vegetables. An open-faced sandwich is one where you only use a single slice of bread.  It cuts down on the calories and carbohydrates that you're consuming.  These are especially great for hot sandwiches. For example, you could make an open-faced tuna melt using only one slice of whole wheat bread.  "], "Picking Out Healthy Sandwich Fillings": [" Be mindful about your condiments. Most of the time you make a sandwich, you're most likely going to add some type of sauce, dressing or condiment.  It adds a little moisture and extra flavor. Be mindful of what types and how much of these condiments you add.  You could start with a fairly nutritious or low-calorie sandwich and send it overboard with high-calorie or high-fat condiments.  Try to choose condiments that are a little lower in calorie.  Try mustard, salsa, hot sauce, horseradish, relish, hummus, reduced fat mayonnaise with olive oil, or a drizzle of olive oil and vinegar. Make sure to measure out the appropriate portion size as well.  Many are only 1 teaspoon or tablespoon per serving.  ", " Choose low-sodium proteins. Many sandwich fillings contain some sort of protein.  Whether it's peanut butter and jelly or a ham and cheese, protein usually plays an important role; however, many protein options for sandwiches are overly high in sodium.  Sandwich fillings that are frequently high in sodium include nut butters, deli meat, bacon, sausage, salami, and frozen veggie patties. A diet high in sodium can increase your risk for high blood pressure and stroke.  Sticking to lower sodium items is better for your health.  Instead of traditional deli meat items, try the following lower sodium items:  roasted turkey or chicken breast, low-sodium deli meat (look for this on the label) or sliced grilled steak. Add about 3 – 4 oz of lean protein to your sandwich.  This is about one serving and will help keep you satisfied.  ", " Include a source of calcium-rich dairy. A nice slice of cheese really completes a sandwich.  Don't skip it in favor of lower calories.  Cheese can also add extra nutrients to your sandwich. Cheese is part of the dairy food group.  It contains a decent amount of calcium, Vitamin D and even has some protein.  Whether or not you choose fat-free, reduced fat or full fat cheese is up to you.  The calorie difference between these options is minimal.  Fat-free cheese is more processed than the full fat, so you may enjoy the flavor of the full-fat. Make sure to measure the appropriate serving of cheese.  Only add one slice or about 1-2 ounces per sandwich.  ", " Add in some vegetables. An easy way to make any sandwich or wrap a bit healthier is by adding vegetables.  They can add a whole host of beneficial nutrients to your meal.  Vegetables are great to add to sandwiches.  They can add flavor and crunch without  many added calories. In addition, vegetables are high in fiber, vitamins and antioxidants.  Adding just a few to your sandwich can really boost the overall nutritional content. You can add any type of veggie to your sandwich.  It can be as simple as lettuce and tomato or you could a little more fancy with caramelized onions and roasted red peppers. One serving of vegetables is about 1 cup or 2 cups of leafy greens.  You probably won't be able to get an entire serving on a sandwich, but aim for about 1/2 serving.  "], "Making More Nutritious Sandwiches and Wraps": [" Make a BALT sandwich. If you enjoy the traditional BLT, you may also love a BALT — or a BLT that has avocado.  It's a simple twist on a classic, but something you're bound to love. Start by toasting two pieces of 100% whole grain bread.  You can also use 100% whole wheat wrap as well. Spread 1 tablespoon of low-fat, olive oil based mayo on one side of the toast or wrap. Top with three to four slices of cooked bacon (it should be around 3 oz), two to three leaves of romaine lettuce and one to two thick slices of a ripe tomato. Last, top with 1/2 of a thinly sliced avocado.  Sprinkle with salt and pepper and either roll up your wrap or top with the remaining slice of bread.  ", " Try a Mediterranean veggie wrap. If you're looking for a vegetarian based wrap, try this Mediterranean wrap.  It's packed full of vegetables and makes for a great, high-fiber meal. Start with a 8\" 100% whole wheat wrap.  Spread on about 3 – 4 tablespoons of your favorite hummus.  Evenly spread the hummus over the entire wrap. Then top with 1/2 of an avocado that's been sliced very thinly.  Sprinkle with a little salt and pepper to taste. Then layer on:  1/4 cup of sliced roasted red peppers, 2 tablespoons of diced black olives, 1/4 cup of thinly sliced cucumbers and 2 tablespoons of crumbled feta cheese. Roll up your wrap tightly.  Slice in half and enjoy.  ", " Prepare spicy salmon lettuce cups. Cut down on your carbohydrate intake by making spicy salmon lettuce cups.  Using sweet, cup-shaped butter lettuce is a great substitute for bread in this recipe. Start by laying out two leaves of butter lettuce.  Try to use the bigger, outer leaves.  You can also use iceberg lettuce leaves as well. Fill each lettuce cup with about 1/3 cup of canned salmon (you can also use tuna in the recipe as well). Lightly drizzle about 1 teaspoon of your favorite hot sauce on top of each salmon cup.  You can add more if you like things more spicy. Also top each of your salmon cups with about 1/4 cup of pico de gallo, 1 teaspoon fresh cilantro chopped and salt and pepper to taste.  ", " Get classic with a tuna melt. A warm, cheesy tuna melt is a great sandwich.  Keep it portion controlled by using whole wheat English muffins instead of traditional sandwich bread. Start by separating the halves of a whole wheat English muffin.  Toast until your desired doneness. While your English muffin is toasting, mix together a 3.5 oz can of tuna with 2 tablespoons of low-fat mayo with olive oil, 1 tablespoon of relish, and salt and pepper to taste. Scoop half of the tuna salad onto one side of the English muffin.  Repeat with the remaining tuna salad and English muffin half. Top each half with 1 tablespoon of shredded cheddar cheese.  Place under the broiler for about 30 – 60 seconds or until the cheese melts.  "]}}, "How to Make a Cabbage and Onion Sandwich": {"description": "Sometimes you may be late for school or work and you don't have enough time to pack a lunch. This sandwich is not only really fast to make it also taste fantastic giving you a lunch you can enjoy on the hurry.", "content": {"Steps": [" Take two slices of bread. Place two bread slices ontop a plate and decide if you want the bread toasted or not.  ", " Slice cabbage and onion (long pattern). Using a sharp knife, cut the onion and cabbage into long thin slices then place them into a bowl and begin to mix them together. ", " Take a bread slice and put the chopped cabbage and onion in it. Place a generous amount of the onion and cabbage mixture onto a slice of bread. ", " Layer it with Mayonnaise. Spread some mayonnaise onto the sandwich bread evenly with a knife or spoon. ", " Cover it with another bread slice. Complete the sandwich by placing the other slice of bread ontop and pushing down on it gently to prevent the sandwich from falling apart when eating. ", " Serve. Cut the sandwich in two and place it onto a clean plate. Get yourself something to drink, you can have it with milk, coffee, juice, or another beverage. "]}}, "How to Make Tofu Sloppy Joes": {"description": "Sloppy joes are the kind of food that you never outgrow. But if you don’t eat meat, you may find yourself wistfully reminiscing over the the childhood joy of tucking into a messy sandwich while nibbling on a much less exciting snack. Tofu to the rescue! As with many other dishes, tofu can be used as a handy meat substitute that won’t force you to compromise when it comes to flavor. All you have to do is season it, cook it and throw it into your mom’s timeless sloppy joe recipe, and you’re guaranteed to feel like a kid again.", "content": {"Cooking the Tofu": [" Drain the tofu. Peel back the corner of the package and let the water the tofu comes packed in run out. Place the tofu on a plate and drape a paper towel or piece of cheesecloth over the top. Rest a heavy object, like a cookbook or metal saucepan, on top of the tofu block. This will help force out the excess moisture contained in the tofu.  Leave the tofu under constant compression for 20 to 30 minutes. Not squeezing the water out of the tofu first could result in watery sloppy joes.   ", " Dice the tofu into small cubes. Use a sharp knife to cut the block of tofu, slicing it first into long, narrow strips, then turning the strips and cutting them into pieces of the desired size. For smoother sloppy joes, dice or mince the tofu into pea-sized squares. If you prefer heartier sandwiches, you can leave the cubes slightly bigger.  You can also mash the tofu or crumble the tofu by breaking it apart with a fork.  Cutting the tofu into smaller pieces increases its surface area, which will help it cook faster.  ", " Chop up the onions, garlic and other vegetables. The onions and any other vegetables you choose to include (green pepper, mushrooms, fresh tomatoes, etc.) should be roughly the same size as the tofu. Mince the garlic extra fine to avoid biting into any oversized pieces.  In addition to regular white onion, you could use a head of scallions or shallots. Use a garlic press to grate the cloves into a thick paste.  ", " Heat oil in a large pan. Pour 2 tablespoons of vegetable oil to the pan and turn on the cooktop to medium-high heat. Tilt the pan to spread the oil around. The surface of the pan should be nice and hot before you begin cooking.  Butter can be used in place of oil on nonstick pans.  ", " Sear the onions and garlic. Toss your aromatic ingredients into the pan and begin searing them. This will unlock their pungent, zesty flavors, which will then be infused into the tofu. Cook the garlic and onions until they turn translucent and begin to brown slightly.  Caramelized aromatics will lend a noticeable richness to the mild tofu. Be careful not to cook the onions and garlic until they burn. This could ruin the flavor of the sloppy joes.  ", " Fry the tofu until it’s crispy. Add the tofu and scramble it together with the aromatics. Let the tofu cook for about 3-5 minutes before stirring again. As it fries, it will absorb the oil and take on a crisp, golden brown finish. Dust the tofu with a coating of rice flour or cornstarch before pan frying to give it an extra crunchy texture.  Tofu doesn’t change colors dramatically when cooked, so look for the edges to just begin turning golden brown and be careful not to get it too done.   ", " Season the tofu to taste. Sprinkle the tofu generously with salt, chili powder, onion powder and paprika. If you want, you can also add a pinch of black or white pepper. Sample a piece of the tofu to make sure it’s seasoned just right. Keep in mind that you’ll be increasing the saltiness later on when you add the canned tomatoes and other condiments. A couple shakes of an all-purpose spice blend, such as Creole or Greek seasoning, is a good way to enhance the flavor of tofu.  "], "Making the Sloppy Joe Mixture": [" Mix in the tomatoes, ketchup and mustard. Open one can of diced tomatoes and stir them in with the tofu. Then, add 1-1½ cups of ketchup and 2 tablespoons of dijon mustard. Stir the ingredients until they’re thoroughly blended.  Substitute a can of tomato puree for ketchup if you prefer tangier sloppy joes.   ", " Make your own additions. At this point, you can incorporate a few other delicious extras to put your own personal stamp on the recipe. Diced green pepper, white mushrooms and chopped nuts are all vegetarian-friendly options that can impart welcome nutrients. You can also tinker with the flavor of the sauce by adding a dash of soy sauce, apple cider vinegar, sugar or fresh parsley.  Turn up the heat with half a can of pickled jalapeño or serrano peppers.  The ketchup will contribute to the sweetness of the sauce, so don’t overdo it with the sugar.  ", " Simmer the mixture for 10-15 minutes. Turn the cooktop down to medium heat so that the sauce gently bubbles around the edges of the pan. Leave the pan uncovered, stirring occasionally. This will allow it to thicken as it simmers.  For a thicker consistency, let the sloppy joe mix simmer for an additional 5-10 minutes. The longer you simmer the sloppy joe mix, the more time the flavors will have to set up and the tastier they’ll be.   "], "Serving the Sloppy Joes": [" Serve the sloppy joes hot on hamburger buns. Scoop the sloppy joe mix with a serving spoon or ladle. Pile it onto toasted and buttered whole wheat hamburger buns, or make them the way grandma used to with two slices of plain white sandwich bread. Grab hold with both hands and take a big, messy bite!  Wrap hamburger buns in a paper towel and microwave them for a few seconds, or butter them and stick them in the oven until the edges begin to brown.  Don’t forget to soak up the mess that’s fallen out onto your plate with your bun!  ", " Enjoy sloppy joe mix any way you please. Hamburger buns are the traditional vehicle for sloppy joes, but there's no rules for how to eat your messy masterpiece. The tofu mix can make a filling breakfast when piled onto a slice of toast and topped with an egg, and will be positively delicious stuffed inside a warm tortilla with shredded lettuce, cheese, salsa and jalapenos. Just because it's simple doesn't mean it has to be boring! Try serving your tofu sloppy joes in lettuce wraps to cut down on fat and calories even more.  Use leftover mix to make quick and easy vegetarian nachos.   ", " Heat up a few traditional sides. No sloppy joe is complete without a heaping mound of mac and cheese or pillowy tater tots. Those seeking a lighter option can go with a steamed seasonal veggies, sweet potato fries or fruit cocktail. When you comes to comfort foods as simple, healthy and delicious as sloppy joes, it’s hard to go wrong.  Balance out the hot sloppy joes with a cool pasta salad, mixed green salad or homemade coleslaw. Pair tofu sloppy joes with your family’s favorite side dishes or companion recipes.  ", " Store leftovers in the refrigerator. Uneaten sloppy joe mix can be placed in an airtight container and kept in the refrigerator for up to a week. To reheat, simply pop the cold mix in the microwave for 45 seconds to a minute at a time, stirring between heatings. Sloppy joes are equally good as an afternoon snack for the kids or an easy dinner for one when the pantry is empty.  Sloppy joes are often even better a day or two later, after the flavors of the individual ingredients have had more time to mingle. Heat hamburger buns or bread separately. Microwaving them for too long can make them tough and chewy.  "]}}, "How to Make Cheesecake Sandwiches": {"description": "A cheesecake sandwich can be either a delicious snack that holds you over until the next mealtime or a rich dessert, depending on how much effort you want to put into making it. The healthiest version is the one using graham crackers and cream cheese, while the other recipes here will amp up both the flavor and the calories!", "content": {"Graham Cracker Cheesecake Sandwich": [" Put the graham cracker halves on the plate. Make sure that they are separated on the line.  ", " Spread the cream cheese on one cracker and spread the jam on the other.  ", " Put both crackers together. Press it together firmly. ", " Serve it and enjoy!  "], "Grilled Strawberry Cheesecake Sandwich": [" Place the slices of sandwich bread on a work surface.  ", " Spread the cream cheese on 2 bread slices.  ", " Spread the strawberry jam or preserves on the other 2 slices.  ", " Press the 2 slices together. Press one cream cheese to one strawberry jam/preserves slice. ", " Turn on the overhead grill (or broiler).  ", " Spread butter over the top of each sandwich.  ", " Put the buttered side up and grill for about 3 to 4 minutes, or until golden brown.  ", " Remove and butter the other side. Slip back under the grill or broiler for about the same time. ", " Remove from the heat when golden brown both sides.  ", " Plate up and serve. Allow the diner to cut the sandwich; the cheese will ooze a little. Be careful, as both cheese and jam or preserves will be hot. "], "Salted Caramel Cheesecake Sandwich": [" Preheat the oven to 150ºF/300ºC. Line a slice pan with parchment or baking paper. ", " Arrange half of the lattice biscuits on the base of the pan. The sugared side needs to face downward. ", " Add the cream cheese, sugar, syrup and vanilla to a mixing bowl. Mix until smooth and all the sugar has dissolved. You can either use an electric mixture or do this by hand. ", " Add the eggs. Whisk in to combine thoroughly. ", " Pour or spoon the creamy mixture across the layer of lattice biscuits. Tap the side to remove any trapped air bubbles. ", " Finish with another layer of the remaining lattice biscuits. This time, face the sugar side upwards. ", " Place in the preheated oven. Bake for 50 minutes or until the cheesecake portion has set. ", " Remove from the oven. Let sit for about 10 minutes to slightly cool. ", " Place in the refrigerator to chill. It should be refrigerated for at least one hour but can remain in there longer, as needed. ", " Serve. Either place on the table for self-service or pre-slice into separate sandwich portions and plate up individually. Serve with whipped cream and/or fresh berries/fruit. "]}}, "How to Make Matzo Brie or Fried Matzo": {"description": "Do you want to learn how to make a delicious meal that your whole family will love? If you do, read on!", "content": {"Steps": [" Crack eggs in a bowl and beat eggs with whisk.   ", " Pour water in the bowl and mix.  ", " Add onion powder, garlic powder, salt and parsley flakes. Mix well. ", " Break the matzos into the bowl. Try breaking them into 9 pieces - in thirds one way, and then in thirds the other. ", " With a fork, mix the matzos by starting at the bottom and flipping the matzos upside down.  ", " Do this four times, once every 2 minutes, or until the matzos are well coated with egg mixture.  ", " Put the pan on the stove over high heat and melt the butter.  ", " Add the matzo mixture to the pan and cook, stirring frequently, until well cooked.  ", " Remove pan from heat, add cheese, stir the mixture and serve on a plate immediately (the heat from the fried matzos will melt the cheese).  ", " Drizzle maple syrup to taste.  "]}}, "How to Create Cheap, Healthy Delicious Meals": {"description": "Are you spending more on food than you can afford? Do you always end up tossing things away? Well you're not alone. This article will show you how to create cheap meals and to reduce wastage to save your money.", "content": {"Steps": [" Start evaluating how much you were paying for food. Include what you spend at the grocery store or super market, restaurants, canteens, coffee shops etc. Unless you include everything you spend on food, you won't, overall, make any saving. Doing so will let you know how much you are currently paying and whether you are within your desired budget.  ", " Always buy in bulk where appropriate. If there's a staple food such as rice, flour, potatoes etc, that you can buy cheaper in bulk, do so. Bulk buy items must be something you will use up before they can perish. If you're one of those smart shoppers, you would've paid much attention to the regular individual prices or stuffs that comes in bulks. Check the prices and buy bulk, if it's cheaper. To figure out the cost the divide the cost of the article by its size or volume. For example:  Divide $8 by 12 ounces to figure out the cost of a can of coffee.  The cost per ounce will tell you what the actual price is. Compare this with the bulk price per ounce. Take care to ensure your household will consume the bulk food within its use by or sell by date, otherwise this can compound the problem and create more waste. ", " Remember, meat can be expensive. Consider only buying meat once every 9 or 10th day and make it last. Meat can be purchased in bulk and then portioned up into smaller serves, wrapped in cling film and frozen for future use. It's best to do this before freezing the meat to ensure its not frozen and then refrozen (which may create food poisoning conditions) ", " Think about any kinds of creative, healthy, delicious but cheap foods that could be made in a large portions. Very often most recipes are better if made in a large quantity as opposed to cooking for one.  There's a lot of food that can be made in large portions, be made cheaply and can last for a couple days in the fridge for a future lunch or leftover dinner, or put into a freezer safe container for a future time. Some examples are: Chilli Fried rice (which stores well in the refrigerator but does not freeze well) Homemade soups, casseroles and stews. Stir-fry  ", " Plan your purchases. If you buy food that you could sometimes have some extras left over for next time, consider how you can use those for the next days meal. Good ideas would be: Tomato soup with basil and a garlic bread as a side. Vegetables with tips and milk Pasta with tomato sauce and water  ", " Don't buy food you usually ended up throwing away anyway. If you do buy some food but usually ended up at least a good solid half of it away then don't think about buying that as you'll lose valuable money that goes out the drain. ", " Share your purchases in a food co-op . If you may only consume, for example, half a block of cheese before it goes moldy, shop and share the bill with someone who can use the other half. ", " Try to only spend $50 or the equivalent or less a week on food regardless of the number of people you need to feed. If you spend too much money on food a week you'll risk getting too much that you could use. ", " Quit any of the junk food that you might be buying. That includes any soda, chips, and everything else that comes along with that category. A lot of the times they can actually be a lot more expensive than healthy food in the long run. ", " Remember to use coupons or in-store specials. Those things can actually help you save money. Granted, you'll only save bits here and there but you can save up to $20 or more easily enough if you take advantage of them. ", " After cooking your meals in a large portion, pack them in a small single portion containers. Doing so will help you make sure you don't don't overuse more than what you should. ", " Plan your meals out throughout the day instead of eating large meals. This will help you not feeling hungry throughout the day and at the same time if you incorporate this with the single portion step, it will help you not eat more than you really should. ", " During Christmas, birthdays or Thanksgiving you might be invited to your family or friend's place for dinner. This is a good opportunity to catch up with them and possibly get free food out of the entire thing so don't feel bad to eat and save some money out of this opportunity if arises. "]}}, "How to Make Breadless Sandwiches": {"description": "There are lots of tasty breadless sandwich recipes. If you are looking to reduce or eliminate bread in your diet, you may be interested in replacements for bread that will allow you to still enjoy sandwiches. You can eliminate refined carbohydrates and get more vegetables in your diet by using leafy greens and other vegetables.Instead of bread, try using butter lettuce, swiss chard, kale, collard greens, cabbage, cucumbers, jicama and  portobello mushroom caps. Using these ingredients instead of bread, you can really boast the nutritional value of your breakfast, lunch or dinner.", "content": {"Making a Basic Breadless Sandwich": [" Try wrapping your sandwich fillings in butter lettuce. Butter lettuce is a great choice for a breadless sandwich and requires little preparation. Choose a piece that doesn’t have too many holes, give it a rinse and then dry it in a salad spinner or with a clean towel. Throw your sandwich ingredients in the middle and then wrap it up.   ", " Pick swiss chard for your breadless sandwich. You can get green swiss chard or a rainbow swiss chard, which will add beautiful colors like yellow, orange and pink to your sandwich. Show off your healthy sandwich by choosing rainbow swiss chard. It also tastes great and, like lettuce, can be used raw. Throw your ingredients inside, wrap and enjoy.  ", " Choose a leafy green for your breadless sandwich. If you choose a sturdy green such as collards, kale or cabbage, it is best to blanch it first. Throw it in hot water for thirty seconds and then dunk it in cold water. You want to choose a leaf that looks fairly intact and doesn’t have too many holes.  ", " Swap grilled portobello mushrooms for hamburger buns. The next time you grill up a burger, try using portobello mushrooms instead of the bun. You will boost your fiber and eliminate the simple carbohydrates. Chop off the stems of the portobello mushrooms, wash and then throw them on the grill with your burgers. You will need two mushrooms per burger.  ", " Use jicama instead of bread. If you are trying to cut carbohydrates from your sandwich, try using slices of jicama instead of bread. Jicama tastes like a potato but is slightly sweeter and has more water. Wash and then peel the jicama. Slice it into quarter inch slices and replace each piece of bread with one slice of jicama.  If you are making tacos, you could use Jicama instead of the tacos. Instead of slicing the jicama, scoop out the middle and then throw the taco ingredients in the middle.   ", " Slice up a cucumber. Wash, peel and slice up a cucumber. You should cut the cucumber into quarter inch slices. Replace each piece of bread with one piece of cucumber. Since there is a fairly small surface area, you may need to make a couple cucumber sandwiches for each of the bread sandwiches you had planned to make.  ", " Choose your protein wisely. Decide which protein you want to use for your breadless sandwich and then prepare it. If you use cooked, shredded chicken breast , you can go right ahead and throw it on your breadless wrap. If you choose a can of tuna or salmon, you will need to drain it and then mix it with a teaspoon of mayonnaise, salt and pepper. Beans will need to be drained, and then can be added directly to the wrap.  ", " Pick your condiments. Remember that most substitutes for bread will absorb less moisture, so you may need to adjust your usual condiment choices. For instance, you may want to avoid condiments with a lot of water content, since they may make a bit of a mess. Choose thicker condiments like tahini, as opposed to watery condiments like greek dressing.  ", " Assemble your breadless sandwich. You will want to be a bit conservative in terms of the amount of ingredients you throw inside, which should be proportional to the size of the leaf. Start by throwing in your protein. Next, choose a crunchy vegetable or seed such as shredded carrots, slivered almonds, sprouts, cucumber sticks or shredded carrots. Then, you will want something creamy such as yogurt or tahini. Finally, throw in something to boost the flavor a bit such as mustard or hot sauce. Finally, roll up the wrap like you would a burrito. Roll it horizontally, moving away from you.  "], "Grilling Portabella and Halloumi Burgers": [" Grill the portabella mushrooms. You can either grill or broil the mushrooms. To grill, preheat the grill to 450 °F (232 °C) (232 Celsius). Alternately, you can preheat your oven broiler and put the rack on the top third of the oven. While you are waiting for the oven or grill to heat up, remove the steps of the portabella mushrooms. Brush the mushrooms with the olive oil and sprinkle a bit of sea salt on top of them. Grill or broil them for four or five minutes per side.  ", " Grill the halloumi. Slice the halloumi into desirable, relatively thin slices (e.g., half an inch thick). Grill it for two minutes per side on high heat. The halloumi should be soft and emit an aromatic, salty smell. ", " Assemble the sandwich. The portabella mushrooms will be your bun. On top of one portabello mushroom cap, place the grilled Halloumi cheese, slice of tomato and basil leaves. Add the balsamic vinegar and the freshly ground pepper. Then, place the other mushroom cap on top. Repeat this process for the other burger.  "], "Making Tuna Salad Sandwiches with Cucumbers": [" Prepare the cucumbers. You have two options for preparing the cucumbers, which will be used instead of the bread for this tuna sandwich. If you are making appetizer sandwiches, you should simply peel and then slice the cucumber horizontally, into quarter inch slices. This option will give you a greater number of smaller tuna sandwiches. Alternately, if you want to make a sub style tuna sandwich, you can halve the cucumbers lengthwise. Then, scoop out the seeds and flesh to make little boats, where you will put the tuna mix. Poke the inside a bit with a fork, so that the cucumber absorbs more of the flavor.  ", " Mix the vinaigrette. In a medium sized bowl, whisk the mustard, vinegar, salt and black pepper. Then, slowly whisk in the olive oil. Finally, pour the vinaigrette onto the cucumber.  ", " Make the tuna filling. Start by draining the tuna fish. Rinse it well with cold water, and then put it aside. In a small bowl, whisk the mayonnaise, yogurt, dill, celery leaves, scallions, celery, lemon zest, quarter teaspoon of salt and a pinch of black pepper. Throw the tuna into the bowl and then mix to combine all ingredients. ", " Put together the sandwiches. If you are making the appetizer version, place a dollop of tuna mix and then a few sprouts on top of each slice of cucumber. Then, add another slice on top for a cute little sandwich. If you are making the sub style tuna sandwich, fill the cucumber boats with the tuna mixture and then add the sprouts. Add the other half of the cucumber on top. Eat and enjoy! "], "null": [" Prepare the lettuce. Place the leaf of lettuce so that the rib is horizontal. If you do not have a big enough leaf, you can always glue two pieces of butter lettuce together with some hummus. Simply place a thin layer of hummus on the edge of one piece of lettuce and then place the second piece of lettuce overtop and press down. ", " Spread the hummus. Start by evenly spreading the hummus over the bottom third of the lettuce leaf. You want to spread it in an even layer, rather than just a big dollop. You should have a two inch border around the leaf. ", " Assemble the wrap. Place the tofu or cooked, sliced chicken breast in the middle of the wrap. Then, add the sprouts. Evenly distribute the za-atar overtop all of the ingredients. Then, roll up your wrap. Start by folding in the sides to the center. Then, roll it up horizontally, rolling it up away from you as if you were making a burrito. You can either enjoy it right away or wrap it in plastic wrap and refrigerate it. It will be good for twenty four hours.  "], "Making a Ham and Cheese Sandwich Without Bread": [" Peel and slice the jicama. Using a vegetable peeler or a sharp knife, peel the jicama. Like you are peeling a potato, make sure you get off all of the skin. Then, slice the jicama into thin, approximately one eight inch slices.  ", " Mix the sauce. In a small bowl, stir the sour cream, mustard, horseradish, chives, and a pinch of freshly ground black pepper. Add salt to taste.  ", " Assemble the ham and cheese sandwiches. Start by laying out the slices of jicama. On each slice, spread a layer of sauce. Then, add a quarter of the ham, cheese and arugula to each of the four sandwiches. Top each sandwich with a jicama slice. Cut each sandwich in half and serve with a pickle on the side.  "], "Making a Swiss Chard Wrap with Pesto": [" Prepare the swiss chard leaves. Wash the swiss chard leaves and pat them dry. Then, cut off the stem. You will need to cut it off a little bit into the actual leaf as well, approximately half an inch up from the bottom of the leaf. ", " Blend the pesto. In a small food processor, throw in all of the pesto ingredients. This should include the basil, walnuts, olive oil, lemon juice, garlic, salt and pepper to taste. Mix it all together until you get a nice smooth pesto. ", " Assemble the wraps. Add a couple tablespoons of pesto to each swiss chard leaf. Then, throw in the rest of the ingredients. Fold in the sides of the swiss chard leaf. Finally, roll it up like a burrito. Roll it away from your body. Enjoy it right away or wrap it with plastic wrap and put it in the fridge.  ", " Finished.  "]}}, "How to Make Jam Heart Sandwiches": {"description": "Jam (or preserves) heart sandwiches are simple to make, yet look striking on any party table. They're great for Valentine's Day, for children's parties, for picnics and for afternoon tea parties. They also make a fun snack any time.", "content": {"All Hearts Jam Sandwich": [" Cut out the large hearts first. For each sandwich, you'll need 2 slices of bread cut into large heart shapes. Repeat for as many sandwiches as you need.  ", " Cut out the inner heart. Use the smaller heart cutter to cut out a heart shape dead center of the large heart. Only do piece per sandwich though, as only the top piece needs the heart hole. ", " Spread a generous serving of jam or preserves across the bottom heart. Repeat for each sandwich you're making. ", " Spread a thin layer of cream cheese across the top heart. Repeat for each sandwich you're making. ", " Carefully place the top heart onto the jam heart layer, cream cheese side facing downward. Press together gently but avoid squeezing the cream cheese out. ", " Arrange the jam heart sandwiches on a plate. Serve immediately or keep covered and chilled in the refrigerator until needed. "], "Fairy Heart Jam Sandwiches": [" Prepare the bread slices in exactly the same way as for the \"All hearts jam sandwich\" above.  ", " Spread a generous layer of jam or preserves across the base layer.  ", " Place the heart hole layer on top.  ", " Fill the hole with sprinkles. Be generous! This is the fairy's heart. ", " Arrange on a serving plate. Serve immediately or keep covered and chilled in the refrigerator until needed. "], "Toasted Heart Jam Sandwich": [" Toast the bread slices.  ", " Spread one layer of toast thickly with delicious jam or preserves.  ", " Press a heart shape out of the middle of the other piece of toast.  ", " Quickly and gently place the toast with a heart hole in the middle of it on top of the jam toast layer.  ", " Place on a single serving plate. Serve immediately. "]}}, "How to Make a Capsicum Sandwich": {"description": "Nothing spices up the morning better than a capsicum sandwich. This palate pleasing dish is quick and easy to make and makes for a full meal when served with sauces, fries and dips.", "content": {"Steps": [" Fry the sliced onion with the mustard oil until it is slightly browned. You can opt for any other type of cooking oil if you wish.  ", " Add the ginger garlic paste to it and fry for about 2 minutes.  ", " Add the sliced capsicum and fry for another 2 minutes.  ", " Add the tomato, salt, chili powder (or cayenne pepper) and cumin powder and fry for 3 minutes. However, if you want to keep it simple you can avoid adding the Tomato or you can even experiment with other veggies of your choice. ", " Lower the temperature and cover the pan. Cook for another 2 minutes. ", " Switch off the stove after the spices have mixed in and cooked well. The mixture should absorb the flavour of the spices. ", " Toast the bread slices slightly.  ", " Add a cheese slice. Choose your favourite cheese and place a slice over either one of the bread slices or both if you wish. ", " Spread the capsicum spice mix over it and make a sandwich. Serve it with fries, soups, sauces or dips and enjoy! ", " Finished.  "]}}, "How to Make a Spaghetti Sandwich": {"description": "A spaghetti sandwich makes the perfect snack or lunch and satisfies the taste buds really well. Properly toasted, and sprinkled with a pinch of garlic powder, this sandwich is sure to suit almost anybody.", "content": {"Steps": [" Melt the butter and garlic powder. In a large frying pan or skillet, melt together the butter and garlic powder until fully melted and the butter starts to bubble slightly.  ", " Spread the butter over the bread. Using a pastry brush, dip the brush into the melted butter mixture and spread it all over the two slices of bread. ", " Mix the spaghetti sauce with the spaghetti. In a medium-sized bowl, combine the spaghetti sauce with the spaghetti noodles. Mix with a wooden spoon until properly combined. ", " Make the sandwiches. Sprinkle mozzarella cheese over one of the slices of bread Carefully add the spaghetti noodles on top. Close the sandwich with the other slice of bread. ", " Grill the sandwich. Preheat the stove top on to medium heat. Lay the same frying pan or skillet you used to melt the butter. Place the spaghetti sandwich on the pan and have it fry for until the bread is crisped on both sides, usually taking about 5 minutes for each side. ", " Serve. Cut the sandwich into two slices and serve them on a serving plate. Heat up any extra spaghetti sauce to dip the sandwich in. Sprinkle extra mozzarella cheese if desired. ", " Enjoy!  "]}}, "How to Choose Energizing Midday Snacks": {"description": "There are a large variety of energizing snacks you could choose to power through the middle of your day.  Vegetables like celery, spinach, and hummus make good snacks.  Sweet fruits like oranges, apples, and pineapples will give you a needed boost and soothe your sweet tooth.  You could also choose a drink like a fruit smoothie, an herbal tea, or coconut water to increase your midday energy levels.", "content": {"Having a Snack of Fruit": [" Eat some melon. Melons of all sorts make wonderful energizing snacks toward the middle of the day.  You could try watermelon, honeydew melon, or cantaloupe.  Mix and match diced melons in a tasty fruit salad.   ", " Eat some peanut butter banana bites. Peanut butter banana bites are a wonderful bite-sized snack that take only seconds to make.  Just slice a banana into somewhat thick slices.  Scoop a teaspoon or so of peanut butter onto the banana slices.  Use your hands or a fork to eat the peanut butter banana bites.  ", " Eat an apple. Apples provide ATP, a kind of fuel that your cells use to make energy.  Eating an apple will keep your energy revving through the midday.  If you wish, sprinkle a bit of nutmeg and/or cinnamon on your apple slices before eating them.  ", " Try oranges. Oranges are a juicy fruit containing vitamin C, potassium, and folate (a B-complex vitamin).  These nutrients and vitamins will keep your energy levels high.  ", " Snack on some pineapple. Pineapple contains manganese, a powerful antioxidant and an important element in the operation of the nervous system.  Pineapple is great on its own, but you could also work it into a smoothie for a refreshing snack.  "], "Snacking on Veggies": [" Try some spiced chickpea nuts. Spiced chickpea nuts are actually not nuts at all.  Rather, they’re just roasted chickpeas, often seasoned with garlic or red pepper spice.  You can buy prepackaged spiced chickpea nuts in many grocery stores, or make them yourself at home.  To make the spiced chickpea nuts at home, just drain a can of chickpeas and lay them on a baking tray.  Sprinkle with olive oil, salt, and cayenne pepper.  Bake in the oven at 450 degrees Fahrenheit (232 degrees Celsius) for 15 minutes.  ", " Make some ants on a log. Ants on a log is a quick snack consisting of celery sticks with peanut butter spread on them, then sprinkled with raisins.  Instead of raisins, you could use dried cranberries or dried cherries, and instead of peanut butter, try almond butter or cashew butter.  Find a combo that you like to customize your energizing midday snack of ants on a log.  ", " Have some pureed vegetable soup. Pureed veggie soup – as opposed to a more traditional veggie soup consisting of vegetables floating about in a vegetable broth – allows your body to more easily absorb the vegetables’ nutrients.  Warm a cup of purred vegetable soup up for quick and energizing midday snack.  You could just pour some regular veggie soup in a blender and blend it until smooth, or snack on a soup that is already pureed, such as butternut squash soup or tomato soup.  ", " Eat spinach. Spinach contains iron, a crucial ingredient in your body’s energy production.  A spinach salad or a spinach smoothie might be just the snack you need to stay energized through the middle of the day.  ", " Try a cucumber sandwich. A cucumber sandwich typically contains three ingredients: bread, mayo, and cucumbers.  Slice a cucumber into thin slices.  Slather mayo on two slices of whole wheat bread.  Lay your cucumbers in an even layer on one slice of bread, then place the other slice, mayo side down, on top.  A cucumber sandwich has substantial amounts of B5, an energizing vitamin.  Instead of regular bread, you could use a whole wheat pita pocket.  ", " Eat edamame. Edamame are soy beans, a rich source of both protein and vitamin B.  Pop some edamame seasoned with a bit of garlic, butter, and salt in the microwave for a quick snack.  ", " Try hummus. Hummus is a kind of blended chickpea mash.  It makes a great dip for whole grain crackers, which provide complex carbohydrates to keep you fueled through the middle of the afternoon and beyond.  Baby carrots, carrot chips, celery sticks, red pepper slices, or raw broccoli are great alternatives if you don’t have crackers on hand.  There are many varieties of hummus available such as red pepper hummus and garlic hummus.  Choose one that appeals to you.  "], "Enjoying Protein Snacks": [" Snack on a protein bar. Protein bars are available in many flavors, including cherry, strawberry, and chocolate.  Choose bars with at least five grams of protein and less than 15 grams of sugar.  Many protein bars are high-calorie; aim to keep your portions to less than 100 calories.  If you have a protein bar that has more than 100 calories, eat only half and save the rest for later.  ", " Have some eggs. Eggs are a good source of vitamin B, which turns food into energy.  You could try scrambled eggs, hardboiled eggs, or an over-easy egg on toast.  For a lower cholesterol option, eat the egg whites only, not the yolk.  ", " Try beans. Beans contain magnesium and carbs, both of which are great for providing energy.  You could try black beans, pinto beans, or baked beans with rice for a quick and energizing midday snack.  "], "Choosing Grains for Midday Energy": [" Eat brown rice. Rice contains manganese, an important component in moving the energy stored in carbohydrates and protein into your body.  If you enjoy a bit of spice in your snacks, a simple snack of kimchi and brown rice is perfect for a midday energy boost.  A more elaborate snack might include brown rice with sweet potatoes, nuts, and raisins for an more energizing midday snack.  White rice contains more sugar, and could cause your energy levels to crash after providing an initial boost.  Stick to brown rice.  ", " Try oatmeal. Oatmeal is a kind of grain which, when prepared with water or milk, turns into a delicious gruel perfect for cold winter days.  Top your oatmeal with fruit, nuts, or syrup for a tasty snack.  ", " Have some quinoa. Quinoa is a kind of grain, not unlike rice or couscous.  But quinoa has higher protein levels than any other grain, and therefore makes a great midday snack.  Try using quinoa just as you would rice, topping it with a bit of tofu and curry or beans.  ", " Have some trail mix. Trail mix is a combination of dried fruits, nuts, and seeds.  The natural sugars in dried fruits – raisins, banana chips, and dried strawberries, for instance – provide a great source of energy.  And nuts increase protein levels.  Don’t eat more than a handful, though, as carb levels that rise too quickly can cause sleepiness, which would defeat the purpose of eating trail mix as an energizing midday snack.  Throw some roasted pumpkin seeds into your trail mix for an extra dose of energizing calcium, iron, and protein.  Flax seeds are also a great addition to trail mix.  ", " Eat yogurt and granola. Granola has lots of protein to keep your energy high through the middle of the day.  Paired with plain, low-fat yogurt, your midday snack will be irresistibly delicious, as well as energizing.  Check the label on your granola to ensure it does not have added sugar.  You could choose to sprinkle your yogurt with diced apples or blueberries if you wish to sweeten it a bit.  "], "Drinking Your Snack": [" Drink coconut water. Coconut water contains energizing electrolytes.  And like regular water, it has hydrating properties that will keep you feeling fresh.  The best way to obtain coconut water is by simply buying it prepackaged, but if you’re more adventurous you could get your own coconut and crack it open inside a pan or large bowl to collect the water within.  Avoid coconut water containing added sugar.  ", " Try an herbal tea. Herbal teas are those not prepared with tea leaves, but instead with infusions of spices, fruits, and herbs.  You might, for instance, enjoy ginger tea, ginseng tea, hibiscus tea, or elderberry tea.  Herbal teas do not contain caffeine, but can improve blood flow through your veins, thus providing invigoration.  ", " Make a smoothie. A smoothie is a drink that contains solid foods blended together until totally dissolved.  For instance, you might enjoy a banana chocolate smoothie as your energizing midday snack.  Just drop one banana, two tablespoons unsweetened cocoa powder, ½ cup silken tofu, and ½ cup milk into a blender.  Blend on high for thirty seconds.  If you find the consistency is too thick, add ¼ cup water, then mix again. For a colder smoothie, add three ice cubes to the mix.  "]}}, "How to Make a Fairybread Sandwich": {"description": "This sweet little treat is both tasty and very simple to make! Perfect for satisfying a sweet-tooth craving, or bringing a \"Fairy Themed\" birthday party to life! You are sure to love the simplicity of making the \"Fairy Bread Sandwiches\"", "content": {"Steps": [" Gather all ingredients and necessary equipment. Make sure to wash your hands, too.  ", " Take a slice of bread from the packet and place on a plate. If bread is not pre-cut, cut a slice or ask for help from an adult. ", " Spread! Grab your block of butter or tub of margarine, and use the butter knife to spread a reasonably sized amount of spread onto the slice/s of bread. (Note: the recipe tends to taste better with more spread, rather than less.) ", " Sprinkle some colour onto this bread and butter! If your edible sprinkles come equip with a \"safety\" dispenser, you can simply shake the desired amount of sprinkles onto the bread. If no safety dispenser is available, use a spoon to scoop out the sprinkles and then carefully apply these rainbow fragments onto the bread! ", " Complete the sandwich. Take a second slice of bread, and simply place the second slice onto the first. Pressing the two slices together with little pressure, may prevent a fairy mess. You may opt for simply a slice of fairy bread. Optioning for a \"non-complete\" sandwich allows the sprinkles to show, preferable for children's birthday parties.  ", " Make the sandwiches small and dainty! Using a knife, cut the sandwich or slice into fours. Making lots of fairy-sandwiches and placing onto a tray is perfect colorful treat for a birthday party!  ", " Finished.  "]}}, "How to Cook a Binghamton Spiedie": {"description": "A Spiedie is a sandwich made with marinated chicken, pork, or lamb that’s chopped up into squares, skewered and cooked on the grill. Spiedies are fairly unique to the upstate New York area; mostly predominate in and around the Binghamton area. The term Spiedie is derived of the Italian word “spiedo” which means “spit”, which was the skewer type tool it was cooked on. The common story when it comes to the origin of the Spiedie is that the idea came from Italian immigrants during the 1920s.  Agustino Lacovelli and Peter Sharak are credited with its creation when they started serving it to the public. Early Spiedies were only made from lamb, but with increasing prices over the years, chicken has become the most popular choice of meat.", "content": {"Steps": [" Decide on what type of meat that is going to be used.  The most popular choices are chicken breast and pork. Lamb is another option people can use. When buying the meat make sure it is boneless, it makes it easier to cut up into manageable sizes.   ", " Chop your meat up into about 1 inch (2.5 cm) squares.  ", " Choose your type of marinating sauce, homemade or store bought.  In the Binghamton areas there are many different types of marinating sauces at local grocery stores made specifically for Spiedies. If you have a personal recipe for marinating sauce, using that will make your Spiedie unique.  ", " Place your marinating sauce in a container for it to be stored in.  If you are only going to marinate it overnight, using a heavy duty zip lock bag would be fine. For longer than 24hrs, it is best to use a Tupperware bowl, it is more secure and prevents the risk of leaking.  ", " Take your chopped up Spiedies and place them into the marinating sauce and then place them in your refrigerator.  The length of time it sits and marinates can very. Some people let it sit for only 24hrs and other for over a week. It all depends on your preference and the amount of time you have.  ", " Take your marinated Spiedies and put them on a skewer.  Adding vegetables such as mushrooms, chopped green and red peppers, etc. in between each individual Spiedie gives it more flavors.  ", " Place the Skewered Spiedies on the grill. Leave the handle hanging over the edge, allowing easy rotation. If you are a person who doesn't like charred grill lines, placing tinfoil on the grill and cooking on that helps reduce the char lines. Cooking on tinfoil helps keep moisture on the Spiedies by preventing the sauce from dripping in between the grill.  ", " Let the Spiedies cook until they are cooked all the way through.  Rotate the Spiedies every so often to prevent burning and even cooking. When cooking the Spiedies, make sure you pay attention, if they end up over cooked, they have the tendency to dry out.  ", " After they are done cooking, take them off the grill and place the Spiedies on a separate plate.  When taking the Spiedie of the skewer, a good way to do it is using the bread or bun to grip the Spiedie as you pull the skewer out.  "]}}, "How to Make a Baguette Roll Boat": {"description": "This is a fun way to make food interesting for kids, whether it's a party or at the dinner table. Turning a baguette style roll into a mini boat will intrigue any fussy eater.", "content": {"Making the Mast and Sail": [" Draw triangle sail shapes on plain paper. The triangle should be about half the size of the baguette roll, to make it look balanced.  ", " Cut out the triangle sails. Decorate if wished––this can be as simple as writing on the child's name or sticking a fun sticker onto it. ", " Poke the cocktail stick or toothpick through the sail's \"back\". Do this by threading it through two holes in the paper. ", " Adjust the sail as needed. The sail will need to sit well above the filling when placed in it. "], "Making the Roll Boat": [" Slice the baguette roll in half.  ", " Scoop out some of the bread inside, to make room for the filling.  ", " Butter the roll if doing so.  ", " Spoon in filling. Don't overfill, it will fall out if you mound it up too much. ", " Stick the mast into the filling. You now have a boat set to sail across the dinner table! "]}}, "How to Make Green Pea and Mint Sandwiches": {"description": "Spice up the sandwich filling with this amazing variation. Peas are both nutritious and filling. What's more, in the combination they are exceptionally tasty.", "content": {"Steps": [" Mash the cooked peas into a paste.   ", " Add the chopped mint, sugar, and vinegar or lemon juice. Mix through until combined. ", " Season with salt and pepper to taste.  ", " Butter the bread (or not if you prefer).  ", " Spread the mashed pea spread over the bread.  ", " Remove the crusts. Use a warm knife to cut the crusts from the slices. ", " Cut into triangles or fingers for serving at afternoon tea or a luncheon.  "]}}, "How to Make Bagels With Three Fillings": {"description": "A delicious combination of bagels filled with cream cheese and smoked salmon, smoked ham and mustard, and egg and mayonnaise. A perfect choice for lunch or brunch!Serves 3", "content": {"Steps": [" Make the cream and chive filling. In a bowl, combine the chives, cream cheese, and season with salt & pepper.  ", " Make the egg and mayonnaise filling. In a bowl, mix the mayonnaise and the chopped boiled eggs. Season with salt & pepper. ", " Create the filled bagels.  Smoked salmon and cream cheese bagel: Slice a bagel in half. Spread butter and cream cheese on the bottom half of the bagel. Layer smoked salmon on the creamed side. Season with black pepper and then put the other bagel half on. Egg and mayonnaise bagel: Slice a bagel in half. Spread the bottom half with butter and then spoon a generous scoop of the egg mix on the buttered side. Season with salt & pepper. Put the unbuttered bagel half on top. Ham and mustard bagel: Slice a bagel in half. Spread the bottom half with butter and mustard. Layer the smoked ham and tomato slices next and then season with salt & pepper. Place the top half (unbuttered) half on the top.  ", " Serve the bagel sandwiches on a serving plate.  "]}}, "How to Make Nasturtium Flower Sandwiches": {"description": "A delicate and dainty treat for light lunches and afternoon teas. Perfect for when the nasturtiums are blooming in the garden.", "content": {"Steps": [" Butter and cut into thin slices a light white loaf.   ", " Spread between them fresh petals of nasturtium flowers, each petal overlapping the next half-way in its length, to give substance to the sandwich \"filling. \" ", " Garnish the dish with whole flowers, or, if served singly on plates, lay a flower upon each square or triangular sandwich.  "]}}, "How to Make Grilled Sandwiches": {"description": "One of the most delicious snacks on any given day is a grilled sandwich. The perfectly crispy bread, tasty fillings, and gooey cheese all culminate for a fantastic culinary experience. Although a simple and satisfying snack, there are a few basic steps to follow to ensure that you end up with a well cooked, carefully constructed, hearty sandwich.", "content": {"Cooking with a Skillet": [" Choose your bread based on your ingredients. One of the most integral parts of a grilled sandwich is the type of bread that you decide to use. All kinds of bread are perfectly fine for use, but some make more sense than others depending on what you will be putting inside the sandwich.  If you’re planning on having very few ingredients then a basic thin bread will probably work best. If you’re going to be putting more ingredients in, then it may be worth exploring some heartier types of bread. Robust bread helps hold the ingredients together and also adds to the flavor of the sandwich.   ", " Butter your bread on both sides. Ensure that the butter has been softened or is at least at room temperature. Trying to spread hard butter may result in you tearing the bread.  Buttering the bread instead of the pan will prevent burning and ensure the bread cooks evenly.  For some extra tang you can also use mayonnaise instead of butter. It will cook the same way and also add a little extra flavor to the sandwich.  ", " Assemble your sandwich. Put all the ingredients together on your bread. If you are using cheese, make sure it is a cheese that will melt (eg. Swiss, American, mozzarella). Feel free to grate the cheese onto the bread to speed up the melting process.  While assembling it’s important not to get too overzealous with how high you stack your sandwich. Eventually, you'll have to flip the sandwich and you don’t want it to fall apart.  ", " Heat the non-stick pan to a medium heat. To ensure that the sandwich starts cooking the moment it touches the pan, preheat it before putting the sandwich in. This should be to a medium heat where the sandwich will be able to cook gently but also thoroughly. You can always turn the temperature down later if need be.  ", " Place the sandwich into the skillet after 2-3 minutes of preheating. You should hear a nice sizzle when the bread hits the pan. This is a good sign and means the pan is at the right temperature for starting the bread at.  ", " Turn the temperature down to a medium-low if you can. The higher the temperature, the faster the bread will cook. Therefore, once the sandwich is in and has made a nice initial sizzle, turning the temperature down by just a little bit will ensure that the bread doesn’t cook too fast for the fillings. Ideal temperatures for cooking vary depending on what is in your sandwich as some fillings cook faster than others. For example, mozzarella cooks very fast so when cooking a Caprese sandwich the temperature should be higher. This will mean the bread becomes golden at the same time that the mozzarella is melted.   ", " Flip the sandwich after 2-3 minutes so it can cook on the other side. Doing this will get you a nice golden brown color on both sides of the sandwich. If your sandwich is packed with ingredients then hold a plate on top of your sandwich, flip the pan, then slide the sandwich back onto the pan.   ", " Serve once golden brown on both sides. As soon as you have gotten the color you want on the bread and the ingredients inside have been cooked/melted, serve your sandwich. Be careful, it will be hot!  "], "Using a Panini Press": [" Pick a bread you like. When using a panini press you can get away with using a basic thin bread with lots of ingredients as the sandwich is being pressed down and cooked from both sides. With that being said, feel free to explore and get creative with your bread choices. Some of these options might include: Ciabatta Multigrain Sourdough Rye  ", " Butter both sides of both pieces of bread. This is integral to getting the nice golden color and buttery flavor for your bread. The outside of each piece will get toasted but buttering the inside allows more butter to melt into the bread and create a richer flavor.  ", " Fill your sandwich with whatever ingredients you like. One of the advantages of using a panini press for your grilled sandwich is that it will have weight on top pushing downwards. This means you will have less trouble cooking with a full sandwich than with some other methods.  If you do overload your sandwich, it’s possible that some ingredients get squeezed out the side. There isn’t anything wrong with this it’s just something to be aware of.   ", " Cook for 3-5 minutes or until the bread is golden and the ingredients are well cooked. These times will vary depending on the thickness of the bread, the ingredients in your sandwich, and the panini press you are using, but this should be about right.  The press should be on a medium heat if possible. You don’t need to fully close the lid on your panini press but you are welcome to do so if you would like a more compact sandwich. Pushing the panini press down when you have more ingredients will also mean the ingredients receive more of the heat from the top and bottom.  ", " Take out and serve immediately. The sandwich will likely be quite hot so be careful, but your sandwich is now ready to enjoy!  Cutting the sandwich in half will help cool the sandwich down a bit faster.  "], "Trying Different Flavors": [" Make a Cuban for a more hearty meal. This is a hugely popular option made popular by cafes in Florida catering to Cuban immigrant workers. The sandwich consists of the following ingredients: Ham Swiss cheese Roast pork Mustard Pickles   ", " Try an Italian Caprese style sandwich for a more summery option. This is an Italian inspired sandwich consisting of some of the most delicious Italian ingredients you can get. Mozzarella, pesto, tomato, and balsamic drizzle all combine to make a gooey and flavorsome delight.  Mozzarella melts very fast so it’s a good idea to cook this sandwich on high so the bread gets golden as fast as the cheese melts. If you don't have any pesto on hand, basil will do just fine.  ", " Explore a more exotic option with a Bombay grilled sandwich. This is a sandwich originating in India and combines tasty ingredients for a more hearty sandwich. Ingredients include: Boiled potato Green chutney Bell pepper Tomato Chaat masala Onion   ", " Stick with a classic grilled cheese option if you want to keep it simple. This one is a tried and true classic and gives you room to get as fancy or as simple as you like with the ingredients. All it requires is a lot of cheese and some good bread, and you’ll have an amazing tasty snack on your hands in no time.  Use a cheese that melts well such as mozzarella, American, or cheddar.  "]}}, "How to Make a Grilled Italian Sandwich": {"description": "This is a very unique sandwich that is both tasty and easy to make. If you like grilled turkey, ham and cheese, and garlic toast as well, wait till you try this!", "content": {"Steps": [" Put two 1 or 2 table spoons of extra virgin olive oil on a non stick pan.   ", " With a spatula spread the olive oil out enough to the size of a piece of bread.  ", " Place several very thin slices of fresh garlic in the olive oil.  ", " Start preparing your bread by thinly spreading the soft margarine with a butter knife  on the outside of each piece of bread that will be in contact with the pan, then sprinkle parmesan cheese on both sides of the bread evenly and completely, then run a spatula over the bread rubbing in the sprinkled cheese into the margarine as much as you can. You can also rub in the cheese with the tips of your fingers if you like. ", " Turn the bread over and put Turkey, Capicola Ham, Parsley, Basil, and oregano on the ham, then toss on a slice of Provolone Cheese.  ", " Put your sandwich together making sure that the margarine and sprinkled cheese parts are on the outside of the bread.  ", " Turn the heat up real low on the stove to slowly heat up the oil and garlic, and when the garlic starts to barely cook, place your sandwich on and let it cook so ever slow.  ", " While the one side of the sandwich is slowly cooking, place thin slices of chopped or sliced garlic on the bread facing you and press into the bread with fingers or spatula.  ", " When you see that the bread is getting lightly brown underneath, turn the sandwich over and cook the other side the same.  ", " Finished.  "]}}, "How to Make Healthy Sloppy Joes": {"description": "Sloppy joes are classic sandwiches that are also fun to eat. Unfortunately, many sloppy joe products are high in sodium, sugar, and contain mostly meat. If you'd like to serve a healthier version, increase the vegetables in the mixture, choose lean meats (like ground beef or turkey), and use low-sodium products. You can even make vegan sloppy joes that are made with delicious French lentils. You'll find that healthy sloppy joes are just as enjoyable to eat!", "content": {"Making Heart-Healthy Sloppy Joes": [" Cook the ground beef and onions. Place 1 pound of (454 g) of extra-lean ground beef into a large skillet over medium-high heat. Dice 1 onion and add it to the pan. Stir and cook the beef and onion for 5 minutes, so the meat is completely browned and crumbly. Carefully drain off any fat and discard it.  Look for an extra-lean beef that's 90 to 95 percent lean.   ", " Stir in the garlic, jalapeno, and red pepper. Mince 4 cloves of garlic and 1 jalapeno. Add these to the cooked meat and onion. You'll also need remove the seeds and stem from 1 red pepper. Dice it and add it to the skillet. Cook the mixture for 5 minutes over medium-high heat.  The meat and onion will continue to cook and soften along with the vegetables.  ", " Add the remaining ingredients and simmer the mixture. Open 1 can (439 g) of low-sodium red beans or pinto beans and drain it. Rinse the beans to remove more sodium and add it to the sloppy joe mixture. Add the remaining ingredients and turn the heat down to low. Simmer the mixture for 5 minutes. Stir in these remaining ingredients:  1 1/2 cups (340 g) of no-salt-added tomato sauce 2 tablespoons of tomato paste 1 tablespoon of red wine vinegar 1 tablespoon of molasses 1 tablespoon of Worcestershire sauce 1 teaspoon of mustard powder  ", " Taste and serve the heart-healthy sloppy joes. Once the mixture has thickened and cooked down, taste it to adjust the seasoning. You can add 3/4 teaspoon of salt and freshly ground black pepper to taste. Get out 8 whole-wheat burger buns and divide the sloppy joe mixture among them. Serve the sloppy joes immediately.  If you want to make the heart-healthy sloppy joes ahead of time, keep in mind that the mixture will thicken as it's stored. You may need to stir in a little water to thin it out.  "], "Making Healthy Turkey Sloppy Joes": [" Saute the vegetables. Pour 1 teaspoon of olive oil into a large skillet and turn the heat to medium. Dice 1 small onion, 1 red pepper, and chop 2 cloves of garlic. Add the vegetables to the skillet once the oil shimmers. Saute the vegetables for about 4 minutes. Scoop the cooked vegetables to a prep bowl and set them aside while you cook the rest of the sloppy joe mixture.  The onions should be somewhat soft and you should smell the garlic. The vegetables will continue to cook and soften when you add them to the cooked meat mixture.  ", " Cook and season the ground turkey. Add 1 pound (454 g) of extra lean ground turkey to the skillet and cook it over medium heat. Use a spoon to break it up into crumbles. Cook the ground turkey for 8 to 10 minutes, so it's completely cooked. Sprinkle salt and pepper over it.  Look for extra-lean ground turkey that comes from the turkey breast. This will be leaner than meat that comes from the turkey's thighs.  ", " Stir in the remaining sloppy joe ingredients. Measure and pour in the rest of the sloppy joe ingredients. Choose low-sodium options where you can and adjust the seasonings according to your taste. Stir in:  Red pepper flakes, if desired 1 cup (225 g) of tomato sauce 1/2 cup (115 g) of low-sodium barbecue sauce 1 teaspoon of Worcestershire sauce 1 teaspoon of chili powder 3 tablespoons of tomato paste 1 teaspoon of hot sauce or Tabasco  ", " Combine and simmer the mixture with the vegetables. Stir the cooked vegetables into the seasoned meat mixture. Turn the heat down to medium-low and let the mixture bubble gently for 15 to 20 minutes.  Simmering the sloppy joe mixture will develop the flavors and finish cooking the vegetables.  ", " Taste and serve the healthy turkey sloppy joes. Taste the mixture and add more seasoning, according to your taste. Consider adding 1 tablespoon of brown sugar if the mixture is too tangy. Divide the mixture among 6 whole wheat hamburger buns and serve them immediately.  You could sprinkle reduced-fat shredded cheese over the sloppy joes for a creamy flavor.  "], "Making Vegan Sloppy Joes": [" Saute the onion, pepper, and celery with the seasonings. Pour 1 tablespoon of extra virgin olive oil into a medium-sized pot. Turn the heat on to medium. Dice 1 small onion, 1 red or yellow sweet pepper, and 2 sticks of celery. Add the vegetables to the hot oil and cook them for 5 minutes. Stir in:  1 teaspoon of ground cumin 1 teaspoon of chilli powder  ", " Stir in the lentils, water, tomato sauce, tomato paste, and Sriracha. Continue to cook the mixture over medium heat while you add 1 cup (200g) of French lentils, 3 cups (705 ml) of water, 1 28oz (796ml) can of tomato sauce, 3 tablespoons of tomato paste, and 1 teaspoon of Sriracha sauce.  Look for low-sodium or no-salt added tomato salt.  ", " Cook the vegan sloppy joe mixture. Turn the heat up to high, so the water begins to lightly bubble. Simmer the mixture with the lid off for 30 minutes. Stir the mixture every once in a while, so the vegetables don't stick to the pan. The lentils should soften completely.  If too much water evaporates and the lentils aren't covered, add more water so the lentils are submerged.  ", " Taste and serve the sloppy joes. Once the lentils are cooked, add 1 teaspoon of salt and 2 teaspoons of balsamic vinegar. You can scoop the vegan sloppy joe mixture onto 6 whole-wheat or sprouted grain buns and serve them with the following toppings:  Relish Pickles Avocado Coleslaw Sliced onions  ", " Finished.  "]}}, "How to Make Game Day Sandwiches": {"description": "When game day rolls around, having delicious food to eat is almost as important as seeing your favorite team win. Sandwiches are great option for game day eats because they're easy to make and customize to suit your tastes. Including meat in your sandwiches, such as in a traditional chicken parm hero style sandwich or an oven-baked pulled pork sandwich, makes them especially hearty. However, if you're a vegetarian, meat-free options such as an Italian tomato hoagie or a nacho grilled cheese, can also be tasty and satisfying when you're watching the big game.", "content": {"Preparing Party-Sized Chicken Parm Sandwiches": [" Adjust the broiler rack and preheat the broiler. To ensure that the oven is ready to broil the sandwich, move the broiler rack so it’s approximately 8-inches (20-cm) below the heating element. Set the oven to broil and allow it to heat for approximately 5 minutes.  Most oven broilers only have two settings: on and off. If yours has more specific heat settings, set the broiler to high.   ", " Add olive oil to the bread and broil it until browned. Place 1 loaf of ciabatta bread that’s been cut in half lengthwise on a foil-lined cookie sheet with the cut sides facing up. Drizzle 3 tablespoons (45 ml) of extra virgin olive oil over the pieces of bread, and set them under the broiler until they are crispy and brown, which should take approximately 2 to 3 minutes.  You can substitute your favorite type of Italian bread loaf for the ciabatta. It should have a crispy crust, though.  ", " Cover the bottom piece of bread with sauce. After you’ve toasted the bread in the broiler, set the top piece aside on a cutting board. Spread approximately 1 cup (257 g) of spaghetti or marinara sauce over the bottom piece of bread so that it’s completely covered.  You can make or use your favorite jarred sauce from the grocery store.  ", " Layer the chicken parmesan on the bread. When the bottom piece of bread is covered with sauce, place 4 to 6 chicken cutlets that have already been prepared parmesan style on the bread. Arrange them in a single layer, overlapping just the edges to fit them all if necessary.  The should be completely cooked and already covered with sauce and cheese. This gameday sandwich is an ideal use for leftover chicken parmesan.  ", " Top the chicken with the mozzarella. After you’ve arranged the chicken parmesan cutlets on the bread, sprinkle 4 ounces (113 g) of shredded mozzarella cheese over them. Make sure to cover all of the chicken evenly with the cheese.  You can also sprinkle some grated Parmigiano-Reggiano cheese over the chicken cutlets if you like.  ", " Broil the sandwich bottom until the cheese melts. Once the chicken cutlets are covered with cheese, return the cookie sheet to the broiler. Allow the sandwich bottom to broil until the cheese melts completely and begins to brown and bubble, which should take approximately 2 to 3 minutes.  It’s best to keep an eye on the sandwich as it’s broiling. It can burn easily if you leave it unattended.  ", " Place the top on the sandwich and press it closed. When you remove the sandwich bottom from the broiler, place the top piece of bread on top of it immediately. Use clean hands to gently press the sandwich closed so it’s sealed. Allow it to cool for 1 to 2 minutes before slicing it.  ", " Cut the sandwich into pieces and serve. After you’ve allowed the sandwich to rest for a minute or two, use a sharp knife to slice it into 6 to 8 pieces. Place the sandwiches on a platter and serve.  You may want to serve the sandwiches with some extra sauce for dipping. Pasta salad is a tasty side to serve with the chicken parm sandwiches.  "], "Assembling Italian Tomato Hoagies": [" Combine the oils, vinegars, fennel seeds, mustard powder, and dried herbs. Add 3 tablespoons (45 ml) of olive oil, 3 tablespoons (45 ml) of vegetable oil, 2 tablespoons (30 ml) of red wine vinegar, 2 tablespoons (30 ml) of white wine vinegar, 1 teaspoon (2 g) of ground fennel seeds, ½ teaspoon (1 g) of English mustard powder, ¼ teaspoon (¾ g) of dried basil, and ¼ teaspoon (¼ g) of dried oregano to a small jar with a lid. Place the lid on the jar, and shake well to mix all of the ingredients.  The vinaigrette can be made up to a week ahead of game day. Keep it covered, and store it in the refrigerator.  ", " Season the vinaigrette with salt and pepper. After you’ve mixed the vinaigrette, remove the lid to taste it. Add kosher salt and freshly ground black pepper to season the dressing to your liking.  If you’d like your vinaigrette to have some heat, you can also mix in some crushed red pepper to taste.  ", " Mix the ricotta and olive oil. Add ¾ cup (188 g) of fresh ricotta and 2 tablespoons (30 ml) of olive oil to a small bowl. Use a whisk to blend the ingredients together until they are smooth and whipped. Set the mixture aside for a moment.  After you mix the ricotta and olive oil together, you can season it with kosher salt and freshly ground black pepper for an extra layer of flavor if you like.  ", " Combine the lettuce, basil, oregano, and some of the vinaigrette. Add 1 cup (75 g)  of shredded romaine lettuce, 1 cup (25 g) of fresh basil leaves, 2 tablespoons (2 g) of fresh oregano leaves, and 2 tablespoons (30 ml) of the vinaigrette to a medium bowl. Toss all of the ingredients together until they’re fully combined.  You can substitute iceberg lettuce for the romaine if you prefer.  ", " Season the tomatoes with salt and pepper. For the sandwiches, you’ll need 3 to 4 large heirloom tomatoes that have been thinly sliced. Place the tomato slices on a  large plate, and sprinkle them with kosher salt and freshly ground black pepper to taste.  You can substitute beefsteak tomatoes for the heirlooms if you prefer.  ", " Spread the ricotta on the bottom half of the rolls. To assemble the sandwiches, you’ll need 4 soft sandwich rolls that have been lightly toasted. Split the rolls open, and use a spatula or butter knife to spread the ricotta mixture over the roll bottoms.  ", " Top the ricotta with the greens, tomatoes, pickles, and onions. After you’ve spread the ricotta mixture over the rolls, divide the mixed greens and tomato slices between the four sandwiches and place them over the ricotta. Add bread-and-butter pickles and thinly sliced red onions to each sandwich as well.  You add or substitute sun dried tomatoes, roasted red peppers, marinated artichoke hearts, or sliced olives as toppings for the sandwich. If you want to add meat to the sandwiches, consider layering a slice or two of proscuitto, salami, or pepperoni over the tomatoes.  ", " Drizzle the sandwiches with the vinaigrette and serve. After you’ve placed all of the fillings on the sandwich, add some of the remaining vinaigrette to each. Place the roll tops on each sandwich, and press gently to close them. Set the sandwiches on a platter to serve.  Consider serving the tomato hoagies alongside homemade potato chips.  "], "Whipping Up Oven-Baked Pulled-Pork Sandwiches": [" Adjust the rack and preheat the oven. To ready the oven for the pork, move the rack to the lower middle position. Next, set the temperature to 325 degrees Fahrenheit (165 degrees Celsius), and allow it to fully heat.  Keep an eye on your oven so you know when it’s reached the proper temperature. Most models will flash an indicator light or beep to alert you.  ", " Combine all of the dry spices and rub over the pork shoulder. Add 2 tablespoons (25 g) of light brown sugar, 1 tablespoon (18 g) of kosher salt, 1 teaspoon (2 g) of ground black pepper, 1 teaspoon (3 g) of ground cumin, 1 teaspoon (3 g) of ground coriander, 1 tablespoon (7 g) of paprika, 1 tablespoon (5 g) of dried oregano, and ¼ teaspoon (½ g) of cayenne pepper to a small bowl. Use your fingers to mix the spices together, and then rub them all over the surface of a 6 to 8 pound (2.7 to 3.8 kg) bone-in pork shoulder.  You can substitute dark brown sugar for the light if that’s what you have in your pantry. You can add or substitute your favorite spices for the rub. For example, chili powder and onion powder are options you may want to consider.  ", " Roast the pork in the oven for several hours. After you’ve rubbed the pork with the spices, place it on a foil-lined rimmed baking sheet. Set it in the oven, and allow it to roast for approximately 3 ½ hours or until you can easily shred the meat with a fork.  ", " Allow the pork to cool for several minutes before shredding it. Remove the roasted pork from the oven, and let it cool for 15 to 20 minutes or until you can handle it comfortably. Use clean fingers to pull the meat from the bone and shred it.  If you prefer, you can use a fork to shred the pork.  ", " Add vinegar, sugar, red pepper flakes, liquid smoke, salt, and pepper to the pork to taste. Place all of the shredded pork in a large bowl. Mix in ½ cup (125 ml) of cider vinegar, 2 tablespoons (25 g) of sugar, 1 tablespoon (5 g) of red pepper flakes, ½ teaspoon (2 ½ ml) of natural liquid smoke, and salt and pepper to taste. Toss well to ensure that the meat is fully coated.  You can adjust the amounts of any of the seasonings to suit your taste. If you prefer, you can mix the shredded pork with approximately 1 cup (225 g) of your favorite barbeque sauce instead of the other seasonings.  ", " Divide the pork between the toasted buns and top with your choice of condiments. When the pulled pork is seasoned, place some on 8 to 12 sandwich rolls that have been lightly toasted. Add chopped cherry peppers, chopped onions, pickles, coleslaw, and/or your favorite toppings to the sandwich before closing them.  Potato salad, macaroni and cheese, and macaroni salad are all tasty side dishes for the pulled pork sandwiches.  "], "Frying Up Nacho Grilled Cheese Sandwiches": [" Heat a skillet on the stove. Place a heavy skillet on your stove top. Turn the heat to medium-low and allow the pan to heat for at least 5 minutes.  If you have a table top grill or panini press, you can use it to make the grilled cheese sandwich if you prefer.  ", " Combine the sour cream and taco seasoning. Add 1 cup (230 g) of sour cream and 4 teaspoons (3 ½ g) of taco seasoning to a small bowl. Mix the ingredients together until they’re fully blended.  If you prefer, you can use reduced-fat sour cream. You can use packaged taco seasoning or a homemade blend if you prefer.  ", " Butter the outside of two bread slices and place them in the pan. To make two grilled cheese sandwiches, you’ll need four slices of bread. Spread some butter on the outside of the slices, and place two of the slices, buttered side down, into the heated pan.  You can use any type of bread that you like, but it should be fairly thick and hearty so the bread can support the heavy fillings.  ", " Spread the sour cream over the bread slices in the pan. Use a butter knife or small spatula to spread the sour cream mixture over the tops of the slices of bread in the skillet. Make sure that the sour cream is spread evenly across the slices.  ", " Place the tomato, avocado, black beans, black olives, and tortilla chips over the sour cream. To fill the sandwiches, divide 1 large, sliced tomato, 1 sliced avocado, ½ cup (50 g) of chopped green onions, ½ cup (100 g) of sliced black olives, and 2 handfuls of tortilla chips between the two sandwiches to top the sour cream mixture. Be careful not to overfill the sandwiches, though.  You can omit, add, or substitute your favorite nachos toppings to fill the sandwich. If you want a heartier sandwich, consider adding some chili or taco meat. You can use plain or flavored tortilla chips depending on your preference. It often helps to crush the chips before adding them to the sandwich, so they fit more easily.  ", " Top the fillings with two slices of cheese and the remaining bread slices. . Once the fillings are on the sandwiches, cover them with two slices of pepper jack cheese on each sandwich. Next, set the two remaining slices of buttered bread on top of the sandwiches with the buttered side up.  You can substitute your favorite type of cheese in the sandwich. Cheddar and monterey jack are tasty options.  ", " Cook the sandwiches until the bottom is golden. Allow the sandwiches to cook in the skillet until the bottoms become a golden brown. It should take approximately 5 to 7 minutes.  Resist the urge to turn up the heat on the sandwiches so they’ll cook more quickly. They can can burn in a hurry if you use too much heat.  ", " Flip the sandwiches and cook on the other side until it is golden. When the bottom of the sandwiches are golden brown, use a spatula to carefully flip them over in the pan. Allow them to cook on the other side for another 3 to 5 minutes or until it is also golden brown and the cheese is melted.  Serve the sandwiches alongside more tortilla chips and salsa.  ", " Finished.  "]}}, "How to Make Ham and Bread \"Pancake\" Sandwiches on a Panini Press": {"description": "So what are Ham and Bread \"Pancake\" Sandwiches? Well just circular shaped slices of bread with a bit of folded ham in the middle of them. It's very easy to make and turns out delicious. If you don't know what a panini press is, it's a sandwich maker that makes your sandwich flat like a pancake instead of a triangle or some sort of other shape.", "content": {"Steps": [" Gather up what you need. To make these ham and bread \"pancake\" sandwiches you will need the following items: Bread Ham (It doesn't matter what type you use) Butter A spread you like putting on your bread (Nutella, Peanut Butter, Jam, etc.)   ", " Get your bread. Get a slice of bread and grab a cup. If you don't want to waste bread, use a small glass or possibly a shot glass to make the circles. Push the cup down on the bread and twist it a few times and when you take it out of the bread a bread circle should be in the cup or on the plate/counter. ", " Turn on your panini press. Turn on your panini press and let it heat for at least ten seconds then smear a little bit of butter under your bread circles and drop them on. There isn't a problem if you hear a sizzle, it's just the butter melting around the bread. ", " Prepare your ham. Get a slice of ham and fold in half or fold it so there is a little loop in the middle. When you've folded it, use a spatula or something you can pick it up with that has a flat surface and then drop it on your panini press with the bread circles. This is so the ham will become a little more crisp depending on how long you leave it on the panini press. ", " Flip your bread circles. When you've put the ham slice on the panini press, flip your bread slices but before you flip them, smear a bit of butter on the top and then flip it. After flipping it, leave the side to \"cook\" for at least 10-15 seconds depending on how crisp you want them. ", " Flip your ham. A few seconds after you flip your bread circles, flip your ham but before you flip them do the same thing with the bread circles and smear a little bit of butter on it. This will cause the ham to be moist and juicy. ", " Flip your bread circles then turn of your panini press. Smear a bit of butter on your bread circles again and then flip them. After flipping them, turn of your panini press so it can cool down and doesn't overheat. Don't worry, it won't immediately go cold, it will stay hot and cool nice and slowly. ", " Turn your panini press on again and flip your ham. After it's been 10-15 seconds, turn your panini press on and flip your ham doing the same thing you did the first time you flipped them. Then flip your bread circles, again, smearing butter on top before you flip them. ", " Turn of your panini press and take your ham and bread circles off. When it has been 10-15 seconds, turn of your panini press and put your bread slices and ham on a plate. Make sure to clean any stains with a cold cloth. The water will help with the panini press cooling down. ", " Finish up. Put your folded ham in the middle of your bread slices and spread your chosen topping spread on the top and eat! "]}}, "How to Make Deli Dinner Supreme": {"description": "If you're really hungry and your last night's tasty casserole won't satisfy you, whip up this mouthwatering dish. It's like making a buffet dish without going to a buffet!", "content": {"Steps": [" Make rice (steamed rice recommended)  ", " Take 3 slices of ham and cover the rice with it.  ", " Open up a can of Vienna sausage and take 2 out of it.  ", "Slice them and put it in a bowl ", " Crack one egg into the bowl and whisk it.  ", " Put the remaining Vienna sausages into the plate.  ", " Heat up a pan with cooking oil. When the oil is hot, put in the scrambled egg. ", " When done, put it in the plate. Season it with regular salt or fancy, garlic salt. ", " Crack the last egg into the pan and fry it regularly.  ", " Put it in the plate and enjoy!  ", " Finished.  "]}}, "How to Make Gluten Free Sandwich Wraps": {"description": "Gyros and sandwiches that use sandwich wraps may have been in your past (for those on a Gluten Free diet), but not any longer. Use this recipe to create a sandwich wrap that will quickly become very popular.", "content": {"Steps": [" Mix together all of the dry ingredients except for the sweet rice flour.   ", " Using a heavy mixer, in a separate bowl, combine the wet ingredients.  ", " Add the dry ingredients to the wet ingredients slowly.  ", " Beat on medium to medium high speed for about four minutes.  ", " Dust a good size jelly roll pan with floor. Alternatively, you can oil the bottom of the pan and dust the oiled part of it. ", " Scrape the dough onto the pan and press as thinly as possible.  ", " Use a fork and poke indentations in the dough.  ", " Place the dough in a warm area and let it rise for about 35-40 minutes.  ", " Preheat your oven to 425 degrees.  ", " Bake for 11-15 minutes or until the top is slightly browned.  ", " Allow the bread to cool for at least 15 minutes before using.  ", " Cut into the size that you need for your folded sandwiches.  ", " Save leftovers by storing in a zip lock bag on the counter. Do not refrigerate. "]}}, "How to Make a Low Calorie Caprese Panini Sandwich": {"description": "A caprese sandwich includes tomato, basil, and mozzarella cheese. A panino is a small, long loaf/roll of bread -- or the sandwich made from it.", "content": {"Steps": [" Pre-heat a panini press, griddle or stainless steel pan over medium heat.   ", " Split the lower calorie whole-wheat (or multi-grain) sandwich roll/loaf in half horizontally (lengthwise), with a knife. This more complex bread digests much more gradually than white bread to be satisfying, not spiking your blood-sugar. ", " Spread the prosciutto, tomato and mozzarella slices across the bottom half of the roll.  ", " Top the stuffings with green basil leaves and two thinly sliced pickled (hot) Italian cherry peppers. Season with salt and black pepper. ", " Scoop the excess bread out of the top half, to remove more carbs/calories.  ", " Cover the sandwich with the top half of the bread and heat on a panini press, griddle or stainless-steel pan.  A grilled panino may be lightly oiled (with healthy olive oil) on the outside and grilled in a press (a double-sided electric grill for instance).  ", " Finished.  "]}}, "How to Diversify Sandwich Fillings": {"description": "When the kids start whining that they're sick of peanut butter and you're tired of the same cheese fillings, it can be hard to step outside the habit. However, the world of sandwich fillings is incredibly diverse and can be an art in its own right if you really want it to be. This article suggests numerous sandwich filling ideas to get you started; after reading this, you'll be sure to have many ideas of your own.", "content": {"Steps": [" Make cheese sandwiches more interesting. While cheese sandwiches are an easy mainstay for lunchboxes, they can be made a lot more interesting than just simple cheese. Here are some ideas: Change the cheese. If you've been eating only one kind of cheese, branch out and try other cheese varieties, especially those with stronger flavors, and cheese types you've never tried before. Red pepper, cress, or radish to mild cheese for a piquant taste. Chives and tomato to ricotta cheese. Sprouts and a spread to cheese. Cottage cheese with . Cheese with lettuce, tomato and green or red pepper. Cheese and celery. Mixed cottage cheese and cream cheese, with sprouts added. Cheese with chives and tomato. Add banana and jam.   ", " Spice up the usual peanut butter . Peanut butter is another sandwich mainstay that can do with a lift. Some suggestions include: Lettuce and cucumber with peanut butter. Lentil sprouts and parsley with peanut butter. Semi-dried, oiled tomatoes or red peppers with peanut butter.  ", " Add honey to sandwiches. Honey can make an interesting spread choice, with some additions: Honey with cocoa, Milo, malt powder. Honey with chopped . Warning: Very sweet! Honey with poppy seed or sesame seed. Honey, jam, and apple slices.  ", " Make a roasted vegetable sandwich. This can include any vegetables that are your absolute favorites and it will taste delicious in Italian style breads, such as ciabatta. Good choices for inclusion include pepper, zucchini (courgette), potato, pumpkin, eggplant, artichoke hearts, sweet onion, and tomatoes. Read for more information.  ", " Make a falafel sandwich. Use a pita, pre-cooked cooled falafels, salad ingredients, tabouli , hummus , and a squirt of mint-yogurt. Delicious cold as well as warmed! Read for instructions.  ", " Use leftovers. Leftovers make excellent sandwiches, including turkey, ham, chicken, vegetables, cooked grains, mashed potato, etc. Add condiments such as sauce and pickles for added flavor and moisture. "]}}, "How to Make Greek Salad Wraps": {"description": "Greek salad wraps have an amazing taste combination for anyone to try. These wraps make a twist to your normal wraps that will awaken your taste buds. Whether it's for a snack, on-the-go meal, or a quick dinner, these salad wraps will become a new favorite.", "content": {"Steps": [" Slice the tomato into small pieces on a cutting board. Set aside.  ", " Cut the cucumber into stick-sized pieces. Set aside. ", " Pit and slice the olives into halves. Set aside. ", " Heat the tortillas. Place the stovetop on to medium and lay a large skillet on the heat. Heat the tortillas until each side is crispy brown. ", " Place the tortillas on a large plate.  ", " Spread the tomatoes, olives, and cucumbers onto each tortilla.  ", " Spread the hummus on the sides and top of each tortilla.  ", " Fold and seal the tortillas together.  ", " Slice the two tortillas into a half using a knife.  ", " Serve. Place the wraps on a serving plate and serve with some Greek salad . Enjoy! "]}}, "How to Make a Grilled Chicken Sandwich with Sliced Apples": {"description": "Looking to add a new spin to your grilled chicken sandwich recipe? Just wait until you try this grilled chicken sandwich that includes slices of green apples on the sandwich!", "content": {"Steps": [" Grill the chicken as you continue the rest of the process below. If you'd like more than one chicken breast and your pan offers the space, you can grill more than one. Breasts work better than other pieces of chicken for this sandwich.   ", " Cut an apple into several medium-thick slices. If they are too thick, the sandwich won't hold together; however, too thin and you won't taste much apple. Green apples may seem tart at first, but the balance with the other ingredients works well.  ", "Cut open the \"bun\" so that you have a top and bottom half. ", " Smear both sides of the bun with mayonnaise. A medium layer on each side is usually right for a tasty sandwich. ", " Add a bottom layer of lettuce to the sandwich. Several leaves of lettuce usually works well. ", " Prepare the tomato. Tomatoes for this sandwich should be sliced rather thin, but not so thin that they fall apart when placed down onto the sandwich. ", " Add one complete layer of the the apple slices. You'll be using the remainder of the apple slices later, so don't worry if you have extras. ", "Place the chicken breast on the sandwich. ", "Cover the chicken breast with another layer of apples. ", " Top the sandwich. If you desire more lettuce, you can add more to taste. If not, place the other half of the bun on top of the sandwich. ", " Serve while it's still warm. Ideally, you'll eat this sandwich while the apples remain cool and the chicken remains warm. "]}}, "How to Make Pan Bagnat": {"description": "The Pan Bagnat or \"Bathed Bread\" is a classic sandwich from southern France particularly around Provence and Nice, as well as Italy, where it in known as the Pan Bagna.", "content": {"Steps": [" Start by cutting a pocket into the bread roll. For large round or Viennese rolls, the bread centre is often removed to make room for the fillings, but many light white bread rolls such as Vietnamese rolls or flat rolls such as ciabatta its not essential.  ", " Mix the minced garlic, oil, vinegar and mustard. Whisk lightly to make a vinaigrette, add salt and pepper to taste. ", " Layer your desired fillings into the bread roll. The goal is to fill the roll completely but not so the roll is overfilled. ", " Spoon the dressing on top of the filling and close the bread roll. Securely wrap the sandwich with cling film or foil and press with a heavy weight, such as a cast iron frying pan, or a clean brick. Press for at least 10 minutes and turn the roll, pressing again for 10 minutes. In some areas, the pressing is not traditional so it is not essential, but most mainstream recipes press the roll. The origin of this is unclear, some stories tell about a farm worker whose roll fell to the bottom of his sack and was crushed, yet he ate it and found it delicious.  ", " Cut the roll into thick slices if desired or serve whole. Delicious with fresh summer ingredients, this sandwich can be made in advance and stored for several hours in the fridge until needed. "]}}, "How to Make a Tookie": {"description": "Tookies are a lot like a burger but the meat is replaced by an egg with pieces of ham or turkey and cheese. Tookies are a tasty treat that are fun to make and even better to eat. Read on to find out how to make what will soon become your family's favourite snack!", "content": {"Steps": [" Spray the frying pan with pan coating and place over a medium heat.   ", " Crack egg and put on pan. Try not to pop the yolk. ", " Flip the egg over once firm.  ", " Cut out yoke.  ", " Cut out circles of ham and cheese that are a similar size to the yolk.  ", " Put the circle of ham on the bottom of the space created by removing the yolk. Place cheese on top. Heat for a few minutes until the cheese is beginning to melt. ", " Repeat with all three eggs.  ", " Place the tookies into the burger buns.  ", " Flavour with ketchup, mustard or friend onions as desired.  ", " Serve with a fresh salad and couscous or potato wedges.  "]}}, "How to Make BLT Bites": {"description": "BLT sandwiches are classic for good reason -- they're delicious and easy to make. If you're a fan of the bacon, lettuce, and tomato combination, you don't just have to enjoy it at lunchtime. By making smaller version of the classic sandwich, you can create tasty, no-cook appetizers that are sure to be a hit with family and friends. Whether you prefer BLT bites sandwiches, BLT bites on crackers, or bite-size BLTs inside cherry tomatoes, you can easily whip up any of these hors d'oeuvres for your next party.", "content": {"Whipping Up BLT Bites Sandwiches": [" Spread the mayonnaise on half of the baguette slices. For the BLT bites, you’ll need 1 baguette that’s been sliced into 2- to 3-inch (5- to 7.5-cm) wide rounds. To begin making the sandwiches, spread ½ cup (116 g) of mayonnaise on half of the rounds.  If you like, you can toast the baguette before assembling the sandwiches. They may be a little more difficult to eat, though.   ", " Place the romaine on the sandwiches. After you’ve spread the mayo on half of the rounds, you’ll need to layer 2 to 3 romaine leaves that have been torn into 2-inch (5-cm) pieces on the sandwiches. Place a single piece over the mayo on half of the sandwiches.  If there’s another type of lettuce that you prefer, you can substitute it for the romaine.  ", " Add the tomatoes to the sandwiches. Once the romaine is in place on the sandwiches, place a piece of tomato over the lettuce. You’ll need 4 small tomatoes that have been sliced to fill all of the sandwiches.  Grape or cherry tomatoes work well for the BLT bites.  ", " Layer the bacon and onions on the sandwiches. On top of the lettuce and tomato, place the bacon layer. Use 4 slices of cooked bacon that’s been chopped into 1-inch (2.5-cm) pieces to fill the sandwiches. Next, sprinkle a small amount of 2 chopped green onions over each of the sandwiches.  You can omit the green onions if you prefer.  ", " Sprinkle the sandwiches with sea salt and close with another baguette slice. To finish off the sandwiches, season them by adding a small amount of sea salt to each. Next, place the remaining baguette rounds on top of the sandwiches to close them.  If you prefer, you can leave the sandwiches open and use the remaining baguette rounds to make additional sandwiches. You can also add another layer of mayo, lettuce, tomato, bacon, and green onions on top of the second baguette round if you like.  "], "Preparing BLT Bites on Crackers": [" Slice the bacon. For the BLT Bites, you’ll need 3 to 4 slices of cooked bacon. Use a sharp knife to chop the bacon into 1-inch (2.5-cm) squares.  If you’re in a hurry, you can purchase precooked bacon at the grocery store. You heat and crisp it up in your microwave according to the package instructions, so you don’t have to fry it yourself.  ", " Chop the salad mix and mix it with the mayonnaise. For the lettuce in the BLT bites, you’ll need 1 cup (75 grams) from a bag of spring salad mix. Use a sharp knife to chop the greens into bite-size pieces, and mix it in a medium bowl with 3 teaspoons (15 g) of mayonnaise until all of the lettuce is coated.  You can use any lettuce or greens that you like for the BLT bites. Premixed salad bags are usually easier to work with than a head of lettuce. If you find that there isn’t enough mayonnaise to coat all of the greens, you can add more. Just mix it in small amounts so you don’t accidentally add too much.  ", " Spoon some of the salad mix onto the crackers. After the greens are coated with the mayonnaise, add the mixture to 12 round crackers. Use a teaspoon (5 g) to carefully place the salad mixture on the crackers so there’s a single, neat layer.  You can use any type of cracker that you like for the BLT Bites. A bacon-flavored variety is an ideal option, though.  ", " Top the crackers with bacon and tomatoes. With the salad mixture on the crackers, add the bacon and tomato layers. Place one of the bacon squares on each cracker, and use a slice from 3 to 4 grape tomatoes to cover each piece of bacon. Place the bites on a platter, and serve.  "], "Putting Together BLT Bites with Cherry Tomatoes": [" Slice the tomatoes and scoop out the pulp. For the bites, you’ll need 16 to 20 cherry tomatoes. Use a knife to cut a small slice in the top of each tomato, and hollow out the pulp from inside with a small melon baller. Discard the pulp.  If you don’t have a melon baller, use a small spoon to hollow out the tomatoes.  ", " Drain the tomatoes. Once the tomatoes are hollowed out, set a piece of paper towel down on a flat surface. Turn the tomatoes upside down and set them on the paper towel. Allow them to sit for 5 to 10 minutes to drain the excess moisture.  ", " Combine the remaining ingredients. Add 1 pound (454 g) of cooked, crumbled bacon, ½ cup (116 g) of mayonnaise, ⅓ cup (33 g) of chopped green onions, 3 tablespoons (15 g) of grated Parmesan cheese, and 2 tablespoons (1 g) of chopped fresh parsley to a small bowl. Mix the ingredients well until they’re fully blended.  You can substitute shredded cheddar cheese for the Parmesan if you prefer.  ", " Spoon the bacon mixture into the tomatoes. Once the filling is completely mixed, use a spoon to carefully add it to each of the tomatoes. Place a generous amount of the bacon mixture in each so it’s peeking out the top of the tomatoes.  If you like, you can sprinkle some more chopped green onions over the tomatoes after you’ve filled them.  ", " Refrigerate the tomatoes for several hours before serving. After you’ve filled all of the tomatoes, place them in an airtight container or a plate that you can cover with plastic wrap. Put the tomatoes in refrigerator to chill for 3 to 4 hours. Once they’re fully set, place them on a platter and serve.  You can make the BLT bites the day before, and allow them to chill overnight.  ", " Finished.  "]}}, "How to Make a Healthy Pita Sandwich With Garlicky Yogurt Filling and Roasted Bell Peppers": {"description": "Ever wanted to eat an interesting yet healthy sandwich, which is filling too? This lovely sandwich combines the goodness of yogurt with oven roasted bell peppers and pita to give you something perfect for any time of the day.", "content": {"Steps": [" Mix the yogurt with the grated carrot, spring onion, crushed garlic, salt, pepper and herbs.   ", " Toast the pita bread, either on the stove or in the toaster.  ", " Chop the bell pepper, lengthwise into thin strips.  ", " Set up a pita station in an uncluttered part of your kitchen, and keep the yogurt mix and roasted bell pepper there.  ", " Stuff the bread with chopped bell pepper, then the yogurt mix.  ", " Your sandwich is now ready to eat!  "]}}}