{"How to Remove Rust from a Bike": {"description": "A rusty bike can turn an enjoyable ride into a bumpy mess or ruin your bike's overall shine. Don't take your bike to a professional for rust removal: in most case, you can remove bike rust yourself. Depending on the severity of your bike rust, you may use household items like baking soda and vinegar or cleaning chemicals to get the job done. Once your bike is rust-free, you'll be back to smooth riding once again.", "content": {"Using Baking Soda on Minor Rust": [" Mix baking soda and water in a bowl. Combine a 50/50 mixture of baking soda and water in a bowl and mix until it becomes a thick paste. You will need enough of the paste to completely cover the rust, so keep the bowl, baking soda, and water nearby in case you need to make more.  Baking soda is generally best at minor rust removal. Severe rusting may respond better to other methods.  Add a squirt of lemon juice to the paste for strengthened removal properties.    ", " Put the paste directly on the rust for about 15 minutes. Dab the paste on a brush or sponge and apply it to the rusty bike. Do not scrub or remove the paste immediately: it will need time to set and break down the rust. Let the paste sit for about 10 to 15 minutes.  The baking soda paste should be thick enough to evenly coat the rust patch without dripping off of the bike.  ", " Scrub the baking soda with a scrub pad. Using a plastic scrubber or steel wool, scrub the baking soda solution. As you scrub, you should notice the rust breaking down and detaching from the bike. If you do not notice this, add more of the baking soda paste to the bike and scrub with more force.  Use a toothbrush as an alternative if no scrub pads are available.   ", " Wait about 10 minutes before wiping off the baking soda. After you are finished scrubbing, leave the baking soda on for about 10-15 minutes to reach stubborn rust. Then, wipe off the paste with a dry microfiber cloth. Make sure the bicycle is completely dry to prevent further rusting.  Store the bike in a cool, dry place to keep the rust from returning. If there is still some rust left over, repeat the same process again or try another method.  "], "Using Vinegar on Stubborn Rust": [" Pour white vinegar into a spray bottle. White vinegar is best at rust removal because it is more acidic than other varieties. Although you can dab the vinegar onto the bike rust directly, spray bottles are ideal to ensure an even coating of the liquid. Add a small spoonful of baking soda to the mixture for a more corrosive solution.   ", " Spritz or coat the rust on your bike in vinegar. If you put the vinegar in a spray bottle, spray it evenly around the entire rust patch. Apply the vinegar with a sponge or ball of tinfoil if you decide to directly coat it. Tinfoil is especially effective because it can also function as a scrub brush while you apply the vinegar.  If desired, you may soak removable bike parts in a vinegar solution as an alternative.   ", " Rinse the vinegar off of your bike after 10-15 minutes. Vinegar can continue corroding your bike metal after removing the rust. To prevent this from happening, use a hose to wash the bike down after the rust has dissolved. If vinegar does not remove the rust, you may need to use a chemical cleaner.  ", " Dry the bike off before storing it again. Leaving moisture on the bike can cause rust to return. Rub your bike down with a cloth soaked in denatured alcohol to remove excess moisture. Store your bike in a cool, dry place to prevent future rusting.  "], "Trying a Chemical Rust Remover": [" Use chemical rust remover if no other method works. In some cases, household items might not be strong enough to remove rust. Try baking soda and vinegar first, but if neither work, purchase a rust remover from your local hardware store or bike shop.  Do not mix chemical removers with baking soda, vinegar, citric acid, or other cleaners. Some mixtures can be deadly.  ", " Put on protective gloves and glasses before handling rust remover. Chemical removers are more potent to use than other methods and can harm your eyes or skin. Read the instruction label carefully before using to make sure you're using it safely. If the cleaner touches your eyes or skin, rinse it off thoroughly and contact poison control for further instructions.  Avoid using chemical cleaners in confined spaces. Open a window or door for ventilation, and exit the room immediately if you feel dizzy and/or lightheaded.  ", " Brush the chemical cleaner on as directed. How long you leave the cleaner on will depend on the chemical. Suggested times can range from 30 minutes to overnight. Read the directions for specific instructions and follow them carefully for the best results.  If you need a cleaner that will remove rust quickly, read the label instructions while you're at the store and choose one with a quick setting time.  ", " Remove the cleaner after the suggested time has passed. Because chemical cleaners are corrosive, wipe it away completely with a cheap cloth after it has finished removing the rust. Store remaining cleaners wherever you keep other chemicals in case you need to remove more rust later on. Throw the cloth away after use to prevent contaminating other fabrics.  "]}}, "How to Change a Crank": {"description": "A bike's cranks must be properly maintained to keep your bike operational. These are the arms connected to the Bottom Bracket (consisting of axle, bearings, etc.) via the axle(usually square on the ends). If you need to change your cranks, you can do so as long as you have the proper tools. First, you’ll need to detach the pedals from the crank. Then, you’ll need to use an Allen key to remove the center bolt from the crank before replacing it. You can use this process to replace Shimano two-piece, SRAM self-extracting two-piece, and three-piece cranks.", "content": {"Detaching the Pedals": [" Detach the right pedal from the crank arm with a 15mm wrench. The crank arm is the elongated piece that connects the pedals to the crank. Fit the wrench around the rod that connects the crank arm and pedal. Then, turn the wrench counterclockwise 2-3 times to loosen it from the crank arm.  When the pedal is loosened it should freely rotate on the crank’s bolt.   ", " Rotate the crank arm clockwise to detach the pedal. Hold the pedal and rotate the crank arm clockwise. Continue rotating the crank around until the pedal detaches from the crank arm.  You should be able to feel the pedal unthreading from the crank arm as you rotate it. It may take 10-30 full rotations of the crank to remove the pedal.  ", " Repeat the process on the left pedal. The left pedal is reverse-threaded. Use a 15mm wrench to loosen the left pedal from the bike. Then, hold the left pedal and rotate the crank arm to completely detach it from the bike. Both pedals should now be completely removed.  If you're standing on the right, or drive side, of the bike, rotate the crank arm clockwise. If you're standing on the left, or non-drive side, of the bike, rotate the crank arm counterclockwise. Set the pedals aside in a safe place so that you can reattach them once you’re done replacing the crank.  "], "Removing the Crank": [" Remove the cap from the center of the crank, if it has one. Some cranks will have a metal or plastic cap that fits over the bolt on the crank. If your crank has one, fit a screwdriver under the edge of the cap and pop it out of its fitting. This will reveal the crank bolt.  The crank bolt will be in the center of the crank and looks like a hexagon.  ", " Loosen the pinch bolts with an Allen key, if the crank has them. Some cranks will have pinch bolts, or 2 smaller bolts, near the top of the crank arm. If your crank has these, insert a 5mm Allen key into the holes at the top of the arm and rotate the key counterclockwise.  Loosening the pinch bolts will allow you to remove the crank arm from the rest of the crankset. The 2-bolt design is for Shimano cranks. For this type of crank, you also need to remove the plastic pre-load screw on the left, or non-drive, side of the bike. Not all cranks have these pinch bolts. If your crank doesn’t, skip this step.  ", " Insert an Allen key into the crank bolt and turn it counterclockwise. Turn the handle of the Allen key counterclockwise to loosen the crank bolt. Then use it to completely unscrew the crank bolt.  If your crank has bolts on both sides of the bike, go to the other side of the bike and remove the other crank bolt. Most cranks require a 4mm-8mm Allen key. Look in the bike's user manual or on the bike manufacturer’s website to find out which size will fit your bike. An Allen key is also called an Allen wrench or a hex key. You can find them at bike shops and hardware stores.  ", " Slide the crank off the spindle if you have self-extracting cranks. Pull the crank arm away from the bike to remove it from the rest of the crank. Then, slide the other side of the crank out of the bottom bracket. Pull the rest of the crank away from the bike to slide it out of the bottom bracket.  If you have rubber washers around the spindles, slide them off before installing your new cranks. You don't need a crank extractor tool for self-extracting cranks. You’ll know if you have a self-extracting crank if the crank only has 1 crank bolt on 1 side of the bike with a retaining ring around it.  ", " Loosen the cranks with a crank extractor for non-extracting cranks. Purchase a crank extractor tool from a bike store or online. Insert the crank extractor into the crank-bolt hole and turn it clockwise to screw it in until it's tight. Then, turn the handle of the extractor counterclockwise until the crank pops off. Go over to the other side of the bike and remove the other side of the crank in the same way.  Crank extractors are needed on non-self-extracting cranks. These types of cranks have a crank bolt on each side of the bike and do not have a retaining ring around the crank bolt.  "], "Installing New Cranks and Reinstalling the Pedals": [" Pop the right crank onto the spindle in the 6 o'clock position. If you have washers, place them around the crank spindle before installing the cranks. Push the right side of the crankset onto the right spindle and wrap the chain around the crank’s chainring so that it's between the bike and crankset.  Wrap the chain so that it runs from the back gears to the chainring on the crankset.  ", " Slide the left crank onto the spindle in the 12 o'clock position. Jiggle the left crank arm and push it all the way down the spindle. If either side of the crank isn’t going all the way down the spindle, tap on it with a rubber mallet to push it into place.  ", " Screw the new crank bolt into its socket with an Allen key. Place the crank bolts back into their sockets. Then, use the Allen key that you used to uninstall the old cranks to screw in the new crank bolt. Continue turning each crank bolt clockwise until you can’t anymore.  ", " Replace the compression cap and tighten the pinch bolts, if applicable. If your crank bolt has a plastic compression cap that goes over it, place the cap over the center of the bolt and push down to pop it into place. Tighten the cap to the recommended torque, which is typically 5 Newton meters. If your crank has pinch bolts, turn them clockwise with a 5mm Allen key to tighten them and secure the crank to the bike. Tighten them to the manufacturer's specifications, which is generally around 15 Newton meters. Self-extracting cranks do not have pinch bolts.  ", " Screw the pedals back into the crank arms. Place a pedal into its socket and start turning the crank counterclockwise. This is an easy way to screw the pedal back onto the bike. Go over to the other side of the bike and repeat the process. Continue screwing the pedals into the crank arm until they are tight.  Most pedals will have an engraving that reads “R” and “L” for right and left. This will help you determine which pedal goes on which side. Make sure that the threads of the pedals match with the groves on your crank arm so that you don’t strip the threads.  "]}}, "How to Unwobble a Bicycle Rim": {"description": "The best way to make sure a bicycle rim stops wobbling is through using a method called \"truing\" the wheel. The spokes on your bike all work together to keep the rim straight, each one pulling in a slightly different direction at the same force in order to keep the wheel straight. Because there are so many spokes to account for, this makes truing a tricky art form. But, if you're patient and go slowly, it is still very doable for any burgeoning bike mechanic.", "content": {"Fixing a Lateral (Side to Side) Wobble": [" Flip bike upside down, or put the wobbly wheel in a truing stand if you have one. You need to be able to spin the wheel freely, allowing you to see where it wobbles and make subtle changes. Usually, turning the bike upside down is more than enough, but precise mechanics can use a truing stand, which holds the wheel in place and has small calipers that let you notice even the smallest wobble. If you've got a serious wobble or issue, it can help to take the tire off first. At the very least, If not, one will likely pop while you work.    ", " Locate the bend in the rim by noting where the wheel comes nearer to the brakes. Spin the wheel, watching near the brakes to see where the wheel swings to either side. Either stop the bike at this point with your fingers, noting where it is, or use a permanent marker to measure the wobble. Simply hold the marker evenly at one height, and spin the wheel so that any wobbling are hits the marker and makes a streak.  Looking to protect your beautiful wheels from marks? Take a small piece of masking tape and use it to make the spots where there is some wobble.  ", " Understand how spokes are tightened and turned. The way you tighten spokes seems a little counter-intuitive at first, since you'll be turning spokes on both the top and bottom of the wheel. It seems like it's breaking the \"righty-tighty\" rule you've grown up with, but there is an easier way to think about it. Imagine you're looking straight down at the top of the spoke where it meets the rim. If you were to take a screwdriver and stick it into the top of the spoke, you would turn the spoke clockwise, like normal, to tighten it, and counter-clockwise to loosen it. If you're ever in doubt, imagine which direction you would turn this screwdriver, and turn accordingly. ", " Grip the spokes around your problem area and squeeze lightly, checking for looseness. If you're not sure what \"loose\" is, feel your other wheel or the spokes on other sides of the wheel. While not all wobbly wheels have noticeably loose spokes, most do, which will point out the exact spoke where there is an issue. If a spoke is extremely loose, tighten it until it is about the same tension as those around it.  If a spoke is extremely loose, you should still go ahead and try to fix it. That said, you may need a new rim if this happens regularly-- it should be a rare occurrence.  There are rare cases where a spoke feels too tense, which can cause a wobble as well. The technique to fix it (shown below) is the exact same, just with loosening instead of tightening.  ", " Note which side each spoke pulls towards to find the ones causing your wobble. The spokes will alternate which side of the rim they go to -- half to the left, half to the right. The balance between these two sides is what keeps your wheel true and prevents wobble. So, if your wheel wobbles to the left, that means the spokes on the right side are too loose to keep things balanced, or the spokes on the left are too tight. This is why you only get wobbles in certain areas -- one spoke that is too loose only affects the wheel in the precise spot. Trace the spoke down from the rim down to the center of the wheel to see which side it pulls towards.   ", " Tighten the spoke just below your problem area with a half-turn of the nipple. The golden rule of rim truing is go slow. Using your spoke wrench, a small tool with notches made to fit perfectly around the \"nipple,\" the small sheath where the spoke meets the rim. Tighten it with a half-turn clockwise, then check again. Remember -- go slowly! This first turn won't fix the issue immediately, but don't keep turning just yet.  Don't have a spoke wrench? A pair of needle-nose pliers will work in a pinch, but you should buy a spoke wrench cheaply as soon as you can. Remember to get the right side! If the wobble is to the left, you need to tighten the spoke that pulls the rim back to the right.   ", " Loosen the two spokes next to the one you just tightened, using only quarter-turns. This is how you keep the radial tension (up and down the rim, keeping it perfectly round) even without too much work. Say you just tightened a spoke on the right side of the rim, because it wobbled to the left. On either side of this spoke are two more spokes for the left side of the rim. Instead of continuing to crank on the right side, which can put too much pressure on one spoke, just loosen the spokes that pull it to the left. By using just a quarter turn on each spoke, you undo the same amount of tension on the left that you just added to the right, further balancing your wheel. Keep this simple math equation in your head as you work -- \"if I tighten one spoke, I need to loosen the two spokes next to it half as much to make sure it stays balanced.\" The opposite equation, loosening one spoke and then tightening the other two half as much, also applies.  ", " Spin the wheel and check the truing. After every set of adjustments, spin the wheel and check your work. You should be keeping an eye on the wheel frequently -- don't just blindly tighten the spokes without seeing if you're making any progress.  ", " Continue this 3-spoke adjustment process until the wobble is gone. You may need to take another set of three spokes and do the same thing. Just remember to keep the forces even, balancing out every adjustment on both sides. Never turn more than a half-turn at a time, and only work on one set of spokes at a time, allowing your to quickly undo something if you make a mistake. You will likely get smaller and smaller adjustments as you work -- using only turning the nipple by small increments. At this point, you should be spinning the wheel after every tightening, making only the smallest adjustments until you hit perfection.   ", " Check for \"flat spot\" wobbles, or a bike that is not \"radially\" true. The most common issue is when the rim wobbles left to right, but bike tires can also wobble up and down as well, forming egg-shaped wheels or small flat spots where the tension isn't quite right up and down. After fixing the rim from side to side, make sure you didn't accidentally pull the wheel out of radial true as well. Usually, you'll have a few simple adjustments to make, but they should be easy.  "], "Fixing Radial (Up and Down) Wobbling": [" Check that the bike is laterally trued first, as best as you can get it. You'll always want to finish laterally truing the bike before attacking a radial wobble. Radial wobbling is when the bicycle rim loses its perfectly round shape, and you can usually feel a little bump when riding. This has more to do with the overall tension on the bike and is easier to fix once you've got side-to-side areas ironed out. ", " Spin the rim and watch it from the side, noting any high spots using calipers or your fingers. Spin the bike and place your finger, a marker, or a set of calipers underneath the wheel, just below where it would touch the tire. Then spin the wheel and note where it rubs against the caliper. This is where the rim has elongated, and you'll need to pull it in to get this bump out of the rim.  ", " Tighten the two spokes that are on either side of the rubbing area with a half turn. One of these spokes will go to the right side of the bike, the other to the left, so tightening them both equally will pull the high spot in without ruing your radial truing. ", " Move the calipers, pen, or your finger closer in, spin the wheel, and adjust as needed. Keep working these two spokes until you've pulled the rub out of the rim, using smaller and smaller are turns (like a quarter-turn) to get more precise truing. After every set of turns, spin the wheel and double-check the lateral truing again, making sure you've not introduced a new wobble.   ", " Check that parts of the wheel don't dive inwards now, making flat spots, and loosen as necessary. This often happens on the opposite side of the wheel as the part you're working on, but it is an easy fix. Just find the two spokes on either side of your low spot and loosen them with quarter turns until you're even again.  "], "Troubleshooting": [" Know when a rim is damaged and not simply out of true. If your wheel can't stay in true, shows noticeable bending or denting, or your spokes won't stay tight, you'll need a new wheel. Oftentimes you'll need to true a wheel after a crash, which can loosen spokes, but it is not always possible. If you find yourself working and working without results, the rim is likely shot.  ", " Tighten any extra-loose spokes until they feel as tense as the rest, then make the finer adjustments. The half turn, two quarter turn system won't work if the spoke is noticeably looser than the rest. Simply tighten this spoke on its own until it feels about as tight as the spokes around it, then move on to the more precise adjustments. ", " Make sure the wheel is seated perfectly and the brakes are even if you can't seem to true the bike. Is the rim really out of true, or do you not have the wheel in the frame properly? The best way to ensure this is to release the wheel as if you were about to take it off the bike. Then squeeze the brakes to hold the bike in the center of the frame. Re-tighten the wheel into the frame and then let go of the brakes, leaving the wheel in the dead center. ", " Replace any broken spokes as soon as you can, as one broken spoke often leads to more. When you lose a spoke, you can keep riding for a bit if you have not other option to get home. But the increased pressure on the other spokes will warp and bend your wheel if left for too long, eventually causing more spokes to break and potentially ruining your rim permanently.  "]}}, "How to Replace Bike Pedals": {"description": "When bike pedals get worn down or loosened, it's time for them to be replaced. Fortunately, you can easily replace your bike pedals at home using a few simple tools. When you replace your bike pedals, take the time to install the new pedals correctly so you don’t have a hard time taking them off in the future.", "content": {"Removing the Old Pedals": [" Secure your bike on a flat surface. If your bike has a kickstand, rest your bike on it. If your bike doesn't have a kickstand, lean it up against a wall or a table so it stays upright.  You can also set the bike upside-down so that it rests on its seat and handlebars. In this case, all directions are the opposite (clockwise instead of anti-clockwise).   ", " Check the pedals to see what kind of spanner (wrench) you’ll need. Look at the space in between the pedal and the crank arm (the metal arm that your pedals are attached to). If you see flats for a spanner (wrench) to grip on, you’ll need to use a pedal spanner (wrench). If you don’t see spanner (wrench) flats, check for a hexagonal Allen-key (wrench) socket at the end of the axle that connects the pedal to the crank arm. If you see the socket, you’ll need an Allen-key (wrench).  If you need to use a pedal spanner (wrench), a 15 mm (0.59 in) wrench will usually work for an adult bike. For some children’s bikes, you will need a in (14 mm) spanner (wrench). Some pedal spanners (wrenches) have openings in both of these standard sizes. A 6 mm (0.24 in) Allen-key (wrench) will usually work for bikes with Allen-key (wrench) sockets. Some bike pedals are designed so you can use either a pedal spanner (wrench) or an Allen-key (wrench). If you see spanner (wrench) flats on your bike pedal, still check the end of the axle to see if there’s an Allen-key (wrench) socket there.  ", " Place the spanner (wrench) on the right pedal. If you’re using a pedal spanner (wrench), wrap the jaws of the spanner (wrench) around the spanner (wrench) flats between the pedal and the crank arm. If you’re using an Allen-key (wrench), insert the hexagonal end of the spanner (wrench) into the Allen-key (wrench) socket on the end of the pedal axle.  Make sure you start with the right pedal. The direction you need to rotate the spanner (wrench) to loosen the right pedal is different to the left pedal.  ", " Rotate the spanner (wrench) counterclockwise to loosen the right pedal. If you’re using a pedal spanner (wrench), make a half rotation and lift the spanner (wrench) off the flats. Hold onto the opposite pedal while you do this to give yourself more leverage. Replace the spanner (wrench) on the flats with the handle back up at the top so you can make another half rotation. Continue to crank the spanner (wrench) counterclockwise until the pedal is fully loosened.  If you’re using an Allen-key (wrench), the socket will likely be on the inside of the pedal spindle. This means you will need to turn the Allen-key (wrench) clockwise (while the spindle itself rotates counterclockwise, from the outside perspective).  ", " Take the right pedal off and set it aside. The pedal should slide out of the hole on the crank arm now that you’ve loosened it. If the pedal is still in good condition, store it somewhere in case you need a pedal in the future.  ", " Repeat on the left pedal but rotate the spanner (wrench) clockwise instead. The thread on the left pedal is the opposite of the thread on the right pedal. This keeps the left pedal from unscrewing as you’re riding your bike. Use the pedal spanner (wrench) or Allen wrench to unscrew the left pedal until it’s completely loosened. Then, pull the pedal out of the hole and set it with the right pedal.  If you’re using an Allen wrench on a socket positioned inside the pedal spindle, you will need to turn it counterclockwise.  "], "Putting on the New Pedals": [" Apply waterproof grease to the bike threads in the pedal holes. The grease will prevent your bike pedals from seizing so you don’t have a hard time getting them off later on. Use enough grease to thinly coat the threads.  You can find waterproof grease online or at your local bike shop.  ", " Insert the threaded end of the new right pedal into the right pedal hole. The right pedal should have a small “R” on it to indicate that it’s the right pedal. Don’t push the pedal into the hole or you could damage the threads. Only the end of the new pedal should be resting in the pedal hole.  Before you start using the wrench, do a few turns by hand to ensure that the threads on the new pedal are aligned correctly.  ", " Place the wrench on the right pedal. If you’re using a pedal wrench, wrap the jaws of the wrench around the wrench flats on the new pedal. If you’re using an Allen wrench, insert the hexagonal end of the wrench through the pedal hole and into the Allen wrench socket on the end of the pedal axle.  ", " Rotate the wrench clockwise to tighten the right pedal into place. Continue to rotate the spanner (wrench) clockwise until the pedal is completely tightened. If you’re using a pedal spanner (wrench), make half rotations and then lift and bring the spanner (wrench) back up to the top of the pedal before you make another half rotation.  ", " Repeat with the left pedal but rotate the spanner (wrench) counterclockwise. Rotate the spanner (wrench) counterclockwise until the left pedal is secure.  ", " Check your pedals to make sure they’re attached correctly. Pull on the pedals gently to make sure they feel secure. If you feel any play (looseness) in the bearing, then the pedals need to be tightened. Turn the pedals on their bearings and make sure they turn smoothly. Newly installed pedals usually do not spin freely, since the bearings need time to break in. You can also check the axel alignment by turning the pedal crank backwards and watching the pedals carefully. They should stay in the same plane, perpendicular to the crank circle, for the entire rotation.  "]}}, "How to Change a Quick Release Skewer": {"description": "A quick release skewer is essentially the axle of a bicycle wheel.This 1927 Italian invention is a rod that is threaded on 1 end and contains a lever-operated cam system on the other end. To change a quick release skewer, you do not need any tools since the lever and cap can be tightened and loosened by hand. If you have never operated this type of apparatus before, you may need to learn how to change a quick release skewer, especially on a bicycle.", "content": {"Steps": [" Push open the quick release lever. This will loosen the skewer. Locate the cap at the opposite end of the skewer, and unscrew it until the wheel falls out of the dropouts. Continue unscrewing the cap until it is completely detached from the skewer threads. Set aside the cap in a place where it will not get lost. If you purchased a new skewer, don't worry about the cap for the old skewer.   ", " Pull the skewer straight out by pulling on the quick release lever. Take off the spring, and clean the skewer at this point if you intend to reuse it. If you are replacing a quick release skewer, set aside or dispose of the old one. ", " Lube the shaft and threads of the skewer with bearing grease.  ", " Insert the skewer into the wheel with the quick release lever facing in the proper direction, which is usually the left side of the bicycle. Put the spring on with the smaller end aiming toward the wheel. Gently compress the spring with the cap, and slowly turn the cap just enough to get it attached without falling off. Put the wheel into the dropouts, and finish tightening the cap.  "]}}, "How to Take the Pedals Off a Bike": {"description": "If you want to upgrade or replace your pedals, you'll need to take them off first. Doing so is fairly simple as long as you know what kind of pedals you have. First, you'll have to figure out whether you need a hex key or 15mm wrench to remove the pedals. Then, it's as simple as unscrewing the pedal with the right tool so that it detaches from the crank.", "content": {"Determining Which Tools You Need": [" Read the bike's instruction manual if it came with one. If your bike came with an instruction or maintenance manual, it will usually have pedal removal and installation instructions. Read these thoroughly to see if there is anything particular that you need to do with your specific bike. The instructions will also detail whether you need a 15mm wrench or a hex key to remove the pedals.  Check to see if the manual has a table of contents so that you can skip to the pedal or crank section. If your bike didn't come with a manual, you can still determine what kind of tools you'll need to remove them.   ", " Look for a hex fitting on the pedal if you don't have a manual. The pedal is attached to the crank by the crank arm. The hex fitting will be located on the end of the crank arm and looks like a hexagonal impression. Most bike pedals require either a 6mm or 8mm hex key to install and remove the pedals.  Popular crank brands that require a hex key include Shimano, Look, and Speedplay.  ", " Get a 15mm wrench if the pedals don't have a hex fitting. Most basic or flat pedals require a 15mm wrench rather than a hex key. You can purchase a 15mm pedal spanner, which is specifically used for bike repairs, or you can use a standard 15mm wrench to remove your pedals.  "], "Taking the Pedals off with a Hex Key": [" Fit a 6mm and 8mm hex key into the fitting to see which one you need. If you're unsure of which sized hex key you need, figure it out by inserting both a 6mm and 8mm hex key into the hex fitting on the end of the crank arm. The hex key should fit snugly in the fitting and allow you to rotate the bolt that holds the pedal in place. ", " Rotate the hex key clockwise in the left pedal to loosen the pedal. Insert the appropriately sized key into the hex fitting. Rotate the hex key clockwise while holding the pedal in place to loosen it. Continue rotating the hex key until the pedal comes loose.  The left pedal is sometimes marked with an “L.” Rotating the crank so that the pedal is in a downward position may make it easier to remove it.  ", " Loosen the right pedal by turning the hex key counterclockwise. Go over to the other side of the bike and fit the hex key into the fitting on the end of the crank arm. Usually, the right pedal is on the same side as your chainrings. Turn the key counterclockwise to loosen the pedal. Then, continue turning the hex key until the pedal comes loose enough to take off the crank.  The right pedal will be on the same side as the chainring and is sometimes marked with an “R.”  "], "Removing Pedals with a 15mm Wrench": [" Set the bike to a high gear to shift the chain to the biggest ring. Once you set the bike to a high gear, rotate the pedals a few times so that the chain shifts to the largest ring. This will give you more room and will make it easier to remove the pedals.  If your bike doesn't have different gears, skip this step.  ", " Lift up the back wheel on the bike. Hang your bike from a bike rack or you can hang the saddle on the edge of a table or workbench while you remove the pedals. Lifting up the back wheel as you work will keep the bike still even if you pedal the bike forward or rotate the crank. This will make removing the pedals with a wrench much easier.  ", " Position a 15mm wrench between the right pedal and crank arm. The right pedal will be on the same side as your chainring. The pedal is attached to the bike's crank with a 2–3 in (5.1–7.6 cm) crank arm. Fit the 15mm wrench around the fitting where the pedal and crank arm are connected.  Rotate the pedals in a slightly forward position to make rotating the wrench easier.  ", " Pull up on the wrench to loosen the pedal. Once the crank arm is in place, pull up on the handle to loosen the bolt connecting the pedal to the crank arm. The pedal will start unthreading from the crank arm when you rotate the wrench counterclockwise. You should feel the pedal come loose after a single rotation with the wrench.  ", " Hold the pedal and rotate the crank forward to remove it. Push on the pedals so that you rotate the crank as if you were riding the bike. Hold the pedal and wrench in place and continue pedaling the bike forward until the pedal comes completely off.  ", " Turn the wrench clockwise on the left pedal to remove it. Go over to the other side of the bike and repeat the process to remove the non-drive (left) pedal of the bike. Pull up on the wrench to loosen the bolt. Then, hold the pedal in place so that it doesn't rotate as you pedal the bike forward to completely unscrew the left pedal. "]}}, "How to Adjust Disc Brakes on a Bike": {"description": "Disc brakes are one of the most common types of brakes found on bicycles. This style of brake has 2 pads that press on either side of the wheel’s rotor (a flat, perforated metal disc) to slow down the bike. Disc brakes come in 2 common varieties: hydraulic and mechanical. If your brakes aren’t working as well as you’d like them to or if they’re rubbing on the rotor when you ride the bike, you can adjust them yourself with an Allen wrench.", "content": {"Assessing Your Brakes": [" Flip your bike upside down or set it in a bike stand. When you adjust your bicycle’s disc brakes, the wheel should be elevated off of the ground so it can spin freely. If you have a bike stand, put your bike in the stand so it’s held in place and elevated off the ground. If you do not have a bike stand, just flip your bike upside down so that the seat and handlebars are on the ground and the wheels are sticking up.  Portable bike stands are sold at most sporting goods stores. They typically cost between $35–50 USD.   ", " Figure out which style of disc brakes you have. Look closely at the caliper at the center of each of your bicycle’s wheels. If the bike’s calipers have a small cable running to them, they are mechanical. If the calipers don’t have any attached cables, they’re hydraulic. If you’re still not sure which style you have, snap a photo of your bike’s brakes and take it to a local cycling shop.  The caliper looks like a small box about 3 inches (7.6 cm) long that sandwiches the rotor. The caliper is the mechanical device that puts pressure on the rotor and slows down your bicycle.  ", " Tighten your wheel in the drop house before adjusting the brakes. A bike’s drop house is the y-shaped frame that the wheel sits between. The drop house attaches to both sides of the wheel and keeps it connected to the bike. Make sure that the wheel is firmly in place by turning the lever on the side of the wheel clockwise. Once you’ve tightened the wheel, fold the lever in until it’s flush with the wheel.  On some older styles of bike, you may need to tighten the wheel in the drop house manually with an Allen wrench.  ", " Avoid touching the edge of the rotor so you don’t cut yourself. The rotor (the circular metal disc that disc brakes apply force to) can be very sharp. As you’re adjusting your disc brakes, try not to touch the edge of the disc. Hold the disc by placing your thumb and fingers on the disc’s 2 flat sides.  If you do get a cut, stop and wash it with soap. Bandage the small wound before you finish adjusting the brakes.  "], "Adjusting Hydraulic Brakes": [" Loosen the 2 bolts on the side of your caliper if the brakes rub. If you can hear your disc brakes rubbing as you drive your bike around, it’s a sign that the brakes are too tight. Inspect the caliper and find both of the inch (0.32 cm) hex bolts that hold the caliper to the frame. Insert an Allen wrench of the corresponding size and twist it a half turn counterclockwise. This should loosen the brakes enough that they stop rubbing.  It’s possible that the disc brakes are too tight on only 1 wheel. In this case, you will not need to tighten the brake on your other wheel.  ", " Squeeze the brake lever 2–3 times to center the caliper on the rotor. After you’ve loosened the 2 hex bolts, squeeze the brake lever that corresponds with the wheel you’re adjusting. If you bumped the caliper while you were loosening it, this will re-center it on the rotor disc. On the last squeeze, keep pressure on the brake lever.  The right-hand brake lever controls the rear brake and the left-hand brake lever controls the front brake.  ", " Tighten the bolts by a half turn before releasing the lever. With the corresponding brake lever held down, again insert the Allen wrench into 1 of the 2 hex bolts. This time, turn the wrench a half turn clockwise to tighten the caliper around the rotor. Tighten the second hex bolts as well.  If you need to work on both the front and rear brakes at the same time, have a friend hold the brake levers while you work on the calipers.  ", " Spin the wheel to make sure that the rubbing has stopped. Make sure that the wheel is unimpeded and can turn freely. Give the wheel a firm spin (in either direction). Listen for the sound of rubbing.  If the disc brakes no longer rub, you’ve adjusted them successfully!  ", " Align the caliper visually over the rotor if the brakes still rub. If the brakes continue to rub, loosen the bolts by a quarter turn. Look down from the top of the caliper and visually align it so that it sits directly over the rotor. With the brake lever held down, fine tune the position of the caliper so that it’s fully centered. Then, tighten the hex bolts a quarter turn.  Again test the brakes by spinning the wheel and listening for the sound of rubbing brakes.  "], "Tweaking Mechanical Brakes": [" Loosen the small set screw found on the side of the caliper. Some models of mechanical disc brakes have a small “set” screw that clamps down on the caliper’s adjustment dial to prevent it from loosening while you’re riding the bike around. Use a small Philips head screwdriver to turn the set screw 1–2 full rotations counterclockwise.  Not all bikes with mechanical disc brakes have a set screw on the caliper. If yours doesn’t, you can skip this step.  ", " Twist the adjustment dial on the side of the caliper to adjust the brakes. Most bikes with mechanical disc brakes have a 1 inch (2.5 cm) wide plastic dial on the side of the caliper (right next to the wheel’s spokes). Turn the wheel clockwise to move the brake pad closer to the rotor and counterclockwise to move it farther away from the rotor.  In some cases, bikes with mechanical disc brakes may not have an adjustment dial on the side of the caliper. In this case, there will be a hex bolt on the caliper that fills the same function.  ", " Adjust the dial until the caliper is centered directly over the metal rotor. It typically takes some fiddling to line the caliper so it’s centered over the rotor. Periodically give the bike’s wheel a spin and visually inspect the brake pad so that you can tell if the pad is rubbing on the disc brake.  Most rotors aren’t perfectly flat, so don’t worry if you see a small amount of wobble as the rotor spins.  ", " Squeeze the brake lever to make sure that the brakes tighten. Give the lever that corresponds to the brake that you’re adjusting a firm squeeze. The 2 pads should tighten on either side of the rotor. Both of the pads should touch the rotor disc at the same time; if 1 touches before the other, the rotor isn’t properly centered beneath the caliper.  The right-hand brake lever works the rear brake, and the left-hand brake lever works the front brake.  ", " Tighten the hex bolts and the set screw before riding your bike. Use your Allen wrench to turn the 2 hex nuts on the side of the caliper clockwise. Even if you didn’t loosen them when you were adjusting your mechanical disc brakes, check to make sure that the hex bolts are tight. Also use your screwdriver to tighten the small set screw that you loosened earlier.  Once you’ve tightened the bolts, the bike should be ready to ride!  "]}}, "How to Replace Bicycle Trailer Bearings": {"description": "While top-end bicycle trailers like those made by Bob and Burley have replacement parts available, the commodity trailers from the local discount store, on the other hand, are almost impossible to find information on, let alone buy replacement axles or wheels for. Here's how to demystify and overhaul a common design of bicycle trailer wheel.", "content": {"Steps": [" Remove the hitch pin from the 1/2 inch (12.7mm) axle bolt.  ", " Remove the wheel from the trailer .  ", " Setting the retaining ring pliers to \"external\", remove the snap ring.  ", " Using a mallet or other heavy tool, tap out the axle bolt. If wheel is asymmetrical, note carefully which side the bolt head goes into. On this trailer, the bolt head goes on the flatter side of the wheel. ", " Remove washers and set them aside where they won't get lost.  ", " Pry or push out the old bearing. See \"Tips\" for ideas on how to go about doing this. ", " Clean any goop out of the wheel using a small screwdriver , solvents, rags, or whatever you have.  ", " Repeat the previous two steps on the other side, assuming there are bearing assemblies on each side of the wheel.  ", " Buy new bearings . This model uses US standard 1/2\" (12.7mm) ID, 1-1/8\" (28.5mm) OD radial bearing assemblies. ", " Insert the new bearings into each side of the wheel. If you have a socket the same size as the outer diameter of the bearing, and a mallet, then position the socket onto the bearing and tap firmly with the mallet until it's seated. Otherwise use whatever you have. ", " Reinsert the axle bolt into the wheel assembly.  ", " Replace the washers in the same order they were removed.  ", " Seat the snap ring. You may need to push it firmly onto the shaft using a screwdriver or other tool until it snaps into the groove. ", " Lubricate it. Adding some lubricant will save you from having to do this again soon. ", " Put the wheel assembly back into the trailer.  ", " Secure the axle with its hitch pin.  "]}}}