{"How to Build a Float": {"description": "Building a float for the local holiday parade is one of those projects which require careful planning, teamwork, design, and lots of effort.  Get your materials and helpers together before you dive into the project for a successful venture.", "content": {"Steps": [" Contact the Parade Organizers. Many times, the parade committee will have resources to help you build your float.  They should also have entry information (time to be at the formation area, insurance waivers, vehicle or decorating requirements) and the rules and regulations to ensure a safe parade.  ", " Choose the theme for your float. This will depend on the type of parade or venue you will be displaying it in.  A sports theme or Christmas float will not fit in well at a Mardi Gras parade.  Be realistic in the scope of your project.  If you have a certain message you hope your float conveys, whether it is Christmas greetings or a patriotic theme, think small for your first venture into this type of project.  ", " Form a design team to work out the list of materials you will need and to assign specific work areas. The complexity of the project may require painters, model builders, carpenters, and the like.  Having someone talented or skilled in these areas will make the job much easier. ", " Find funding for the project. Crepe paper, craft paper, flame retardant Floral Sheeting, poultry netting, paint, lumber, and all the other materials you may find you need are not cheap.  Some local businesses like craft shops and hardware stores may be willing to donate, especially if their name can be incorporated as advertising in some non-obtrusive manner. ", " Pick the platform for your float. Usually, this is a flatbed trailer of some sort, and it needs to be available for a fairly long period, and be in good condition.  No parade master appreciates a broken down float in their show. Make sure your platform's axle is rated for the amount of weight you putting on it.  ", " Find a garage or other \"out-of-the-weather\" location for your work. You will need room to fabricate the details of your float, as well as to set up your trailer for the actual installation of them.  ", " Get your workers together. If you are in a club, school class, or other organization, schedule work times and try to get commitments from the volunteers who sign on to help.  This is where good leadership will come in handy.  ", " Skirt it. Many floats are skirted with either plywood with fringe stapled on the bottom edge; extra-long fringe or table skirting; or poultry netting, a.k.a Chicken Wire with 1\" holes wrapped around the base of the trailer hanging down close to the ground.  Tissue paper \"pomps\" can be \"gathered\" to tuck into the holes in the poultry netting to make colorful designs, spell out messages, or form other artwork.  ", " Set up platforms or stages. If you are building a multilevel float, you will want to build frames to support each \"stage\", or deck.  This can be done using 2x4 lumber framing with a plywood decking and should use material strong enough to support anything which will set upon this deck or be built above it. You could also stack pallets and secure them together and to the deck. Usually, each tier, or stage, will have its skirt or wall of sorts around it. ", " Hook up lights or sound systems if you desire them. Sometimes, a small portable generator can be either concealed in the framework of your float or carried in the back of the truck towing the float with an extension cord running to the electrical devices that you need power for. You may want to ask the parade organizers if they have a qualified electrician to ask questions or take a look at your work. All cord and cables should be secured to prevent pinching, dragging and disconnection. The generator should be well-ventilated, far away from the passenger compartment, as quiet as possible, and operated where there is no risk of fire or fumes accumulating from it. ", " Take it on a test run. Ideally, you can find an out of the way place to make a practice pull of your new float.  This will give you a chance to see if all of the decorations are securely attached and find out how it handles.  Depending on how large and elaborate your float is, you may find you need a more powerful vehicle to tow it. ", " Go to the parade and show off your awesome, new float!  "]}}, "How to Organize a Parade": {"description": "Parades can be organized for any occasion, whether it be to celebrate a holiday, a special tradition, or even to honor a loved one or notable figure in a community. No matter what the occasion, organizing a parade may involve much planning and be somewhat overwhelming for those who need guidance on how to get started. Here are some tips on how to effectively and efficiently organize a parade.", "content": {"Steps": [" Determine a parade theme. Consider a theme you and others will feel comfortable with planning.   ", " Decide on the magnitude of the parade. Consider if you want to organize a parade for the neighborhood or a larger-scale parade for the entire town or city. ", " Set a time and date for the parade. Give yourself the time you need to organize the parade, whether it be a few months or a few weeks. In order to have an audience, you will need to advertise your parade far in advance so people can make plans. Announce your parade in a local newspaper or post fliers and signs around your town or neighborhood.  ", " Establish a parade committee. Depending on the size of your parade, you may need to pull together a group of people to work with you on organizing the parade. Not only will a committee help you plan for the parade, but they will also assist with clean-up, building floats and more.  ", " Set budgets and obtain permits. To organize large-scale parades in a town or city, you will need to obtain special permits to use public streets, erect barriers and hire security or police officers to control crowds and traffic.  ", " Set up a marching registration sheet. Finding out how many participants you have in advance will allow you to set time constraints in place. ", " Organize the timeline of the parade. Depending on the amount of participants and time allotted for the parade, you will need to plan accordingly; such as determining how fast floats will travel and how far apart to space each participant. ", " Set up rules and guidelines for all participants. Establish guidelines around appropriate costumes, advertising limits, or even alcohol limits, depending on the parade theme.  ", " Seek out parade sponsors. If you plan on having floats in your parade, some local car dealerships may want to lend cars to the participants in your parade for advertising purposes. Be sure to mention your sponsors in parade fliers or brochures.  ", " Generate excitement. As the day of your parade closely approaches, generate a buzz in your community by hanging banners and posting signs on the parade route. "]}}, "How to Attend the Macy's Thanksgiving Day Parade": {"description": "With the event of Thanksgiving Day in New York, comes the sight of the Macy's Thanksgiving Day parade. If you are an American who lives on the eastern seaboard, you're probably thinking about attending it, but don't know how. Well, this article has your answers. Start reading step 1 below and follow along.", "content": {"Steps": [" Determine the parade route. Although things changed in 2013 for the parade route, the newest parade route tends to be to march from the corner of 77th St and Central Park West to the southern edge of the park near Columbus Circle, then walk East to 6th Avenue/Avenue of the Americas and continue South to 34th Street, making an appearance at 42nd Street, and continuing on till they reach Herald Square and the big Macy's New York Headquarters area at 151 West 34th Street. The parade route is about two and a half miles and it takes about ninety minutes for the walkers to walk this route.   ", " Research the hotels and motels along most of the parade route. Hotels here are a little light, and where they exist, it's \"mom and pop\" hotels that you would never have guessed in a million years could have been a hotel to exist at the location. Bigger hotel chains do exist but are a few blocks from most of the famous sites in New York City near the parade route including a Quality Inn within 10 blocks from New York's Penn Station train station and about 10-12 blocks from Macy's. You'll have to do a little more searching by Macy's address to find major hotel brands nearest the street address on the major hotel brands' websites to find spots to relax. ", " Camp out in a hotel room not far from your parade route spot from about 10 pm the Wednesday night before until at least 5 am on Thanksgiving.  ", " Give yourself ample hours of additional wait-time before the parade, to ensure you are in the proper viewing spot with a great viewing angle. There are masses of people that line the sidewalks along both sides of the parade route, and getting to there super-early is crucial to seeing the parade. Don't pick a fight if you don't get to your predetermined area at the same time as that of others that have reached to your spot first. Tensions always grow, and sometimes walking a few parade route light-poles down/up from your predetermined spot can help you achieve what you need to achieve to ensure that you get the same results as that of your predetermined spot the day before, before hair flies. Don't look like you are lurking around just waiting for your spot to become free. If police spot you, it's hard to explain to them what you are doing and explain that you were waiting for the parade to begin.  ", " Ensure that you will be warm enough to attend the parade the next day. Find out the forecast for the next day. End of November temperatures for New York City tend to be quite chilly, and sometimes even some snow begins to fall. Although few snowfalls tend to graduate to more than a general dusting (or half an inch in spots), it's crucial that you know what to expect during your few days of camping out. Bundle up in several layers of warmth. Don't expect warm weather. Your time spent there will be super-chilly. Use at least 3 additional layers of jackets and sweaters as you would have otherwise used during other camping sessions. Dress children in 2 or more footed blanket sleepers 1-2 winter-weight jackets and at least one pair of \"bib-style\" snow pants.  ", " Plan on a long day the following day (Thanksgiving Day). The parade lasts about 2-3 hours, but it's an exciting few hours that is well needed for most. You'll know later, that it's over when you see Santa arrive on his annual float into the Square.  ", " Try to wake up several hours before the parade.  "]}}, "How to Get the Best Open Seat for a Disney Parks Parade": {"description": "Finding an empty and great seat at a Disney Parks parade may be tough, but after you read and follow these directions in this article, you're long-lasting search should become over and you'll be able to sit for one without fighting someone for the spot.", "content": {"Steps": [" Visit the Disney Park that the parade will be shown in.   ", " Pick up a brochure (that contains the park map of your language) upon entry. Disney Parks park maps aren't just written in English and Spanish.  They also have a variety of other languages to choose from, but you'll have to scout out additional languages that the brochure is written in, to find out the information you'll need later. ", " Look for the parade route on the park map. The parade route will be marked on the map by some type of dotted or broken line.  Parade routes differ between the different parks.  Whether it's the Magic Kingdom in Florida to Disneyland in California to California Adventure across the walkway, or if any of these compared to Disney's Disney-Studios/MGM or Disney's Animal Kingdom they all contain different routes, and you should be aware of these routes. ", " Look at the Times Guide brochure for the parade times. Most Disney parks parades are given twice a day. It will likely list the two parade times when the parades will be given.  Generally, if the parade marchers march one way, they'll tend to march the other way come later in the day to return to \"home-base\". ", " Stake out some of the viewing locations for the one parade. Look for benches that seem to be crowded with people, and even where people tend to \"sit\" at least 30 minutes before. ", " Look for key signs that a parade might be taking place within the right area. Not only will you tend to see people sitting on benches, but in some places there may be places where people tend to sit (near the edge of the sidewalk). Look for those tape markings can give you signs that a parade will soon be marching along the area where you are presently walking. Disney park Cast Members don't want anyone to sit on the edge of a sidewalk near the parade and will usher you back from it. They will mark it with a special \"special event ongoing tape\")) to mark the parade route. Another key aspect to look for is the possibility of seeing street-car like rails tucked into the streets.  These are regularly used for each of the floats that most of the Disney parades carry.  ", " Look for spaces to the left and right of the park benches, if the benches themselves are filled up seconds after the last parade moves forward from the point of the pole-bearer (\"The End\" bar and sign) forward.  ", " Try to always arrive at these benches at least two hours before the second parade comes through, and don't ever leave the space unmanned unless another credible person in your party can honestly save you your seat.  "]}}, "How to March in a Parade With a Marching Band": {"description": "Parades can be a nice change frommarching drill, but they come with their own set of possible horrors... the heat, the distance, and the crowd can often be a lot to deal with. However, parades can also be very enjoyable, if you're prepared.", "content": {"Steps": [" Know your fundamentals of marching well. This may seem obvious, but depending on what your band was doing before the parade, a refresher course in marching 8/5 in a block may be in order. You may also have to perform basic moves that aren't used much in shows, which some members (especially the rookies) might not remember.  ", " Have your uniform in order. Be sure to know what you're supposed to wear, especially if your band has multiple uniforms (for instance, a casual summer uniform and a full uniform). If you have to wash anything, make sure you do so well in advance. Girls may need to braid or otherwise style their hair. Your band director may ask you to not wear any jewelry if the parade is on the somber side. If it's a themed or holiday parade (like a holiday parade), you might be asked to wear a Santa hat or something else for the occasion. If you like this idea and nobody's said anything, suggest it yourself! ", " Dress for maximum comfort. Wear thick socks that will cushion your feet. Pick comfortable clothes to wear under your uniform pants (if applicable). If you're allowed to, you may wish to wear sunglasses. In an extremely casual parade (meaning no uniform to speak of), wear loose-fitting, light colored clothing, the sturdiest shoes you own, and you might even be able to pull off a water backpack. ", " Keep hydrated and eat right .  Drink lots of water the day before and the morning of the parade. Drink water as much as possible right up until the moment you step off. If possible, keep a bottle of it somewhere in your uniform, or wear a water backpack if it is allowed. Avoid dairy products right before the parade, because they'll make you sick if you're out in the sun for a long period of time. ", " Know the song line-up. Getting lost or playing the wrong song during a parade can be very confusing and embarrassing. If possible and necessary, try to write it on whichever hand you'll have the best view of. If you'll be marching with a flipbook, put your music in order before the day of the parade. ", " Stay in step. If you step off at the right time and keep the beat under your feet, this shouldn't be a problem. However, you might want to look down at the person's feet in front of you or at the drum major (if yours is marching backwards and conducting) every once in a while. Remember, odd numbered beats are \"left\", evens are \"right\" (in key signatures based on multiples of four... this doesn't work in 3/4). If you realize you're out of step, try to do a subtle skip or change your step size for a moment to fix it. ", " Use your peripheral vision and keep the lines dressed. You will most likely be marching in a large block. The whole time you're moving, you'll have to frequently check to make sure you're still in line with the people in front of you and on either size of you, you're still in your diagonal, and the intervals between people are still correct. Your peripheral vision will also allow you to see any incoming clowns or others who are trying to be funny by messing with your instrument (glare at them, and if that doesn't work, get rid of them as discreetly as possible). ", " After the parade, take care of your instrument, then sit down, rest your feet, and drink water to compensate for whatever you may have lost through sweating. Congratulations, it's over! "]}}, "How to March in New York City's Annual St. Patrick's Day Parade": {"description": "Not Irish and still want to be included in one of the biggest partying days of the year while also faking it till you make it as a person of Irish-American heritage? Irish and want to march it out? If you happen to find yourself in New York City during the month of March, or better yet, the week of March 17th, see if you can too, march in the parade; a parade pre-dating our country!", "content": {"Steps": [" Find an association in which you can be affiliated with (as the St. Patrick Parade is a private one). Also you can find a friend or someone you know who is in an organization that marches and go with them.  ", " Wake up and have an Irish Scone with Irish Butter and Irish Coffee.  ", " Shower with Irish Spring soap.  ", " Check up with the details and know you're destination (where (if your organization has one) your reception is and where you're organization would be leaving (start walking into the parade from) which will typically be outside of where you are having the reception.  ", " Leave early so you can get there early and without rushing.  ", " Take the train / subways so you can also get to your destination conveniently.  ", " Get there.  ", " Wait.  ", " When everyone starts walking and things kick up, follow! Obviously. It is a parade after all. There will always be people in the forefront so don't worry of not knowing where to go. ", " Have fun! Wave at the onlookers and march on the outside so you can give high fives to all the enthusiastic people in the crowds! ", " Find a good bar or restaurant. Your pick will depend on your budget and the way you want to celebrate. If you want more of a frat kind of feel to drinking and being \"Irish\", go to the plethora of bars with cramped, jam-packed bodies and no room to breathe. If you want more of a classy way to celebrate, are hungry and have quite a bit more money, try going to a nice restaurant or steakhouse. I recommend: The Atlantic Grill, Smith & Wolensky's, and Rothman's. Any other restaurants you find you like, will do just fine. Just make sure to not go to an Italian or Chinese restaurant or anything with ethnic foods because, although those foods are extremely tasty as well, on this one day to celebrate Irish heritage, it would defeat the purpose. Go to a neutral place at best. ", " If you can find a party, awesome! ! Have at it! Don't forget to be responsible! ;) ", " Have fun!  "]}}}