{"How to Do a Kip Up (Kick Up)": {"description": "Ever see a Jackie Chan movie and wonder how he goes from lying flat on his back to standing up in a flash? It looks like he jumps up from the floor effortlessly, but you can do it too with a little practice!", "content": {"Starting Face-Up": [" Lie flat on your back. Get into a neutral position, with your legs straight out and your arms extended comfortably at your sides.  ", " Pull your legs up to your chest. They can be bent at the knees, or (if you're really flexible) kept straight.  ", " Put your hands flat on the ground, next to your ears. Keep your fingers pointed toward the tops of your shoulders.  ", " Roll back so that all of your weight is on your shoulders. Your spine beneath your shoulders and your rear should be in the air.  ", " Kick your legs up directly into the air. The most important part is to kick upwards as hard as you can, at an angle.  Your body should fly into the air from the force of you kicking your legs.  ", " Push hard with your hands as soon as you feel your momentum shifting upwards. Picture that you're doing a backwards push-up, and push as hard as you can.  Try to make this movement as explosive as possible. There's no turning back at this point — you either complete the kick-up or land flat on your back.  Time to give it your all!  ", " Land in a squat. When you feel that sensation of weightlessness just before you're about to fall downwards, pull your legs downward as quickly as you can.  Snap them down hard, and the momentum will cause the rest of your body to whirl upwards (land on your toes first).  You'll suddenly, almost magically, be on your feet.  "], "Starting Face-Down": [" Lie face-down on the floor. Face forward but keep your neck comfortable; your chin should point downward without touching the floor. Keep your arms on the floor and bent in front of you, so that your hands are just beyond your face. ", " Bend your legs at the knees and curl them up. Your heels should be touching the back of your thighs.  ", " Put your hands flat on the ground, next to your ears. For a face-down kip-up, you can use flat palms or fists — whichever works best for you.  ", " Kick back hard with your legs, while pushing up with your hands. Move your arms like you're doing a pushup, while flipping your legs back hard.  Between the momentum in your legs and the slight push upwards from your hands, you should be able to flip into a squatting position.  "]}}, "How to Get Started in Parkour or Free Running": {"description": "Parkour, or free running, is a movement style that turns real life into an obstacle course. Parkour artists train themselves to do crazy, sometimes death-defying stunts with freedom as the guiding principle. Though it may seem intimidating, just about anyone can become a free runner if they're willing to put in the time and effort.", "content": {"Teach Yourself": [" Get in shape. You must have endurance. Work on basic calisthenics like push-ups, pull-ups, sit-ups and squats. These are the basic building blocks for practicing parkour. Experts say you should be capable of performing 25 push-ups, 5 pull-ups and 50 full squats before you formally get started in parkour.  ", " Practice landing and rolling moves. Parkour entails a lot of vertical movement. High jumps can be painful if you don't know how to land properly or safely fall, then end with a move. You should start off with a jump between 1/2 a meter to 1 meter. Land on the front part of your feet with your legs bent and if you have jumped from a higher distance then perform a forwards roll. To do this roll you should roll on your shoulders, not on your back! If you roll on your back, you may do serious damage to your body. ", " Practice vaulting, jumping and climbing maneuvers. These more difficult maneuvers are designed to get you up and around obstacles in the urban landscape. As you begin to practice more frequently, you will learn which moves you prefer and develop your own unique style for practicing them. ", " Practice regularly. Like all sports, parkour requires regular training to be effective, otherwise your skills will drop off. Practice at least two or three times a week, and make sure to maintain your basic skills while moving on to more difficult maneuvers. ", " Use self-exploration. Begin to drill the techniques that you have created, establish new ways of moving through experimentation, and find new paths and environments to master through self exploration. When you are in tune with yourself, no one knows what works better for your body than you. ", " Pick a point and do whatever it takes to get there. Start with a slow, safe pace. Trace a path between two points over and over until you are a master of your territory. You should notice a gradual increase in your speed, endurance, and the ease with which you transition between obstacles. This progression can take hours, days, and even years depending on the path you choose, your natural ability, and several other factors. The important thing is to continue progressing no matter how slowly. This method is the essence of Parkour, and will lay the foundation to understand it.  ", " Develop your personal style. Approach obstacles in a way that is unique to your body and abilities. The common movements employed by others do not necessarily make sense for you. That is precisely why it does not make sense to rely on videos as a way to learn. Once you have overcome this mental obstacle and risen above the poor standards set by many others, you can take your training in many different directions. "], "Group Training and Coaching": [" Start to train with other people. Getting together with a small group (2-4 people) can shed new light on your training regimen; new people offer new ways to move, different paths to take, and constructive criticism of your methods. Since you have already developed your own style, the ideas offered by new people can only expand your possibilities. ", " Use training as a collaboration. Be sure that ideas are not stifled and no individual person sets the bar of what should work for everyone; this method works best as a creative discovery between friends. On the other hand, if you followed someone else's method from the beginning, you could be stuck with a style that does not actually make sense for you. Remember that while large gatherings have the potential to be an extension of the smaller training and discovery sessions, too often they devolve into a roaming herd that quickly grazes over obstacles while looking for the next big trick. Understanding Parkour through self discovery is the sure way to avoid falling victim to this personal experience, making a traceur and his Parkour unique.  ", " Get a Parkour coach. This option can be helpful to someone who doesn't know how to condition themselves or prevent injury; however, experimenting by yourself first is highly recommended. By entrusting your early development to a stranger, you run the risk of following a path that is completely wrong for you; a good coach will help you get started and drill you in the essential moves necessary to begin parkour and will also teach you how to stay safe. A good coach will set you down the path of discovery and help you form your own style, while a bad coach will set you down their own path. As Parkour gets more popular, an increasing number of people are trying to cash in as coaches. Be wary of anyone who doesn't offer their services for free, at least part of the time. A coach who is still connected to the community, through free outdoor training sessions , is a good bet.  "], "Common Methods For Succeeding in Parkour": [" Tread lightly. Some surfaces take damage more easily than others; be respectful of where and how you interact with your environment, and take responsibility if you accidentally damage something. Check out the surface you are on or will be going on, before trying anything remotely dangerous on it. Importantly, that surface may also be slippery, fragile or unstable, so survey the area first. If you slip or something moves/breaks under you it could cause a painful fall. ", " Get the proper gear. You won't need much. All you need is a good pair of running shoes and an outfit you're comfortable moving and exercising in. ", " Begin by choosing A and B. Try to trace a path from A to B. Go through the path and do everything that feels natural in that situation. Parkour is not a set of vaults, movements or \"stunts.\" It is a way of moving, and moving is always changing, and no set motions could be ready to meet the quota. A good way to find ways to get there is trying different ways and consider what is efficient and fast. ", " Develop flow. This is what separates traceurs from your average trickster or acrobat. Flow is the flawless transition from one obstacle to the next, to the point where there might as well not be any obstacles at all. Flow can be practiced simply by adding good form and correct technique, thus creating fluidity to all of your movements. This includes soft landings (as opposed to stomping down or falling). ", " Exercise regularly . Make sure to keep yourself in peak physical condition. Traceurs and traceuses use most of their body in order to navigate any obstacle. This level of involvement requires total body fitness. ", " Practice regularly. Find a spot that you can come to every day to train. Good areas include diverse obstacles (walls, rails, etc). Your overall goal is to find creative ways to make it through the \"sea\" of obstacles using your body in any way necessary. "]}}, "How to Parkour": {"description": "Parkour is a natural method for training the human body to be able to leap and move from place to place by climbing, jumping and flipping. This 'art of displacement' requires neither specific structures nor accessories for its practice: The body is the only tool. It takes perseverance, guts, and discipline, but the end is rewarding.", "content": {"Gathering Your Materials": [" Invest in a good pair of shoes. You want a pair that has decent grip and shock absorption (forefoot absorption, too!) -- no skating, soccer, or football shoes. The ones you'll be wearing need to be flexible and light; it's less about protection and more about morphing with your foot to the surface. It is also recommended by many top traceurs (those who practice parkour) to have a shoe that does not have hard plastic in the center of the arch as this will cause your ability to balance on things such as rails to decrease significantly as well as raising the chance for injury.  A shoe with a good flat sole and as few pieces of rubber as possible is preferable as the little rubber nubs as seen on most running shoes will tear off with ease when training.   Ideally the sole of your shoe should have one to two piece of solid rubber that way it will not tear free as easily and you will get more use from your shoe. You may want good toe bumpers to cushion your cat leaps. And, of course, regardless of the shoe, if it doesn't fit well, it won't work. The shoes must be snug or else you are increasing your risk of injury on landings. Don't concern yourself with brand names. If you are practicing as much as you should be, you will wear those suckers out in a few months. In addition, since you will be practicing outside, they are going to get dirty. Do not waste money on the looks of your feet.   ", " Get some comfortable clothes. As long as you can move quickly and your clothes are not restrictive, you are good to go. Just make sure they stay on and you will not find yourself messing with them as you move.  Climbing pants, since they allow you to move freely, and are durable, fit well, and don't get in your way. Gramicci, Prana stretch Zion pants (good), North Face, and Arborwear are recommended. Dickies are also durable and offer free-range of motion. Jeans are not recommended, as they are too stiff and do not allow enough freedom of movement. Again, if you have that favorite pair of sweats (that stays up!), go for it. Shirts do not have to be anything fancy, but it is good to have a sweat wicking type. REI and running shoe stores have these. Consider wearing long sleeves to prevent scrapes while first learning.  You are going to want to stay cool, so you'll probably want to don cotton.  ", " Consider wearing gloves as a beginner. Gloves are not a necessity, and many advanced practitioners skip gloves so they can get a better feel for the way a surface feels. That being said, when you're first starting out, wearing gloves can be a good way to avoid some serious scrapes and cuts that would prevent you from continuing for several weeks.  Even if you wear gloves as a beginner, you may eventually decide to ditch them. For the first few weeks afterward, you may come home seeking the ice pack. Soon enough, though, your hands will get used to the work you are putting them through.  ", " Find a friend. Not only will your friend help keep you motivated, but they will show you things that did not even occur to you, forcing you to learn. Another choice is a Parkour coach. Someone who has been in the game for a while will be an invaluable resource in shortening your learning curve -- and they will help keep you from getting hurt. If your social network isn't pulsing with the energy of a thousand traceurs, start doing some research; there are Parkour groups worldwide that are always looking for new members.  ", " Find a few places to train. Find some area of the concrete jungle that looks enough like a maze but poses less of a challenge (and danger) than the Great Wall of China. Once you have found one, find another. You will need various obstacles to keep your mind and skills fresh. Before you go darting from parking garage to parking garage, however, try mastering your way through a park first. Grass stains are a lot easier to take care of than broken femurs. Stay off private property. The police will not look at you and go, \"Sweet, man! How would you get your leaps to look like that? Can I take a look at the definition in your calf muscles?\" If trouble does find you, be polite and go on your merry way. Few will understand the purpose of what you are doing, and that is fine.  "], "Learning the Moves": [" Start slowly. If you injure yourself, you are out for good. Do not tackle an obstacle you you be able to do. Your nerves may get the better of you and get the better of your landing. Even if you think that you are not getting hurt, you may need to think of some of the long-term effects of the things you are doing to your body. You need to condition and make your body used to doing certain things without over-stretching or bruising it.  Start exploring what your body is comfortable with. How high and far can you jump? How quickly can you get into a roll? You will find the techniques to start with and what techniques need more work. It will also help you gain awareness of your body and body control.  ", " Master the landing. There is a basic landing that you will be incorporating into all basic drops. The principles of this basic landing will be used for the advanced landing (the Parkour roll) as well. Therefore, it is important you learn and master this technique first. There are four main key points you always want to remember:  1) When you land, your legs will be about shoulder width apart. 2) You must land on the balls of your feet. That way your body will act like a spring and distribute the landing. If you land on your heels, your body will act like a stiff board and will injure the rest of your joints and body. 3) You will not allow your legs to bend below 90 degrees. Bend below 90° and you put too much strain on your knee joints you slow yourself down. 4) When you have forward momentum, or are taking a higher drop, lean slightly forward and allow your hands to absorb some of the force. This will keep your legs from bending below 90° on the drop and enable you to continue your run. Only use this basic landing for small drops.  ", " Learn the shoulder roll. This move is one of the most basic but useful tools in your Parkour toolbox. A shoulder roll is a forward roll diagonal across your back over the shoulder. Shoulder rolls are important because they reduce the impact of the landing, by converting the downward motion of a fall into forward motion, where you can easily begin to run again.  If you are a doing one on the right side you would bring your right arm close to your body and tuck your head and neck close to your chest. Then, roll over your right shoulder and come up onto your feet at the end. The reason you roll diagonally is to reduce the damage to your back and spine.  ", " Practice on vaults. These help you clear obstacles easily and with speed. A vault should essentially keep your forward motion going while you are clearing an obstacle.  Find a rail. When you run up to it, place both your hands on it and propel your legs to the right. When your knees come up over the rail, move your right arm out of the way, and swing your legs over. You should then be able to land with ease and balance. If balance is an issue, finding a rail of a different height may help.  Once you have mastered this, practice doing it to the left.  ", " Start training jumps from about 3 feet (0.9 m). You should never jump off anything higher than you yourself can jump. This is because if you repeatedly land on your legs from extensive heights you will damage your knees. Always practice precaution.  Find a flight of steps. Start low and work your way up. Once you have done a step 10 times, kept relaxed, and always landed on your toes, move up. Repeat until you have done step 10 times, relaxed, and always landed on your toes. If balance is an issue, don't move on until it's not.   ", " Practice the muscle up. How else are you going to be able to climb over walls? The muscles you use in doing pull ups are the same ones you will be employing in hanging off and getting over walls. Find a bar where the ceiling is still a ways away and get practicing.  Start pulling up a bit farther when you are doing your normal pull-up. Get to the point where your elbows are in line with the bar. Then, pull up farther -- bringing your chest over the bar. Get to the point where you can pull up and bring your arms straight over the bar, with it resting near your pelvis. Use your legs to propel upward from a hanging position. Get your intervals down to split seconds. Once you have mastered the basics, start timing yourself on the same courses. How much time can you knock off? This is when a friend comes in handy. Pick an area and find point A and B. Then, either time each other separately or as you both make your way through the course. What is the faster one doing the slower one is missing? A split second here and a split second there can add up and put the final changes on technique.  "], "Getting in Shape": [" Get in shape aerobically. You are going to be running, jumping, and rolling until the cows come home -- so getting your lungs into shape is priority number one. Hit the treadmill, the elliptical, and start swimming and boxing. Then when you hit the obstacle course, you won't be concerned with getting winded on top of everything else.  Even activities like yoga and lacrosse (and other team sports) have their place in Parkour training. If it keeps you going for long periods, do it. Go until staying active for an hour at a time is a piece of cake.  ", " Get in shape with your body. Once you have gotten your lungs up to par, it is time to focus on your muscles. You won't need to be doing any serious weightlifting because, let's face it, moving a car out of the way is a lot slower than just jumping over it. However, you work with your body weight and constantly lifting and propelling that. Start doing push ups , pull ups , squats, and leg lifts like it's your second job.  It may seem like training as much as possible is ideal, but your body does need time to heal. Keep the muscle-building exercises to every other day (twice a day is okay if you do not work out too hard) to give your muscles time to heal themselves. They will be all the better for it in the long run.  ", " Amp it up. If you have your 5k down and you are doing three sets of 15 reps, twice a day every day of those four exercises, good. Now do more. Do not let your body plateau. Aim for 10% more next week than you did this week. It will be good for your spirit and motivation to boot.  Add extra exercises on or switch up your activity routine. Keeping your body guessing is key to developing all your different muscle groups. If you normally swim, go play rugby. Switch a day of squats and leg lifts for planks and sit-ups. Your ability to focus may heighten as well.  "]}}, "How to Train for Parkour": {"description": "Parkour combines walking, running, and acrobatics with jumping skills to get you from 'A' to 'B' in the quickest and most efficient manner possible. It is a way of \"flowing\" between places to get there quicker than if you took the normal route. It isnotjust to look cool. It is a serious art; it is physically demanding and should be practiced only within the limits of your physical condition and ability. If you're up for the challenge, read on.", "content": {"Conditioning Yourself": [" Train with your own body weight. Nothing else will train you to really move and push your body through the environment than working with it from the get-go. Do the following routine 2 times each workout session. If you can't do it all, do what you can. Aim for improvement above all else. If you can do it all, consistently increase your number of reps and/or sessions bit by bit. Remember to take a day or two off every week to give your muscles time to rebuild.  10 squats (building up to plyometric box jumps) 10 push-ups 10 leg lifts on your back with both legs 10 pull-ups   ", " Run frequently. You should run at least 7-10 miles (11-16 km) per week. Running is a big part of parkour, and you should be able to run long distances, as well as sprint fast. Other cardio exercises that are helpful to do are lacrosse, boxing and swimming. Yoga will tone up your muscles, too.   ", " Lift weights. Strength is another important aspect of parkour. You can't just hang on the wall; you have to somehow climb over it. Work with the routine described above and combine with weight training for optimal results. Do not become obsessed with how much weight you can lift. Perfect form and endurance (number of reps) are much more important. After all, you'll be working with the weight of your body, not lifting cars.  ", " Stretch and warm-up your body properly. Parkour can be a dangerous sport if you are not conditioned, so be sure to stretch properly beforehand. If you do not warm up before you stretch, you could lose up to 30% of your muscle's possible strength and power. What's more, make sure you stretch to prevent injury or strain. Don't miss any part of your body. Parkour may seem like it uses mostly legs, but your arms, neck, back, and shoulders are equally important. If you have an injury, you should not be stretching without a physical therapist (or doing parkour in the first place).  ", " Eat a healthy diet. The high carb diet is the most efficient, and non calorie restrictive diet, that will provide the highest energy levels for intense sports like parkour. Raw till 4 is the most popular high carb, low fat diet, and one of the best. Whole and unprocessed foods are best for parkour athletes (traceurs). Your main source of calories should come from fruits. That might sound crazy to a society that has been taught that fruits and veggies are just snacks, but it's true. Eat a lot of high calorie fruits, along with vegetables, and greens. Cooked carbs such as rice, potatoes, and gluten free pasta are perfect for dinner. Animal products such as eggs, fish and meats (or soy equivalents for vegetarians and vegans) are also highly necessary as they provide protein and other vital nutrients. Drink plenty of water--at least 64 ounces per day. Many traceurs consume at least one gallon daily.  Cut out the high-fat, high-sodium processed goods. A healthy weight and muscle-to-fat ratio is important for succeeding at this skill. It's much easier to lift up 180 lbs (82 kgs) of stream-lined muscle over that wall than 220 lbs (100 kgs) of not-so-streamlined fat. You'll be peeing a lot, but it'll be worth it. You will be healthier, and your body will transform into a well oiled machine! Make sure to chug water after each workout session. Parkour can be incredibly hard on your body and your body needs the hydration to stay in top form.  ", " Get a good pair of shoes (unless you want to go the barefoot route). Your own success at parkour can depend a lot on what shoes you have. Consider getting ones with grip (for climbing); they should be sturdy enough to handle the motions you'll put them through, but also flexible to ensure your feet can bend properly. They should also be light enough so that they don't weigh you down. Specialist parkour sneakers are starting to appear on the market. They are designed with the grip, support and stability needed for hard impacts as well as traction for a variety of running surfaces. K-Swiss, inov-8 and Vibram Five Fingers are all popular choices. You will figure out soon enough that you destroy sneakers faster than you can buy them and that it's not worth spending big amounts of money. Buy cheap sneakers; when you destroy them, get a new pair. Grip and durability are not as important as technique, but make sure the sneakers do have some traction, as it will make climbing a bit easier. Make sure that the soles are not too thick to promote bad landing techniques and to gain more feel for the environment.  "], "Mastering the Basics": [" Refine your jump. Though it may seem initially scary, start out with steps. Jumping , not down. Find some outside or a set that are wide and open. Jump from the ground up to one step, then two, then three, etc. You should be relaxed, well-balanced with a relatively upright posture, and land softly on your toes 10 times in a row before you add another step to your jumps the next session or week. Around 5 or 6 steps should be rather difficult. Find a mid-sized rail to work on your two-handed vault. Use your hands to pull your legs up to the side. One knee should seem to go between your arms. Practice staying balanced as you land.  ", " Work on your landings. A great jump becomes a trip to the hospital without the proper landing. Before you extend yourself, get your landings down. Remember in this order: tuck, extend, absorb.  At the top of your jump, bring your knees up to your waist, feet underneath. Extend your legs to a standing position mid-air, and bring your entire body down upon landing. Place your palms in front to help balance and absorb, just in case. Try to land silently (like a ninja).  ", " Perfect your muscle-up. This is a pull-up taken to the extreme and will get you over walls, fences, and high obstacles.  Start with a normal pull-up. Then bring the bar to your chest. After that, work on bringing your chest over the bar, adding dips as well. Eventually, bring it into one fluid motion, from underneath the bar to it resting at your pelvis. Propel your knees up and forward to give your body momentum.  ", " Be one with the shoulder roll. The times you'll need the roll most are when you are surprised and off-balance. Mastering the shoulder roll could get you out of what would be a terribly sticky situation.  Tuck your head and hands in, relax your body, arc your arms and one shoulder forward in a hula hoop shape around your head, and roll your butt over your head. Think of it going from your shoulder diagonally to your hip.  If you're a bit hesitant, start with one knee on the ground. Put your arm on the inside of your leg, holding the foot that's on the ground. This will help you keep form while doing the roll. Propel yourself forward while holding onto your foot. Once you get the basic of the roll, start from low jumps, moving progressively higher.  ", " Run up walls. You've seen it in movies and now you're ready to do it yourself. Start with walls that are just barely out of reach; don't go climbing apartment buildings District B13 style just yet.  Get a good run up to a wall, kick off with your foot, and reach as high as you can, grabbing the edge of the wall. at the top to pull yourself up. As you get better, use corners for two kick-offs, giving you extra height.  ", " Be as silent as possible. This is for your safety and for the safety of the objects you are running on and gallivanting over. A structure may seem sturdy and able to withstand your weight, but you won't know for sure until you're climbing on it. Tread lightly to respect yourself and your environment. Less noise generally means less impact. That's great for the concrete, yes, but the least impact possible is what's best for your knees. Listen to yourself as you move. Or you'll be able to feel it afterward.  "], "Working with Others": [" Develop your own style. When you start working with a teacher or other trainees, you'll notice that everyone has a different way of going about from point A to point B. None of these is incorrect. All you have to do is find what comes most naturally to you. Watch videos and observe others, but only to a point. If you're hurting yourself, definitely question your form--but if it's working for you, don't make efforts to change your habits. What comes natural to you may not come naturally to someone else.  ", " Find an academy or train with others. Working with a professional one-on-one is a privilege that no amount of practice can equal. Working with others allows for personal exploration and critiques of your skills that may come in handy for improvement.  If no academy is in your area, hit up your local gyms. A professional will not only teach you everything you need to know, providing you well-rounded skills, they will also make sure you stay safe. If you do choose to train with others, keep it to a few people. If too many gather, it becomes a roadshow of boasting and showing off skills. The practice should be a collaboration, not one person demanding the others follow suit.  ", " Choose a common A and B. This is good advice whether you're working by yourself or anyone else. Always establish a starting point and an ending point. There can be innumerable ways there, but only one beginning and end. The aim is to get there as quickly as possible, not how many impressive jumps you can do or how many walls you can climb up or roll underneath. Pick a path that doesn't stand out in its simplicity or its grandeur.  "]}}, "How to Roll in Parkour/Free Running": {"description": "Have you wanted to land from a high fall, or just wanted to safely land from a jump? Well, this is a how to on doing a correct roll. Be sure to read the Tips and Warnings before attempting this!", "content": {"Steps": [" Learn the movements. Practice on first, such as a mattress or grass.  ", " To start (basic roll):     your hand on the ground, a little to the opposite side you are rolling.  Now, to the opposite side and rolling on your shoulder, (left shoulder to lower-right back or right shoulder to lower-left back).  Try to while rolling.  After that, or stand up directly   ", " When you feel like you learned it, find a jump . Again, begin with a  ", " Start small, don't go crazy and want to jump off of something that's ten feet tall. Try with something about Make sure that you can launch yourself off of it though; it's safer to try small, but going fast will apply what you'll feel from a higher fall. ", " Jump up and forwards, bringing your knees to your chest and your hands up. After you jump, make sure to plot out your landing.  ", " Beginning your roll. Once the hit the ground, bend your knees (not more than about 90 degrees), crouch and lean forward as quick as possible . Make sure to push off of your feet to propel yourself forward. ", " You are now starting the roll: don't back out now, you might hurt yourself. Be careful not to land on your neck, or mid back, as you might get hurt. Perform the movements explained above; curl your shoulder and land on it, but be sure to roll diagonally.  "]}}, "How to Practice Parkour": {"description": "Parkour is a non-competitive sport where practitioners seek to move through various novel environments as quickly and efficiently as possible. Runners carefully plan out routes on the fly, using their environment to overcome obstacles in their way. Because of this, male and female parkour practitioners are named traceurs and traceusesfor the French words for \"one who traces.\"Although the popular image of parkour is of traceurs who jump from roof tops to roof tops, the art can be practiced anywhere and typically involves much less extreme conditions.While you may not always have the opportunity to work through a complex parkour course, there are many ways you can practice necessary skills between runs.", "content": {"Knowing the Basic Techniques": [" Vault at full speed. While doing parkour, you will often need to bypass medium-sized obstacles without slowing your run. To do this, you will likely perform a speed vault: As you approach the obstacle, kick off from the ground using your left leg while raising your right. Simultaneously reach your left arm forward and place one hand flat on the object. Avoid contacting the obstacle before your body is airborne. As your hand catches the obstacle, use the momentum from your kickoff to bring both legs together up towards your right side. Use your left arm as a pivot to direct your body's momentum over the obstacle. Once you're over the object, land on your left foot to regain vertical posture. Return to your run.    ", " Leap like a cat. In a \"cat leap,\" the traceur jumps onto the face of a wall and uses all four limbs for grip and balance. While in the air, position your arms in front of you so that your hands can grip the wall ledge when landing. Orient your legs to be nearly parallel with your arms and so that your feet will connect with the wall's face first. Allow your legs to absorb the impact, bend at the knee, and catch the ledge with your hands. A cat leap can be done using almost any type of leap as a base, from running jumps to vaults. As long as you can orient your body so that all four of your limbs can extend forward, you can turn a normal leap into a cat leap. In practice, this move is typically used to reach slightly higher surfaces. From this position, the traceur often pulls his or her body up onto the top of the wall.   ", " Swing through the air. Find a horizontal bar you'd like to swing from and jump towards it. Before catching the bar with your hands, curl your body and bring your legs up and forward. Once your hands make contact with the bar, add to the momentum and direct your body forward.  When you are doing parkour, be careful that any bars you grab onto are sturdy enough to hold your weight.  ", " Land solidly. Any time you land, you will need to do so safely. In general, you will be landing upright on two feet. This could easily cause injuries to your knees and wear out your joints over time if not done properly. Keep the following in mind when landing: Land on the balls of your feet. This is the semi-flat space between the toes and the arch. When you land, angle your feet pointing downward while lifting your toes. Don't land with your legs straight. Bend your knees to absorb the shock of your landing. Never bend your knees to an angle less than 90 degrees.   ", " Roll to absorb landing impact safely. Rolls can be done at the end of a controlled drop or after an unexpected fall. Their purpose is to spread out the force of impact, preventing injury. With practice, a quick roll can even be done painlessly on concrete. Until then, it's best to practice on soft surfaces, such as grass and gym mats. To execute a roll diagonally across your back: When practicing, begin in a standing position with one leg slightly forward. The leg in front should correspond to the same side as the shoulder you plan on rolling onto. Crouch down into a squat, placing your hands on the ground palms down. The hand of the side you're rolling into should be slightly behind the other, making a diagonal line with your front foot. The opposite hand should form a straight line with your back foot. Push with your front leg to create momentum. Roll onto the corresponding arm and then drop onto your shoulder. When your shoulder hits the ground, tuck your back leg into your side. Shift your weight and use your momentum to roll from your shoulder to your hip on the opposite side. Hit the ground with your front foot first as you finish your roll. It's extremely important to keep your head up and away from the ground at all times.   "], "Training Your Body": [" Go for daily runs. Running is a major component of parkour, so your training should include this element. The time and frequency you should devote to running will depend on your personal preference and skill level. Most casual runners run only three times a week to prevent injury, while many serious runners do so twice per day. If you don't already run as part of your exercise regimen, start out slow with short runs every other day. As your endurance increases, you can then gradually add miles to your weekly run goal.   ", " Build functional strength. When you parkour, you will need the strength to do things like jump, climb, and vault your way past obstacles. As such, you will need to develop muscles in your legs, arms, and core. Squats, push-ups, pull-ups, and lunges are excellent exercises for this type of strength training that don't require specialized equipment to do. Remember that the amount of force you'll need to generate is proportional to the weight of your body and that muscle is fairly heavy. Because of this, traceurs tend to be lean rather than bulky.  ", " Practice quadrupedal movement. Learn to crawl quickly on your hands and feet. When doing parkour, you will use quadrupedal movement to crawl under objects and fit into tight spaces with swiftness and ease. Practicing quadrupedal movement is also an excellent workout in and of itself, as it exercises all four of your limbs along with your core. ", " Get your feet used to minimalist shoes. Because parkour relies heavily on tactile feedback and freedom of movement, most traceurs avoid bulky running shoes. You should look for a shoe that has thin soles while providing excellent grip and arch support. If you are not already used to this type of shoe, you will need to take the time to adjust to wearing them. Before doing parkour in them, go for a normal run fist. It's also wise to wear them around the house and for low-impact walks before doing any type of running at all.  ", " Learn to love calluses. While you may see some traceurs wearing gloves to protect their hands, they are not generally recommended. Gloves reduce feedback between your hands and your environment, increasing the likelihood of dangerous mistakes. Instead, practice without covering your hands and encourage the formation of calluses. "], "Overcoming Obstacles": [" Plan parkour routes when you aren't running. You can do this when you're walking around your city or taking the bus to work. Look around you. Take note of nearby structures and think about how you would interact with them to get from an imaginary point A to point B. If there is a large horizontal bar in your path, does it make more sense to vault over it or slide under? Which would be faster for you? Where do you see potential footholds on the sides of buildings? If there is a gap between ledges, could you make the jump, or should you climb down one and climb up the other?  ", " Join a parkour group. Use Internet resources to locate parkour groups in your area. With local contacts, you'll be able to find the best places to practice and do parkour. If you are a beginner to the sport, you will also be able to find qualified parkour coaches to teach you. ", " Find the right spot to practice. Parkour has its roots in military training obstacle courses. If you have access to a military-style obstacle course, take advantage of it and practice your parkour skills. If you don't, there are still a few options for you to practice: Find other types of obstacle courses in your area. With parkour's increase in popularity, more and more facilities specializing in obstacle course training are opening up. Join a gym with gymnastics equipment. You can practice your parkour moves on bars, ropes, vaults, and balance beams all with the safety of soft mats underneath. Keep in mind you may need to reserve space for use. Some gyms also feature rock walls for you to safely practice climbing. Public parks are also great places to practice parkour. They usually feature wide open spaces for you to run on and low to the ground structures like tables and railings for you to use as obstacles.  ", " Try new locations whenever you can. Once you get comfortable in your abilities, try moving through new areas. Remember that parkour is meant to be done in almost any environment. If you're bored with your current practice spot, look around for a new one. Ask members of your local parkour community where they like to practice or do parkour. Be careful not to practice on private property without permission from its owner.  "]}}, "How to Improve Your Parkour Balancing Skills": {"description": "Balance is an important part of parkour and an element that needs to be incorporated into your parkour training from the outset. Balance can be improved by the means suggested in this article.", "content": {"Steps": [" Dress properly. Wear running shoes , trainers or other supple, gripping shoes suitable for parkour. Wear loose, comfortable clothing and nothing too tight. And don't overdress, in case you get too hot.  ", " Stretch . Before you train in any part of parkour , ensure that your muscles have been properly warmed up through stretching. Some people also like to spend time clearing their mind of concerns and worries, so that they can fully focus on the parkour training. Perhaps a short meditation, a mantra, a positive visualization, etc.  ", " Find a suitable place to practice your balancing. As a beginner, choose a place that isn't too high from the ground, where a fall is only a matter of a few inches or centimeters. The practice of balancing doesn't need height to begin with, just find suitable places that can enable balancing . Some suggestions for getting started include: Railing placed at a low level is ideal, such as railing in gardens or used as traffic or parking barriers Slim poles or pipes that can take your weight The gutter at the edge of the sidewalk Other low items you can walk on and balance.  ", " Improve your strength . Balance is a lot about strength as well as balancing and this can be improved with gym or exercise workouts , even before you train in parkour. Find a gym or a fitness studio, or use your own equipment. Use apparatus that increases your ability to balance. One really good exercise is to stand on a half dome ball. These are exercise/gym balls cut in half and placed on a base. They often have cords attached to the sides for arm strengthening training: Practice standing on this with your arms out to the sides. How long can you go? Now switch it up and do squats without losing your balance. How many can you do? Now and see how long you can stay there. You'll find it gets much harder as your sight is one aspect of good balance. Keep practicing remaining on the half ball with your eyes closed as long as possible. In the process, you will be strengthening your ankle region, which will greatly improve your sense of balance.  ", " Practice walking up and down a low, flat narrow surface to begin with, over grass or another soft surface. The flat surface will give you the safety of keeping your feet flat but the narrowness should be enough to cause you to have to balance. For example, a narrow street gutter can be ideal because you have to place one foot in front of the other to stay on it. Each time you practice, make the distance you manage it longer and longer. Even though there isn't far to fall, the mental discipline in telling yourself that you are doing fine is a big part of this; the moment you start to tell yourself \"I'm going to fall\", you will, so use this easy training time to overcome these thoughts as well. Use thin small garden walls to walk on. Just be sure the wall owner doesn't mind, and don't fall on their prize ! A think wooden rail, tree logs, or 2 by 4s in the backyard work fine too. Use whatever you have around the house and yard. Check out the local . There is often a balancing bar or low balancing play equipment you can use. Just don't push away the kids; go after they've finished playing for the day.  ", " Proceed to something harder to balance on once you're confident on the lower items. Look for a rounded rail. Rounded rails are great because you can't naturally stand on them without falling off and you have to use your sense of balance to remain on it. If the rail is higher and over concrete, be sure that you're ready for this step. Have a spotter nearby to catch you in case, or to help you out if you do get into difficulties. And always wear gripping shoes!  ", " Try walking forwards and backwards. You need to feel comfortable balancing in any direction and the rhythm will change depending on the direction in which you're walking. ", " Close your eyes on the higher rail. Once you're feeling confident enough, try walking with closed eyes. Have your spotter walk alongside you in case you misstep or suddenly need support. With enough practice though, you'll soon get the hang of this. ", " Turn and balance on the balls of your feet.  Do squats while in this position on the railing. It's a tough one to do but will increase both your strength and balance intensely. This is a great muscle improving workout!  ", " Keep practicing. With regular, consistent balancing practice, your confidence will grow, as will your strength. Don't neglect the related but different balancing exercises in the gym or at home; keep doing these to help keep your balancing skills sharp. "]}}, "How to Do Precision in Parkour": {"description": "Precision in parkour is jumping (commonly from a standing position) from one object to another (e.g. from a car top to a fence rail). The end goal of a precision is to land on and stay on the object jumped to.", "content": {"Steps": [" Stand on an object. This can be anything from a stair to a fence rail to a roof.  ", " Determine what you will precision to. Estimate how far away it is, how strong it is, and how high it is. If you have any doubts about your ability to land the precision, do not attempt the precision. ", " Drop into a slightly crouched position. Jumping from this position will allow you to go farther with greater balance. ", " Jump. Once you feel confident about the jump, go for it! Make sure to jump with both your feet at the same time, and keep them together through the whole jump. ", " Land and follow through. Land both of your feet at the same time, and allow your body to absorb the land. "]}}}