{"How to Parallel Park": {"description": "Parallel parking can be intimidating, but you’ll master it in no time with a bit of practice. Before you begin, find a space a few feet longer than your vehicle. Confirm the space is legal and use your flashers to signal as you pull up in front of the space. Shift into reverse and begin slowly backing up. At the same time, push the top of your steering wheel toward the space until the vehicle is at a 45 degree angle. Straighten out by turning the steering wheel the other way and bring your vehicle parallel to the curb. Shift back to drive and pull forward to center the vehicle in the space.", "content": {"Selecting a Parking Space": [" Find a suitable space. Look for a space you can safely get your vehicle into without hitting another vehicle.  Once you get better at parallel parking, you may be able to park in tighter spaces, but you may want to start with spaces that have six feet (two meters) of extra space. The space needs to be at least three feet (a meter) longer than your vehicle.  If you've never parallel parked before, consider bringing plastic bins or cones to a parking lot and practice parallel parking between them.   ", " Ensure it is a safe, legal parking space. Look for signs that indicate parking regulations in the area. Make sure you’re not parking in front of a fire hydrant or another area you cannot block.  Note any time limits for the spot. Make sure nothing is sticking off the end of the either of the vehicles you hope to park between, such as a trailer hitch. If so, ensure you have enough room to fit into the space. Note the height of the curb next to the space. If it is especially high, you’ll want to take care not to back into it.  ", " Turn on your signal and position yourself to back in. Check your rear view mirror to confirm that no one is immediately behind you. Brake gently to indicate that you are slowing down. Use your turn signal and pull up next to the vehicle in front of the space. About two feet (60 cm) between your vehicle and the parked vehicle is ideal.  If another vehicle comes up behind you while you are trying to park, stay where you are and keep signaling.  Roll down your window and hand-signal the other driver to go around you if necessary. The tighter the space, the closer you'll need to get to the other vehicle when you pull up beside it. For instance, you may need to position your vehicle about a foot (30cm) beside the vehicle in front of your space if the space only has an extra meter or so to work with.  "], "Maneuvering Into the Space": [" Consider having someone help. If the space is tight or you haven’t parallel parked much, it’s worth having someone help guide you into the spot from outside the vehicle. If you have a passenger, ask them to get out and direct you.  Have your passenger show you the distance between your vehicle and the one you’re approaching by holding their hands up to mimic the distance. This will be more accurate than verbal directions. Consider shifting your side mirror down so you can see the curb.  While this isn’t necessary, it may help.  ", " Begin backing up. Shift your vehicle into reverse.  Make sure the street behind you is clear of traffic.  Look over your shoulder towards the space. Once the back of your seat is even with the back of the vehicle beside you, turn your steering wheel quickly and evenly towards the spot until your vehicle is at a 45 degree angle as it enters the spot.  Conceptually, envision pushing the steering wheel in the direction that you want the back of the car to go. Avoid swinging the front of your vehicle into the space too early, as you may hit or scrape the vehicle in front of you.  ", " Back most of the way in. Continue backing in at an angle until the rear wheel nearest the curb is about a 1 foot (30 cm) from the curb.  The rear of your vehicle should still be a few feet from the vehicle behind your parking space.  If your rear tire hits the curb, you've gone too far. Simply shift back into drive, pull forward, and try again.  ", " Straighten it out as you finish pulling in. Turn the steering wheel back towards the road once the rear of your vehicle is mostly in the space, and still slowly moving backwards.  Look to do so when your front bumper is next to the rear bumper of the vehicle in front. This final maneuver moves the vehicle into the space and straightens it out simultaneously.  Another good indicator to begin turning the wheel the other way is when the license plate on the vehicle in front of your space is centered in your windshield. In tighter spaces, you may need to begin switching the steering wheel’s direction a bit earlier.  "], "Positioning Your Vehicle in the Space": [" Center the vehicle in the space. Once you’re successfully in the space, you’ll likely have to re-position your vehicle to get it parallel to the curb and midway between the vehicles in either direction. If you still have space behind you, continue backing up until you’re almost touching the vehicle behind you. Shift into drive and turn slightly towards the curb as you pull forward.  ", " Adjust your vehicle in tight spots. When the spot is tighter, positioning can be more challenging, and your front end may be further from the curb than you’d like to be. To remedy this, continue pulling forward and backward and wiggling towards the curb. Each time, turn the steering wheel all the way towards the curb before you pull forward, and straighten it up as you back up.  Repeat as necessary.  The front end will work its way into the space by turning hard to the curb as you pull forward. If you're too far from the curb in a normal-size spot, pulling out and trying again may be easier.  ", " Start over whenever necessary. If you wind up unable to get into the spot on your first try, don’t worry. Signal and pull back out alongside the vehicle in front of you to start over. ", " Open your door carefully. Before getting out a vehicle, especially on the road side, check to make sure that a vehicle or cyclist is not approaching.  It’s important to be aware of bicyclists at all times, and parallel parking spots in particular place cyclists at risk, as you may be opening your door into the cycling lane. On the curbside, take care not to scratch the door against the curb or other items beside the road. If the door cannot open all the way while passengers are in the vehicle, remember this when you return to the vehicle. The door may open all the way when the vehicle is empty, but crunch down into the curb once people get into the vehicle and weigh it down.  "]}}, "How to Park in a Parking Lot": {"description": "Parking in a parking lot can be challenging, especially for a new driver. Sometimes, parking spaces are small and the lot is very crowded, making this even more difficult. There are three different types of parking spaces in parking lots: angled, perpendicular, and parallel. You should be proficient at all of these before passing a driver's exam or getting on the road. This article addresses tips on how to park in different types of parking spaces.", "content": {"Parking in an Angled Space": [" Find a parking space not surrounded by many cars. It will be easier to practice parking with fewer obstacles in your way. When you are practicing, you will want to do this in a parking lot that isn't crowded. As you are learning, you might make mistakes. In an area with no cars, you are unlikely to hit anything as you practice your parking skills. This isn't just a good idea for people learning how to drive. If you haven't driven in a long time, it is a good idea to practice parking and driving a little bit before going long distances.   ", " Position your car. You want your vehicle to be in the right spot, away from other cars and the right distance from your spot so you can cut your wheel correctly.  Make sure there is at least 5 or 6 feet between your vehicle and any other parked cars. If there aren't any cars in the spaces near you, try to judge a 5 or 6 foot distance away from them. This is so that when you are parking, you can use the rest of the steps for cutting your wheel correctly.  ", " Signal when you have found a parking space. This will let other drivers know you are going to park.  Drive forward slowly until you see the center of the parking space you want to use. Be aware of other drivers. Don't take a space someone else has been waiting for. Make sure there is no one trying to back-out of a nearby spot as you are driving forward.  ", " Turn the wheel sharply. You should do this once you see the center of the parking space.  Make sure your car is still about 5-6 feet from any other cars or empty parking spaces as you begin to turn. You will want to turn the wheel about a half of a turn. Make sure there are no carts or other objects in the space. Move forward slowly into the space. Come to a full stop when your car is in the spot the whole way. Make sure your car is in the spot entirely to avoid getting a ticket.  ", " Straighten out your wheels. You can do this once your car is stopped.  You want to make sure your wheels are straight so you can back out of your spot straight. You can also straighten out your wheels just before you back out. However, it is best practice to do this when you park.  "], "Parking in a Perpendicular Spot": [" Position your car. You will want to be far enough away from other cars in the parking lot to be able to turn into a spot.  Make sure your car is at least 8 feet away from any other parked vehicles on the driver's side or passenger's side. This will depend on if your parking space is on the left or right of your car. If there aren't any cars parked near you, try to judge an 8 foot distance from the spaces to your car. Don't take someone else's parking spot that they have been waiting for.  ", " Turn on your signal. This will let other drivers know you are going to park in a free space.  Take a quick look for any cars, pedestrians, or other obstacles. Move forward slowly. Drive forward until the front bumper of your car is just past the taillights of the car next to your parking space.  ", " Turn your wheel sharply. You will need to turn a little bit more sharply than if you were parking in an angled space.  Begin to do this as your front bumper passes the taillights of the car in the parking space next to yours. Drive forward slowly. Make sure there aren't any shopping carts, debris, or objects in the space as you pull in.  ", " Pull into the space. Do this until the front of your car is at the back of the space and the rear of your car is entirely in the space.  A good way to do this is to align your side mirrors with those on the car beside you. Make sure your front bumper isn't creeping into the space in front of you. Check to make sure the rear side of your car isn't sticking out of the parking space.  ", " Straighten out your wheels. Do this after your car is entirely in the parking space.  Your wheels will need to be straight when you back out of your spot. You can also do this when you are leaving your spot before you start to reverse. It is best practice to do this right after parking, however.  "], "Parking in a Parallel Spot": [" Seek out a space. This will need to be one you are comfortable with getting your car into without hitting the person in front of you or behind you.  Some parking lots have parallel spaces. These are usually marked clearly with white lines, so it can be easier to park in these than on the street. If you need to, drive around the block until you find a space with a large enough gap. You will need a space several feet longer than your car. Larger spaces are easier to park in.  ", " Check your mirrors. Do this as you approach your spot.  Ensure another car isn't riding on your tail. Signal towards the space as you approach, slow down, then stop. If another motorist pulls up behind you, maintain your position. Roll down your window and gesture for them to go around you, if possible.  ", " Line up your car. You will do this with the car in front of your space, maintaining at least a 2 foot distance between the side of your car and the one in front.  Don't get too close or too far away from the car. If you are too close you might scrape the other vehicle as you are backing into your space. Try to be about 2 feet away from the other vehicle. Align your car's bumper with the other vehicles bumper or stay 2-3 feet behind it.  ", " Put your vehicle in reverse. You will now be backing into the space.  Check your driver's side mirror to make sure the street behind you is free of traffic. Look over your other shoulder to check the space. Back up until your bumper is about 3-4 feet behind that of the car next to you.  ", " Release your brakes and cut your wheel all the way to the right. You will begin to back slowly into the space.  Visually check in front of and around your car frequently. Make sure other cars or pedestrians don't cross your path. Maintain a distance of 2-3 feet between the side of your car and the car in front of you to avoid scraping it. Use your mirrors to judge the distance between your back bumper and the car behind you. If you hit the curb, you've gone too far. In that case, switch gears into drive and pull forward a few feet.  ", " Turn the steering wheel to the left. Do this once your front wheels are next to the back bumper of the car in front.  You should still be in reverse. Continue in reverse as far back as you can. Look forward and to the side to make sure you aren't hitting the car in front. Don't hit the bumper of the car behind you. Look through your back window to check how far the car behind you is from your rear bumper. You can also use your side and rear view mirrors to help you.  ", " Shift into drive. You will now position your car in the space.  Turn your steering wheel to the right again. Move slowly forward towards the curb. As you do this, straighten your car in the space. Use your passenger side mirror to check your distance from the curb. You should be within one foot (30cm) of the curb when you are done parking. You should now be completely parked.  "]}}, "How to Park on a Hill": {"description": "When you park a car on a steep hill, gravity works against you. If you don't take the proper precautions, the vehicle could roll downhill, could damage property and potentially hurt people. First and foremost, be sure to engage the handbrake and turn the wheels in the correct direction. If you are driving a manual transmission, make sure that you also leave the gearstick in neutral. Turn the wheels toward the curb, when parking downhill, and away from the curb when parking uphill.", "content": {"Parking an Automatic": [" Park your car parallel to the curb. If you are parking facing uphill, make sure to leave a full car's length of space behind your vehicle so that you can back into the curb. If you are parking on a downhill incline, you will need to leave a full car's length of space in front of your car so that the wheels can roll forward into position.  ", " Turn the wheels. Face your wheels away from the curb if you are parking uphill. Turn them facing towards the curb if you are parking downhill. Press your foot on the brake, put the car in neutral, and turn your steering wheel one full turn in the proper direction. This will keep the car from rolling out into traffic if the brakes fail.  If there is no curb, then turn your front wheels toward the edge of the road regardless of whether you're parking up or down. This way, your car will roll into the dirt or grass beside the road, and not into the path of oncoming traffic. Avoid \"dry steering\" – turning your wheels while the vehicle is completely stopped. This puts pressure on the tires and the power steering system.   ", " Roll the car into the curb. When you are ready, take your foot off the brake. Let the car roll slowly downhill until you feel your turned front tire touch the curb. Hit the brake and put the car in park. Make sure that there are no other cars coming up or down the hill behind you. Check your mirrors and look over your shoulder.  ", " Leave the car. Make sure that the car is in parking gear. Engage the the handbrake before leaving the car. "], "Parking a Manual Transmission": [" Park your car parallel to the curb. Your passenger-side front tire should be gently touching the curb, and your passenger-side rear tire should be no more than six inches from the curb.  If you are parking uphill, make sure to leave a full car's length of space behind your vehicle. You will need this space to back into the curb. If you are parking on a downhill incline, be sure to leave a full car's length of space in front of your car so that the wheels can roll forward into position.  ", " Turn the tires. Face your tires away from the curb if you are parking uphill. Twist them toward the curb if you are parking downhill. Press your foot on the brake, put the car in neutral, and turn your steering wheel one full turn in the proper direction. Avoid \"dry steering\" – turning your wheels while the vehicle is completely stopped. This is hard on the tires and the power steering system.  ", " Roll the car into the curb. First, put the car into neutral, but keep your foot on the brake. When you are ready, take your foot off the brake. Let the car roll slowly downhill until you feel your front tire touch the curb. Hit the foot-brake to stop the car.  Make sure that there are no other cars coming up or down the hill behind you. Check your mirrors and look over your shoulder.   ", " Pull the handbrake. Then, shift the car into either first gear or reverse. Leave the vehicle in first gear if you are parking on an uphill incline, and leave it in reverse if you are parking on a downhill incline. This will help keep your car from rolling, as it sets your transmission in the opposite direction that the car would roll if your emergency brake fails. "]}}, "How to Reverse Into a Car Parking Space": {"description": "It is almost inevitable that once you start driving, you will need to park in a parking spot.  Most people drive in and back out.  However, once you master the art of backing in, you will find it is much more convenient to be able to pull right out.  This is a learned skill, and will need a lot of practice off-site in a remote location.  Once you have practiced, and learned the skill, you will be able to park almost anywhere.", "content": {"Parking Your Car in Reverse": [" Drive your car past the open spot. As you are doing this, turn your turn signal on so that cars behind you know to drive around.  The open spot should always be on your right.  Never park crossing over to the other side of the street.  Your bumper should cover half of the end of the parking space.  Make sure to look out for pedestrians before you begin backing up.   ", " Put your car in reverse. Turn your wheel all the way to the right before you begin moving the car.  Press on the gas gently as your car begins to turn.  Because your wheel is all the way to the right, your car will move left when it is in reverse.  Continue to look in your mirrors and check for pedestrians and the edges of the cars surrounding the parking space. Turn your car to the left until your car is parallel with the parking space, equidistant on both sides.  After it is parallel, press on the brakes and hold your car steady.  Turn your wheel so that your tires are now straight.  ", " Begin to back your car into the space. Check your mirrors first to make sure that there is enough room on both sides of the parking space.  Do not back up if there are people behind you.  Let the brakes go, and gently press on the accelerator with your car still in reverse.  Let your car slowly move back into the space.  Take it slow.  Continuously check the mirrors, and back out, if you are getting too close to one of the cars on the sides.  ", " Adjust your car. Switch between forward and reverse, moving a few inches at a time.  Turn your wheel either way.  You want the space on both sides of your car to be even.  Once your car is safely backed into the space, put your car into park and turn off the engine.  ", " Get out of your car. Open the driver's door slightly to see whether there is enough room to get out.  You may have to hold the door only slightly open as you get out.  Make sure not to sling the door open, otherwise you could damage the car behind you.  Once you are out, lock your car and you are good to go.  ", " Exit your parking space. Turn your car on and put it in forward.  Go forward slightly as you press on the accelerator.  As you begin to creep out of your parking space, tilt your head forward to make sure there are no cars or pedestrians coming by.  Continue out of the space straight until your bumper is fully past the cars on either side.  Turn your wheel whatever direction you want to go and press on the accelerator.  "], "Parallel Parking Your Car": [" Find an empty parking spot. Make sure that the space is big enough to hold your car.  It will have to be at least 25% longer than the length of your car.  You will also want to check for fire hydrants, yellow edges on sidewalks, or handicap signs as to why the space might be left empty.  ", " Turn your blinker on to the right. This will allow other cars behind you to drive around.  Pull up next to the car in front of the empty spot.  You want to be as close to the other car as possible, not more than 12 inches (30.5 cm) away.  Ensure that the front of your car is the same distance from the car next to you as the back of your car (don't slant your car at an angle).  Your bumper should line up directly parallel to the car next to you.  ", " Put your car in reverse. Start backing up slowly until your head is parallel with the wheel of the car to your right.  Press on the brake and hold your car steady.  Turn your steering wheel as far as it will go clockwise.  Look over your left shoulder as far as you can and start backing up again.  Keep backing up until you can see the front wheel of the car behind you in your right mirror.  Your car should now be positioned at a 45 degree angle into the parking space.  Press on your brake and steady your car.  ", " Turn your wheel all the way counter-clockwise. Do this while maintaining your foot on the brake.  When it has moved as far as it will go, begin backing up again slowly.  Glance from front to back to ensure that you are not going to bump the car in front or the car in back.  ", " Continue to back up until you are parked. If you either bump into the curb, or get too close to the car in back of you, turn the top of the wheel to the right again and pull forward slowly.  Steer your car into the proper position.  ", " Exit your vehicle. Leave space in front and behind to allow yourself and the other people to get out of the parking spots. If you park very far forward or back and another car parks very close to you, you will be too tight to get out of your spot, so don’t forget to leave that space.  If done correctly, you should leave no more than 12 inches from the curb to your car.  "], "Exiting Your Parallel Parking Space": [" Turn your car on. Put your car in reverse, and go back 10-12 inches.  Do this very slowly and check your rearview mirror to make sure you don't bump into the car behind you.  Press on your brake and hold your car steady.  Now turn your left blinker on before your next move.  ", " Turn your wheel all the way to the left. Put your car into forward and slowly press on the accelerator.  Your car should begin to turn left.  Do this until your car is at a 45 degree angle in the parking space.  Make sure that you are always checking your side and rearview mirrors.  Press on your brake and steady your car.  ", " Steady your wheel until your front tires are straight. Go forward slightly, looking to the left and right for oncoming cars.  Drive your car forward until your bumper has passed the car in front of you.  ", " Turn your wheel back to the left. Press on the accelerator and go forward as you leave the parking space.  Make sure as you turn your wheel that you do not run into parked cars on your right.  "]}}, "How to Park a Truck or Large Vehicle": {"description": "It’s no secret that large vehicles handle differently than normal sized cars. But when attempting to park in a spot or parking lot intended for vehicles of a more regular size, you’ll have to be especially careful with your large vehicle or truck. The last thing you want is to accidentally damage other parked cars. It’s a good thing that some basic parking principles can help prevent this from happening.", "content": {"Pulling Large Vehicles into a Parking Spot": [" Check your mirrors before parking. Poorly adjusted mirrors could result in you losing perspective while parking. This can hurt your ability to gauge the distance between your vehicles and obstructions. You’ll want as clear and complete a view of the area around your vehicle as possible. Even if you are more confident in your parking skills, you should always double check your blind spots to ensure you don’t back into kids, pedestrians, or moving objects, like strollers and shopping carts. Larger vehicles may have additional mirror mounted to the body of the vehicle to improve visibility. These additional mirrors can be easily forgotten by casual large vehicle drivers. Check these regularly when parking.    ", " Give yourself plenty of space. The more space you have to pull into your spot, the more space you’ll have to maneuver and make adjustments while parking. You might give yourself more space by parking in an empty part of a parking lot, or you could also choose a spot that is surrounded by smaller, more compact vehicles. Smaller vehicles on either side of your large truck will take up less space in their own parking spot, giving you more leeway as you park.   ", " Park slowly and brake early. The increased weight of a large vehicle will require you to brake sooner than you would for a normal car, especially if you have a heavy load you are transporting. Taking your time when parking your large vehicle can prevent costly errors, like damaging cars around you or hitting a parking barrier.  ", " Pull in to wide open spots. This is perhaps the safest route if you are less confidant in your large vehicle parking ability. Choose a location of the parking area that is free of other cars. Cut your wheel in the direction you are turning to move into the spot. You may notice your front end swinging over the parking spot lines into the spot beside you. This is due to the fact that larger vehicles require a wider turning radius to complete turns.  You may need to adjust your vehicle in your space after pulling in. Put your vehicle in reverse, check your mirrors and blind spots, then back up. When you pull back into your spot after backing out, adjust your wheel to straighten out your vehicle as you pull into the spot again.  ", " Avoid overshooting or undercutting your turn. The length of your large vehicle will require more space spent turning for you to straighten it out and pull it evenly into its spot. Turning as you would normally in a regular car can lead to over or underturning, potentially into other vehicles. To prevent this you should:  Maneuver your vehicle as far away from the parking spot as you are able. The more space you have to approach, the easier it will be for you to straighten your back end and pull into the spot. Cut your wheel hard in the direction of the spot you are parking. You’ll want the front end of your truck to enter the spot as straight as possible. Check your mirrors constantly while pulling into your spot. The side of your vehicle may still be straightening, and you’ll need to keep a careful eye to ensure you do not bump or scratch other vehicles.   ", " Straighten your vehicle with a three-point turn. The more aligned your back end is with the spot you are aiming to park in, the less turning you will have to do and the easier your parking job will be. A three-point turn is where you turn in one direction as far as you are able, put your vehicle in reverse to straighten your front end, and then finish your turn by continuing it. You can use this while parking by: Pulling your front end close to one of the vehicles next to the spot in which you are parking. Putting your vehicle in reverse and straightening it to line up with your spot as much as possible. Be sure to check your mirrors and blind spots so you don’t hit any pedestrians or cars parked behind you.  ", " Pull into your spot evenly out of your three-point turn. Now that your car is more lined up with the spot, it’s likely you’ll only have to make slight adjustments to your course as you pull into it. Executing this move in tight spaces is a valuable skill when driving a large vehicle, so you may want to practice how to make a three-point turn . "], "Backing Large Vehicles into a Parking Spot": [" Identify your backing up maneuver. There are four main kinds of backing up maneuvers you might come across in your large vehicle driving: straight back, offset back, alley dock, and parallel parking. Each of these can be identified by the following characteristics:  spots are usually located in a grid and form a perpendicular (L-shaped) angle with the traffic passage that vehicles pass through to go deeper into or exit from the parking area.  spaces are usually arranged in an offset grid. These meet the traffic passage vehicles use to enter into or exit the parking area at a diagonal angle.  spaces are almost always for semi-trucks. These require you to move straight back through a narrow passage and then turn sharply to maneuver the trailer to meet a loading/unloading dock, which is usually at a right angle (L-shape) to the passage.  spaces are on the side of the road, with either traffic, obstacles, or empty spaces before or after the spot. These require you to back your vehicle in, and can be especially challenging. New drivers may want to avoid these if at all possible.   ", " Understand the mechanics of backing up. This is going to be slightly different for semi-trucks/vehicles with a trailer versus large, normal trucks that have a bed attached to the cab. While large, attached-bed trucks will turn similarly to smaller vehicles you may be used to driving, these will require plenty of extra room to complete the turn. Semi-trucks/vehicles with trailers will turn backwards the direction you turn your wheel.  Getting the hang of backing up a semi-truck/vehicle with a trailer requires time and practice. You should consider finding an empty parking area and executing reverse maneuvers to get a feel for how your trailer responds to turning. If you are are prepping for a driving test or expect to have to reverse your large vehicle into a space, you should purchase some traffic cones from your local hardware store or set out some obstacles, like a cheap folding chair, in an empty parking area. This way you can practice avoiding and guiding your trailer/rear end around obstacles.  ", " Pull ahead of your spot. You'll want to pull several feet ahead of your parking spot to make sure your turn doesn't cut too sharp and hit parked vehicles in the near-side spot, or swing wide and hit vehicles parked in the far-side spot. The more distance between your large vehicle and the parked cars means you will have more distance to straighten your rear-end before approaching the parked vehicles. This extra room can be the difference between scraping up another car and sliding into your spot without incident. Roll down your mirrors on both the driver and passenger side of your vehicle. You want as clear and as unobstructed a view as possible of your mirrors. Do this especially it it's raining, as raindrops can negatively impact your perspective or obstruct your view. Ask any passengers to step out of the vehicle. Even well-behaved passengers can be difficult to see around while backing up. A clear line of sight will help you prevent potential damage to your vehicle or others.  ", " Check your mirrors and do a walk-around. Your mirrors should give you a general sense of the dimensions of the area you will be parking in. However, mirrors can sometimes distort distance or miss important features, like thin metal signs, posts, and so on. Take note of the surroundings in your mirrors and step outside of your vehicle. Then: Compare your walk-around evaluation of the parking area to your mirror view. Note any inconsistencies, difficult to see obstacles, or missed obstacles. Evaluate the size of the parking spot. If you feel that the spot might not be a good fit, or if you are nervous in your ability to park, you are probably better off finding another parking spot. Adjust your mirrors upon returning to your vehicle. Now that you have a more complete idea of the area in which you are parking, you can adjust your mirrors to give you a better perspective of the surrounding area you will be turning into. Your mirrors will normally be situated for straight-traffic driving, so adjusting these for a better parking view can help immensely.   ", " Swing out wide with your cab. For attached-bed trucks as well, but especially for semi-trucks/vehicles with a trailer, you should swing your front-end in an outward arc away from your parking spot by cutting your wheel of the parking spot. This will allow the rear-end of your vehicle to cut sharply in the direction of the space you are attempting to park in. Once your rear-end is angled diagonally into the spot, straighten it by turning your wheel ¼ turn or less in the direction from the spot. The more space between you and the already parked vehicles/obstacles surrounding the spot in which you are attempting to park, the more time you'll have to align your rear end with the parking spot. This will give you more space to make small adjustments and guide your rear-end into the spot. Outside of your initial hard cut in the direction of the parking spot, which began the hard turn of your rear-end toward the spot, you should only make slight adjustments while backing up. Large adjustments will likely result in over- or under-steering. If you feel your angle of approach too far off, you should pull out and start again. You should keep a close eye on the front- and rear-end of your vehicle during these maneuvers. While swinging out wide with your cab to angle your rear-end into the spot, it's easy to swing out into cars parked in spots across from the one you are backing into.   ", " Straighten out your cab. Once your rear end is aligned with the spot, your cab will likely still be at an angle to it. Allow your rear end to travel a few more feet into the spot, then turn your wheel in the direction you made your first hard cut - in the direction of the spot. This should begin straightening your cab without changing the angle of your rear-end. Use gentle steering corrections at this point; oversteering could result in the angle of your trailer/rear-end changing significantly. Some spots are too narrow or are at too sharp of an angle for you to back into in one attempt. Even experienced large vehicle drivers sometimes need several tries before their vehicle is in the right position when backing into a spot. Adjust your vehicle as necessary. You may need to pull out of your spot, straighten your vehicle one more time, and reverse back into it, nice and even. When pulling out, be careful your rear-end does not cut short or wide into surrounding vehicles.   "], "Parking Large Vehicles Safely": [" Make use of designated large vehicle parking. Many main route establishments, especially rest stops and designated “trucker” stops, will have special parking spaces intended specifically for large vehicles, like semis and moving trucks. Be on the lookout for places such as these, as this kind of parking will make your job much easier.  Some semi-trucks can need as much as four times the space used by a normal sized car.  You might want to plan your route well in advance so that you know where you can park easily while on your trip. A few popular sites that give comprehensive resources on roadway information are:   ", " Know the legal expectations for large vehicles. Due to the fact that your large vehicle can block the view of smaller ones and sometimes create a dangerous blind spot on the road, there are laws in place to prevent this from happening. These laws will vary between state and country, but generally you should : Park on a road with a speed limit over 30 mph (48 kph) unless your vehicle is disabled. Park in a way that blocks the view of the road from driveways and other streets. Park with your vehicle facing opposite the direction of traffic.   ", " Signal emergency stops soon after occurring. When you are forced to stop on the side of a road due to mechanical issues or some other problem, you must place emergency warning devices no later than ten minutes after coming to a stop. Different kinds of roads will require different placement of your warning devices, such as: On or near a one-direction street or a divided highway, you will need to place your warning devices at 10, 100, and 200 feet (3, 30.5, and 61 m) behind your vehicle. On a two-lane road with traffic that moves in either direction, or on an undivided highway, you should place warning devices 10 feet (3 m) in front of and behind the front and rear corners of your vehicle and 100 feet (30.5 m) ahead of and behind your vehicle. On bends, curves, and hills that obstruct the view of your warning devices, you’ll need to place your rearmost device so it can be clearly seen before the sight obstruction.  ", " Make a physical check of potential parking spots. Smaller parking lots and residential areas are built with smaller vehicles in mind. The best way you can gauge the space of these places is by stepping out of your vehicle and getting a clear look of your surroundings.  If possible, you should make use of a spotter, who can direct you as you move into the spot safely.   ", " Use your parking break always. Larger vehicles are much heavier than your average sedan. If your vehicle were to experience a critical brake failure, its weight would make it even more dangerous to others if it started to roll. You can easily prevent this from happening by always using your parking break as an extra safety measure.  "]}}, "How to Angle Park": {"description": "Angled parking spots let drivers glide into them quickly and efficiently with minimal steering. You’ll probably find angled parking spots in high-traffic areas like cities and parking garages, though they’re also common on one-way streets. Because of how little maneuvering is involved, learning to park at an angle couldn’t be easier!", "content": {"Pulling In": [" Locate a parking spot. Angled parking spots are most common in high-traffic areas, so spots may come and go quickly. Look for spaces between cars or other drivers who are preparing to leave.  You’ll commonly find angled parking spots in commercial lots, multilevel garages, and busy side streets.    ", " Put on your turn signal and check for traffic. Using your turn signal will tell the cars behind you why you’re slowing down, and prevent anyone else from trying to park in your spot.  Always check for traffic, pedestrians, and other potential obstacles, even when you’re just parking.  ", " Turn into the spot carefully. Start turning into the spot when your mirrors are even with the line on the side nearest you. When in doubt, go slowly rather than quickly, to avoid overshooting the spot or crashing.  ", " Finish pulling into the spot. Continue turning until the front of your car is in line with the cars next to you. Come to a stop at the line, curb, or wall that marks the spot, being careful not to bump into anything and damage the front of your car.  ", " Put your car into park. Keep your foot on the brake until you’re securely parked. If you’re parking on an incline, pull the parking brake to prevent your car from rolling down the hill.  "], "Backing Out": [" Put the car in reverse. If you’re using the parking break, don’t forget to disengage the parking brake before driving.  ", " Check behind you for cross traffic. Cross traffic may be hard to see in an angled spot, so you can also back out slowly and check again for oncoming traffic. Don’t start backing out fully until you’re sure no one is approaching.  ", " Pull straight out the parking spot, slowly. Don’t start turning the wheel yet or you might hit the cars beside you. Check again for oncoming traffic once your line of sight is clear, and stop if you see another car coming -- they have the right of way.  ", " Turn the wheel once you’re halfway out of the spot. Turn the same way you turned into the spot -- angled sports are meant to be exited the same way they were entered. Turning your wheel the wrong way will force a much sharper turn. Aim for a smooth, loose arc, and reverse until your car is on the road, pointed straight ahead.  ", " Shift your car into drive and rejoin the flow of traffic. Before you start moving, make sure your steering wheel is straightened and not pointing into the parking spot. Keep an eye out for nearby drivers exiting their parking spots.  Watch your speed until you’re out of the parking lot or garage.  "]}}, "How to Park a Car": {"description": "You can't drive a car without knowing how to park it. If you want to know how to park your car in a variety of situations, you just have to approach the spot slowly, position the car correctly, and know when to shift gears. If you want to know how to park a car, just follow these steps.", "content": {"Park Forward with a Manual Transmission": [" Steer the car in the direction of the spot. Move the wheel left or right to maneuver your car in the direction of the spot. You should approach the spot going no faster than 5 mph (8.0 km/h).  ", " Lightly place your foot on the brake. This will help you pull into the spot at the right speed and not overshoot your target. This is particularly useful if you're parking in front of a wall and. It'll help you maintain control of the car. ", " Pull into the parking space. Take care to avoid hitting the curb or other cars in your way. Focus on your depth perception: have a firm sense of how close all of the objects in your way really are. ", " Press down on the brake. Once you've pulled into the spot, it's time to firmly press down on the brake so the car comes to a complete stop. ", " Turn your wheels in the right direction. Keep your foot on the brake as you turn your wheels in the right direction. If you're pulling into a flat spot, just straighten your wheels. If you've parked uphill, you can turn your wheels away from the curb, and if you've parked downhill, you can turn your wheels toward the curb. This will keep your car from rolling away if your brakes are disengaged.  ", " Set the parking brake in place.  "], "Park Forward with an Automatic Transmission": [" Slowly steer the car in the direction of the spot. Move the wheel left or right to position the car into the spot. You should approach the spot going no faster than 5 mph (8.0 km/h). If you're directly in front of the spot, this part is easy. If you're trying to maneuver into a space between two cars that is perpendicular to you, then you have to create an arc wide enough for you to turn into the spot. When you're first turning, it may feel like you're overshooting the spot and will hit the car further away from you. Just lightly apply pressure to the brake and quickly turn the wheel in the direction of the spot to comfortably slide the car into place.  ", " Lightly press the brake. This will help you maintain control of your car while moving it in the right direction. ", " Pull into the parking space. You can lightly put your foot on the brake to make sure that you don't overshoot the spot. ", " Press down on the brake. Instead of lightly hitting the brake, you should firmly press the brake so the car comes to a complete stop. ", " Turn your wheels in the right direction. Keep your foot on the brake as you turn your wheels in the right direction. If you're pulling into a flat spot, just straighten your wheels. If you've parked uphill, you can turn your wheels away from the curb, and if you've parked downhill, you can turn your wheels toward the curb. This will keep your car from rolling away if your brakes are disengaged. ", " Shift the car into Park (P) and set the parking brake in place.  "], "Park Backward with a Manual Transmission": [" Shift to Reverse (R). Once you're within just a car's length or further away from the spot, you should switch into Reverse before you start backing up. ", " Apply light pressure to the brake. This will help you maintain control of your car as you back up. ", " Steer your car in the direction of the spot. This is a bit trickier when you're parking backwards, because you'll actually have to steer the wheel in the opposite direction that you want the car to go, instead of the same direction. If you want your car to move left, you'll have to steer to the right. ", " Pull into the spot. You can check your mirrors to start moving backwards -- or better yet, put your right arm around the left passenger seat, and look behind you. You'll have a better sense of where to move your car if you're actually looking at the space. ", " Press the brake firmly. Once you've moved the car in the right space, press the brake firmly until the car comes to a complete stop. ", " Shift to Park (P).  ", " Set the parking brake in place.  "], "Park Backward with an Automatic Transmission": [" Shift to Reverse (R). Once you're within just a car's length or further away from the spot, you should switch into Reverse before you start backing up. ", " Apply light pressure to the brake. This will help you maintain control of your car as you back up. ", " Steer your car in the direction of the spot. This is a bit trickier when you're parking backwards, because you'll actually have to steer the wheel in the opposite direction that you want the car to go, instead of the same direction. If you want your car to move left, you'll have to steer to the right. ", " Pull into the spot. You can check your mirrors to start moving backwards -- or better yet, put your right arm around the left passenger seat, and look behind you. You'll have a better sense of where to move your car if you're actually looking at the space. ", " Press the brake firmly. Once you've moved the car in the right space, press the brake firmly until the car comes to a complete stop. ", " Shift to Park (P).  ", " Set the parking brake in place.  "], "Parallel Park a Car": [" Check your rear-view mirrors. Make sure that there's no car behind you before you try to parallel park. If there is a car behind you, wait for it to pass or pull into a driveway or side-street ahead, and then approach the spot again. ", " Turn on your signal. This will let other cars know that you're parking. ", " Slow down your car. Shift your transmission down so that you approach the spot at no more than 2–3 mph (3.2–4.8 km/h). If you're driving an automatic car, just lightly press the brake, and if you're driving a manual car, shift down to a lower gear and lightly press the brake. ", " Pull your car so that it's parallel with the car in front of the open space. It should be at least a foot apart from the car. If it's too close, then you may hit the car when you start moving backward.  ", " Shift into Reverse (R).  ", " Back up. Continue to check your mirrors and blind spots to make sure that the coast is still clear. Turn around before you begin to move backwards. ", " Turn your wheel toward the curb.  ", " Lightly press the gas. If you're driving an automatic car, that's all you need to do. If you're driving a manual car, then you should slowly let go of the clutch as you press the gas. If you're parking on a hill, then you can keep pressing the clutch and just slowly move your foot off the brake. ", " Move the car backward until it's halfway in the parking space.  ", " Steer your wheel away from the curb. Continue to back up until you're fully in the space. You may not get it on your first try. You can move back and steer your wheel away from the curb, then move forward again while steering your wheel toward the curb, and repeat this process until you've got it right. ", " Park the car. Shift it into first gear if you're driving a manual car, and shift the car into Park if you're driving Pull forward until you're evenly positioned between the car in front of you and the car behind you. ", " Turn your wheels in the right direction. Keep your foot on the brake as you turn your wheels in the right direction. If you're pulling into a flat spot, just straighten your wheels. If you've parked uphill, you can turn your wheels away from the curb, and if you've parked downhill, you can turn your wheels toward the curb. This will keep your car from rolling away if your brakes are disengaged. ", " Shift into first gear. Pull forward until you're evenly positioned between the car in front of you and the car behind you. ", " Pull up your parking brake.  "]}}, "How to Park Safely in Small Space": {"description": "Parking seems like a simple task, but it’s not always easy. Some parking spaces are small and narrow, making it difficult to pull in safely without accidentally dinging the cars on either side of your space. Parking can be especially challenging when you drive a large vehicle. By taking your time and following a few helpful tips, you can successfully park safely in small spaces.", "content": {"Pulling into a Parking Space": [" Locate an available parking space. For an easier time parking, look for a parking space with another empty one next to it so that you don’t have to worry about getting too close to another parked car. If that isn’t possible, select the first empty parking space you find. If you are driving an SUV, a large truck, or an oversized vehicle, you should not attempt to park in a small space. Smaller parking spaces are best limited to smaller vehicles, such as compact cars. Attempting to park a large vehicle in a small space runs the risk of bumping into or scraping against another parked vehicle because there is no wiggle room, so to speak.   ", " Stop your vehicle before the space you plan to park in. The bumper of your vehicle should be lined up with the middle of the parking space immediately before the one you will be parking in.  ", " Flip on your turn signal. This lets other drivers know that you are about to park. When they know you are planning to park, they can stop and give you space to safely park your vehicle. ", " Check your mirrors. Even though you are not reversing, it is a good idea to check your mirrors before pulling into the parking space. You want to be sure that any vehicles behind you have stopped. If you observe a vehicle trying to pass you, wait until it is has passed before proceeding to park.  ", " Fold your side mirrors in, if possible. Once you have checked your mirrors as described in the previous step, if you have folding mirrors it is a good idea to fold in both the driver and passenger side mirrors before pulling into the parking space. In small parking spaces, vehicles parked next to one another run the risk of having the driver and/or passenger mirrors bump one another. Folding your driver and passenger side mirrors in will protect them from being broken off by other vehicles whose driver’s might not park as carefully as you.  ", " Turn your steering wheel toward the space you want to park in and slowly begin pulling in. Your turn signal should still be on at this point. It will likely turn itself off soon as you continue turning the wheel. ", " Continue turning the wheel as you drive forward into the parking space. Take your time and pull in slowly. Always be extra cautious when parking in small, narrow spaces. If there is a vehicle parked in the space next to the driver side of your car and that vehicle is extremely close to the line between parking spaces, park your car closer to the opposite side of your parking space. This will leave more room on the driver’s side so that you can safely open your door without hitting the other vehicle when getting out of your car. If the vehicles parked on either side of you are positioned in the center of their spaces, then you can also park your car in the middle of your spot rather than leaving extra space on the driver’s side.  ", " Straighten up your steering wheel once you are parallel to the vehicles or spaces next to yours. When you are fully in the parking space you want to be sure your steering wheel is straightened back into its original position. This will make it easier to back out of the space later when you leave. ", " Continue to pull forward slowly until your vehicle is all the way in the parking space, then brake. If there is a vehicle parked directly in front of your space (it will probably be facing your vehicle, unless it was backed in), be careful not to bump it as you pull all the way in. ", " Put your car in park and turn off the ignition. Upon exiting the vehicle, take caution when opening your door. In small parking spaces, there is not always enough room to open your car door all the way without hitting the vehicle next to yours. "], "Backing Out of a Parking Space": [" Check your rearview mirror and look behind your vehicle before backing out of the parking space. You want to be sure there are no pedestrians walking past and that no other vehicles are in the way.  If you folded your side mirrors in when parking, open them before reversing if you have enough room to do so. If you were able to open the side mirrors or if they were already open, check both to be sure the coast is clear before reversing.  ", " Put your vehicle in reverse and slowly begin backing up when it is safe. You will still need to continuously watch for pedestrians and other vehicles the entire time you are reversing out of the parking space.  ", " Turn the steering wheel in the direction you want the rear of your vehicle to go as you reverse. Remember to continue watching out for people and other vehicles as you back up.  ", " Apply the brakes and straighten up the steering wheel once your vehicle is all the way out of the parking spot. Do not release the brakes until the next step. You do not want your vehicle to accidentally roll further backward once you are completely clear of the parking space. If you were side mirrors were folded and you were not able to open them prior to backing out, go ahead and open them now before continuing.  ", " Put your vehicle in drive, release the brake, and slowly drive forward. You have now successfully pulled into and backed out of a small parking space. "]}}, "How to Use Parking Lot Etiquette": {"description": "Often, in our hurry to get into the store to pick up a few things before heading home, or in the throes ofholiday shopping, we disregard courtesy and respect for other drivers looking for thatperfectparking space.  It is regrettable that in our hurried up lifestyles, common etiquette is seldom observed, but if you would like to ponder parking lot etiquette, here are some steps you can take.", "content": {"Waiting for a parking space": [" Use your turn signals/indicators. Signalling your intentions to others when reaching a desired parking space will reduce unnecessary confusion in the car park. It is often assumed that when two cars reach a parking spot at the same time from opposite directions, the one that turns their indicator on first, claims the spot.   ", " Park only in designated spaces. Parking along the curb, with the exception of loading zones, or for loading a heavy item or helping a less mobile individual with their load is annoying and often dangerous. ", " Do not block other road users while you wait for a space to open up near the store entrance. The drivers in the cars behind you may be finished with their errands, and are ready to head for work or home. If the person is already pulling out, that's one thing. But if you're sitting there while they walk to the car, waiting while they put their bags in the car, etc. you'll be trying the patience of every other car behind you, especially if they can't go past you.  "], "Parking accurately in car spaces": [" Position your vehicle in the centre of the parking space. Parking over the stripes will be inconvenient yo the driver in the adjacent space, and can lead to doors getting unnecessarily scraped or dented.  Know how to neatly if you have one, or if your vehicle is large in relation to your local parking spaces because they are too small.   ", " Pull your vehicle all the way into the space. This makes it easier for other drivers to see past your car when they are backing out of adjacent spaces, and also gives the widest possible driving lane between spaces. This can be particularly helpful when shoppers pushing loaded shopping carts are sharing the driving lane with moving vehicles. The exception would be a very small compact or sub-compact vehicle. With small cars such as a Mini Cooper or a Smart car, parking so that the back end of your car is equal with the cars beside you lets drivers know that the space is occupied and does not give the false impression that the parking spot is vacant.  ", " Don't pull too far forward If you drive a small car (Honda Fit, Smart ForTwo, Kia Rio, etc. ) do not pull so far forward that your car cannot be seen as a person drives down the lane, looking for a spot. Pull into the spot, out of the lane of traffic, but not so far that your car is unable to be seen from the lane. You may be saving yourself damage from someone who sees the \"open\" space and pulls in a BIT too quickly. ", " Never force your car into a space. In crowded, busy parking lots, special spaces are becoming more common.  Standard parking spaces are generally 9 feet (2.7 m) wide while compact car spaces are only 7 feet (2.1 m) wide.  Obviously, a large SUV or Pickup will not fit easily in a compact car space, and quite simply put, they are not supposed to.  "], "Things to watch out for in parking lots": [" Watch for drivers backing out of blind spots . Small cars parked between larger vehicles like vans and SUVs often have to back blindly out of their spaces, so be alert and give them a break. If you are walking past a car in this situation, pause for a moment and guide the driver out of the tight spot if you are able. ", " Observe the legal aspects of driving in a parking lot. You are not likely to be pulled over by the police, but there are laws regarding operating a motor vehicle in a public parking lot, just as there are on the highway. Here are some things to watch for. Posted speed limits. Many large parking lots do have posted speed limits or road markings, which are for the safety of pedestrians and other road users, please abide by them.  One-way signs and markings. In parking lots with diagonal spaces, individual lanes may be one way, most often marked with a directional arrow painted on the pavement at the end of each lane. Even if the lane is not marked, you may be safe to assume the lane is one way if the diagonal spaces are oriented in the same direction on both sides.  Stop and Yield signs.  These serve the same purpose in parking lots they serve on city streets, allowing the right-of-way to a vehicle driving in a certain lane or direction, and should be obeyed.  Disabled and elderly spaces. Disabled parking spaces are generally clearly marked with signs and special striping, and are wider than regular spaces to accommodate wheelchairs. They are located near disabled ramps, usually very close to the entrance of the shop. If you do not require the use of these spaces, and do not have a permit, park somewhere else as parking there would be an inconvenience to them, and it is illegal in many places.  Pedestrian crosswalks. These are common near the main entrances and exits of most large businesses, for the safety of pedestrians returning to their cars. They are usually marked with diagonal white or yellow stripes, and often also are marked with a pedestrian crossing or stop sign.  Indicators/Turn signals. Using indicators gives other road users an idea of what your intentions are, use them in a timely manner to show what you are doing.   "], "Making your parking experience safer": [" Remove trailer hitch receivers if they hang out of the parking place. These receivers, usually made of heavy steel and often with sharp corners, can be dangerous to inattentive pedestrians trying to walk as close to parked vehicles as possible to give drivers more room. ", " Avoid curb hopping . This is very important where landscaped areas are within the curb boundaries, since jumping the curb may damage plants and irrigation components. ", " Slow down in the rain. Driving at highway, or even street speeds, in a parking lot filled with puddles of rainwater can inundate a passing pedestrian, or even another driver who is traveling with their window down. It also makes it harder to stop quickly if a child should run out or a wayward cart start rolling across your path. ", " Resist temptation to blow the horn (or give the finger ) to other drivers. You may feel like they were discourteous, but showing grace, rather than anger, shows more class and prevents reciprocal aggression. See How to Release Anger and How to Respond to a Road Raged Driver .  ", " When parking in a spot and opening doors, be aware of vehicle on each side of you as to not hit the doors and producing dings, scratches or dents, as these can be very costly to repair.  "], "Supervising children in the car park": [" Never let small children push the shopping cart for you. Not only is it dangerous in busy parking lots, but a loaded shopping cart in a hilly parking lot can end up crashing into and damaging someone's vehicle.  Children should also not be allowed to back to the vehicle, with the exception of small toddlers or infants riding in the special seat built into many shopping carts, while a parent has both hands on the handle. Do not allow children to stand on the front of the bottom of the cart, as the child could fall. ", " Keep children under control walking through parking lots. This will help protect them from inattentive drivers, and make the parking lot safer for everyone.  "], "Business parking lots": [" Be mindful of any specific parking rules your business office may have. For example, there are often employee lots reserved for certain employees or for those who have served a set length of employment as a reward. Know about these cordoned off parks before selecting a spot in which to leave your vehicle for the business day. ", " Once selecting a spot, make sure to follow all the rules explained in previous sections. This includes speed, distance, and size of parking space before pulling your vehicle into the selected spot. Be aware that in many business parking lots, parking is not the only activity, but there may be a lot of loads being unloaded and packed, in tall vehicles, that can make it more congested and difficult to see your way clear. This makes it even more important to be very careful and follow the parking lot instructions, for your own safety and for the safety of other workers. ", " Be particularly mindful of parking arrows designating traffic within the lot a certain direction and no parking zones. Going the wrong way causes accidents, while parking in no parking zones can impact loading and packing operations. It may also mean that your car registration is called out over the intercom and you have to sheepishly leave a meeting to move your car. For parking lots with two entrances/exits, one is usually the entrance and one is the exit. Pay close attention to this, as various lots will have selected parking spots along the entrance. When parking in these spots, pull all the way in, with the direction of traffic.  "], "General parking lot etiquette": [" Keep the parking lot clean. Nobody likes to see trash blowing around the parking lot as they walk to and from the business, so stow the empty fast food wrappers, ashtray contents, drink bottles, and other potential debris until you have access to a waste receptacle.  This should also apply to sales fliers and business literature, including that which is conveniently posted underneath windshield wiper blades while you are searching for your latest bargain. ", " Park shopping carts, dollies, and baskets in designated areas. Many large stores have for shopping carts when the customer is finished unloading them.  Putting the carts in these locations will make it less likely the cart you were using will end up denting someone else's car.  "]}}, "How to Use a Parking Valet": {"description": "Valet parking services are fast-paced and have their own, specific forms of etiquette that should be understood before dropping off your car. Because this is a luxury service and the workers work very hard, knowing how much and when to tip is important. Preparing your car before dropping it off, communicating well with the valet workers, and keeping your ticket on hand when picking up the vehicle are all necessary when enjoying valet services.", "content": {"Getting Ready Beforehand": [" Clean your car before entering the drop off zone. It is appropriate and courteous to pick up any trash or garbage before dropping your car off with a valet service. As the valet workers will be driving your car, it is respectful to tidy up and ensure that their experience driving your car is not a negative one. Remove any trash or leftover items of food at a gas station or service station before starting your trip.  Although washing the exterior of your car is not necessary, do so if your car is extremely dirty. Valet parking is a classy service, so ensuring that your car is presentable will be a nice touch before entering the drop off zone. It is a nice touch to hang an air freshener in your car if you smoke or if you’ve eaten any food in the car recently.   ", " Stop to get some cash for tips beforehand. Tipping your valet is an important thing to do, as valet jobs are difficult and drivers are sometimes reliant on tips to complete their full minimum wage. Plan on spending $2 - $5 (USD) on tips when you drop off your car, and 2 to 5 dollars when you pick your car back up.  Taking out ten dollars in cash and saving it specifically for tipping will keep you from not having any cash on hand when the time comes. Although a two to five-dollar tip is average, you can tip more if your valet was particularly professional and hard working.  ", " Remove any valuable personal items from the car. Before arriving at your destination, place your valuables in a bag, or take them out of your car before you leave for your destination. Although you should not assume that the valet will steal anything from you, there is no reason to risk theft by leaving something expensive in your car.  Things like electronics, wallets, or sentimental items should all be removed prior to dropping your car off. If you have items that you are not particularly worried about, you can tuck them under the seats of your car.  ", " Call ahead for the price of the valet. The prices for valet services could vary significantly depending on where you are dropping off your car. Some businesses will provide complimentary valet parking, but others will charge you. Checking beforehand will allow you to prepare for the expense.  Ask if they take credit or debit cards, or if they only accept cash. If you are using valet services at a hotel, they will mostly like charge you a daily rate.  ", " Remove your car key from the rest of your keys. When dropping your car off at the valet, there is a chance that your key could be lost. Although this is rare, it is not worth risking your entire key ring. Either bring a spare car key to give the valet worker, or take the key off the ring and bring the rest of your keys with you, keeping them safe and secure.  Giving your entire key ring to the valet worker is also a pain for them, especially if you have an abundance of keys on your ring.  "], "Dropping off Your Car": [" Identify the drop off zone and approach slowly. Approaching the drop off zone at an appropriate speed is safe and polite. Look for a sign that says “valet parking drop off,” or any signage that indicates the drop off area. Keep an eye out for valet workers, as they will direct you and show you where to pull up. Come to a slow stop in front of the sign and gather your belongings as the valet worker approaches your vehicle.  If you have trouble finding the drop off zone, do not be afraid to ask someone who works at the establishment. They will be happy to direct you to the valet parking area. Pay close attention to your surroundings while pulling into the drop off area. There will be pedestrians, and valet workers run around a lot.  ", " Leave your car running. One of the most important pieces of etiquette when dropping your car off, aside from tipping, of course, is keeping your keys in the ignition and your car running once you’ve parked. Valet workers move very quickly, and having to restart your car will slow them down.  ", " Let the valet worker open your door for you. Although this is not mandatory, as you can absolutely open the door yourself, it is a part of the valet parking culture for the valet worker to help you out of the car. This will also let the valet worker move at their own pace. Getting out of the car too early may throw off the pace of the worker and slow them down.  Having your door opened for you is a pleasant experience and will show that the valet worker is professional and hard-working, so consider this when you tip. This service will also depend on your environment. If you are arriving at a luxurious hotel or restaurant, it can be expected.  ", " Tell the valet worker about any problems with your car. If there is any problem with your vehicle that will impede in the process of parking the car, the valet drive will need to be informed. Do not go into too much detail, though, as the valet worker will be in a hurry. Simply and directly communicate the car’s problems or quirks and let the worker keep moving.  It is a good idea, for instance, to tell your valet if you have any problems with your brakes or door latches, or if your seats have problems adjusting. You can tell them some other important details, too, like whether the vehicle is an automatic or manual.  ", " Get your ticket from the valet and put it in a safe place. Although you will still be able to pick up your car with your driver's license, this will significantly slow down the process when you come back to pick up your vehicle. Place the ticket in your wallet, purse, or any other safe, easily reachable place.  If you do not receive a ticket when dropping your car off, consider asking the drivers in case they forgot to give you one.  ", " Tip the valet driver $2 - $5 (USD) before they enter the vehicle. Tipping before the driver parks your vehicle is an important part of valet etiquette. This early tip will help your chances of having your vehicle returned in perfect condition and will let the driver know that you care about the vehicle and that you appreciate the service.  Save 2 to 5 more dollars to tip the driver once you return to your vehicle. Be sure to tip the driver who is going to be parking your car, not another employee.  "], "Picking up Your Car": [" Call ahead if you are in a hurry. Although valet companies value their ability to retrieve cars quickly, this may be difficult during busy hours. If you have somewhere to go and do not want to wait for your car to be dropped off, calling ahead and letting the valet workers know that you are coming will expedite the process and ensure that your car will be waiting for you when you return.  Give the valet drivers at least 10 to 20 minutes if you expect things to be unusually busy, or if you are leaving an event at the same time as a large group of people.  ", " Hand your ticket to one of the valet workers. There will often be a valet worker behind a desk whose job it is to take tickets and inform drivers which cars to retrieve. Have your ticket ready when you approach the desk so that things run smoothly. The valet employee may ask for your name and for your basic information.  ", " Check your vehicle for damages once it arrives. Before tipping the valet driver or receiving the keys to your vehicle, do a quick walk around your vehicle looking for damages, large and small. Check the doors for dings, the back bumper for dents, and the front of the car for any damages that weren’t already there.  If there are damages to the car, inform the driver and ask to speak with a manager about the damages. Depending on where you live, the liable party for damages to your car will differ. Often, the driver is liable, but some companies will take on the liability themselves. Communicating damages right away is vital, as you will not be able to prove that the company is responsible if you drive away.  ", " Tip the driver $2 - $5 (USD) again before leaving. Once the driver hands you your keys, hand the driver this second tip to meet proper valet etiquette. Thank the driver for working so hard and let them know that you appreciate their service. If you feel as though the driver did a particularly outstanding job, feel free to tip more.  "]}}, "How to Park Safely": {"description": "The world is a dangerous place. Being careful about where and how you park is a critical factor in preserving your personal safety. To park safely, you need to find the right location to park in and be sure to execute your parking carefully by pulling into the spot with caution. Never park where it is illegal and always look for safe areas with plenty of people around. Make sure to focus only on parking and not allow any distractions. This will ensure safety for you, cars around you, and pedestrians.", "content": {"Choosing a Safe Location": [" Park in a well-lit area. If you are parking at night, be sure to park in a well-lit area that is as close to your destination as possible. Look around for any dangerous looking people nearby. If you feel unsafe, don't park there. Just keep on driving and consider coming back another day during daylight hours. You could also look for a different parking lot or a parking garage that has better lighting. Or you can go to a well-lit store, like Walmart, that has lots of lighting and built-in security.   ", " Choose an area that has people around. If you park your car off the beaten path, it will be more of a target. Choose a place where there will be people walking around. Look for an area where other cars are parked as well. ", " Find a legal spot. Make sure the place you wish to park is a designated parking area. Look for any signs that might indicate otherwise, such as a No Parking sign. Look for printed lines on the pavement that indicate that a spot is for parking.  Never park in a handicap spot unless your car has a handicap symbol on its license plate or rearview mirror. Never park on a sidewalk or in front of a fire hydrant. Never block a driveway or park too close to an intersection Never park where you will block the flow of traffic.  ", " Make sure your vehicle will be visible. This will help to prevent crime. Many parking lots and garages have security cameras. Make sure your car is clearly seen from several angles. Avoid parking next to a large truck or in between two vehicles that block the line of sight to your car. ", " Avoid parking at the end of a row. Your car will be more likely to be hit by cars driving by if it is at the very end of the row. Especially avoid parking after the end of the row in a crowded area. For example, if the lot is full, cars will sometimes make their own space next to the last designated parking spot. But this is ill-advised because your car will be more likely to get hit, get ticketed, or even get towed because it isn’t a legal spot. Avoid parking next to a cart storage area at a grocery store. Your car might get a dent from a cart.  ", " Be prepared to pay. Some parking garages or city streets require payment to park there. Take note of this as you are choosing a spot and be sure you have the money to pay. Sometimes you will need to pay ahead of time, like with a parking meter, and other times you will pay when you leave, like when leaving a parking garage. It’s never fun to pay for parking, but it’s much less fun to get a ticket or get your car towed! Sometimes you can pay by credit card, but other times it requires cash or coins. Be sure you have the appropriate payment method available.  "], "Pulling In Safely": [" Carefully enter the parking lot. Observe its activity. Drive slowly and pay attention to other vehicles and pedestrians. ", " Be prepared to suddenly stop. A pedestrian could walk in front of you or another car could back up. This is why it is important to move slowly and proceed with great caution. ", " Focus solely on parking. Do not check your phone or turn around to look at your kids while parking. 20% of accidents occur in parking lots, so it is important that parking have your undivided attention. Once your car is safely in its spot, you can deal with anything else. ", " Choose a spot with enough space. Don’t try to squeeze your car into a tight space because you could hit the car beside you, ding their door, or they could hit your car. Look for a spot that will allow for at least two feet on both sides of your vehicle.  If there aren’t too many cars in the parking lot, leave a few spaces between you and other cars.  ", " Prepare to pull in. Stop your car 6 to 8 ft away from the spot. Slowly come to a halt and turn on your turn signal for 3 seconds when coming to your spot. This will show other cars that you are turning and will give you a chance to check the area around you for traffic and pedestrians. Only begin to move into your parking space after you have carefully looked at the area around you and signaled to other drivers that you will be parking. ", " Park in the lines provided on the parking space. Carefully position your vehicle within the given space. Make sure your vehicle is in the middle of the space and not too close to either line. If you have an over-sized vehicle, then consider taking up multiple spaces so that your vehicle is not in the lane of the parking lot. This is a problem with many larger trucks and SUVs. You could park in additional spaces by parking perpendicular to the parking spots.  ", " Park as close as possible to the curb on a road. Anytime you are parking on a street rather than in a parking lot, be sure to pull over as far as possible. This is especially important when parallel parking. Try to park as close to the curb as you can so that your vehicle will not be hit by cars driving by.  If it is a busy road, exit your vehicle on the passenger side of the car rather than into traffic.  ", " Use your car’s safety brake when you park on a hill . This will keep your car from rolling. You should also turn your tires diagonally so that it won’t move. When parking uphill, turn your front tires away from the curb; when parking downhill, turn your front tires towards the curb.  ", " Know how to park in all situations. You should be comfortable parking at an angle , parallel parking , and reversing your car into a parking spot . There are situations where these skills will be necessary, so be sure to practice ahead of time. To get comfortable with these skills, you could go to an empty parking lot and practice. If the parking lot doesn’t have these types of parking spots, you could set up your own with cones. For parallel parking and reverse parking, it is especially important to check all of your mirrors and your blind spot to ensure you won’t hit any cars or pedestrians.  ", " Use safe parking technology. Cars are starting to come with tools to help you park safely. If your car has technology like a Blind Spot Warning System, Reverse Monitoring System, or an Intelligent Parking System, make use of these. They can help you to safely pull in and out of your parking spot without hitting anything. Be sure to heed their warnings and respond accordingly. "], "Leaving Safely": [" Remove valuables from your car. This will help to prevent theft and break ins. If you leave money or your purse or laptop on the seat, this will tempt people to steal it. Your car should look boring and like there is nothing of value inside.  ", " Open your vehicle's doors carefully. Be careful not to hit another person's vehicle with your door as you exit your vehicle. You can make this much easier by leaving enough space in between you and the cars next to you. ", " Lock your car securely. Make sure that all doors and the trunk are locked after you leave. This will protect your car.  If your car has a security system, be sure to activate it. It will sound if anyone attempts to break in.  ", " Supervise young children as they exit the vehicle. Accompany them by either carrying them, pushing a stroller or holding their hand as you leave the car. They will need help safely navigating the parking lot. ", " Reverse your car carefully. To pull out of the parking spot, you may need to reverse your car. Be sure to reverse your car very slowly and only after checking your mirrors and your blindspot. To reverse, turn your head around and look behind you while maneuvering your vehicle. Wait to begin turning your car out of the space until the front of your car is out of the spot so that you don’t hit the car to your side.  Driving in reverse is when many accidents occur and when you are most likely to hit a pedestrian. When reversing, you do not have the right of way! Let other cars and pedestrians move first. Use your turn signal to show which way you will be pulling out. Signal for at least 3 seconds.  "]}}, "How to Find a Parking Spot": {"description": "You are not alone when it comes to the frustration of finding a parking spot. On any given day, people drive an extra 3,600 vehicle miles searching for a parking spot in a single neighborhood. You can save some of the time and money associated with these extra miles by using a mobile app, planning ahead and thinking strategically when you get to the parking lot.", "content": {"Using Apps": [" Download the mobile parking app that is best for you. Open the app store on your smartphone and then open the navigation category. Look for relevant parking apps that meet your key criteria. For instance, you may want to choose an app that allows you to pre-pay for parking or sends notifications when your parking is about to expire. If discounts are a priority, some apps have significant deals on entertainment and travel. Parkopedia is available on a range of platforms and helps you calculate the cost of parking. BestParking, which is available for over one hundred cities and airports. Parking Mate, which sends you notifications when your spot is about to expire. Parking Panda, which is great for discounts and entertainment events.   ", " Use the mobile app designed for your area. If you are driving in a city or to a university that has its own mobile app, you should download it to your smartphone prior to departure. Some neighborhoods, cities and universities embed sensors in parking meters and send this information to a particular mobile app, so you should download the app with this information. San Francisco has its own app with up-to-date information on parking spaces.  University of Maryland has its own mobile app for parking. Roosevelt Island in New York City has its own mobile app for parking. Use VoicePark in San Francisco.  ", " Pre-pay for parking with a mobile app. Some mobile apps, such as ParkWhiz, allow you to pre-pay for your parking prior to departure. You can use the app to find a spot close to your destination, pay for it and then get a scan code that you use when you get there.  ", " Use a parking app to find a spot near your entertainment event. You can download parking apps that specialize in major sporting and entertainment events, such as Parking Panda. If you refer people to the app, you may be able to earn free parking spots at entertainment events.  ", " Download an airport parking app before flying. There are mobile apps with up-to-date information on parking spaces available at airports. Download one of these apps before driving to the airport parking lot. Some of these apps will also give you travel and hospitality deals.  \"AirportParkingReservations\" is great for parking reservations at airports in Canada, the United States and the United Kingdom. Through this app, you can access \"ParkSleepFly\", where you can get deals on airport hotel and parking deals. BestParking does a combination of airport and city parking.  ", " Get a notification when your parking is about to expire. Use your mobile parking app to receive a notification when you are about to run out of parking time. In this way, you can avoid potentially expensive parking tickets.  Parking Mate will send you a notification when your spot is about to expire. For instance, Parker has a timer that helps you avoid parking tickets.  ", " Pull over to the side of the road to use your mobile app. Once you have come to a stop in a safe position, grab your smart phone. Open the mobile app that you use to find parking. See where you have to drive to find a spot. Head to the spot and safely park your vehicle.  "], "Making Strategic Decisions": [" Choose a row and look for a spot. When you get to the parking lot at your destination, choose a parking row. Instead of driving around the lot looking for a spot, simply choose one row and wait for a spot to open up. You will save the time involved in the more active parking lot search, which doesn’t typically save any time.  ", " Practice your patience on busy days. If the parking lot is full because of a major event, you should just sit around in your car and wait for a spot to open up. Although it may sound more time intensive than driving around or going to a different parking lot, it will typically save you time and energy.  Wait in a strategic location. Stop in the middle of a row of parking spots that is regularly changing, and you'll be the first if a spot becomes available. Look for people who are walking back to their car. If they have car keys, keep a close eye on them until they get to their spot. When they leave, take their spot.  ", " Look for spots on the periphery. Parking spots directly in front of an entranceway are often the most coveted. To save time, look for a spot a few parking rows over or even on the edges of the parking lot.  ", " Consider the speed of exiting the parking lot. Try to avoid pedestrian crossings and pick up lanes. Look for spots that are close to an exit, so that you can increase your efficiency when you need to leave the parking lot.  If you are parking in a shopping center, you may want to park close to the shopping cart return center. This will save you time when you are leaving.  ", " Look for long term parking spots online. There are a variety of websites that specialized in searching for parking spots, such as parking spotter. You can also try general websites, such as Craigslist. Navigate to one of these websites and click on relevant links to find long term parking options for your neighborhood. ", " Arrive early. If you have trouble finding parking at a particular destination, you may want to arrive earlier to your destination. Whether you are going to work or to an entertainment destination, getting to your destination early will increase your chances of finding a spot.  "]}}, "How to Choose Airport Parking": {"description": "Choosing airport parking is an important element of planning any travel through an airport. This is because there are a variety of parking options at most major airports. Thus, you need to consider several factors including cost, safety, and your schedule when choosing a parking lot. Ultimately, by evaluating your needs, picking your lot, and being prepared to park on the day of your flight, you’ll take steps to make your trip more seamless.", "content": {"Evaluating Your Needs": [" Figure out your schedule. When choosing parking, you need to figure out your schedule, flight time, and general itinerary. Without this information, you won’t be equipped to choose a parking lot. Locate the time of your departure and arrival. From this information, you’ll be able to determine how long you will need to park your car for. Know the day of your departure and arrival. This may be important, as parking might be limited on peak travel days like Friday and Sunday. Thus, if you plan to travel at a busy time, you may need to consider an off-airport lot or keep a backup lot in mind.    ", " Calculate how long you will need to park. The length of time you’ll leave your car in airport parking is also an important factor in choosing a place to park. This is because different parking lots and services are geared toward different amounts of time. Hourly parking is great if you’re just dropping someone off at the airport and want to escort them to security check point. Very often, this parking is available from one to three hours. Short term parking provides parking over the course of a day or even several days. This is best if you’ll park your car for less than two days. Long term parking is parking for more than one or two days. Long term parking is best for people who need to park their car for several days, a week, or even longer.  ", " Determine how much you can pay. Cost is a major factor to consider when choosing airport parking. This is especially true if you are in a city or will be parking your vehicle for a week or more. The price of long-term parking at on-site lots at smaller regional airports range from $8 to $16 a day. The cost at major airports like Los Angeles International can top $30. Off-site airport parking at lots not affiliated with airports can be substantially cheaper. In Atlanta, you may find parking as cheap as $6 a day. However, make sure to consider safety and transportation to the terminal. For people who need different options, the cost of short-term parking is about a dollar per hour at many regional air ports, and $3 or $4 an hour at major airports like Los Angeles International. You should also consider \"Park and Ride\" options in your community. You may be able to park for free or inexpensively, and then use mass transit to get to the airport.   "], "Gathering Information about Specific Lots": [" Call for more information. When it comes to picking your parking lot, you may just want to call the lot or whoever is responsible for maintaining the lot. By calling, you’ll be able to gather important information that you may need when evaluating the lot. Inquire as to whether you can reserve a spot. Ask about the general availability of parking for the time you’ll need a spot. For instance, if you need to park your car from 10am on a Friday to 1pm on a Sunday, ask about how busy the lot is on the weekends. Get exact directions, or ask if there is anything tricky about accessing the parking lot. Find out about methods of payment. In the past, many lots only accepted cash. Over the last decade, though, many airport parking lots have begun to accept credit or debit cards.  ", " Think about the safety of the lot. When it comes to picking a lot, you need to consider its safety. This is important, as you want to make sure that you or your vehicle are not exposed to crime. Drive by the parking lot in advance, if you can. From driving by, you’ll be able to see if there are a lot of people loitering or if there is a police presence. If there are a lot of police around, this may be an indication that crime at the lot is relatively regular. Plug the address of the parking lot into your local law enforcement’s crime record website. By doing this, you’ll see if any crimes have been reported in or near the parking lot. If there are a lot of robberies, grand theft auto, or other similar crimes reported, you should consider a different lot. Conceal all valuables you may have in your car.   ", " Park close to the terminal, if you can. Finally, when it comes to picking a lot, you’ll want to think about how close it is to the terminal. This is important, because depending on your schedule and psychical condition, it may be a major factor. If the parking lot is off-location from the airport, meaning it is not on an adjacent piece of land, you need to think about transportation to the terminal. In many cases, the parking lot will offer a complimentary shuttle to the terminal. Make sure to factor this time into your schedule. If the parking lot is on-location, but is far removed from the terminal, you’ll have to walk with your luggage to the terminal or take a shuttle. If you choose to walk, be prepared for a walk up to 10 minutes or even more.  "], "Parking Before Your Flight": [" Have a backup plan. You should have a backup plan of where you’ll park just in case the lot you intend to park is full. This is especially important during busy travel times like the winter holiday season and during the summer. Familiarize yourself with one of the other lots you investigated when choosing your lot. Know the address of the lot and how to access it. Carry cash on you, just in case that is a cash only lot. Consider parking at long term parking provided by your community’s mass transportation system and then using mass transit to get to the airport.  ", " Leave your home with enough time. When it comes to parking before your flight, you’ll have to make sure to leave your home with enough time for you to get a spot and then make your way through security to your gate. Without providing yourself enough time, your parking may not run smoothly and you may be late for your flight. Use popular websites like MapQuest or Google Maps to estimate the time from the airport to the parking lot. When estimating driving time to the airport, add thirty minutes in case something goes wrong. If you live in a city with bad traffic, consider adding more. Factor in time it may take to find a spot in the parking lot and then to walk from your car to the terminal. Make sure to add in time it takes to check your bags, move through security, and walk to your gate. For domestic flights at major airports, make sure you arrive at the airport two hours early. For regional airports, consider an hour or an hour and a half. For international flights, consider two and a half hours or more. If you are picking an off-site parking lot, build time in for extra time it may take to get from your spot to the terminal.   ", " Choose your spot. The spot you choose is also very important. This is not only because of its proximity to the terminal or to a shuttle, but because your car will be there for so long. The closest spot is not always the best. Park near a light, in case you return at night time. Try to park in an over-sized spot or an end spot, so you can minimize the chance of your car being hit or dinged by someone else. Find a spot close to a breezeway or in a garage. You’ll thank yourself if it’s raining or snowing when you return. Write down your spot. As some parking lots are extremely large and confusing, make sure to write down the spot number and the section of the parking lot. This will save you a lot of time when you return for your car.   "]}}, "How to Find Parking with Parkopedia": {"description": "Finding a parking spot in a crowded area can be tough. If you have the Parkopedia app on your mobile device (iOS or Android), you can use it to find parking easily by just entering your current location or an address. It will then give you details about available parking spaces and even give you directions and other pertinent details, like payment options and opening hours.", "content": {"Finding Parking Near Your Current Location": [" Launch Parkopedia. Locate the app on your device and tap on it. The app icon has a picture of a book with the letter “P” on it. It looks like an encyclopedia for parking, hence the name.  ", " Check your current location. On the main dashboard, tap the “Current Location” menu. The app will determine where exactly you are on the map, and  a results screen will be displayed. It will have your current location specified on a map, represented by a drop pin. All the parking options in and around your area will be indicated by small boxes with parking costs. You can easily see which ones are the nearest and most cost-effective for you. You have to have a Wi-Fi connection or data plan to use this app.  ", " View the parking options. There is also a list of parking options on your screen. Swipe up and down to see more. Each option has a rating based on user reviews, a price estimate, the maximum capacity, and its distance from you. Tap on the one you’d like to view. ", " View the parking details. The selected parking’s details will be displayed. This includes its availability, capacity, price menu, distance, opening hours, accepted payments, and basic features. You may also see a photo of it, together with user ratings and reviews. ", " Find a parking area. From the options you’ve checked, go to the one you prefer. Use the address provided on the parking’s details screen so you can easily navigate towards it. "], "Finding Parking near an Address": [" Launch Parkopedia. Locate the app on your device and tap on it. The app icon has a picture of a book with the letter “P” on it. It looks like an encyclopedia for parking, hence the name. ", " Enter an address. On the top of the main dashboard is a search field. Enter the city, place, or post code of the address where you want to check parking. ", " Select the location. As you type in your address, a list of suggested results will be displayed right under the search field. Select the location you want by tapping on it. ", " View the map. A results screen will be displayed. It will have the location you’ve entered on a map, represented by a drop pin. All the parking options in and around the area will be indicated by small boxes with parking costs. ", " View the parking options. There is also a list of parking options on your screen. Swipe up and down to see more. Each option has a rating based on user reviews, a price estimate, the maximum capacity, and its distance from you. Tap on the one you’d like to view. ", " View parking details. The selected parking’s details will be displayed. This includes its availability, capacity, price menu, distance, opening hours, accepted payments, and basic features. You may also see a photo of it, together with user ratings and reviews. ", " Note the selected parking options. If you’re doing this method, most likely you’re planning a trip and will want to prepare ahead. Note all the parking options you selected and use their details when the time comes. "]}}, "How to Park in a Major City": {"description": "Traveling within a major city can be considered a stressful situation. When it comes to driving  within the city one of the most aggravating tasks is trying to find decent parking. A person will find themselves driving around searching for a place to park while in turn trying to dodge the insane traffic around them. This instruction set provides simple step by step instructions on how to park in any major city, thus eliminating a stressful situation.  By doing a little pre-planning, assessing your funds, and narrowing down  your parking options you will find parking in a major city less of a hassle.", "content": {"Pre-Planning": [" Look up your destination online using Google maps.  Approximate your duration at the destination.   ", " Find the different methods of parking located near your destination (Meter, Structure, and Free).  ", " Determine payment options (card or cash)  for parking methods.  ", " Print directions out to your location and chosen parking area if needed.  ", " Assess your funds available for parking.  If available, count cash/ coins on hand. Check your bank account (online or over phone) for card payment. After you have decided how much you are willing to spend choose your method of parking.  "], "Methods of Parking": [" Use a parking meter. (Only if funds are available) Locate empty meter area. Pull into empty parking spot and make sure you are within the designated area.  ", " After turning your car off, walk to the meter with coins or credit card ready in hand.  Read the time limit for the parking meter and enter the amount of money that is needed for the time you determined for your stay. Double check the meter and read the proper amount of payment that was entered. Once you are satisfied you may proceed to your destination.  ", " Park in a structure. (Only if funds are available) Pull into the entrance of the parking structure with cash or credit card ready in hand. Observe the time of accessibility to structure Swipe your card if it is automatic or exchange payment method with the cashier. Find a parking spot and make sure you do not block anyone else’s path.  ", " Try free parking (if available).  Locate empty parking area. Pull into your desired parking space. (Do not block any driveways, sidewalks, or fire hydrants) Shut vehicle off and exit your car. Analyze your surroundings and parking limitations (Look for posted signs regarding parking) If satisfied proceed to desired destination.  "]}}}