{"How to Play Fetch with a Ferret": {"description": "Fetch can be a fun game to play with ferrets, but some ferrets may struggle with learning how to return a ball. For this game to work, your ferret should learn how to push a ball with its nose. Toss a ball, and let the ferret chase it before you command it to return to you. While many ferrets may not be able to learn to fetch the ball properly, you can increase the chances of successfully training your ferret with time and plenty of treats.", "content": {"Pushing a Ball": [" Avoid balls that can be easily chewed. This includes rubber and latex balls. Golf balls, tennis balls, ping pong balls, and whiffle balls are perfect for ferrets to roll around. They are also safest for ferrets to play with.  Balls with bells or rattles inside can also be fun to chase. Avoid balls that are small enough to be picked up in their hands or mouth. These can be a choking hazard.   ", " Guide the ferret to the ball with a treat. Hold a small treat in your hand, and use it to draw the ferret towards the ball. Touch the treat against the ball. Once the ferret touches the ball with its head, give it the treat. Repeat this three or four times.  You can buy prepackaged semi-moist ferret treats at the pet store. You might also give your ferret a small piece of cooked meat. If the ferret won't go to the ball, put the treat away, and try again another time.  ", " Reward the ferret when it pushes the ball forward. Once the ferret understands how to touch the ball, encourage it to push it forward. Start saying \"push\" when you want the ferret to move the ball with its head, and only reward it when it manages to roll it a few inches forward.  At this point, you should stop giving the ferret treats whenever it touches the ball. The ball must move before you give it a treat. Practice this trick once or twice a day until your ferret can push the ball on command.  "], "Chasing the Ball": [" Bounce a ball for your ferret. Take a lightweight bouncing ball, such as a tennis ball or ping pong ball, and bounce it across the room. Avoid hitting any fragile objects. The ferret will go racing after it.  ", " Roll out balls in a straight line. You can also just roll the ball for your ferret to chase. Whiffle balls, golf balls, and ping pong balls are good for rolling. Quickly flick or toss the ball forward. Let your ferret run after it.  ", " Rub a little bit of salmon oil on the ball to encourage hesitant ferrets. One drop of oil is all that you need. Your ferret may go scrambling after it, and it will try to lick the oil off the ball afterwards.  While many ferrets don't enjoy the taste of fish meat, many do like the taste of fish oil. If yours won't take salmon oil, try using liquid FerreTone instead.  "], "Bringing the Ball Back": [" Use clicker training to teach your ferret commands. Start by clicking your clicker and immediately giving the ferret a treat. When the ferret learns to expect a treat when it hears a click, give your ferret a click and a treat whenever your ferret does something you like, such as touching the ball. The ferret will learn to do things you want it to do in order to get a treat.  You can get a clicker at a pet store or online.  ", " Teach your ferret the “come” command. If you want your ferret to bring a ball back to you, it is important to teach the ferret to return on command. Place the ferret about 3 feet (0.91 m) away from you. Hold a treat in your hand, and say “come.” Give it the treat when it comes to you.  As it gets better at coming on command, start putting the ferret farther and farther away until it comes running from 10 feet (3.0 m) away. This command can take up to two weeks to teach successfully.  ", " Ask your ferret to come after it gets the ball. Toss or bounce the ball, and let the ferret chase it for a few seconds before saying “come.” The ferret should return to you. It may or may not roll the ball towards you. ", " Reward the ferret when it brings the ball back. If the ferret pushes the ball back towards you, give it a treat. This will encourage it to repeat this behavior in the future.  ", " Fetch the ball yourself if the ferret doesn’t bring it back. If you keep taking the ball and tossing it for your ferret, it may start bringing you the ball to encourage you to continue. ", " Repeat the game a few times. You might only toss the ball a few times before your ferret gets bored. If you play this game daily, your ferret may learn to return the ball in a couple weeks. Don’t be discouraged if your ferret doesn’t learn how to play fetch properly. You can continue to play catch with it, but you may have to retrieve the ball yourself.  "]}}, "How to Get Your Dog to Stop Playing Fetch With You": {"description": "Many dog owners are jealous when they meet a dog that loves to play fetch. All dogs need exercise, and a chance to bond with their owner. That said, a ball-obsessed dog is not just an annoyance. If the drive to chase the ball is too strong, the dog may push itself past its limits and suffer from heatstroke or injured joints. Training is the best long-term solution for controlling a dog's fetching behavior.", "content": {"Training Obedience During Fetch": [" Begin with basic training . Start here if your dog hasn't yet learned basic commands, such as \"Sit\" and \"Come.\" These are easy first commands to learn, because the dog can connect them to an obvious, immediate action. Train the dog in sessions no longer than 15 minutes at a time, using these techniques:  Get the dog's attention with a treat or toy. Say a short command (like \"Sit\") in a loud, clear voice. Say the command one time only, to teach the dog that he needs to respond right away. To get the dog to sit, raise the treat above the dog's ahead, or gently press down on the hindquarters. For other commands, you may need to mimic what you want the dog to do, or wait until the dog does it accidentally. Praise the dog as soon as he obeys, and give the treat. Many dog owners use a clicker tool to make a sound that the dog will learn means a reward.   ", " Teach the dog to drop it . Once the dog knows a couple commands (at least Sit and Come), you can start teaching it good manners during fetch. The Drop It command is useful for dogs that won't let go of the ball or stick, even while they're begging for you to throw it again. Here's how to train this behavior: Give the dog a toy to hold in its mouth. Choose one it likes to play fetch with. Hold a small treat near its mouth. Pick something the dog likes, but not so much that it ignores the toy. When the dog lets go to eat the food, say \"Drop it\" and pick up the toy. Repeat until the dog starts opening its mouth as your hand approaches. When this happens, start saying \"Drop it\" before the toy is released. Finally (perhaps after several 5–15 minute sessions), leave out the food and reward the dog with praise instead.  ", " React to begging by starting a different form of play. When the dog tries to start a fetch session, throwing the ball will teach it that this method works. This isn't a problem for many dogs, but if yours wants to play fetch for 24 hours, deflect these requests with other activities. Take the dog outside instead, go for a jog, or give him a belly rub. Once the dog is distracted, get its attention and start a fetch session. This shows that are the one who decides when to play fetch, not the dog.e yourself. ", " Be firm when ending a play session. Don't let the dog determine when you play fetch. Watching her bark, whine , and jump isn't fun, but if you give in, she'll learn that it gets her what she wants. Don't give in to \"one last throw\" after you decide to end it. A stern \"That's enough\" or \"No play\" command can teach some dogs to stop bothering you. This is more difficult to train, since you can only use the command while the dog is misbehaving. Try an additional signal, such as clapping your hands, to reinforce the idea. When playing outdoors, end the play session by putting on the leash and walking calmly back inside or to the car.  ", " Stick to a schedule if necessary. Some \"ball-obsessed\" dogs, including many retrievers, have trouble resisting the extreme drive to play fetch. If you've tried training for two or three weeks and you aren't happy with the results, start a fetch schedule. Play fetch only at certain times of day, in five minute sessions — or longer sessions with a break every five minutes. If you regularly visit a dog park or other play area, consider only playing fetch during those visits. The more structured the play session is, the more likely the dog is to learn how it works. Try starting each session by saying \"Playtime!,\" and giving the dog a set of commands: \"Sit,\" \"Stay,\" \"Fetch,\" \"Come,\" \"Drop It.\"  "], "Other Solutions": [" Hide the ball. If you don't want to play fetch, take the ball or other thrown object and hide it. Do this when the dog isn't looking, and place the ball somewhere the dog can't see it. If your dog want to play fetch constantly (and is getting adequate exercise), keep the ball hidden. Only take it out during playtime. When outside, hold the ball on the side opposite the dog, or hide it in a bag.  ", " Distract the dog. Try this of the dog won't obey a \"drop it\" command, or won't stop harassing you. Show the dog a treat and toss it next to him. Toss another treat a few feet (couple meters) away. When the dog goes for it, grab the ball and hide it. This is best used when you're looking after another person's dog and urgently need cooperation. If this is your own dog, training it is the better long term option.  ", " Get a mechanical thrower. These devices automatically launch tennis balls across your backyard or hallway. If your dog is bored or doesn't get enough exercise, this could be a good solution. Keep an eye on the dog the first few times it plays. Make sure the thrower doesn't launch the ball hard enough to hurt the dog. Several short play sessions a day are healthier than one long play session. Puppies and old dogs are especially vulnerable to injury, and should stop after five minutes to catch their breath and drink water.  "]}}, "How to Teach a Dog to Fetch": {"description": "Playing fetch is a great way to exercise your dog and strengthen your bond with him at the same time. Many dogs are naturally good at chasing something that is thrown to them, but they may not always be good at bringing and giving it back. Teaching your dog how to complete the fetching process will help to make the game of fetch more fun for the both of you.", "content": {"Teaching Your Dog to Drop His Toy": [" Use the “Drop it” command with a treat. Your dog may be good at catching and bringing the toy back to you, but may not know that he needs to drop it. To teach him how to drop his toy, hold a treat in one hand. With your dog sitting or standing in front of you, start shaking his favorite toy in your other hand until he gets excited (eg, wagging his tail). As you’re shaking the toy, give the verbal command “Take it.” After your dog is excited and you’ve given the command, allow him to take the toy from your hand with his mouth.  After a few seconds, give him another verbal command– “Drop it”– to drop the toy.  Your dog will probably not drop the toy once he has it in his mouth (at least not initially), which is why you’ll need the treat. Hold the treat close to his nose. Once he drops the toy, immediately reward him with the treat.    ", " Use the “Drop it” command without a treat. Put the treat in your pocket. When he has his toy in his mouth, hold your hand in front of his nose as if you have the treat in your hand and give him the “Drop it” command. When he drops his toy, reward him with the treat.  Eventually, your dog should be able to drop his toy with only the verbal command to do so.   ", " Increase the time that your dog holds his toy in his mouth. Gradually increase the amount of time that he must hold his toy before you give him the “Drop it” command. The longer he can hold his toy in his mouth, the easier it will be for you to him teach him the next parts of the fetching process. Increase the time by a few seconds each time you practice. If he drops the toy before you command him to do so, start again shorten the period of time that he has to hold it.  Remember to reward him each time he drops his toy at your command. Practice the “Drop it” command each day until your dog is comfortable with it and has mastered it. This part may take longer if he is reluctant to give up his toy once he has it in his mouth. Practice in short intervals (5 to 15 minutes) several times a day.  "], "Teaching Your Dog To Bring His Toy Back To You": [" Play ‘Bait-and-Switch’ with your dog. If you notice that your dog chases after his toy but doesn’t bring it back to you, try playing fetch with two of his favorite toys. To play the ‘bait-and-switch’ game, throw his first toy. When he fetches this toy, call him to get his attention. Once he starts turning to you, throw his second toy in the opposite direction that you threw the first toy. He’ll probably drop the first toy to go chase after the second one.  When he’s chasing the second toy, run and get his first toy. Call his name, and repeat the process.  Your dog probably sees this as a fun game of chase, but you are teaching him to turn back to you.  After doing this a few times, throw your dog’s first toy again. Call his name, but do not throw the second toy yet. When he gets closer to you with the first toy in his mouth, give him the “Drop it” command and show him the second toy. When he drops his first toy, throw the second one. When he chases after the second toy, pick up his first toy and repeat the process.  Eventually, your dog will learn will learn to bring his toy back to you after you throw it to him, without the need for the second toy.   ", " Play ‘Catch Me If You Can’ with your dog. This is another game to teach your dog to give his toy back to you. Attach a leash or rope to his toy and throw the toy. If your dog catches it but doesn’t bring it back, wiggle the leash or rope and start running in the opposite direction. Chances are that your dog will start chasing you with the toy still in his mouth. Give him a treat if he does so.  If your dog initially drops the toy and doesn’t chase after it, wiggle the leash or rope a little more and start running away. Eventually, he should try to chase after and catch the toy. Give him a treat when he gets closer to you with the toy.  After a few weeks’ time, your dog will learn that he should bring his toy back to you after you throw it to him.   ", " Teach your dog to bring his toy closer to you. If your dog tends to drop his toy before bringing it all the way to you, stand in place and say “Bring it” just as he reaches the point where he usually drops it. Wave your arm to gesture that he should follow you, and then start walking away from him. When he starts to follow you and reaches the place where you were originally standing, say “Drop it” and walk back towards him to pick up the toy.  It may take a few weeks before your dog understands the “Bring it” command, so be patient with him.   "]}}, "How to Throw a Boomerang": {"description": "A boomerang is a type of throwing star which originated in Australia as a hunting weapon used by the Aboriginal people. Nowadays, the boomerang is used for sport and recreation, and is famous for its unique ability to return to the thrower. Throwing a returning boomerang is a skill which requires a specific technique and plenty of practice, making it a feat akin to getting a hole in one on the golf course.", "content": {"Gripping the Boomerang": [" Start with the proper grip. You can hold the boomerang on either arm -- the lift (leading) arm or the dingle (trailing) arm. Either way, make sure that the painted, curved side is always facing toward you and the flat side is facing away from you.   ", " Try the pinch grip. The pinch grip involves \"pinching\" the boomerang between your thumb and index finger. You throw the boomerang by flicking your wrist backwards before snapping it forwards. This creates enough momentum to pull the boomerang out of your hand and create spin.  ", " Test the cradle grip. This grip is similar to the pinch grip, except you wrap your index finger (or all four fingers) around the edge of the boomerang instead. Grip the boomerang as close to the bottom of the arm as possible, and as you throw, flick the boomerang with your index finger as if pulling a trigger. This helps to create spin.  "], "Finding Good Throwing Conditions": [" Find a large, open area. Choose an area where you have at least 50 meters (164.0 ft) of space on all sides. Football fields, soccer pitches, and open park spaces are all good options. Make sure there are not too many trees or bushes for your boomerang to get caught in, or large bodies of water for it to fall into.  Avoid practicing your boomerang throw in crowded areas, or places with a lot of windows or parked cars. It can be difficult to predict where your boomerang will land, and a mis-thrown boomerang can cause significant injury or damage to property.  You should always throw from the center of an open space. This will help you to throw more consistently, while also providing some leeway on all sides if the flight of the boomerang doesn't go as planned.   ", " Watch out for weather conditions. Wind is one of the most important  factors in the proper return of a boomerang. Ideally, you want a nice calm day, with winds between 0 to 10 mph (16 km/h). Some boomerangs will not return in completely calm weather, but most will. Avoid throwing your boomerang in high winds, as it will distort the path of the boomerang and throw it off course.  Light rain will not distort the flight of the boomerang. If you choose to use your boomerang on rainy days, put a protective seal on it, especially if it's made from wood, to prevent it from swelling with moisture.  Even though falling snow will not affect the flight of the boomerang, snow on the ground will conceal a fallen boomerang, making it almost impossible to find.   ", " Throw the boomerang around the wind. You want to throw the boomerang \"around\" the wind, meaning that you throw it to the right of an oncoming wind, and it returns on the left (or the opposite if you're left-handed). You want to throw your boomerang between 45 to 90 degrees to the right or left of an oncoming wind.  To figure out wind direction, pick up a fistful of grass or leave and throw them into the air. If the leaves blow across your face to the right, you will need to turn left, and vice versa.  Stand so that the wind is blowing directly into your face, then turn about 45 degrees to the left or right, depending on which is your dominant hand.  Some boomerangs work better when thrown at a wider angle to the wind (up to 90 degrees) so experiment a little to find out which angle works best for you.   "], "Throwing with Proper Technique": [" Throw the boomerang vertically, with the correct layover. Boomerangs should be thrown vertically overhand, as if throwing a baseball, so they will cartwheel end-over-end. Hold the boomerang so that it's perpendicular with the ground, tilting it 5 to 20 degrees to the right (if you're right-handed) or to the left (if you're left-handed).  The degree to which you tilt the boomerang is called the layover. If using a wide layover, you should throw the boomerang softly, whereas more vertical layovers will require harder throws.  Throwing a boomerang horizontally will prevent the boomerang from returning. It will cause the boomerang to climb high into the air, before dropping straight back to the ground and potentially breaking.   ", " Throw the boomerang at the appropriate elevation. Most boomerangs only need to be thrown at eye-level, with an elevation about 10 degrees above the ground. A good trick is to pick a point slightly above the horizon, such as some far-away tree top, and aim directly for it.  ", " Figure out the footwork. A right-handed thrower will need to pivot their right foot outwards, lift their left leg so all the weight is on the right, then step forwards onto the left foot as they throw, in a move that's known as \"casting the foot out.\" Left-handed people will do the exact opposite. This helps to put more weight behind the throw, increasing the distance the boomerang will travel.  ", " Give it some spin. Spinning the boomerang as you throw is perhaps the most important deciding factor in whether your boomerang returns to you or not. You can give your boomerang spin by cocking your wrist backwards, then snapping it forwards as you throw. You shouldn't just release the boomerang -- it should be ripped from your grip by the force of the spin.  ", " Focus on technique, not strength. Unless you're really focused on distance, the strength of your throw is not the most important thing when it comes to throwing a boomerang. Once you have the hang of putting a good spin on your throw, you can start to focus on power.  ", " Catch the boomerang. The best way to catch a returning boomerang is to extend both arms, wait until the boomerang reaches below shoulder level, then clap your hands together to catch the boomerang between your palms (known as the sandwich catch). If you've lost sight of your boomerang, or it's coming at you too fast, turn around, hunker to the ground, and cover your head with hands.  There are lots of trick catches you can try, such as the under-the-leg catch, the hand-to-foot catch and behind-the-back catch. You may want to wear some padded fingerless gloves to protect your hands while attempting these trick catches.   "], "Choosing the Right Boomerang": [" Purchase a high quality boomerang. The type of boomerang you buy will have a significant impact on whether you will get it to come back to you or not. Boomerangs are made from regular pieces of wood or plastic, so it takes some skilled workmanship to imbue such everyday materials with the aerodynamic qualities that make boomerangs so unique. There are loads of boomerangs on the market, but not all of them are true returning boomerangs, so do your research before you buy.  ", " Beginners should choose a v-shaped or a tri-bladed boomerang. Pick one that is made from lightweight materials. These boomerangs do not require a strong throw, which allows beginners to focus more on technique. They will usually travel between 10 to 25 meters (32.8 to 82.0 ft) before returning.  ", " Choose a heavier boomerang if you are advanced. Once you have mastered the throwing technique and your boomerang is consistently returning, you can move on to intermediate and, later, advanced boomerangs. These boomerangs tend to be heavier, come in a variety of shapes and sizes, and can travel distances of up to 50 meters (164.0 ft) before returning.  ", " Pick a boomerang made for your dominant hand. Be aware that you will need either a left-handed or right-handed boomerang depending on your dominant hand. If you're left-handed, you will have considerable difficulty in throwing a right-handed boomerang with any success. "], "Troubleshooting": [" Reassess your throw if your boomerang won't come back. If your boomerang is failing to return to you, the reason is one of two things: your boomerang is of poor quality, or your throw is incorrect. If you think your throw is incorrect, focus on correcting the following common mistakes:  Decrease the layover of your throw. If your throw is too horizontal, it will almost certainly fail to come back. Throw your boomerang vertically for best results. Don't throw the boomerang your body. Instead, throw it straight ahead. If your throwing hand ends up across from the opposite shoulder, you know you're doing it incorrectly. Work on your spin. Focus on flicking your wrist, as this is where most of the spin comes from. You can also experiment with different grips and hand positioning to find out which is most comfortable and effective for you.  ", " Change your direction if your boomerang returns to the wrong spot. If the boomerang comes back but lands too far in front of you or too far behind you to catch, you are probably facing the wrong direction in relation to the wind.  If the boomerang lands in front of you, try turning a few degrees to the left, so you are throwing more directly into the wind. If the boomerang lands behind you, try turning a few degrees to the right, so you are throwing further away from the wind. These directions will be reversed if you are left-handed.  ", " Watch your boomerang closely if you keep losing sight of it. The flight of a boomerang is almost impossible to predict, so if you look away for even a second, you may not be able to find it again. If you've thrown it well, the boomerang may fly back suddenly and hit you in the face. But if you've thrown it badly, you may never be able to find it again.  Wear sunglasses while practicing in case your boomerang flies into the path of the sun. They will also protect your eyes should your boomerang come back and hit you in the face. If the boomerang falls out of the sky as the result of a bad throw, make a mental note of a landmark you can use to locate it. Search for it right away, as you may not be able to find it later.  ", " Repair your boomerang if it becomes warped or nicked. Boomerangs can easily become warped or dented due to repeated crash landings or fumbled catches. However, with a little love and care most of these problems can be patched up and your boomerang will still be in perfect working order.   Place the boomerang in the microwave or hold it over the heat on an electric stove for 8-10 seconds. Bend the boomerang in the opposite direction to the warp and hold it in place until the wood cools again.   Fill any holes with a little wood putty. Once the putty dries, sand the boomerang until smooth, then cover with a coat of polyurethane seal to keep moisture out.   "]}}, "How to Throw a Frisbee": {"description": "It can be challenging to make a Frisbee glide if you don't know how. This article will teach you to throw a Frisbee using a basic backhand technique.", "content": {"Learning the Throwing Motion": [" Grip the Frisbee in your fist. Your thumb should be on top of the Frisbee, your index finger should be against the edge and your remaining fingers should touch the underside.   ", " Stand with your feet at a 90-degree angle to your target. Your right foot should be in front if you are right-handed, and your left foot should be in front if you are left-handed.  ", " Curl your wrist slightly back towards your body as you hold the Frisbee. Your elbow should be pointing up and outward.  ", " Point the Frisbee at your target. Usually, you are throwing your Frisbee to another person, so you will want to aim your Frisbee so that your partner can catch it easily.  ", " Move your arm forward quickly. Straighten your arm and, as your arm is almost fully extended, flick your wrist and release the Frisbee out towards the target.  Your wrist should snap with a spring-like motion. Release the Frisbee at different heights for different effects during the throw. For the most stability, try releasing it just above your belly button.  ", " Release your Frisbee with the appropriate amount of power. Too much power or too little will cause the Frisbee to hit the ground, wobble or fly wildly.  "], "Fine Tuning Your Throw": [" Practice your throwing technique. Practice will perfect your own technique and give you a feel for how the Frisbee interacts with air currents.  Try throwing the Frisbee between two cones with a friend Try throwing the Frisbee at a target.  For example, you could throw the Frisbee into a box or toward a tree.  ", " Increase your power. During your throwing action, shift your weight from your back foot to your front foot while twisting your hips. For more stability, step outwards with your dominant foot.  ", " Get the details right. Remember these details while fine-tuning your throw.  Concentrate on your wrist snap. This action will add spin to your throw, which will make it more accurate and will keep the Frisbee from wobbling Bend your elbow during your toss. The elbow bend will also improve your accuracy while increasing the power of your throw. Keep the disc level as you throw. Imagine that the Frisbee is a dish of ice cream and that you are trying not to spill your dessert.  "]}}, "How to Teach a Dog How to Catch a Frisbee": {"description": "Many dogs love to play with Frisbees, although most dogs don't know how to catch a flying disc. With a little patience and the following steps, you and your pet can learn to do this fun and rewarding activity.", "content": {"Steps": [" Buy a minimum of 2 *dog* discs. Human discs (\"frisbees\") can injure your dog. Look for the brands Hyperflite, Hero or Aerobie. These discs are specially designed to reduce risk of injuring your dog.  There are discs for destructive dogs (the Hyperflite Jawz) and soft floppy discs as well (the Aerobie Dogobie).  The Flippy Flopper is a soft fabric disc available at most pet stores. The Kong Flyer is also a good choice. ", " Get your dog to get excited about the disc by associating it with very positive things. For example:  Use the disc as a feeding dish for a week. Rub hot dog on the disc and praise your dog for going after it. Play tug gently with the disc.  Always let your dog win.  Don't rip the disc out of your dog's mouth. Reward any behavior that shows \"drive\" to get the disc. This means that even if your dog jumps up and grabs the disc out of your hand without waiting for you to offer it to her, this is positive! Never tell your dog to 'DROP' the disc. Always use a second disc to entice your dog to drop the one in his mouth, on his own. Remember, always encourage your dog's drive to have and get the disc.  ", " Throw \"rollers\". Instead of throwing the disc in the air, throw it so that the disc rolls on the ground like a wheel. This helps your dog transition from fetching a ball to retrieving a disc. Dogs love to chase discs this way.  It helps them learn to \"target\" the disc and pick it up.  ", " Throw the disc in the air and alternate with rollers. Begin with short, slow throws, and be very careful to avoid hitting your dog with the disc. In the beginning, your dog will likely let the disc hit the ground before retrieving it. It may take 100 or more throws before your dog grabs it out of the air for the first time. Be patient! ", " Encourage your dog's drive to get the disc. Eventually your dog will get used to the flying disc, learn how to track it in the air, and eventually will want the disc so badly (\"DRIVE!\") that she won't want to wait for it to drop to the ground and will instead grab it out of the air. This is the moment you've been waiting for! Congratulations, you now have a Disc Dog!  ", " Prepare to be amazed.  "], "Young Dogs": [" Teach grabbing. Bend over slightly and hold frisbee in your hand, horizontal to the ground, at the height of the dog's mouth. Then let him grab it with his mouth while you are still holding on to it. Say \"drop it\" then take the frisbee from his mouth immediately. Now praise the dog graciously by saying \"good boy (girl) and repeat the process again a few more times.   ", " Teach running and grabbing. Now do the exact same exercise, only move your body in a circle away from the dog, keeping it at the height of the dog's mouth. As the puppy grows, you will be able to stand up while doing this exercise. ", " Teach jumping and grabbing. Now that you are standing up, hold the frisbee a little higher than the dog's mouth and horizontal to the ground, so he has to jump up to grab it.  After a while, release the frisbee right before your dog jumps up to grab it. Try turning in a circle with this exercise as well. ", " Advance to the steps above for older dogs. If you are training a young pup, you may need to repeat all the above many times before it is ready to chase the frisbee.  "]}}, "How to Play Ultimate Frisbee": {"description": "Ultimate Frisbee combines all the best elements of American football, soccer, basketball, and everyone's favorite beach sport: tossing a Frisbee disc. But there's nothing leisurely about Ultimate. Intense, fast-paced, and strategic, a good game of Ultimate Frisbee is like nothing else. If you want to learn to play, you can get a simple overview of the easy rules, learn to get a game going, and how to strategize to give your team the best chance of winning.", "content": {"Learning the Rules": [" Find a suitable playing field. To play ultimate Frisbee, you’ll need a bit of room to spread out. Traditionally played on soccer or football fields, ultimate Frisbee can be played in any open field that’s at least 70 yards by 40 yards, with marked-off end zones at each end, where points are scored. In regulation Ultimate Frisbee, the end zones are 20 yards deep.  Work with the space you have. If you’re playing in a backyard, don’t worry about measuring it off. Just set up two end zones at each end of the yard to give each team a territory, then start playing.   ", " Divide into two teams. Ultimate Frisbee is a team sport that will require at least a handful of players on each side to play. Split up your group of friends into two evenly-divided teams.  The absolute minimum of players would be four–two per team–but that would be a challenging game. It’s usually best with between five and seven players, per side. Regulation Ultimate Frisbee teams have seven players on each side, though the roster can include as many players as you want. Players may be substituted any time after a point is scored.  ", " Play with the correct kind of disc. You can play Ultimate Frisbee with any kind of Frisbee, though it’s typically easier and more recommended to play with a slightly heavier version of the classic recreational disc. This makes controlling your passes and your distance a lot easier than with a basic beach Frisbee.  175 gram Frisbees are recommended for playing Ultimate Frisbee, which are widely available at sporting goods stores. The Discraft Ultra-Star 175 is the official playing disc for the USA Ultimate Championship Series.  ", " Learn how play is advanced. As in soccer, American football, lacrosse, or other goal-based sports, each team has one end zone that they’re defending and will attempt to score in their opponent’s end zone. The object of the game is to move the Frisbee down the field by completing passes to your teammates.  The player in possession of the Frisbee may not move and must not hold the Frisbee for longer than 10 seconds. The rest of the players will move around the field and attempt to get open for a pass. If a pass is dropped, goes out of bounds, or is intercepted, play is turned over to the defending team at the point of play. Meanwhile, the team not in possession of the Frisbee will attempt to intercept the disc and otherwise disrupt the passes made by the team in possession.  ", " Find a league in your area to learn more. It can be hard to find enough people who know how to play informally, and get a regular game going. For this reason, the best way to learn the strategies, techniques, and enjoy playing Ultimate Frisbee is to find a league in your area in which you'll be able to learn the ropes and have fun making new friends. You can find pick-up games in your area here . "], "Playing the Game": [" Launch the Frisbee to the winner of the coin toss. After dividing into two even teams and going over the basic rules, pick which team will start with possession. This can be done by tossing a coin, flipping the Frisbee, or using some other method of your choice, then launching the disc to start play.  The opposing team will stand at their end zone and “pull” the disc to the other team, essentially tossing it in the air for someone to grab, much as a ball is kicked off in American football. This will also happen after each point is scored. The puller should make sure everyone is ready, then toss the Frisbee high toward the opponent's group of players. All the pullers teammates should immediately run toward the opposition to start playing defense.  ", " Score points with complete passes. A point is scored by completing a pass into the opponent’s end zone territory. Upon scoring a point, the possession of the disc changes to the team that was scored upon. The team in possession of the Frisbee will be trying to score and the other team will be trying to disrupt play and get possession of the Frisbee, so they may score.  A point is scored when a player passes the Frisbee to another player who is standing in the end zone, and that player makes the catch successfully. At that point, play ends and the defending team will receive possession of the Frisbee. Substitutions may be made in the transition period after a point is scored and before the other team takes over possession of the disc.  ", " Do not make contact with opposing players. Physically contacting players on the opposing team is illegal. Picks, screens, and other disruptive plays are not allowed in Ultimate Frisbee. It’s important for defenders to be disruptive and guard the other team, much as in basketball, but without actually coming into contact.  It is up to the defender guarding the player in possession of the Frisbee to count to 10, usually aloud. It is this defenders job to police 10-second infractions.  ", " Play to 15 points. Typically, a game of Ultimate Frisbee ends when one team scores 15 points, though you can amend this rule to fit your time constraints and your desires for the game. Typically, a game to 15 can take as long as an hour and a half, so you might want to play to seven or 10, if you don’t have that long.  ", " Police yourselves. Ultimate Frisbee is uniquely anarchic. Even in regulation play, no referees or line judges are used to govern play. Fouls, points, and disputes are resolved on-field by the two teams. Ultimate Frisbee requires honesty and goodwill, making it a game of trust and fun.  Sometimes an “observer” is used to offer some objective party, uncommitted to each side, who may be used for procedural details, such as keeping track of the time.  "], "Using Strategy": [" Practice making good throws before you try to play Ultimate. To throw a Frisbee correctly, place your index and middle finger under disk, close to the lip. Curl the two fingers to get a firm grip, and twist your body to your throwing hand side. Take a step forward with your dominant foot, and untwist your body. Once you have faced forward, flick your wrist, release the disc, and point where you want the disc to go. Keep the Frisbee parallel to the ground.  ", " Learn more advanced throws as you improve your game. As you advance, you can develop more complex throwing motions into your game with some practice. This is To \"hammer throw,\" put your index and middle fingers under the disk and put your thumb on top. Do not curl your index and middle fingers. Like you are throwing any ball, raise the disk over your head, and have the disk angled towards your head. Make sure you have about a 50-55 degree angle on the disk. Still keeping the angle, throw the disk forward and upward. The disk should fly perpendicular to the ground for a couple seconds and flip upside down to float softly to the ground. This throw is a little tricky to catch, but can be useful under heavy defense. Try a sidearm toss. Place your index and middle fingers under the disk, and curl them against the lip of the disk. Place your thumb on top. Twist your body slightly towards the disk, and flick your wrist to release the disk. Make sure you twist your hand towards your body when you throw to put enough spin the disk to fly. This throw is very useful when you are being defended by an opposing player, but takes practice.  ", " Make quick passes. The difference between teams that are good at Ultimate Frisbee and teams that are just playing is in the speed of the passes. Practice making quick, crisp, accurate passes with your teammates and moving quickly down the field to keep the defense off balance. Though the player in possession has 10 seconds to hold onto the Frisbee, it should be a rarity that a player holds the Frisbee for longer than five. Don't worry about making \"hail mary\" passes that launch all the way down the field. These types of passes are low-probability and will more often result in picks, than in long point opportunities.  ", " Let your quick teammates run onto the passes. Throwing a pass directly to a stationary player is a good way of getting your Frisbee toss picked off by the defense and losing possession. Instead, practice leading your teammates, passing into open space, and allowing your teammates to outrun the defense and run down the Frisbee. This is a more effective technique of moving possession down the field and gathering territory. ", " Don't rush it. Unless you see a great opportunity, you don't need to charge down the field as soon as you grab the Frisbee. Focus on making high-probability passes and controlling the possession of the disc, not in scoring immediately. If you've got the Frisbee, possess it. Make crisp and accurate passes and move down the field gradually, gaining territory. Like in soccer, you can move in any direction when you've got possession of the disc. If you need to make a few passes backward to regroup and control the field, do so. You generally want to be going forward and not back, but it can be a good way of strategizing.  ", " Move to open space. When you're not in possession of the Frisbee, you need to be constantly moving into open space, looking to get open. Spread out. Make cuts, juke out your defenders, and hustle, hustle, hustle. Learn to make crossing patterns in your cuts, taking short routes across the path of the player in possession of the disc, rather than moving parallel. This will result in higher probability passes and help you control the disc. It gives the player in possession more options.  ", " Practice pattern routes. Like in basketball, soccer, or almost any team sport, it's important to have a few plays drawn up, especially when you get into scoring pattern. Whether you want to give them fancy names (\"Flying V on one, on one!\") or just run them on the down-low, moving the offense in pre-drawn patterns is a good way to juke out the defense and stay ahead of the game.  If the player in possession knows what kind of route you're likely to run, the passes can go to open space and allow players to run them down.  ", " Mark up player to player on defense. When you're playing defense, the best way to mark up is usually \"man-to-man,\" by marking up on one player for the whole game and sticking to them like glue. Defense should be played much as a combination of basketball and football, using your arms to disrupt the shots of the player you're guarding and trying to pick off passes. Defenders need to give the offensive player a bubble, at least a yard around the point of possession. You can't get in close enough to physically touch the player in possession of the disc. Remember: no contact. When you're running with players on defense, try to watch their hips instead of watching for the Frisbee. Stay between them and the player in possession of the disc, to give yourself the best chance of picking one off.  "]}}, "How to Throw a Frisbee Forehand": {"description": "The forehand, also known as the flick, the two-finger, or the side arm, is one of the two most common ways to throw a Frisbee. To throw a forehand, you'll have to \"flick\" your wrist forward while keeping the Frisbee parallel to the ground as it moves toward your opponent. This throw, similar to the forehand in tennis, can be a bit tricky to master, but once you get the hang of it, you'll be able to throw a disc with superior distance and accuracy. If you want to know how to throw a Frisbee forehand, see Step 1 to get started.", "content": {"Throwing a Regular Forehand": [" Grip the disc correctly. To properly grip the disc for the forehand, you'll need to use your thumb, index finger, and middle finger while keeping the other fingers out of the way. These three fingers alone should be enough to hold the weight of the disc and to give you the power and control you need. Here's how to grip the disc:  You'll need to stick your thumb out, thumbs up style, and make a peace sign with your index and middle finger, making sure your palm is facing the sky. These are the three fingers you'll need. Now, hold the disc with your left (or non-dominant) hand, logo side up, and place it over your \"peace sign\" fingers, while folding your thumb over the top of the disc. Then, fold your ring and pinkie fingers into your hand as if you were making a loose fist, just touching your palm, to keep them out of the way. Fold your middle finger toward your palm, pushing it against the inside of the rim. Your index finger should stay straight, pointed toward the center of the Frisbee, supporting some of its weight. Squeeze the disc, pushing your thumb down and your middle finger tight against the rim.  For a variation, instead of the \"split fingers\" grip, you can move your index and middle fingers together for the power grip, which will give you more power but less control.   ", " Get in the proper stance. Once you've got the grip down, you've got to step out, with your feet slightly more than shoulder width apart, pointing toward the receiver. Your knees should be slightly bent to help you maintain your balance and to gather power.  ", " Bring the disc back. Now, bring the disc back with your dominant hand while shifting your weight toward your throwing foot, so that about 80% of your weight is on your throwing foot, while 20% of your weight is on your other foot. Your arm should be close to parallel to the ground.  ", " Move the disc back behind your elbow. Keep bringing it back until your elbow is in front of the disc, pointing toward the receiver. Bend your wrist back as far as you can. When you snap it forward, it will generate the momentum you need to spin the disc.  ", " Keep the disc at a slight downward angle while moving it forward. The disc should be angled about 10 degrees downward parallel to the ground. Your throwing hand and arm should be parallel to the ground, with your other arm slightly behind you. You should increase the bend in your throwing foot a bit, too.  ", " Throw the disc. Now, flick your wrist as you move your throwing arm from the outside to the inside of your body (the opposite motion of throwing a backhand). The power should come from the shoulder, passing naturally through the elbow and into the wrist, allowing the disc to spin. When you throw the disc, make sure that you rotate your body, using your throwing side first, and then your shoulders. Use your non-throwing hand to balance your body after it rotates, to create balance as you move it out and behind you a bit.  You may be tempted to flip your wrist because of throwing balls or playing other sports. But for throwing a disc, you should keep your palm facing up toward the sky so the disc will come off flat instead of flipping over, which is a common problem many first-time forehand throwers have.  If you've ever skipped rocks, you can think of the wrist movement as being similar. In a sense, you are skipping the rocks by throwing a forehand, if this helps.  ", " Follow through. After you release the disc, make sure to point after its flight path with your hand, keeping it level, with your palm up. Keep your pinkie and your ring finger slightly bent up and your hand level. Continue to look at the receiver to make sure that your disc is headed on the right path.  "], "Throwing Other Forehands": [" Throw the high release flick. This is the same as a regular forehand, except you throw it above your shoulder, flicking your wrist and raising your arm on release. This is good for getting around other people.  ", " Throw the low release flick. This is essentially a very low forehand. Lunge to the side you're throwing on, sinking down as low as you can. Release the disc just inches from the ground, trying to get it under a defender's arms. Your elbow should just barely make it past your knee when you throw the disc. This is effective at all ranges, but a little bit tricky to master.  ", " Throw the \"pizza flip. \" This is used mostly for faking. Here, you start to do a regular forehand throw, but at the last minute, you rotate the disc counter-clockwise, under your throwing arm, by using just your middle finger to hold the disc. Then, you release the disc toward your dominant side, which will be perpendicular to the standard way you will throw the disc using a forehand.  "]}}, "How to Make a Frisbee": {"description": "Making a frisbee is a fun way to play a game of catch with a friend. Homemade frisbees are lightweight and fairly soft making them ideal for indoor play. Using simple items like paper plates, paper and tape, you can create a fun toy to toss around.", "content": {"Making a Frisbee from Paper Plates": [" Get out supplies. To make a frisbee you will need two paper plates, packing tape, scissors, and markers for decoration.   ", " Decorate your plates. Use markers to draw designs on the bottom of the plates. You don’t need to decorate the side of the plate you put food on because it will become the inside of the frisbee.  ", " Tape the tops of the plates. Cover the side of the plate that you would place food on with clear packing or shipping tape. Cover the entire surface of the plate and trim the excess tape from around the edges of the plate.  You can use decorative duct tape to tape the plates and decorate your frisbee at the same time.  ", " Cut a circle out of the center of the plates. Cut out the center of the flat portion of the plate. Your circle should be about 3 inches in diameter. Trace a circle using a large cup. Stab scissors through the center of the plate and cut out the circle leaving the edges of the plate intact.  ", " Tape the two plates together. Attach the plates together with the packing tape around all the edges. Cover the entire decorated surface of the plate with the tape. Tuck the excess ends of the tape around the hole in the center of the plates.  ", " Toss your frisbee. Hold the frisbee parallel to the ground and throw it by snapping your wrist as you release.  "], "Fold a Frisbee with Post-it Notes": [" Fold the Post-it note it half. Fold the Post-it so that the sticky end sticks to itself. Position the Post-it so that the sticky end is on the left side. The sticky part will be on the inside of the fold.  ", " Crease the top right corner down. Fold the corner down so the right edge of the Post-it is aligned with the bottom edge. The post it should look like a square on the left half and a folded triangle on the right half.  ", " Unfold and open the Post-it. You will see a vertical crease down the center of the sticky portion and two diagonal creases along the bottom.  ", " Fold the sticky ends to the center. The sticky end will hold the edges down. Fold both edges to the center. The Post-it should be  in a “house” shape.  ", " Refold the post it in half. It should now have a point on one end with the diagonal crease visible on the other side.  ", " Push the square end toward the center and flatten to form a parallelogram. Fold the end along the diagonal creases in an inward fold. This is the basic shape that will be used to form the frisbee. If you look at the post it from the open side of the folds, you should see a V shape.  One side of the parallelogram will be a single point while the other end will have two flaps.  ", " Fold seven more Post-its for a total of eight. You will need eight folded parallelograms to create your frisbee.  ", " Connect the shapes together. Attach the 8 shapes together by inserting the end with the single point between the two flaps of another Post-it.  Place one Post-it between the flaps of another. Fold the ends of the two flaps over the flaps of the Post-it you inserted. The flaps of the Post-it that were inserted will receive the next Post-it. When all 8 Post-its are connected you will end up with a donut shape.  ", " Throw your frisbee. Flatten the shape to get the best results when attempting to throw your pocket sized frisbee.  You can push the opposite edges of the donut shape together to transform your frisbee into a star shape.  "], "Making a Frisbee from Paper Claws": [" Fold eight sheets of paper into paper claws . Use colored paper to make a colorful frisbee. You will need to fold all eight sheets into claws to create your frisbee.  ", " Insert the point of one claw into the opening of another. Use tape to secure each claw together. Continue inserting the claws into one another to create an octagonal shaped donut.  ", " Wrap the frisbee with tape. Use scotch tape or duct tape to give stability and strength to your paper frisbee.  Use tape to connect each claw together. Wrap the entire frisbee using decorative tape to add stability and a design element.  ", " Throw your frisbee. You should be able to get considerable distance with the ring shaped frisbee.  If you use duct tape to wrap the frisbee it should be used outside because it can be thrown a long way!  "]}}, "How to Make a Paper Frisbee": {"description": "A paper frisbee is a cool toy that you can put together in just a few minutes. It flies almost as well as the real deal but is safe to use indoors. Best of all, you can make it in any size or color you want.", "content": {"Using Folded Pieces of Paper": [" Gather your supplies. To use this method, you will need at least eight pieces of 3” x 3” paper (6 cm x 6 cm). You can use printer paper or origami paper, which will be thin and easy to fold. You will also need a ruler and glue.  You can use thicker paper like cardstock but make sure they are 3” x 3” as this will make it easier to fold and fit the pieces of paper together.   ", " Fold the paper in half on a diagonal. Make sure the top right corner folds to meet the bottom left corner on a diagonal line. You can use the ruler to ensure you get a nice even fold on a diagonal.  If you’re using double-sided paper, make sure to fold it so you can see the colors. Otherwise, they’ll just be hidden in the frisbee.  ", " Fold the tip of the paper down. Take the left top corner (or the tip of the triangle shape of the paper) and fold it so it touches the bottom left corner of the paper. Use your fingers or the ruler to make a nice, even crease.  Repeat these steps for the remaining seven pieces of paper. Make sure the folds are on the same side. For example, if the first piece is folded so the left top corner touches the bottom left corner of the paper, you should do this for the remaining pieces of paper. This will make it easy to put the pieces of folded paper together and form the frisbee.  ", " Use glue to put the pieces together. Once you have eight pieces of folded paper, you can use glue to put them together in the shape of a frisbee. You will glue and slide each piece of paper together to form the frisbee. You can use other adhesives like tape or staples, but glue will work the best.  Turn one of the folded pieces so the point of the smaller triangle faces to the left and the right point of the larger triangle faces to the right. Place a small dot of glue on the top corner of the folded piece where the smaller triangle and the larger triangle form a straight line. Slide the section with the glue into the pocket of the second folded piece of paper. The pocket will be formed by the smaller triangle section of the folded piece of paper. Press down on the paper so the glue sets properly. The pieces of paper should make two 45° angles on the inner and outer edge when you’re done.  ", " Repeat the process for every piece. Add glue to the piece of paper you just glued inside the other. The pieces will naturally make an octagon as you put them together. Make sure you don’t accidentally glue the paper to your work surface and risk tearing it.  ", " Test out your creation. It’s better to throw paper frisbees with more of a backhand flick than a full frisbee toss. The motion should be almost entirely in your wrist. Paper frisbees aren’t sturdy enough to stand up to a throw with all your strength behind it.  Don’t worry if it doesn’t work the first time. Try to figure out what went wrong and fix it the next time you make one. Is it too floppy to throw? You probably made it too large or added too much glue. Did one of the connections come apart? Add a little more glue and try again.  "], "Using Paper Plates": [" Gather your supplies. To make a frisbee out of paper plates, you will need the following supplies:  Two regular sized paper plates Scissors Tape or a stapler Colorful markers or crayons for decorating your frisbee.  ", " Place both plates right side up. Position the plates as if you were going to put food on them, with the right side facing towards you.  ", " Decorate the plates. Turn the plates upside down and decorate them as you wish with markers or crayons. You can put animals, shapes, or flowers on the plates. Make sure the decorations remain on the upside down area of the plates so they are visible when the frisbee is thrown in the air.  You may also want to put circular shapes on the plates to mimic the movement of the frisbee when it flies in the air or create an interesting design on the plate that appears when the frisbee is flying in the air.  ", " Cut a circle out of the center of each plate. You can do this by placing the plates together so the decorated sides are facing outward and cutting the circle out of the center of both plates. You can also do this one at a time by cutting the circle out of the center of each plate.  Start by cutting a diagonal line from one end of the center of the circle to the other end. Then, cut another diagonal line so you have an \"X\" shape in the center of the circle. You can then cut out the center using the \"X\" cut.  Try to cut only the center of the plate out and leave the rest of the plate intact.  ", " Put the two plates together with the decorative side facing outward. Use tape or staples to seal the edges of the plates together so the plates stay together. You should now have a frisbee with a hole in the center.  "]}}, "How to Throw a Frisbee Backhand and Forehand": {"description": "Every Ultimate Frisbee player needs to at least have the two most basic Frisbee throws in his arsenal in order to be successful.  These are the forehand throw, and the backhand throw, which when used in tandem allow you the ability to make throws to either side of the field while being covered by a defender, who must now cover you on two sides.  Each set of directions will provide detailed instructions on the stance, as well as the actual mechanics, of both throws.  However, before we get into the actual throws, you must know the kind of Frisbee we need and the ideal weather conditions.", "content": {"Equipment and Environment": [" Using the proper Frisbee is vital to performing these throws correctly when one is a novice of ultimate Frisbee. The kind of Frisbee you want to use is one that is the 175 grams (6.2 oz), which is the official weight for the game of Ultimate Frisbee.  There are plenty of companies that make official ultimate discs, but a few include Discraft, which seems to be the most popular, and Wham-O, who were the inventors of the original Frisbee Flying Disc. All official Ultimate Frisbee discs are flat on the top, with the outside sloping down to a vertical lip around the entire circumference of the disc.  The bottom  looks like a flat bowl, or a plate with a vertical lip.  This shape allows the most control and distance for the thrower.  ", " Ideal Weather Conditions: As can be pretty easily guessed, the most important condition that allows you to throw a Frisbee well is no wind.  When wind is a non-factor, the flying disc will go exactly where your muscles send it since there will be no outside force to blow it off course, slow it down, or even speed it up.  As well as no wind, warmer temperatures (above 70 degrees Fahrenheit or so) are preferred, as warmer air will keep the Frisbee flying for a greater distance, and warmer temperatures are generally just more enjoyable.  However, for health and safety reasons DO NOT practice these throws outside if the temperature is severely low or high, you are not comfortable with the current conditions, or the weather is too dangerous to be in for an extended period. Additionally, you may want someone to throw back and forth with, as retrieving your own throws can get quite tedious and boring!  Now that we have gone over what we need to know before, we can move on to the mechanics. "], "Backhand": [" Stand with the foot that corresponds to your dominant hand (the hand you will be throwing with) forward.  ", " Point your dominant shoulder in the direction you wish to throw.  ", " Turn your head the direction you wish to throw. Basically, you will be standing parallel to the line of the Frisbee’s flight. ", " Spread your feet shoulders length apart and bend your knees slightly.  ", " Grip the Frisbee in your dominant hand, with your thumb resting over the top of the disc, and your other four fingers.  ", " Raise your throwing arm parallel to the ground and tuck the Frisbee into your chest. Your forearm and your wrist should be bent inwards. ", " Step into your throw while keeping your toes pointed perpendicular to the direction of the throw.  ", " Move your forearm and wrist outward in a quick throwing motion, while keeping your entire arm parallel to the ground, and your shoulder in place. Your shoulders should not move. Note: It is important during this step to keep your arm parallel to the ground, or the Frisbee will not fly flat and will veer off course. ", " Release (quickly) the flying disc just before your entire arm is straight and in a locked position. The Frisbee should be out of your hand by the time your arm is in this position. ", " Repeat and practice, practice, practice!  "], "Forehand": [" Stand with your non-dominant foot forward (the opposite of the foot used for a backhand throw).  ", " Point the toes of your forward-facing foot slightly inward of your target, and the toes of your other foot perpendicular to the direction of the Frisbee’s flight. This allows for the best balance and comfort while throwing the forehand. ", " Point the shoulder of the arm you will not be using to throw toward your target.  ", " Turn your head towards your target.  ", " Spread your feet shoulders length apart and bend knees slightly.  ", " Grip the disc with your thumb over the top and squeeze your middle and index fingers together then against the inside of the bottom lip so only the middle finger is touching the Frisbee, next squeeze your pinky and ring finger together and against the outside lip of the Frisbee so that your pinky and ring finger are clamping the lip against your middle and index finger. Only your middle and ring finger and thumb should be touching the disc.  Your hand should look like the Spock hand clamping on the disc ", " Raise your forearm parallel to the ground. Your upper arm should essentially be straight down. ", " Bend your wrist back (outward) about 45 degrees.  ", " Cock your forearm back slightly, preparing to throw.  ", " Quickly move your forearm inward while simultaneously flicking your wrist towards your target. Keep your middle finger pressed against the bottom lip until you release the disc.  Most of the throws power should come from the flick of your wrist. *Note: Again, it is important during this step to always keep your forearm parallel to the ground, or the Frisbee will not fly flat and will veer off course. ", " Release the Frisbee just before your wrist is pointed towards your target, and watch it fly!  "]}}, "How to Get Better at Disc Golf": {"description": "You have started playing disc golf and now you want to get a little better at thesport.  Perhaps you have a friend that crushes you every time you play with them, or maybe you want to start playing some tournaments to go for a little cash and prizes.  Either way - this is a good place to get some direction for your quest to become a better disc golfer.", "content": {"Steps": [" Determine how good/bad you are. A good resource for this would be the PDGA (Professional Disc Golf Association) website.  Look under membership/classification.  The key here is to look and see where you may rate.  A recreational player will make 30% - 50% of 20 feet (6.1 m) putts, and drive 150 to 300 feet (45.7 to 91.4 m).  An intermediate player will make 50%-70% of 20 feet (6.1 m) putts, and drive 200 to 350 feet (61.0 to 106.7 m).  ", " Determine a realistic goal - and commit to it. Perhaps you have an underpowered 150 foot (45.7 m) drive.  This is a significant disadvantage over an average player who will launch the disc 250 feet (76.2 m).  If this is you - focus on improving the distance of your drive.  If you can drive over 200 feet (61.0 m) - then you need to become an expert putter. ", " Putting is the skill that will separate an advanced player from a recreational player every time. It is the single best area to focus on to take strokes off of your game.  To determine what the impact could be on your game - do some tracking. ", " Keep score next time you play. When you record your stroke count, put beside it the number of feet to pin you were away when for the stroke before you made it in the basket.  So, unless you make a deuce or an ace, every hole should have a distance in which you missed what could have lowered your score by 1 stroke. ", " Take a look at the numbers . Do you have any at all below 20 feet?  This you can correct in a week or two of practice.  What about below 30 feet?  A good player will make over 70% of putts below 30 feet (9.1 m).  Are you really good? ", "Practice now - whether you need to practice drives or putts - go do it. Make yourself go out to a vacant field or soccer field, and practice 100 drives.  Before going - go to YouTube and check out the instructional help videos created by Discraft. (search for disc golf) ", " Take a measuring tape and mark off 10 feet (3.0 m), 15 feet (4.6 m), 20 feet (6.1 m), 25 feet (7.6 m), and 30 feet (change your scale as to your skill level). Use rocks or discs or minis to mark the distances.  If you feel really brave, take a hoe and some bricks and install permanent markers. ", "Reward yourself by playing your regular course, after a couple of practice sessions,  ", " Bask in your improvement!  ", " Disc Golf - The only Sport You'll Ever Need!  "]}}, "How to Make a Perfect Frisbee Catch": {"description": "Do you want to know how to catch a Frisbee near-perfectly? Do you ever provide a negative answer when you are asked if you want to play Frisbee in fear of humiliation? Do you want to fine tune your Frisbee catching? If you answered yes to all or any of those questions, or you just are reading for fun, this article is for you!", "content": {"Steps": [" Don't be afraid of the disk. It's only a plastic toy, not a meteor hurtling towards you at the speed of light (it just seems that way). Closing your eyes will only make it more difficult to catch.  ", " Get someone to throw you a Frisbee or aerobie. This is vital unless you have some kind of machine that throws flying disks. ", " Find an open area where nothing can be broken or stuck in trees. This is not entirely vital, if you and your partner(s) are careful. Windows, cars and trees are the most common hazards. ", " Have the disk thrown in your general direction.  ", " Now is the climax! When the Frisbee (or aerobie) is in the air, move side to side with the movement of the disk. Do not go forward...yet. ", " When the disk is 1-2.5 feet (0.3-0.7 meters) in front of you, catch it. It is instinct usually. The basic idea is to close your hands around the disk at the right time and not close your eyes. If the disc is an aerobie then the easiest way to catch it is to stick your arm in the large center hole.  For Frisbee the easiest way to catch is the alligator method.  Take both hands and clamp them around the disc like an alligator. For a one-handed catch: Keep your thumb pointing up if the disk is coming in below your waist. If the disk is coming in high, keep your thumb pointing down. Use whichever position feels most natural for in-between heights. Squeeze your fingers and thumb tightly together to grab the disk just before it smacks into your palm.  ", " If the disk starts to fall early, do not run diagonally at it! Run straight. If it rises at the last second, it is easier to stop when going straight than diagonally ", " If it goes too far, jump or run back and jump. Not hard. ", " Be happy inside you caught it!  "]}}, "How to Throw a Frisbee Forehand (Flick)": {"description": "These directions on throwing a flick are intended to be used by coaches, teachers, and captains of young ultimate frisbee players. The directions can be used at practices, gym classes, clinics, or any other settings that involve opportunities to teach how to throw frisbees to people who are new to ultimate frisbee. The purpose of these directions is to teach young ultimate frisbee players how to throw a flick. In ultimate frisbee, the forehand or flick is one of the two most basic ways to throw a frisbee. The forehand is called a “flick” because the thrower must “flick” the wrist forward when throwing the disc.", "content": {"The Grip": [" Form your hand into the star trek hand signal. Raise your right hand, and face your palm away from your body. Part your fingers between the middle and ring finger. Extend your thumb.  ", " Hold the disc in front of the right side of your body with your left hand. Turn the disc to face away from your body. ", " Place right hand over the right side. Rest your index and middle fingers on the inside of the rim and place your ring and pinky fingers are on the outside of the rim. Move your right thumb behind the disc. ", " Grip the disc tightly with your fingers and thumb of your right hand, so that you can release your left hand.  ", " Rotate the disc so that the logo of the disc is now facing the sky.  ", " Support the disc with your ring and pinky finger. Squeeze the disc tightly by pushing down on the top of the disc with your thumb holding your middle and index fingers against the rim. "], "The Stance": [" Stand in an athletic stance. Place your feet slightly farther than shoulder width apart and slightly bend your knees. ", " Hold the disc out to your right sid. Extend your arm so that your forearm and the disc are parallel to the ground. "], "The Throw": [" Bend your wrist backward while keeping the disc parallel to the ground.  ", " Snap your wrist forward while keeping the rest of your arm still and the disc parallel to the ground.  ", " Release the disc at the end of the wrist snap.  ", " Follow through with fingers pointing towards your target and your palm face up.  "]}}, "How to Play Indoor Ultimate Frisbee": {"description": "If you're looking to challenge yourself by playing a new, unfamiliar sport, check out Ultimate Frisbee indoors! It is played between two teams of four on a basketball court. The objective of the game is to score points by catching the disc in the opposing end zone. These detailed instructions will teach you how to play the game to a professional standard. you can use the hoops to score in too!", "content": {"Steps": [" Have the team captains determine the order. Before teams take to the court, team captains need to meet to do the disc toss to determine who will pull first. To do this one person calls ‘up’ or ‘down’ while the other person tosses the disc. If the call is correct that team captain gets to choose whether they receive the disc first or pull. The other team captain then gets to choose which end they want to start at. If the call is incorrect the other team captain chooses whether they want to receive the disc or not. Pull (definition): The throw at the start of each point that initiates play.  ", " After the toss each team lines up four players (often a 3:1 ratio of men and women) on opposing baselines on the basketball court.  ", " Each player on the team pulling lines up opposite the person on the other team they wish to mark. Once organised, the person with the disc puts one hand in the air to signal that they are ready to commence play (this occurs at the beginning of every point). They must wait for someone on the opposing team to raise one hand in response before pulling. ", " The team with the disc then pulls. This is where they attempt to throw it as far down the court as they physically can. Afterwards, the other team takes possession. ", " The opposing team receiving the pull has two options: a) they can catch it and if they do they must play from that point, or b) they can leave it to hit the ground and then play the disc from where it lands. Dropping the pull in an attempted catch results in a turnover. If the pull lands inbounds and rolls out, it must be played on the sideline at the point where it went out. If the pull goes “out on the full” there are two options: a) put the disc into play on the sideline at the point where it went out, or b) put the disc into play from the middle of the court perpendicular to the point where it went out. For option b, you must signal your intentions by raising one arm in the air before picking up the disc.  ", " The first person to pick up the disc after a pull must check it into play. They do this by either a) waiting for a defender to tap the disc and yell ‘disc in’, or b) a self-check where they tap the disc onto the ground. After checking the disc they are able to throw it to another team member. This is similar to basketball rules when the ball must be checked into play at the beginning of a point. ", " Offence is prohibited from running with the disc. Upon receiving the disc, they must come to a complete stop before passing to another player. By passing from player to player, offence is attempting to work the disc up the court towards their endzone. Offence (definition): The team with possession of the disc. Endzone (definition): The area in which a team catches the disc in, in order to score. ", " If a player catches the disc on the line it is out. If the disc comes into contact with anything that is out of bounds, such as a spectator, then it is out. When catching the disc the player must ensure their first point of contact with the ground after making a catch is in bounds, otherwise a turnover ensues. If your first point of contact is in but your momentum carries you out, you must return to the point where you went out before carrying on play. If you land with one foot out and one foot in, you are straddled and this is out. Also, dropping the disc due to contact with the ground is a turnover. A receiver must make as few steps as possible to come to a complete halt when catching the disc otherwise this is travel. If the disc is caught at the same time by both a defender and an offence player possession goes to offence. Straddle (definition): when one foot is in bounds and the other foot out of bounds. ", " When a player catches the disc the leg that is opposite to the arm they throw the disc with becomes their pivot foot and must remain stationary but they are able to move their other leg around allowing them to fake while trying to throw the disc. Pivot (definition): When you plant your foot (left for right handers and right for left handers) and step to the side (allowing you to navigate a throw around your defender). Fake (definition): A pretend movement one way to fool your defender opening up space on the opposite side. ", " When offence has the disc, defenders must each have a player to mark. Similar to man-on-man marking in hockey. The idea is that offence will not want to pass a disc to a player who is being marked closely. Therefore, offence players need to get free of their defenders by cutting. Cutting (definition): An attempt to get free to receive the pass. It begins with a fake then followed by a sudden change of direction and speed. Man-on-man (definition): The most common type of defence. It is where a defence player marks an offence player and attempts to stay as close as possible to the player in order to receive an intercept or forcing a mistake. ", " The defender marking the player with the disc counts a stall count out loud. They begin by saying ‘stalling, one, two…’ The player holding the disc has just seven seconds to pass it to a teammate. If the disc has not been released on ‘seven’ the defender takes possession. ", " If a disc hits the ground or is intercepted or knocked down by the opposition, then it is a turnover. Turnover (definition): change of possession. ", " To score, offence needs to catch the disc in the endzone that can be a marked out rectangle or, in New Zealand, we use the basketball key as the endzone.  ", " After a team has scored a point, they keep hold of the disc and wait while the opposition walks back to the opposing end of the court. After each team has signaled they are ready the team that score the point then pulls. "]}}, "How to Play Ultimate Frisbee in the Dark": {"description": "Do you ever get bored of playing ultimate in the daytime?  If so, try the new and revolutionary way with glow sticks!", "content": {"Steps": [" Go to a local sports equipment store and buy a $20 Flash flight Frisbee.   ", " Visit your local pharmacy and buy a 2016 Lithium battery (watch battery) for your Frisbee.  ", " Drive to a party store and buy at least 10 pink glow stick packets and at least 10 yellow glow stick packets.  ", " Gather at least 20 friends and a limit of 30 people.  ", " Drive to a local field in the dark.  ", " Split up your teams evenly.  ", " Make one team wear yellow glow sticks and the other team wear pink glow sticks.  ", " Set boundaries on the field with extra glow sticks.  ", " Assign a team leader for both teams.  ", " Play the game of ultimate Frisbee like you mean it.  "]}}, "How to Layout Safely in Ultimate Frisbee": {"description": "One of the coolest and most exciting parts of Ultimate Frisbee is the Layout. Watching someone gracefully fly through the air, focusing on only making the catch is truly a beautiful sight to see. But, If done incorrectly, it could result in injury.", "content": {"Steps": [" Fully commit to the disc. If you are hesitant or try to stop midway, you are more likely to tense up and land awkwardly. If you think about it, you will likely slow down and risk missing. If you're on defense, realize that there may be another player around you and make sure to layout at an angle where you will not hit them. Try to track the flight speed of the disc to help with the timing of your jump   ", " Lead with your arms. As you are diving stretch your arms as far as you can. Keep your palms up to improve your odds of getting a clean catch. ", " Keep your head and arms up. Make sure your head is up to avoid landing face first. Your legs should also be straight so you don't lower potential layout distance. It's also critical to keep your arms straight so you don't accidentally knock them against the ground and risk dropping the frisbee. ", " Slide on your chest. You now should gently slide across the ground on your chest. Let your momentum stop you and it shouldn't hurt Maintain a good grip on the disc so you don't drop it when sliding.  ", " Try a Worlds Greatest. Catch the disc in a way that you can throw it. When throwing, you need to make sure there is a target paying attention near you. If you can, try to let them know what you're up to so, they don't give up on the play. Keep your arm above your chest when throwing so, you don't get hurt when you fall. A World's Greatest is a play where a player jumps from within the boundaries of the field to catch a disc that has flown out of bounds and throw it back into the boundaries before touching the ground. The toss back in should be a as it is very hard to catch the disc in a forehand grip.  "]}}}