{"How to Propose Marriage": {"description": "Proposing marriage can be one of the most nerve-wracking and exciting moments of your life. Not surprisingly, you may feel a lot of pressure to get every last detail right. There’s no single perfect way to propose, though; instead, focus on personalizing your proposal to suit your partner perfectly. After that, practice what you’re going to say and work on calming your nerves so you can truly enjoy the experience!", "content": {"Personalizing the Proposal Details": [" Keep your partner in mind during every aspect of your planning. Your proposal should be tailored to suit your partner perfectly. Instead of trying to copy or one-up what other couples have done, ask yourself the following throughout the entire planning process: “Will they love it?”  For instance, if you know your partner hates being the center of attention, definitely don’t propose on the big screen at a sporting event. On the other hand, if you know they’d get a thrill out of having 50,000 people watching them say “yes,” go for it!   ", " Factor your partner's culture and family practices into your planning. Keep in mind that marriage proposal traditions vary widely around the world, especially if your partner comes from a different place or background than you. Do your homework and make sure your proposal respects their traditions, as well as any requirements you may have.  For example, the engagement ring is not a universal symbol. Nor is bending down on one knee while proposing. If possible, talk to your partner’s family to get advice on the best way to propose. Even if there isn’t an expectation that you should get their blessing first, they’ll appreciate being informed of your plans to propose.  ", " Stick to tradition if you know that’s your partner’s preference. If tradition is important to them, make it important for you when planning the proposal. For instance, it may be important for you to talk to their parents first, get a diamond ring, take them to a fancy restaurant, get down on one knee, and specifically ask “Will you marry me?”  If you’re not sure if they expect a traditional proposal, pay attention to how they respond to proposals involving friends or even celebrities. You might even ask, “So, what did you think of that proposal?”  ", " Make it a modern proposal if that suits your partner better. Not everyone dreams of the “fairy tale” proposal that fits all the traditions of their culture. Use your deep knowledge of your partner’s perspectives and preferences to guide your proposal planning. Remember, you goal should be to make it the perfect proposal for them!  If they have moral or economic objections to diamond rings, for example, you might go with a more basic ring style for one or both of you, or just skip using rings at all. So long as you know it suits your partner, there’s nothing wrong with a marriage proposal being a sit-down conversation in which you talk through the pros and cons of this momentous step. You may even want to pair this more modern conversation with a more traditional proposal after you’ve agreed to get married. In many societies around the world, it’s still strongly assumed (and often preferred) among heterosexual couples that the man proposes. But keep in mind that this proposal is about doing things the way that works best for the two of you.  ", " Get input on your partner's ring preferences, if applicable. The engagement ring is a crucial part of the proposal for many couples. To make sure you get it right, you may want to actively browse for rings with your partner. This, however, can ruin some of the surprise, so you may want to work a little more surreptitiously.  For instance, watch for what kind of jewelry (especially rings) they’re drawn to when passing by a jewelry store in the mall. Or, take notice of which of their friends’ engagement rings they rave about. If you get the chance, trace the inner circumference of a ring your partner already owns on a piece of paper. If you bring this to the store, the jeweler can estimate the correct ring size.  ", " Get help capturing and celebrating the event, if desired. If you want to make sure your proposal is captured expertly for all posterity, hire a photographer or videographer to cover the event. (Alternatively, rely on a friend or family member with great camera skills.) You should probably only do this if you’re sure you’ll get a “yes,” though!  If you’re really stuck trying to figure out the right way to propose, consider hiring a wedding planner to help plan your proposal. Even in this case, however, make sure the proposal is personalized to suit your partner perfectly.  "], "Choosing the Right Time and Place": [" Evaluate how or if you should discuss your future together. Don’t start planning a proposal until both of you naturally imagine a future together. If you’re both thinking about the future in terms of “we,” then the time may be right for a proposal. However, if your still talk about the future only in “me” and “you” terms, you may want to wait for the relationship to develop further.  When you discuss important life decisions with future implications—buying a house, changing jobs, getting a pet, relocating, etc.—do you treat them as joint decisions that will affect both of you? For example: If you’re trading in your old car, do you naturally seek your partner’s input on what type of new car to get, even if it’s still your decision to make?  ", " Wait to ask until you’re confident about their answer. You’ll be hard-pressed to find a relationship expert who recommends the “take a chance and hope they say “yes”” method of proposing. You’ll be less nervous and enjoy the experience more if you’re confident about their answer, and you’ll be sure that they’re saying “yes” because they truly want to—not out of surprise or a sense of guilt.  You probably don’t want to ask, “Hey, if I asked you to marry me, would you say “yes”?” Therefore, you’ll have to use your best judgment about the status of the relationship to determine when the time is right. Proposing marriage should feel like the natural culmination of one phase of your relationship, and the starting point for the transition into a new phase.  ", " Make sure you're more excited about the request than the spectacle. Keep your priorities straight—your main goal is to ask this person to become your spouse, not to create the coolest proposal ever...right? If the idea of the spectacle is more exciting to you than the thought of actually proposing, you may want to consider whether you’re truly ready to take this giant step.  Think of it this way: every proposal that ends with a “yes” becomes a great story to tell. The most spectacular proposal that ends with a “no” doesn’t make a great story—at least not for you!  ", " Don’t take advantage of a public setting to pressure their response. If you’re not sure they’d say “yes” if you asked them privately, don’t try to improve your odds by asking them with lots of people around. They may feel they have no choice but to agree, despite their internal doubts. This is hardly the foundation for a successful engagement and (if you get there) marriage.  You can make a public proposal if both of the following are true: your partner will get a kick out of it; and, you’re confident you’d also get a “yes” if you asked them privately.  ", " Choose a location that will be meaningful for your partner. For instance, return to the spot where you first met, or the location of your first date. Or, take them to a romantic spot they’ve been dreaming of seeing—maybe the top of the Eiffel Tower? Use your knowledge of your partner to pick a spot they’ll love.  Not everyone prefers an exotic location or a fancy restaurant, of course. If they’d prefer a private proposal in their apartment, go for it—it will still be memorable to them!  "], "Proposing Smoothly and Confidently": [" Practice what you want to say before the big day arrives. No matter how sure you are of the answer you’ll get, you’re going to be nervous during the proposal. Write down what you want to say, practice it in the mirror several times, and memorize it. You want it to sound completely natural when you say it during the proposal.  In most cases, it’s best to keep things brief. Aim for 2-4 sentences, likely with the classic “Will you marry me?” request at the end. For example: “Annie, the past 2 years have been the happiest of my life because of you. I want to spend the rest of my life doing my best to make you happy. Annie, will you marry me?” Or: “When I think about my life before I met you, Annie, it feels like I’m spying on someone else’s memories. I’m a different, better person thanks to you, and I don’t want to imagine a future without you in it. Annie, I love you—will you marry me?”  ", " Create a video proposal if that boosts your confidence. This won’t be the best choice in all cases—your partner may greatly prefer an imperfectly-executed “live action” proposal to a perfectly-executed recording. However, if you’re worried about getting the wording of your proposal just right, and you think your partner would find it charming, go ahead and create a high-quality recording of your proposal.  After a nice dinner, you might come home to watch a movie and say, “Oh, here’s a flick you might like” while queuing up your proposal video. Then, you can pull out the ring and get on one knee as they watch it.  ", " Use calming techniques to ease your nerves before asking. Taking a few deep, slow breaths is a great way to relieve those last-minute nerves before you “pop the question.” In addition, consider taking some time before meeting up with your partner to do other calming activities. Do whatever works for you, which may include options like:  , prayer, or visualization techniques.  , light exercise (such as walking), or . Writing about your nerves or talking to a trusted friend.  ", " Experience the moment instead of worrying about every last detail. Despite what your social media feeds may indicate, your proposal does not need to be picture-perfect and go off without any hitches or glitches. Keep your ultimate goals in mind: to express your love and your desire to be by your partner’s side for life, and for them to say “yes”! Instead of fretting over the details as the proposal happens, look into your partner’s eyes. Say what you want to say with true feeling. Listen to their response closely. Soak in the whole moment. After all, this may be a once-in-a-lifetime experience.  "]}}, "How to Reject a Marriage Proposal": {"description": "The fairytale suggests that \"yes, oh, yes!\" is the only answer ever given to a proposal of marriage. But sometimes, marriage is not a good choice. There are many good reasons for rejecting a proposal: uncertainty that this is a solid marriage partner, not really knowing one another well enough, wondering if the person asking really means it, or that it is the timing is right. When it comes to a life decision, never say \"yes\" when you should say \"no\"; an honest response allows you both to make the best decision about the future.", "content": {"Deflecting an Upcoming Proposal": [" Be clear on why you do not want to get married. It is perfectly OK to have a \"gut feeling\" that the marriage would not be successful and simply go on that. However, it is even better to be clear to yourself what your concerns are. If you're simply nervous about making such a big commitment (which is not uncommon) try reading the advice in How to overcome the fear of marriage . If you're concerned that you and your mate are not compatible in some way, it's important to address your worries as soon as possible, long before your partner gets down on their knee. Think about these aspects of the relationship in advance so you're prepared to have a serious conversation: Does the relationship feel serious and permanent to you, or more lighthearted or temporary? If the other person takes it much more seriously than you do, it could be difficult to find a path together. Is this a time in life where marriage would derail the path that you've set in mind for yourself? Could you see yourself marrying your partner at a later date? Do you have strong opinions about marriage in general? Would you rather live together unmarried, or live separately even in a committed, loving relationship? Do you have concerns about your partner's approach to having children, running a household, financial habits, career goals, or other \"big picture\" items that would make marriage or cohabitation difficult? Do you have other concerns about your partner or your relationship that are relevant whether or not your get married? These should be discussed as soon as possible, even if marriage is off the table.   ", " Do not play along with the hints. In an ideal world, the topic of marriage would come up without mind games. However, since this is an emotional issue many people will test the waters before they propose. This may come in jokes, veiled comments, or other subtle \"hints\". If your significant other raises the issue of marriage, even casually, make your position clear but polite. Or call him or her out to clarify. For example, if your partner comments while house-hunting: \"This house would be perfect for a married couple,\" hint back with another option: \"Or for an unmarried couple too.\" Or, be more direct: \"Honey, you keep making comments about married couples and such. Are you trying to tell me something? I'd rather you be direct with me instead of making confusing comments.\"  ", " Head him or her off before the proposal. Asking a person to have his or her hand in marriage comes with a lot of emotional weight. This may happen in public, such as a restaurant, an athletic stadium, your family's Christmas dinner, or some cleverly elaborate choreographed manner. And to have to turn a person down after all that dramatic build up can be humiliating for the person proposing. If the hints start coming thick and strong, or you discover a ring hidden somewhere, try have a discussion before the proposal happens. Remember that the purpose of this discussion is information. You should each find out what the other person thinks, not try to persuade them into changing their mind.  If your partner cannot set the topic aside, or you cannot agree on a short-term path forward, visit a relationship counselor for advice. Or you may have to part ways.  ", " Deflect pressure from other people. Sometimes it can feel like parents, friends, or even complete strangers are eager to whip out a marriage license and hand you a bouquet of flowers. In the end, your decision is not their business, and you do not owe them anything more than basic politeness when deflecting these questions or suggestions: A polite \"We don't have any plans right now\" is a good first step, or \"I'll let you know whenever something changes\". Humor can help relieve tension among family members and close friends who are constantly pressuring you: \"I hear they're inventing a new color wedding dress, I'm going to wait a few years for it to hit the market.\" Try acting stiff if strangers or acquaintances do not take the hint: \"Our relationship is fine, thanks for your concern.\"  ", " Consider the future. If you and your partner have both gotten through the conversation (perhaps with help from a counselor), you've bought yourself some time. This is often exactly what you need, but use this time wisely. If it's just a question of reevaluating after finishing your education, you may be content just to see what happens. If you have doubts about the relationship itself, think carefully about whether to stay together , continue to discuss issues with your partner, and seek advice from a relationship counselor if necessary, or from non-judgmental friends who are in healthy relationships and who won't spread gossip.  If there are life events that would seriously pressure you to get married, spend time planning for this in advance. Some events you can do your best to avoid, such as pregnancy, while others you cannot control, such as a terminal illness in the family. Seeking advice and support is especially important in these situations, when you feel pressured to make a decision under stress.  Do not make decisions because of another family member. Yes, Grandma would love to see you get married before she dies. But she does not have to live with the consequences of marrying the wrong person, at the wrong time, for the wrong reasons. And imagine how bad she would feel, knowing the reason for your (likely) divorce, was because she pressured you into the marriage. An out-of-wedlock and/or accidental pregnancy can be problematic. But getting married for the sake of the baby often ends poorly, too.   "], "Rejecting a Proposal": [" Don't mislead with your body language. Try not to smile when proposed to, or at least not to beam and look excited. If your mate has gone as far as to pop the question, they are assuming you will say yes, and your smiling will only confirm their hopefulness, which will make the shock of your rejection greater. Look in your partner's eyes tenderly, put your hand over theirs, and give your response in a gentle voice. ", " Handle a public proposal. If you are in public when proposed to, ask your suitor to stand up (if necessary), and give them a gentle hug. This is a way to acknowledge that you're touched by your partner's gesture, without saying yes. Hopefully, it is enough to make anyone who's watching lose interest and go back to doing whatever they were doing, which will help ease any embarrassment for your mate. If people are still watching, take your partner by the hand and quietly ask to go somewhere more private. Never say yes just to get out of the situation so you can give your real response later. This will just make the later rejection more painful.  ", " Stay positive but honest. This guide assumes you like the person proposing; if your ex from three years ago leaps out of the bushes holding a ring, \"say no and get out of there\" is all the advice you need. But if the suitor has reason to be hopeful, it's best to break the news gently, without being misleading. Say something appreciative, but keep it short so you can get to your response: \"That's such a moving request. I need time to think about it; it's not something I'd feel right saying yes to straight away. It's a bit of a surprise for me - would you mind if I take some time to think it over?\" \"Thanks, that's incredibly wonderful of you but I have so many questions that I've yet to ask you that I'm not sure of our future compatibility yet. Maybe this is a good time for us to sit down and talk about what spending a life together would look like.\" \"I love you for asking that, but I don't plan on getting married (for a while / ever). We could move in together instead?\" \"I'm honored that you've proposed to me. You're a kind, caring (man / woman). I wish I could say otherwise, but I can't see our marriage working out, and I have to say no.\"  ", " Respond to their unhappiness and confusion. It's likely that the person proposing has put in a lot of effort to asking, thinking through the depths of why they want to spend the rest of their life with you. Letting down their unhappiness gently isn't going to be easy, but there are ways you can help the process:  if either of you feels angry or too upset to talk. Let your partner know you'll be contacting them soon (preferably the same day or next morning), but give them time to think until then. Suggest the two of you do something you both love doing. If your partner wants affection from you, spend the rest of the day together doing something that keeps your occupied. This will serve as a distraction and it will help the other person realize that you still care.  ", " Explain your feelings. In private, and once neither of you are actively upset at each other, explain at length what the situation is. Emphasize that your relationship still matters a great deal to you. Describe exactly why you're not prepared to accept. Don't let the other person think it's because they're not good enough. If you have doubts about the relationship itself, not just marriage, be honest about this. It may not be the best time to air your grievances, but let your partner know that there are problems to discuss once you've both calmed down.  ", " Consider the way forward. Things can get really awkward from this point, or they can pick up as usual with good, caring approaches to continuing to nurture your love and relationship. If the proposer is able to accept your position (whether that's an alternative to marriage or delaying the decision for now), then the relationship will likely remain strong and forge on. On the other hand, if this rejection opens a rift in your relationship and causes suspicion, anger, resentment, or discomfort, it may be time to reassess the purpose of staying together. Unless it's clear that the relationship has ended, take a few weeks to sort through the post-proposal emotions before making a drastic decision. ", " Avoid making conditional agreements. Telling your partner that you'll say \"yes, if...\" is not about love or reasonable compromise. You may end up in the same situation a year from now, full of resentment that you backed yourself in a corner. Instead, ask for more time to work out what it is that makes you want to reply conditionally. Most likely your real answer is \"no,\" and you should only alter this answer if you have a genuine change of heart. "]}}, "How to Accept a Marriage Proposal": {"description": "It's easy to get excited if you're expecting a proposal. You may dream about the moment and how you'll react; you may even live the proposal a thousand times over in your head before it actually happens. Marriage proposals can be surprising or expected, depending on the dynamic of your relationship and the circumstances surrounding the proposal. No matter the circumstances, however: if you want to get married, all you need to do is smile, say \"Yes!\", and accept the proposal with grace.", "content": {"Preparing for a Proposal": [" Don't ruin the surprise. If you believe that your partner plans to propose to you, give him or her the chance to carry out a plan. Don't try to rush the process along. Don't give any indication that you expect it. If you find out for certain that your partner is planning to propose, you can take two approaches. You can address the situation up-front and tell your partner that you know, or you can wait for the proposal and do your best to act surprised. Consider which scenario will work best within your relationship dynamic.   ", " Don't get ahead of yourself. If you know that your significant other is planning to propose, try to keep it to yourself. Restrain your excitement; don't tell your friends, your parents, or even strangers. Nothing is certain. You might be embarrassed or disappointed if you build the situation up in your head. ", " Make sure that your answer is \"yes\". Think about your life, career, and relationship goals; your maturity level and your personal finances; your significant other. Ask yourself whether getting married is the right choice for you right now. If you say yes, you should do so wholeheartedly, without any doubts. Explore your misgivings, if you have any, and determine how valid they are.  Search your soul. Make a list of pros and cons, or journal your thoughts, or speak with a trusted confidante. It is perfectly reasonable to do a bit of soul-searching before making such a huge decision. If you find yourself uncertain, do not feel pressured to accept the proposal. You can always ask your partner to give you time. You can keep the relationship in your life without committing to a marriage just yet. You don't need to do anything that makes you uncomfortable.  "], "Accepting the Proposal": [" Reevaluate your feelings in the moment. It is easy to block out the words and start listening to the voices in your head. However, it may be wise to pay attention to exactly what your partner is saying. Consider the implications of his or her words. When all is said and done, consider your feelings on the topic: even if you've already thought it through, ask yourself in the moment whether you are ready to marry this person. Feelings can change when you confront the reality of a situation.  Don't take too long. It's good to stay in touch with your feelings, but you might offend your partner if you keep him/her waiting.  ", " Smile and say, \"Yes! \" Be genuine and straightforward. Make it clear that you are accepting. If you hesitate or joke about the situation, you may hurt or confuse your significant other. Let yourself be swept up in the moment. Let it be special! It may feel more authentic if you don't plan your reaction.  Let your emotions show how excited you are about marrying him/her. Say, \"Yes, yes, a thousand times yes!\" or \"Oh my gosh – of course I'll marry you!\" If your partner set up a special proposal (e.g. something with a theme, or something that plays on an inside joke between the two of you), consider responding in line with that theme. Have fun with it. Starting with things like \"Oh, Sam...\" may throw your partner off balance. Unclear words can confuse the proposer. You may need to repeat your answer – it's easy for the proposer miss your words in his/her haste. Repetition also affirms your answer and makes it feel more real.  ", " Show your emotions. Thinking about this kind of commitment might make you feel excited, peaceful, or anxious. Whatever you are feeling, feel free to express it to your significant other. If you want to build a life with this person, you should share your emotions! There are times when it's better to play it cool, but accepting a proposal is not one of those times. ", " Touch your partner. Place your hand on your partner's hand, and show some affection toward him/her. This small gesture will show some support and give your partner a sense of closure. Don't be afraid to show your excitement with your gestures. Hug him; kiss him; throw yourself into his arms. Make the moment special! ", " Let your new fiancee put the ring on your left-hand ring finger. This is a classic marriage tradition in many Western cultures. The proposer gets down on one knee and opens the ring box to \"pop the question\"; the fiancee-to-be blushes, gets excited, says \"Yes!\"; and the ring slides onto the finger to symbolically seal the deal. You don't need to do this right away, and you can let the proposer take the lead – but it wouldn't hurt to hold out your left hand to make it easier. If the ring does not slide on easily, you may have to help your new fiancee put it on. If the ring turns out to be the wrong size, accept the situation gracefully. Your fiancee will probably be rather embarrassed, so just act natural. You can always take the ring to a jeweler to be re-fitted; but you cannot redo this magical moment. Focus on how excited you are to be engaged!  "], "Preparing to Marry": [" Spread the word. Now is the time to get excited! Tell all of your friends and family, if that's your thing – or simply pass the news along as it comes up. Consider posting a status or photo to social media. This can be an efficient and appreciative way to spread the word to most of the important people in your life. Consider your partner's comfort level, and consider the complexities of the situation. If you aren't supposed to be getting married (due to parents, religion, etc.), then it may not be wise to publicize the proposal just yet. On the other hand, if you have nothing to hide, a loving and joyful Facebook post might make your partner feel even more appreciated.  ", " Talk to your now-fiancee about the conditions of your engagement. Make sure that you both understand what this means. You have committed to marrying this person, and to sharing a life together – so it's important to be on the same page. If you have any special considerations, make them clear early on. Make the engagement a collaborative process so that no one gets hurt.  ", " Plan your wedding . Now that you're engaged, you have a wedding to look forward to! Collaborate with your partner, and make sure that you're both on the same page. You can plan a lavish wedding and invite all of your friends and family, or you can spring for a private, intimate wedding. Set a date and get planning – or simply head down to the courthouse! Bear in mind that you may need to contend with the wishes of your parents and your future in-laws. You don't need to let them dictate the details, but you may not have a choice if they are helping you finance the wedding. If you're planning a big wedding, get started sooner rather than later. , to start, or at least a general timeline. Do you want to get married next week; in six months; in two years?  "]}}, "How to Refuse a Marriage Proposal": {"description": "Marriageinvolves turning your entire life around to accommodate a second person. One has to be certain that he or she is the one, before making such a serious commitment. Declining a proposal can be a painful, even dangerous business for all involved, and you'll need to take careful measures to minimize the potential fallout.", "content": {"Declining a Proposal Politely": [" Request time to think about it. If the proposal comes from someone you genuinely care about, and you just aren’t sure if you’re ready for marriage, ask them for time to think about it. Saying “no” to a proposal is surprisingly common, so do not feel as if you’re being unusual or cruel.  Asking for time to think about things may hurt your partner’s feelings, but it will buy you time to reflect, and leaves you the option to say “yes” if you change your mind, or to explain yourself carefully if you don’t.   ", " Consider why you’re in the relationship. If you decide that marriage, ultimately, is not your goal but your partner disagrees, then it’s probably time to break things off anyway. If you do see matrimony as a possibility, then you will have to handle matters gently to avoid causing lasting hurt feelings. This is a matter for some introspection. Try not to make a hasty or ill-considered decision, because there are likely to be far-reaching consequences for your relationship no matter what you do. Think about what constitutes a healthy marriage, and what your motivations for saying “yes” would be. Marriage probably won’t save a struggling relationship, but it can enrich a healthy one.  ", " Be firm and honest if you decide on “no. ” Proposing to someone is a stressful thing to do, and you likely care deeply about this person. Kindness, sensitivity, and honesty will go a long way in making your refusal less painful to them. Tell them your answer in person, if possible. It’s only fair. If you or they are too emotional for an in-person refusal, then a telephone conversation or a hand-written letter are the next best options. You should not use a highly impersonal method like text messaging to turn them down.  ", " Ask them to wait, if you truly are not sure. It may result in some hurt feelings, but you can overcome those with time, and if they truly love you, giving you a little time will not change that fact.  How long you wait depends entirely on you and your partner. You do not want to rush a decision on marriage if you aren’t sure, but on the other hand you owe your partner a definitive answer at some point. Have some empathy for your partner as you consider things. They are likely waiting on pins and needles for your answer, and ultimately marriage is a cooperative venture. Keep them foremost in your mind as you think about what to do. When you’re ready, break the news to them without delay.  ", " Remember that “maybe” is an answer too. Not every relationship has matrimony as the goal, and declining a proposal does not necessarily spell doom for everyone. Plenty of people create long-lasting, satisfying partnerships without formally getting married. Just because you aren’t ready to tie the knot today doesn’t mean you’ll never want to do it. Explain to your partner that you’re not ready for that step just yet. If you never want to get married, you need to tell your partner. They may be fine with it, they may not, but you owe it to them to be honest.   ", " Keep it quiet. If you decline the proposal, it is your obligation to keep the news to yourself. Politeness dictates that you should spare your partner the potential embarrassment and humiliation of others bringing up their rejection. If you want to tell someone about it, the right thing to do is to ask your partner if they mind first. Only tell people you trust not to spread the story around. A spurned proposal is exciting gossip, so make sure that it isn’t being spread around needlessly.  "], "Rejecting an Unwelcome Proposal": [" Give a firm, but polite, “no. ” If someone you do not have a particularly close relationship with proposes, or you are receiving repeated proposals despite rejecting them, the time for ambiguity is past. You are under no obligation to worry about hurting the feelings of someone who is stalking or harassing you. You don’t need to explain yourself at all in this situation. They should respect your wishes, period.   ", " Keep your distance. While it may not always be possible, staying away from the source of unwanted advances can stop your troubles before they start. In this instance, a text-message rejection is not only appropriate, it may be advisable. You should not, however, be forced to change your life and routine because of this. If the other person’s presence makes it difficult or dangerous to go about your business, you are likely being harassed and should take appropriate action.  ", " Ask a friend to be with you for support. Not only can they provide you with emotional help, they’re also available as a witness to events and a deterrent in case things go badly. Make them fully aware of the situation. They need to know what they’re getting into.  ", " Be prepared to call the police. In some cultures refusing a proposal can be downright dangerous, especially for women. If you think there is a chance of violence or other danger, be ready to call for help. If you are concerned for your safety, stay in a public, well-lit area. If you believe you are in imminent danger call 911 and stay on the line with the dispatcher until help arrives. You may consider keeping a small self-defense tool on hand, such as pepper spray, if local laws permit it.  "], "Refusing a Public, Surprise Proposal": [" Give unsubtle hints that you would not like a highly public proposal. The time to prevent the ballpark jumbotron proposal is before it starts.  If you see a public proposal together on a television show or movie, say something along the lines of “Wow. I would absolutely hate it if someone did that to me. It’s so tacky.” If your partner needs a more obvious example of why a public proposal is a bad idea, watch any of the dozens of public-proposals-gone-wrong videos that are widely available online. Fear of humiliation can be a powerful motivator.  ", " Do your best to recover from the surprise quickly. If you do receive a proposal in a highly public setting like a ballpark, it’s very likely that many sets of eyes, and even cameras, are watching your every move. Every second you take to get over the shock adds to the tension.  Concentrate on your breathing to quickly regain some composure. Identify a way out. Look for a door, a concourse, or even a natural barrier like trees or bushes. Having an escape route available will help reduce feelings of panic.   ", " Quickly ask them to go somewhere private to talk. You want to get out of the public eye in an expeditious manner so you can talk things over with less pressure.  Do your best to control your body language and facial expressions, and suggest to your partner that “I would much rather talk about this privately,” or that “I want to answer you, but I’m too nervous in front of all these people.” Try not to give the impression that the answer will be “no” until you’re safely out of sight. Any answer that isn’t an immediate “yes” will have your proposer worried and stressed, so do not add to it if you can help it.  ", " If they won’t move, say “no” quickly. Consider giving them a hug while you do it, and do your best to keep a smile on your face. All eyes are on you. Spare their pride and feelings if you can, but if that becomes impossible then your best move is to get things over with as quickly as possible.  ", " Get out of there. Regardless of how well (or disastrously) your refusal went, everybody in the immediate area is going to recognize you and maybe even ask you about what happened. Don’t give them the opportunity. A modest disguise can help. Put on, or take off, a hat or sunglasses, or make other quick, minor changes to your appearance. People that only had a quick glimpse of you may not recognize you afterward. Find the back door, or another exit from the area that isn’t crowded. You don’t want to have to shoulder your way through a throng of humanity while making your escape.  "]}}, "How to Plan a Memorable Marriage Proposal": {"description": "Planning a memorable proposal requires forethought and organization. Gauge what kind of proposal your partner would like by talking to their friends and family, and factoring in their favorite things and personality type. Save for and buy a beautiful engagement ring to present to your partner during the proposal. Pop the question in a way that honors your history as a couple, or make an impression by recreating a proposal scene from one of their favorite movies. If you have a trip planned, propose on vacation (or plan a trip with that goal in mind), or get your friends and family involved. If you really want to go big, consider hiring romantic event planners.", "content": {"Figuring Out Your Partner's Ideal Proposal": [" Ask their friends and family. Friends and family who have known your partner for a long time will likely have an idea if they have a dream proposal, and what it might include. For instance, your partner's siblings may recall your partner talking about how wonderful it would be to receive a marriage proposal on a beach, at sunset. As an added bonus, informing other people about your intention to propose means that you can enlist their help with planning the occasion. Friends and family can also inform you if your partner has expressed dislike of certain traditional proposals (e.g. on the big screen at a baseball game). Ask a question like, \"Has Jane ever told you anything about what her ideal proposal would be?\"   ", " Make a list of their favorite things. When planning your proposal, make a list of some of your partner's favorite things and try to incorporate them into your plan. The event will be all the more memorable if your partner is surrounded by things they love while they are being proposed to. Some things to add to your list should include their favorite: Flowers Music Food or dessert Drink (alcoholic or otherwise)  ", " Factor in their personality. Take your partner's personality type into account before planning a proposal. If your partner is outgoing and adventurous, a grandiose, public proposal is an excellent idea. If they are shy or very private about things, plan a more intimate proposal that will be memorable for its sentimental value.  Spend time reflecting on your partner's morals, values, beliefs, likes and dislikes and design the proposal based on these qualities. Make the proposal about honoring your partner and your relationship, not just the things that like. You might think a proposal in front of thousands of people would be cool, but your partner might find it embarrassing. For example, you might try writing a love letter to your shy partner that ends in a proposal. Either have them read it, or read it to them in a quiet, romantic setting. The letter will also make a perfect keepsake. If your partner is adventurous and outgoing, try to make arrangements for a proposal on-stage at a big event, like a concert or sporting event.  "], "Choosing a Ring": [" Save money. Save up for an engagement ring well in advance so that you can buy it without taking a bit hit financially. Open a dedicated saving account without an ATM card, so that you won't feel tempted to spend any of the money in it. You can also consider saving money in small ways over a period of two to three months by:  Selling unwanted items on websites like Craiglist or Ebay Cutting back on unnecessary expenses (e.g. dining out) Buying generic products whenever possible Optimizing your cell phone plan to prevent monthly overpaying  ", " Make the most of your budget. There are many small ways to cut down the cost of an engagement ring. These options can be discussed with jewelers when you are shopping for the ring. Ask about:  Emerald cut stones, which cover a larger surface of a ring than other stones A halo setting, a circle of small stones around a center stone, which makes the middle stone look larger Pave diamonds, tiny diamonds that add extra sparkle to the setting or band of an engagement ring for less  ", " Customize the ring. Choosing a ring that your partner will love means considering their tastes before deciding on anything. If they haven't already told you about what they'd like their engagement ring to look like, take clues from elsewhere, and consider having it engraved to make the gesture extra special. Think about the jewelry that they already own and wear frequently, and note if it is: Bold or understated Yellow gold, white gold, platinum, or silver (and choose a metal that will match) More circular or square in shape (e.g. necklace charms or earrings)  ", " Present the ring creatively. Presenting an engagement ring to your partner in a surprising, creative way can make your proposal especially memorable. Be unsuspecting by hiding the ring in a box much larger than the ring box, or in a bottle of champagne. Alternatively, be romantically obvious by getting down on one knee, holding up the ring box, and opening it in front of your partner. "], "Making It Meaningful": [" Honor your history. To create a memorable wedding proposal, do something that acknowledges a milestone in your relationship with your partner. For instance, consider proposing at the first restaurant you ever brought them on a date, or while playing the first song that you ever danced with them to. Make sure that the memory is significant enough that your partner will recognize it instantly.  Propose at the place that you first fell in love with your partner (e.g. the cafe where you both worked at the time). Make a scrapbook of your best photographs and memories together and write your proposal out on the last page. Set up a screening of the first movie you saw together (e.g. in your living room, or on a projector in your backyard) and propose during the movie. Try writing a simple proposal speech that highlights the things you love about your partner and the special, private details that make your relationship unique. Include every quality about them that you love, and why you want them to be your spouse.  ", " Replicate a romantic movie scene. If one of your partner's favorite movies or television shows features a romantic wedding proposal, consider replicating it. What they love about a movie is a good indication of what they would appreciate in real life. Reproduce the venue, props, and set-up, and don't worry about pulling it off flawlessly- a proposal with a comedic tinge will be just as memorable and charming.  For instance, try replicating the proposal in Love Actually for a grandiose effect. Have a large group of friends or family follow you (as the villagers trail Colin Firth's character in the film) and make a heartfelt speech to your partner in broken Portuguese to ask for their hand in marriage. If your partner is a fan of the film, this will be funny, romantic, and memorable.  ", " Propose on vacation. If you and your partner have a trip planned together, make the most of the opportunity to propose while you are away. Your proposal can essentially piggyback on the excitement of travel, and is bound to be something out of the ordinary and truly memorable (e.g. proposing in front of the Bellagio fountain in Las Vegas, Nevada). There is also the added bonus of popping the question at a grandiose tourist spot that you and your partner would be visiting anyway, giving your proposal the element of surprise while maintaining the magic of the setting (e.g. the Eiffel tower in Paris or the Grand Canyon in Arizona).  When preparing for your trip, budget extra money for supper at a nice restaurant, or a bottle of champagne to celebrate your new engagement.  ", " Get friends and family involved. Share the joy of your proposal by getting friends and family involved. Either pop the question at a family dinner or event, or invite friends and family to the venue where you plan to propose. For the best of both worlds, opt to propose one-on-one and then bring out everyone as a surprise- this will give you two an intimate moment and allow for everyone to share in your happiness right after.  Approach family and friends by saying something like, \"I am proposing to Tim, and I would love it if you could be a part of the event.\"  ", " Hire a romantic event planner. If you have the cash and are certain your partner would love something big and less intimate, hire a company that will help you customize and pull off an elaborate proposal that will create a huge impact. Proposal packages range greatly in price depending on what your wishes are — for example, The Heart Bandits, a romantic event planning company in the U.S., has proposal packages for between $300 to $2,500. Alternatively, Brilliant Event Planning, a company with offices in New York City and Boston, offers services that start at $500 and has charged up to $50,000 for customized proposals. Look online for a local event planning company that could help you with a spectacular proposal involving: A flash mob A musical serenade A romantic gondola ride A limousine tour A carriage ride through the park  "]}}, "How to Write a Marriage Proposal Scene in a Novel": {"description": "Romance is an iconic genre, and most people either love it or hate it. Regardless of whether your book is romance-driven or not, though, you might need to write a proposal scene. Writing that scene can be a difficult one if you're new to the romance genre, but with a few quick steps, it'll be easy to pull off!", "content": {"Steps": [" Build some backstory to the proposal. Your couple is getting married, and in many novels, it wouldn't make sense for them to marry a person they'd never even met before with no explanation as to why. Make sure you've written in backstory to this proposal before writing it, as it will make the proposal make a lot more sense. Not every wedding is because the couple is in love. Some weddings are arranged marriages, while others are for \"the greater good\" - for example, one character is being threatened by a powerful villain and the only way to stop the villain is to marry someone, possibly even the villain! Even if your story has an aspect that makes it so that strangers get married - for example, if a person in the novel's universe grows older than a certain age, they're automatically married to someone regardless of whether they know them or not - make sure that the readers are aware of this. If it's put in the book with no warning, the reader will just be confused.   ", " Set up the scene. A proposal in a fast-food joint might be humorous, but it's not very classy. The scene doesn't have to be , especially if it's a forced marriage, but it should at least make sense for the situation. And if the character is nervous, show it! As shown in the examples below, it's important to write in your character's emotions. Most stories don't have romances between emotionless robots. Rain was pattering down onto the ground and sliding down the window - the same window that Brad and Lisa had been poised at, watching the rain. Brad's hands were clenched in his pockets - one pocket being the one that held a small, velvety ring box. Now was the perfect time to propose - he knew that, he'd seen it all the time in those romance stories. But did someone go about doing that? Did they just pull out the ring and go, \"Will you marry me?\", or wait for the other person to talk first? There were so many questions left unanswered for Brad, all of which left his heart hammering in his chest, but the biggest unanswered question for Brad was,  It was Kaori's first time out with her girlfriend since the two had gotten together, Allison remembered. No wonder Kaori was so afraid. A small prickle of guilt tugged at the blonde girl - she'd thrown Kaori's life for a loop and had forced her into dating her, just because the Shadow had threatened to hurt everyone she ever cared for unless she destroyed her engagement with her arranged fiancé. She didn't even to marry Kaori - she didn't see the autistic girl as more than a close friend - but she knew she had no other choice. She knew it was for everyone's safety - for everyone's .  ", " Write the proposal scene well. Don't make the scene boring, such as the character saying, \"Will you marry me?\" and the other one automatically accepting. Put in a twist to the writing, and detail the scene well. Take a look at the examples below for some examples of better writing of a proposal scene. \"Lisa,\" Brad said suddenly, and his girlfriend turned to look at him. He was sweating, it was obvious, but he didn't care; this was his moment of bravado. He whipped the ring box out of his pocket so fast that Lisa couldn't make out what it was, and rapidly changed his position from sitting on the couch to kneeling on the floor with the box in his hands. Lisa's eyes widened and her mouth gaped as Brad sputtered, \"I love you, and I want to spend the rest of my life with you. Will you marry me?\" The blonde-haired girl turned to Kaori, who was wringing her hands around the rubber band she often carried. \"Kaori. What if we got married? If we got married, I could break off the engagement my parents arranged for me.\" But Kaori stood there silently, looking at her girlfriend uncertainly. The look of sheer terror on her face at the idea left the other one stunned. \"And I really do love you, Kaori,\" she added softly. \"I'll love you no matter how you answer this question: Do you want to get married?\" \"Fool,\" the Shadow snarled in William's face, drool splattering the corners of his mouth. \"Fool! I could you! I could destroy the ! I'm giving you to save everyone you love - - and all you have to do to save is marry me!\"  ", " Describe the reaction to the proposal. Not all marriage proposals end in a happy, tearful \"yes\" - some end much differently. Feel free to experiment around, but try to make sure it fits how the character would most likely react. Lisa had her hand cupped over her mouth to try and hide her shock, but Brad could see from her eyes that she was smiling. Slowly, her head bobbed up and down in a nod, and she kneeled down, pushed the ring box down a bit, and kissed her now-fiancé, waiting for him to slide the ring onto her finger. Kaori diverted her gaze, starting to rock back and forth on her feet, like she always did when she was nervous. \"I... Allison, you...\" She turned her head back towards Allison, but didn't quite meet her eyes. \"I mean, I accept, but... ?\" William delivered a sharp slap to the Shadow's face, leaving him stunned. \"For the record,\" William started, the boy's high-pitched voice breaking the angry fog in the room, \"I know you're a liar. I know you can't do of the things you say you can. And I'm not going to give up my life for a liar - for an abusive, awful person. No, I marry you.\"  ", " Proofread. It's always important to proofread what you've written to make sure you don't have any errors. Go through the scene at least twice - once looking for obvious errors or plot holes, and the second time looking for smaller things such as spelling mistakes, grammar errors, messed-up punctuation, and so forth. If you're writing on a computer, turn on your spellchecker. This can help you discern typos and grammar mistakes much more easily than if you have it off. Software meant for writing, such as Microsoft Word or Google Docs, will usually have this on by default.  ", " Have a trusted friend proofread. It's quite easy to overlook something when you've written it yourself. Get a friend with good language skills to proofread the scene, and ask them to mark any mistakes they come across. ", " Make any required edits. After you've had your friend proofread your story, go over what they marked and correct the mistakes. You may be surprised with how many mistakes your friend noticed! ", " Finished. Your scene is now complete and you can move on to the next part of the story. "]}}, "How to Choose a Creative Setting for Your Marriage Proposal": {"description": "You're in love with the girl (or boy) and you're ready to take the most crucial step in your relationship by popping the question. Proposing over dinner at a favorite restaurant can work; it accomplishes the task for lots of other people. But you want to be different. Knowing how to choose a creative setting for your wedding proposal takes a little bit of imagination and possibly a phone call or two to make it happen.", "content": {"Steps": [" Make it a public proposal by utilizing a local sports venue, museum, aquarium or even a community event.  Aquariums have public feedings several times per day. Provide one of the divers with a laminated sign to hold up to the glass for your loved one (and everyone else watching the feeding) to see. Arrange to make your proposal during a community event such as a July 4th or Mardi Gras parade, Oktoberfest, jazz or arts festival, or concerts in the park. Contact your local parks and recreation department, convention and visitor's bureau, or other organization that plan events and ask if you could ride on one of the floats to make your proposal from the parade itself or see about taking the microphone and making the proposal from the event stage. Buy ad space in one auditorium of your local movie theater during pre-movie advertisements then take your girlfriend or boyfriend to a movie. Score extra points with your loved one and with the whole audience if you arrange it before a romantic movie.   ", " Make it a family affair by involving family members in a proposal that will be the topic of discussion at reunions for years to come.  Arrange for family members to arrive at a favorite park ahead of you so they can set up everything for a surprise proposal picnic. Take your fiance-to-be on a walk through the park and then just happen upon the festivities with your loved one as the guest of honor.  Schedule a family dinner and have all the family members don T-shirts with a message for your future intended. Display the same message on all the shirts or have individual letters on each shirt then have your family members line up so your girlfriend or boyfriend can read the message.  ", " Plan a more intimate proposal, just the two of you, either at home or at a favorite spot.  Take her to your favorite bakery or coffee shop where you've already had a specialty cake made with \"Will You Marry Me?\" written on it. The ring box can serve as the cake topper. Plan a day at a secluded beach where you've gone ahead of time to make a sandcastle and written the proposal in the sand far enough away from the shore so the tide won't ruin your surprise. Arrive a few steps ahead of her and slip the ring box into a turret or on the drawbridge.  Create a website with photos of the two of you and your message then email or text her the link to open. After she accepts, she can send the link to her family and friends to give them the good news.  "]}}, "How to Propose for a Christian Marriage": {"description": "You've got God's pick for you in your hands, but how do you ask forherhand? Should you be romantic, focused, casual, or formal...?! How should a Christian guy propose to his beloved Christian fiancé? It might sound tricky, but if you keep Christ and truth at the center, not only will your proposal be a success, but so will your marriage!", "content": {"Steps": [" Ask her father's permission. Biblically, her father is her protector until you two tie the knot. Make sure he gives you his blessing! (Note: if her dad is passive about it, you might want to try to seek out an uncle, brother, grandfather, pastor etc. who knows your lady very well and can give you their consent.)  ", " Think about what's important to both of you. Is there a special place where you have made many memories together, or a movie you both adore, or a song you both can't live without? Try to weave what you know she loves into the proposal event. She likes the ocean? Invite her to vacation with your family, and propose there. She likes football? Take her to her favorite team's game. ", " Be creative! Thanks to Hollywood and pop culture, guys' romantic tricks and secrets concerning proposals are known by girls everywhere. Make sure that, in the moment she isn't exactly expecting a proposal. For example, you take her to the beach with your family. You've been dating/courting for two years. She's probably expecting a proposal by now!! Don't propose to her while you're walking down the beach in the moonlight, just the two of you. She'll probably expect it, at least a little bit. Instead, propose to her on the \"fishing trip\" where you actually take her and your family to a neat picnic spot. Blow her mind! (And by the way,...girls are smart. They know when you're planning something. Make sure she's surprised!) ", " Be classic. Don't propose to her in the line at the Nachos, stand at her favorite team's football game. You can still do something surprising without throwing class, tradition, and chivalry out the back door. ", " Be genuine. Don't do something completely out of character for yourself, or she'll suspect something's up for sure. ", " Ask the important, married guys in her life (i.e, dad, grandfather, uncles, brothers) how they proposed . That will give you some ideas, and if there's a family \"proposing tradition\", you'll want to know about that. ", " Finally, when you get to that moment when you're on a knee, keep bringing it back to Christ. Sure, tell her how much she means to you and that she's the most beautiful girl you know, but show her that Jesus is the foundation for your love so she knows that she knows that you're stable. Say things like, \"I believe God put us together\"...\"I want to love you like Christ loves the church\"...\"Since Jesus never leaves us, I want to exemplify that by spending the rest of my life with you\"...\"My mission is to bring glory to God, and I think two can better accomplish that mission than one\"...\"Your beauty is your godliness\", etc. ", " When she says \"YES! !!\", give her the biggest hug you've ever given anybody. (If you're saving your first kiss for the engagement, now would be a good time to smooch. If you're waiting for the wedding day, a hug is good.) ", " Do something special the next day, to show her you really, really, REALLY care. Sending flowers is always a classic pick-me-up, or a card is nice, or bringing her lunch at work. Show her she won't regret marrying a man with Christ's servant heart. "]}}, "How to Propose to a Woman Creatively": {"description": "Proposing to marry the person you love takes a lot of courage, sincerity, and creativity. But your proposal should also express how much your partner truly means to you. This way, when you ask those fateful words, “Will you marry me?” the only response you hear is a resounding “YES!” Once you hear that sweet word in response, you can begin sending outwedding invitationsandplanning your wedding. Keep in mind that these creative proposal techniques are only suggestions of how you might propose to your partner. You’ll likely want to add a twist to any of these suggestions to make it a proposal of your own!", "content": {"Proposing with the Help of Others": [" Propose with the support and help of the family. Especially if she’s fond of her family (or yours!) you can make your proposal a group affair with her favorite people. You could have her aunts and uncles wear shirts that spell out “Will you” and younger cousins in shirts that spell out “marry me?” You might even have the family hold up a “Will you marry me?” sign, while you kneel before it, extending her your ring. Another way you could involve her family is by proposing at a family party or event, like a family Christmas party. Hide your ring inside a present, and be sure to be by her side when she opens it. When she realizes what it is, you can ask her the question you’ve been waiting for. Family games, like a scavenger hunt, can also turn into memorable proposal opportunities. Bring the game planner in on your scheme, and have a special set of proposal clues made for your girlfriend. Await her arrival at the end of the hunt with your engagement ring in hand and someone nearby to snap a couple candid photos. You might turn a family game of , sometimes called gestures, into your proposal. Orchestrate it so that you and your partner are on the same team. Then, when it’s your turn to go, get her to ask the question, “Will you marry me?” in gestures. When she finally gets the answer, drop to your knee and hold out the ring.    ", " Propose with a flash mob. This will require some time, effort, and potentially some dancing skills on your part. But a marriage proposal through the coordinated song and dance of a group of people will make yours impossible to forget. You’ll have to get together a large group of your friends or hire performers, design your flash mob routine, practice, and then pull it off in public. For more particulars, you should check out how to organize a flash mob . There are many locations you can spring your flash mob proposal on your bride-to-be. You might choose a mundane, everyday location where it’s sure to surprise, like a supermarket, train station, or a downtown area. You could even waylay her with your flash mob proposal on your way to a special dinner date! If you’re not as confident in your ability to perform in public, you might want to put together a digital flash mob proposal. This has the added benefit of limiting outside interruptions and other potential mistakes that could occur during a live flash mob performance. Have a friend or a professional record your flash mob at a private location, add music, and then use it to propose. The budget for your flash mob can be expensive. To keep things affordable, you may want to forego hiring a photographer and instead hire a videographer. This way, all your hard work, your cool choreographed moves, and the lovely message of matrimony at the end can be watched over and over again.   ", " Propose with the help of a celebrity. While it might be impossible to get her favorite actor to show up and help you seal the deal, you might be able to get a written message from a celebrity that you can use with your proposal. You should check and see if there are any signings or meet-and-greet opportunities you can take advantage of. At these events, you’ll likely get a chance to explain your proposal plans and get a handwritten message from her favorite star. Authors are well known for signing special messages to fans in their books. If your beloved possible bride has an author she’s particularly keen on, you could look up book signing dates or tour dates for that author. Come prepared with a book for the author to sign, and then at the signing, request the author to modify the message for your purposes. You might ask them to write, “To <Bride’s Name>, soon to be married to a lucky guy!” or something to that effect. Depending on the message written, you might frame it in glass along with a picture of the two of you together. This would be a perfect surprise gift to lead into your proposal. Then, when she sees the message from her idol, have the engagement ring ready so you can pop the big question.   ", " Serenade her proposal to her. Unless you’re a one-man-band, you might want some backup when it comes to your wedding proposal serenade. You can choose a romantic song that will sweep her off her feet, or you can write a song of your own . There are many ways you can approach this. You could take center stage yourself and sing karaoke style, or you could allow a performer to sing for you while you prepare to bend knee and propose. Many couples have a romantic song that is special to both. If you have a romantic song, or if you know your girlfriend's favorite romantic song, you can use this in your serenade. Whether you blast it from a sound system of a restaurant or sing along to it while it plays on your phone speakers at an intimate locale, she’ll surely appreciate your thoughtfulness when you finish the song by asking for her hand in marriage. Many popular songs have arrangements for various musical instruments. If you play an instrument, you might accompany the serenade as part of your proposal. Music arranged for your instrument can likely be found at your local music store, or online through a music retailer.   "], "Proposing with a Prop or Message": [" Propose using an audio-visual presentation you’ve made. Compile photos and/or videos of the two of you together. Then you can use video and photo editing software on your computer to make a photo montage. You can even include a few video clips of you together, but when you’re done you should burn your wedding proposal presentation onto a blank DVD or USB memory stick. You don’t want your future bride stumbling across your hard work and ruining the surprise! You can use captions or text boxes at the bottom of your presentation to show just how much she means to you. At the end of the presentation, you could show the question “Will you marry me?” along the bottom of the screen with a video clip or image of you holding out the ring to the camera. Then you can mimic the gesture in real life, so when she turns from the video, there you are, on bended knee holding out her ring. To add some extra surprise to your proposal, you might use some help from others and have your marriage proposal played somewhere she won't expect. This might be at an awards banquet, before a movie at a theater, or even at a family party. Use some kind of excuse, like a DVD marathon, to set the trap for your proposal. Make sure it's realistic, otherwise she might know you’re up to something! Prepare , order her favorite meal, or maybe make her a favorite snack. When you’ve both settled in, play the DVD, and get ready to fish her engagement ring out of your pocket.   ", " Propose using an aerial banner. An aerial banner is a long streamer attached to the back of an airplane. These are often used as advertising gimmicks, and can be seen at beaches, athletic events, and parks. An aerial advertising company near you can be found through an online search, or perhaps even through contacting the customer services of your local airport. Before contacting an aerial advertising company, you’ll need to think of the message you want on the banner. Something short and sweet, like “Will you marry me?” will save you money, but you may want to use your own words. Remember, messages that are too long might be difficult to read up in the sky! You’ll also need to think of a suitable, wide-open space where you and your partner will be able to see the message. A public park, a local pier that juts out from a waterfront, or a similar location might work well for viewing your banner. If you notice her look up, get ready to bend your knee and pop the question, but you might have to direct her gaze by saying, “What’s that up there?” While she’s looking up and reading the message, get on one knee and extend her ring toward her. A common variation on the banner proposal is skywriting. This is where an airplane uses special smoke that hangs in the air for a period of time to spell out a message. For more information, you should look into how to arrange a marriage proposal in skywriting.   ", " Propose with a photo album or scrapbook book. Especially if your beloved is a fan of scrapbooks and mementos, a physical compilation of your good times and the love you have shared can also be used to propose. Gather photos, items that remind you of time spent together, and other supplies to create a proposal scrapbook . At the end of your scrapbook, you might write the message “Will you marry me” along with an arrow pointing toward the side of her which you plan on sitting. When she reaches this page, kneel and hold up your ring so that when her eyes follow the arrow, she sees that it’s pointing to her ring. A might be a good alternative for the more technologically adept. You can upload your pictures from social media or other places, or to use in your digital scrapbook. You might even include the ring as part of the scrapbook. You can use the clear plastic of your scrapbook to form a pouch for your ring on the last page along with your proposal message. This way, when she turns the last page, all you need to do is bend your knee and wait for her eyes to meet yours. Then you can ask, “Will you?” to hear her reply.   ", " Propose with a favorite food or drink. A ring can be the perfect ornament to top an elegant desert, to hide in the bottom of a celebratory drink, like champagne, or to hide as a prize in a favorite snack. You might hide your ring in a plastic egg to keep it clean, then place the egg as a prize in a box of her favorite treats. If you are planning on proposing during a fancy dinner, you might want to bring the restaurant in on your plans. This way the wait-staff can help you make your proposal go as smoothly as possible. The chef could place the ring artfully on a desert platter, or your server might distract your partner so you can secretly slip the ring into her glass. Be careful when hiding your ring as a “prize” in a box containing a favorite snack or candy. There’s always a chance that the prize could be missed! Be sure you are on the scene to prevent any mishaps or accidental ring disposals.   ", " Propose with a favorite TV show, book, or movie series. Your partner may be especially fond of a TV, movie, or book series that you can employ in your wedding proposal. You could recreate a scene and use your ring and proposal as its climax, you could use a prop from the series to present your ring, or you could propose in a way the characters of the series might. If your girlfriend is a fan of the Dr. Who series, you could hide your ring in a Tardis cookie jar. Since a running joke about the Tardis is “It’s bigger on the inside,” you might attach a note to the ring you’ve placed inside the Tardis that says, “And so is my heart when you’re with me. Will you marry me?”  If your girlfriend is and avid reader and you know she is planning on rereading her favorite series, you could buy an extra copy of the book and and then store the ring inside with a message. This way, when she opens it up to read, she’ll see your proposal. You can earn bonus points by using her old copy for the hollowed out proposal and buying a signed copy to replace the one you destroyed. For a fan of Lord of the Rings, you could arrange a massive theme party in the style of Bilbo’s final birthday celebration. Then, much as Bilbo passed the ring onto Frodo, you can present your beloved with her engagement ring at the end of the party. You might even say something like, “Just as there was only ever one ring, you will always be the only one for me.”   ", " Propose with flowers. Flowers are a common romantic gift exchanged between partners, but you can use these creatively to convey the depths of your love. You might send a rose each day for 11 days, and save your proposal for the 12 . She’ll most likely be expecting a final rose to finish of the dozen, but you could present her with a full dozen on the 12 day, along with a ring and your proposal. You might communicate your feelings by spelling out a message with flowers or petals. Be careful when doing so, as some petals and flowers can stain fabric. Light some candles to add a romantic ambiance and make your proposal extra special. Make a mix-and-match message proposal with flowers. Buy 14 of her favorite blooms and attach a piece of paper to the stem of each. On each paper, write a single letter of the 14 letter phrase “Will you marry me” and send them to her one at a time or hide them around the house. Time your deliveries so that she receives a flower every hour on the hour throughout the day. Then, when the 12 hour arises, you can make an appearance with the final flower of the bouquet, your ring, and your proposal to her.   "], "Proposing at a Scenic Location or Event": [" Propose at the place you first met. This one won’t need as much preparation simply because this place will be special already to both of you. You can make her think it’s a casual date by pretending you don’t remember the significance of the spot. But when you’ve finally arrived, you may want to start talking about the time you first met as a lead in to your proposal. Some topics you might want to use to set the tone for your proposal include: what you thought about her the first time you saw her, what makes her special to you, and how she still makes you feel. You might also bring up particular moments that you shared where you overcame an obstacle or you spent your time together enjoyably. Set out candles or other romantic touches. If you first met at a park, you might have a blanket laid out close to the exact location you met. Scatter your blanket with some sweet smelling blossoms to up the romantic appeal. She’ll think you’re just being charming, but when you ask her to marry you, she’ll likely think you’re her one and only.   ", " Propose in a luxurious hotel. A special occasion will make the extravagance of a hotel stay a little less suspicious to her. You might tell her it’s for her birthday or your own. You could plot to spring this proposal around the time of your anniversary or some other special date that you celebrate together. Call or text her and let her know you’ve arranged a hotel reservation for the two of you. To make it an even bigger surprise, don’t tell her any more than she needs to know. Inform her of the date, time, and room number. Then you can leave the door unlocked so she can walk in. But Before she does, you should arrange the room for maximum romance. This might mean playing soft, sweet music in the background, or even leaving a trail of scattered flower petals to a balcony with a table set for two. Then, when the moment is right, all you have to do is ask. Some hotels might have services in place for wedding proposals. While you are booking your hotel, you should let the person handling your reservation know that you plan to propose to your soon-to-be spouse on this day. The booking agent might be able to suggest a more suitable room, or a special room service course that you and your partner can enjoy.   ", " Propose at a religious ceremony. Many religions look at the commitment of marriage as a commitment before the divine. If you and your girlfriend, or either of your parents, are religious, or if you want your proposal to have a sacred, reverential tone, you might propose before, during, or after a religious service. She might be even more pleasantly surprised if, following your proposal, her friends revealed they had been watching all along as part of the congregation. You’ll want to coordinate your plans with the clergy presiding over the service to prevent any disturbances. Marriage is a joyous occasion, and sharing the start of that journey with fellow believers will likely be warmly regarded. You might even be able to play music on the sound system, or have the church band plan a special song leading up to or following your marriage proposal. You might want to involve the presiding minister and ask him or her to offer a blessing for your engagement. This is an easy way of leading into your proposal. First the minister can say some words of encouragement or offer a special message, and then turn the stage over to you for your special question.  Be certain this kind of proposal won't embarrass your hopeful bride to be! Public proposals can put pressure on her to say yes, even if she's not entirely certain.  ", " Propose using a scavenger hunt game. A scavenger game is sort of a treasure hunting game with map, clues, and other features. You can pretend this game is nothing more than a special date you’ve planned for her or something you read about online that you thought might be fun. This way, she doesn’t suspect that you’re about to propose. You can also include your friends and tell them about your plan. Friends can help you think of clever clues for the hunt, set up those clues so they are ready for your girlfriend to find, and can even help you keep an eye on your partner’s progress through text messages. Avoid making the questions for your scavenger hunt too difficult. You don’t want to be waiting too long at the other end, but you also don’t want your girlfriend getting frustrated along the way! While she’s out finding and solving the clues you’ve left, you can prepare the ending location to be extra romantic. Be careful where you arrange the scavenger hunt, the path should not contain anything hazardous. For example, you arrange for your girlfriend to walk across some rocks on the beach to find the next clue, but she ends up slipping and injuring her foot. Not very romantic! You might end your scavenger hunt at the beach, in a restaurant, a hotel room, at the place you first met, or anywhere you think she’ll appreciate. When she’s finally found you using the map, clues, and the hints you gave her, give her a reward she’ll never forget – a small box with a ring inside. You can put a spin on the normal scavenger hunt by going geocaching instead! Geocaching is where an item is hidden somewhere no one will find without precise location information, like longitude and latitude. Or you might start off with a point and have this turn into a series of clues. Learn for more details.   ", " Propose during half-time game. Even if your wife-to-be isn’t a big sports fan, she’ll know how serious you are about your engagement when you do it in front of a stadium full of people! You’ll have to contact stadium officials to see what the policy is for wedding proposals and how you might organize your proposal to be broadcast on TVs and screens across the entire stadium. You could arrange for a quick, heartfelt proposal before, during, or after the half-time break. After making the arrangements, all you need to do is , , and pop the question, “Will you marry me?” Have your friends sit together on the other side of the stadium, and then when the moment is right, send them a signal, like a text message. Then your friends can lift up signs that spell out “Will you marry me?” When she notices the sign and wonders who is proposing, you take a knee and hopefully her hand in marriage, too.  Consider this kind of proposal carefully before putting it into action. Proposals in front of large crowds can be overwhelming. She might prefer a more intimate proposal  ", " Propose on live television. There are a number of TV shows out there that will use any excuse to add drama to the show. The most accessible kind of TV show for average people to join is most likely a game show. Game shows frequently use ordinary people to compete in challenges to win money and prizes. Of course, you won’t really be joining the show for the prize money. You’ve got a bigger prize in mind – her hand in marriage! You might want to discuss your proposal plans with the staff of the show beforehand. These people can help ensure you get you get the perfect chance to pop the question even if things go differently than planned. Win or lose the game, you’ll still hopefully get the girl! Certain game shows choose candidates at random from the audience. Even if you can’t get the gameshow staff to help you out with your proposal, they’ll be hard-pressed to stop you if you’re already in the audience. Simply plan your moment, and show her and the rest of the world you’re ready to love her forever.  Live TV doesn't always go as planned. Be sure that this is the right way of proposing to your bride-to-be before you decide to pop the question on a live broadcast. Your girlfriend might say no, and then you both may go down in infamy.  ", " Propose during breakfast in bed. Some gals like a more laid back and intimate approach. You can spring your question on her following her favorite breakfast while staying at an opulent bed-and-breakfast. If a bed-and-breakfast isn’t your style, do the same while in the comfort of your own home. Wake up early and leave bed as quietly as possible, add a few romantic touches, like rose petals on her breakfast tray, and when the moment is right, bend your knee and ask for her hand in marriage. Time your breakfast preparations to coincide with the time she normally wakes up. You don’t want all your delicious food to get cold, or to awake her too soon and spoil her rest. You could also commemorate a day that’s already special by adding your proposal to it. This way, she’ll think that you’re celebrating something else, like your anniversary, when you arrive with her tray and food. When you spring the question, she’ll be extra surprised. Take some time to tell her how special she is and why you love her more than anyone else. Keep eye contact with her as you slowly kneel down on the floor beside the bed, open that small special box and ask her your question: “Will you marry me?”   ", " Propose while announcing a holiday you have paid for as a surprise. Take her somewhere that has sentimental value, or plan your trip for a romantic place she’s always wanted to visit. When you surprise her with her holiday, present her with her ticket, but not the real one. Have a fake ticket with the words \"Will you marry me\" typed on it, or use your best handwriting and write out your message on an old ticket from a trip you went on together before. Buy refundable tickets. Even if you’ve taken every precaution, there’s always a small chance you could be rejected. As much as you might not want to think about this, it would be even more bitter to lose your lover have to foot the bill for a non-refundable trip for two. Come up with an excuse for your trip, like celebrating a recent accomplishment such as graduation or a promotion, and then surprise her with the engagement ring at an opportune moment. You might have a stewardess bring your girlfriend a glass of champagne with the ring inside, or you might arrange to have the captain announce your engagement to passengers on board.   "]}}, "How to Propose at a Disney Park": {"description": "Looking to find a great place to propose? Many people refer to the Disney Parks as the \"happiest place on Earth.\" If the parks have meaning to you and your partner, have you considered proposing there? It can be a magical venue for popping the question.", "content": {"Steps": [" Prepare for the proposal itself. You're likely to want a traditional engagement ring when you propose; if so, keep it concealed and safe ahead of your proposal. If you're not going the traditional route with a ring, consider anything else personal you might want to bring.  ", " Plan your actual trip. This will depend on your transportation needs and overall plan for your Disney vacation . Not only will you need to know which set of parks you'll be visiting, but you'll also need to know how you'll get there. You'll need to keep your flight(s), hotel, car, or bus schedule in mind. ", " Drive to the destination on the day you plan to propose. Don't forget your ring, phone/camera, and anything else you need! Spruce up to look your best for any pictures you plan to take. If you'd like, you can catch a limo or a ride-sharing program (or even a local taxi) to the parks and ask the driver to drop you and your loved one off close to the gate. ", " Consider using one of the castles as your backdrop. Whether it's Cinderella's Castle in Florida (Walt Disney World), Sleeping Beauty Castle in California (Disneyland), Le Château de la Belle au Bois Dormant (replica castle at Disneyland Paris), or one of the central park icons of the Disney Parks name, think about the great backdrop a castle will create for your big moment. Of course, there are plenty of other locations you can pick for a Disney proposal besides heading to the front of a castle, but this is certainly the most popular choice. ", " Ride together on some of the rides that bring out the best in your significant other. If you know they don't like fast rides, try to stick to slower, gentler rides such as \"It's a Small World\" and similar attractions. Stay away from roller coasters or any other rides they don't enjoy or that make them motion sick. Follow all safety instructions you are given. Exit each ride waiting up for your significant other to disembark from the ride. Although your significant other will think that this is just another Disney Parks trip before your big moment, it's still good to make sure they're having a great time. Do things that the would like to do. You might need to discuss this beforehand.  ", " Walk over to the Castle at sunset (or in the late afternoon hours). Have your significant other admire the craftsmanship of the moat and Castle while you prepare yourself and the ring. ", " Get down on one knee and express how you feel about your partner. If you'd like, you can even remind them how much you took care of them during the ride. You can express that you can take care of them for the rest of their life and would like to be with them. ", " Ask them for their hand in marriage. Open the ring box as you proudly announce to them, \"(Their name), will you marry me?\" ", " Wait for a reply. Hopefully, this will be a yes! If so, take the ring from the box and slip it on their finger. Most often, engagement rings are worn on the left ring finger. However, there are some cultures and people who pick a different finger, so go with their wishes. Give them time to think about an answer if they shy away from responding at first. Marrying is a big decision, and if they're a little overwhelmed at the idea of responding, give them a little time and show them understanding. Either way, you can share a big hug and kiss and enjoy a special moment together.  "]}}, "How to Propose During a Romantic Movie": {"description": "Want a place to propose to your girlfriend?  Why not try a movie?  Proposing can be a huge part of a romantic relationship, but don't stress.  Try a romance movie.", "content": {"Steps": [" Pick a date. An essential part of the planning to propose is a date.  It has to be a day where she is doing nothing else, and a day where she has nothing to stress about.  Find a time and tell her to come; mention that it's important.  ", " Find a movie she likes. Whatever it is; a chick flick, a stupid teenager movie, whatever.  It could be your least favorite in the world, but it doesn't matter.  It's not what you are supposed to focus on. ", " Have a lovely dinner all laid out. Make something homemade and something she loves to eat.  Eat before starting the movie so she doesn't get proposed to on an empty stomach. ", " Sit down and press Play. Get comfortable!  Sit right down next to her and put your arm around her neck.  Kiss her before the movie starts, but only a peck.  Save the good stuff for later. ", " Begin watching. Don't say anything, but laugh when she does and comfort her when she begins to cry. ", " When the time seems right, turn to her. Put the movie on pause (optional). Tell her how you feel about her deep down. ", " Before anything happens, ask her to marry you. Smile when you say it and look straight into her eyes. ", " Kiss her. Kiss her long and hard, showing her how much you love her. ", " Continue watching. You just did it!  Pat on the back. "]}}, "How to Propose to a Woman": {"description": "So you've found the woman you want to spend the rest of your life with. How do you ask her to be yours -- forever? You should push your nervousness aside and remember that, once you have a full plan and know what to expect, you'll be able to propose to your girlfriend without any blunders at any stage. You don't have to do anything over-the-top or crazy, unless you think that's what she wants and its what you want. Make that grand gesture if you want to and think she will appreciate it. The most important thing is that you speak from the heart, and that you find the perfect way to let her know how much she means to you. Remember, you may wish to, or have to, ask her parents if you can marry her first, otherwise they will not be happy with you and buying an engagement ring might be useful. Proposing marriage is a big step, get started at step one below.", "content": {"Steps": [" Ensure that she's the one. You've probably already been thinking this over for some time.  The important thing is to know that you love her and consider her to be \"the one\". Write down or think through a list of all the reasons that make you want to marry her. This will be important for expressing your love to her at the proposal, as well as confirming to yourself that you're making the right decision. When you see your girlfriend, you should feel that you absolutely want to share the rest of your life with her, and that the time is right for you to tell her that.  Though they say, \"When you know, you know,\" this can be a little confusing. The important thing is that you propose because you genuinely want to, not because she's dropped so many hints about getting married that you don't want to disappoint her, not because you feel like you've been together long enough and that it's just about time for you to do something, not because everyone around you is getting engaged, and not because your friends, pastor, and family members keep putting the pressure on for you to propose. Many people believe that you should move in with your girlfriend for at least a few months before you know she's the one. You may like her at a distance, but once you have to share a bed, groceries, and some mutual expenses, you may see an entirely different side of each other that isn't as compatible as you believed. Of course, you don't have to do this, but it's one way of \"double checking\" that you can really see yourself spending the rest of your life with her. It can help to talk this through with a close friend or family member, as long as you're sure that person won't spill your secret. Avoid discussing your plans too widely with others, as it can soon filter back to her through the grapevine.    ", " Be confident with your relationship. Though it's impossible to be able to predict with 100% accuracy that she'll say yes to you, you should have a pretty strong sense that your girlfriend loves you and wants to spend the rest of her life with you. See if she's dropped hints that she wants to get married (to you), that she wants to move in to a house with you, to have kids, to make you a part of her family, and so on. If she's never mentioned these things, then you can try out some feeler conversations to get a sense of her feelings; if she acts uncomfortable or deflects your questions, then she may not be ready to get married. If you've only been together for a few months, make sure you know that she's in it for the long haul. Though many happily married couples got engaged after being together for only a few months, spending more time with your girlfriend to make sure that you're both the right people for each other can help you make sure she'll say yes. Though you may be nervous about figuring out her feelings if you're not sure, this can save you from embarrassing yourself during a proposal, when you should have figured out she wasn't ready.  ", " Consider asking her parents permission. If her parents are old-fashioned, and your significant other wouldn't mind, you could consider asking her parents for for their daughter's hand in marriage. Although asking a father's permission is considered by many to be old-fashioned, it hasn't died out precisely because it's a gesture that suggests that you respect her and her family and that you're always going to be considerate of her family. It's also a sign of politeness, and what family can resist that? But again, it depends on the girl and her family situation, so try to feel it out.  Put her first – is this something that would be important to her and her ? Or is it something that might make her cringe? Or maybe she is estranged from her family. Take your cues from your knowledge of her existing situation and preferences. You should know her well enough by now. Another modern twist on asking for permission is to do so after you've proposed. This can be a way of ensuring that your wife-to-be is the first to be asked but she's aware that you still intend to bring her family right into the fold by asking; this can also be a good excuse to turn up together to share the news. Some people consider that this is the \"wrong way around\" but it's still a sign of respect, and frankly, it's your choice. If it isn't possible to , ask her mother.  ", " Decide when to propose. It's important to get the timing right, and timing is really only something that you can work out. It's not possible to say that there are perfect times to propose, but it is important that you propose at a time when you're not rushed and when you feel calm, sorted, and ready. Once you've planned the proposal in as much detail as possible, then the time will be right. Here are some things to keep in mind: Is there a meaningful day to the both of you? Such as an anniversary of your relationship or first date, or some other commemoration? Sometimes the time chooses itself by sheer practicality, especially if the two of you are living in different cities and come together for a special holiday event and this is your only chance to ask her.  Consider the time of year she wants to get married. It's helpful to ask her or indirectly through her friends or family if there is a certain season, month, or length of time she wants to be engaged in order to plan the wedding without feeling overwhelmed or rushed. If she's mentioned that she wants a fall wedding, try proposing around that time the year before -- if you propose just a few months before the fall and she wants a bigger fall wedding, she may not like the idea of waiting well over a year to get married. Proposing on special holidays or has advantages and drawbacks. On the one hand, these days can make the occasion more meaningful, especially if family is gathered around or it's a time of great joy. On the other hand, you will always share your proposal date with the holiday date; if you want to celebrate your engagement date, this can make it feel less impersonal for some, while for others, it's a great way to remember!  Whenever you do it, make sure you have some alone time right after the proposal. If you plan on proposing to her on Thanksgiving with your families nearby, for example, make sure you take her out on a long walk or somewhere private when you do it, before you get overwhelmed by family and don't have a minute to yourselves to process what just happened.  ", " Decide where you will propose. The place and atmosphere of the proposal will be remembered forever and the most important thing to remember is that are the principal creator of the atmosphere! Naturally, you can propose absolutely anywhere, but it helps to choose a place that will be meaningful for both of you and where you can feel comfortable, calm, and natural.  Where are her favorite places? Does she love the beach, sunsets, tall buildings, bridges, cityscapes, , etc.? Or maybe she'd prefer a private screening at the local cinema?  What is practical? The harder you try to create a special occasion, the more things can go wrong. Sometimes it's just easier to focus on what you know will work and will be appreciated by both of you. Consider romantic places such as the beach, a , a famous restaurant with an amazing view, a covered bridge, a picnic, etc.  Consider the safety of the location. A man once proposed to his girlfriend on a cliff; she said yes, but became so excited that she slipped and fell to her death. This is why you should always take safety into account when proposing to your lover. Consider the things the two of you love doing together. Perhaps this can serve as a source of inspiration, such as proposing when you're out , fishing, sailing, hiking, cycling, attending a sports event, traveling somewhere, etc. The benefit of proposing during something you love doing together is that she won't suspect that you'll be proposing, since it'll be part of your usual routine.  Make reservations if you need to. If you're proposing somewhere like a restaurant where you need to be able to get the best table, etc., be sure to reserve it well in advance.   ", " Consider how you will propose. Once you've decided the when and the where, the intimate details of the how need consideration. Naturally, there is the ring to produce, but what other elements do you want to add into the mix to make this an especially memorable and romantic occasion for her? Bear in mind that the manner in which you propose will be retold by her many times over, so make sure it's good! There are many possibilities and it's entirely up to you what you do but for some inspiration, here are some suggestions : Try the traditional pose. Bend down on one knee, take her hand in yours and ask her to . The beauty of this gesture is that it's universally recognized thanks to the movies, and it can be performed anywhere. Just note that if there are other people around, they'll be eavesdropping (kindly!), so expect their interest and support.  Get a sense of whether she'd like something public or a bit more private. Though many women are proposed to in public in the movies, in real life, most engagements are private. You may think it's a great idea to propose to hear at half-time during a sporting event or at an intimate party with several of your friends around, but she may be mortified by all of the attention. Plus, if it doesn't go well, you'll feel even worse in front of a bunch of people. Think about things that might accompany the occasion, such as a quartet playing a tune or a , or a tiny fireworks display, etc. These sorts of extras are not necessary and they will bloat the budget unless you've got willing friends to help out, but if it's your kind of thing, they can add to the atmosphere. Hide the ring. This is another popular method for proposing that requires her to find the ring, and then you do the proposing. Places to hide a ring include inside flowers, chocolates, or a special gift. Be sure to ask her to open the gift at the time, or you might be waiting ages! And take great care not to hide it somewhere that she can accidentally swallow it; that'll put a big dent in the occasion. Be creative. If you're not so traditional or you're not that keen to say the proposal yourself, there can be a number of other ideas for proposing that involve some more planning but can be really entertaining as well as confirming for her that you're the kooky guy she wants to spend the rest of her life with. You could prepare her very own word puzzle or crossword in which the final answer spells \"Will you marry me?\". You can do something small and cute involving children in your families, or even a pet that you own together. If you have the means and think she'll like it, you could have a plane write the question across the sky as the two of you are walking along. Proposing on a vacation is another popular move. If you do this, just make sure that she'll say yes! Nothing will make your vacation worse than a rejection on the first night. Perhaps use publicity, such as taking out an advertisement in the paper that you know she'll read, or getting her favorite radio DJ to announce the proposal, or place a big banner with the question on it over a bridge she drives under every day.   ", " Choose a ring. If you know what kind of ring your girlfriend wants, then great. But if you don't know or don't want to ask, get a temporary ring, and then get another after you propose; for many women, choosing their own ring is the preferred option. But if you know exactly what kind of ring she wants, then you should try to sneak out a ring she usually wears to get it sized and to find out her ring size. She'll be touched that you remembered exactly what she wanted -- and that you got it in the correct size! But if you have no idea what kind of ring she wants, asking her about it \"casually\" will pretty much let her know what's on your mind.  You don't have to blow a fortune on an engagement ring, especially if you really can't afford it. It's better to get something small and classy and to save for your future together instead of spending all your savings on a piece of jewelry. If budget is a concern, consider all types of natural diamonds. The diamond industry now offers many types that fit within everyone's price range including clarity enhanced, laser drilled, and natural GIA certified HPHT diamonds. Read for more information.  ", " Be well dressed. Dress handsomely, according to the occasion and choice of place. as can be. This is very special and it deserves to be \"picture perfect\". She'll appreciate the effort you've gone to. Naturally, this only applies where you're planning to propose somewhere elegant and you have time to change beforehand. If you're proposing on the beach, during a hike, skiing , or as you're skydiving, use your common sense about what to wear! ", " Rehearse . If you're going to propose, it pays to rehearse in advance. Practice asking, and practice explaining the reasons as to why you love her so much that you want to spend the rest of your life with her. This will help you avoid being tongue-tied when the important moment comes up. This doesn't mean you should put a lot of pressure on yourself. Though it helps to make your girlfriend feel extra special, in the end, she may only remember the words, \"Will you marry me?\" Keep the proposal simple, to the point, and from the heart. For example: \"Mel, I love you more than words can ever express. You're the most thoughtful, generous, kind, and beautiful woman I've ever had the fortune to know and I'd be honored to have the chance to spend my life with you. Will you marry me?\"  ", " Propose. There is no time like the present to move on with your carefully thought through plan. Bring her along to \"the place\" and start unfolding your plans. Be sure that you don't give things away by touching the ring in your pocket constantly, or saying daft things. If you're bringing her to a place she's never been before, or somewhere extra romantic, and you have a feeling that if you're there for more than thirty seconds, she'll know exactly what you're up to, then try to propose as soon as you can, so you don't lose any of the surprise factor. There may be tears, screaming, or . Don't be fazed; these are fairly standard reactions, even if she has every clue of what you're about to do. It's not real to her until it's done! If she says yes, end the proposal with a or a . And don't forget to put a ring on her finger!  If she says no, react with understanding and don't be petulant. She may need time to think and a memory of your sour face and grumpy attitude will leave a bad impression in her mind. Be a and don't be down on yourself -- you tried your best.  "]}}, "How to Propose to a Man": {"description": "You've decided he’s Mr. Right, and you keep dropping hints, but he just doesn’t get it. You can try tonudge him in the right direction, but if that’s not your style, why wait for the guy to pop the question? There’s no reason why a woman can’t be the one doing the proposing. And if you're a guy proposing to a guy, the same ideas and steps apply.", "content": {"Planning the Proposal": [" Figure out if you're ready for this next step. Marriage is a big step and you want to be sure that you're taking that step for the right reasons, because you've found someone that you honestly want to spend the rest of your life with, not because all your friends are getting married and you think you need to, as well.  If you're looking to get married because you're trying to 'save' the relationship or because you're scared of being alone, those are not reasons to get married. In fact, it's probably a good idea to let the relationship go. However, if you know for certain that marriage to this guy is what you want, then it's time to go for it and put your energy into making it happen.   ", " Talk about marriage and commitment with your guy. Popping the question should not be the first time the two of you discuss commitment and marriage. You don't necessarily have to talk about it in terms of the two of you (although, you probably should) but it is important to suss out his feelings about this very important thing, especially if you're going to be proposing to him.  Pay attention to how he talks about the future and what he says. If he talks about \"we\" and \"us\" (referring to the two of you) in future endeavors, if the two of you live together, own a pet together, have moved somewhere together, he is pretty committed to you. This does not necessarily mean that he is ready for marriage, or even wants marriage, so that is something the two of you should discuss. You can even find a way to talk about relationships in general, or bring up your concerns up in a potential, distant future type of way. For example: \"Becky just proposed to Henry in front of his entire family. I think I'd want to do a quieter proposal, don't you think?\"  ", " Make the proposal about him. When you're planning to propose to a guy you want to make sure that the proposal is about him and what he loves. If you wanted a big proposal in a fancy restaurant in front of everyone, that doesn't mean he would want that. You know your guy best, so make sure you use that knowledge.  For example, if he's really in to fishing, plan a fishing excursion with him and put a note in the tackle box that says \"will you marry me?\" Another example: if he's a big fan of a certain band, plan a proposal around a show the band is doing in your area (or go wherever the band is performing, even if it's a distance away). This doesn't mean that you should ignore yourself and your desires completely. The proposal should be something that is important and memorable to you, as well. You just have to find some sort of middle ground. For instance, you could follow the fishing date with a three-course candle-lit dinner at a lovely restaurant.  ", " Plan the proposal. Spontaneity is a great thing, but for something like a marriage proposal, you want to have enough of it planned that you can follow the plan even when you're nervous (because you will be nervous, but that's expected!). especially if you're making it a big deal, you want to have all the components figured out. You'll need to pick a specific place to pop the question, preferably somewhere that has meaning to both of you. It could be where you went on your first date, or it could be the first place you kissed. Picking a place that has meaning to you both works two ways, one, it's already special to you both and two, it provides a great segue into your proposal! Timing is everything. It's better to pick a time when he's relaxed and receptive to making or thinking about making a big change. It's less good to do it when he's stressed about work or school, or distracted by something else (like if you're both at a football game and he's paying more attention to the game than you and what you're trying to ask). You'll want to make sure that the mood is right for what you're about to do. It could be something as simple as lighting a few candles, or pouring out some nice champagne, or you could have a whole lavish dinner set-up. You'll need to consider what is important to the two of you. If you're including other people in your proposal (children, family members, friends, animals) you'll need to make sure that they know what they're supposed to be doing and when and especially that they need to keep quiet about it so they don't spoil the surprise.  "], "Popping the Question": [" Use his hobbies. Again, when you're plotting how to ask him, think about his hobbies and interests and use those as a way to make the proposal special. Not only does this show that he's important to you (since you are, after all, asking him to marry you), you're also showing that you pay attention to his interests and that you support them.  For example: if he's interested in archaeology, volunteer for an archaeological dig with him and propose on the dig (you can enlist your fellow volunteers to help). Or you could even make a treasure hunt type proposal and have him dig up the proposal in the backyard.  ", " Pop the question privately. In every rom-com ever it seems, there's a scene where one person proposes to another and it's always in front of a bunch of people, but, especially for a guy, it's best to do this part in private (unless he's specifically said that he wants to be proposed to in front of a bunch of people). This way it gives him a chance to think about the proposal without the weight of a bunch of people waiting for his decision. Once he's said yes, feel free to go announce it from the rooftops.  ", " Keep it simple. Even if you're planning an elaborate proposal (a skydiving extravaganza, or a scavenger hunt), try to keep the actual proposal itself simple and to the point. What you really need to do with it is tell him why you want to spend the rest of your life with him and would he want to do the same with you. You'll be nervous (because, who wouldn't?) so keeping it simple makes it easy for you to remember what you're going to say. Have a few lines to lead up. You could say something like, \"We have so many awesome memories... From now on, I want ALL my memories to have you in them.\" and propose. Or, before your day, \"I have this wonderful day planned for us, but I just can’t wait... I want us to spend it together as more than just boyfriend and girlfriend\" and then propose.  ", " Give him a symbolic gift. You'll want to give him some sort of symbolic gift, like an engagement ring, but it doesn't necessarily have to be a ring, especially if he isn't the type to wear a ring. You know your guy best, so you'll have to decide what the gift should be, but there are lots of options.  You could get him a wrist watch or pocket watch, because these are sometimes considered the male form of jewelry anyway. You could even have it engraved with both of your names to make it more special. You could make something handmade for him, like a box containing all your favorite memories together, or a ceramic plate that asks him to marry you. If he's the type who wears necklaces, you could get him an engagement necklace, perhaps even with a ring on it. Engraved lighters are also, often, used as engagement gifts for men (or women) and can be very cool and attractive.  ", " Deal with the aftermath. As you can't control the outcome, proposing to someone can be very nerve-wracking and make you feel vulnerable. That's no reason not to do it, but you have to be prepared for every eventuality. If he says yes, great! It's time for a party. You can set the wedding date, or leave that until sometime in the future (you don't have to get married right away, just because you got engaged). If he needs time to think, that doesn't necessarily mean he's going to say no. The proposal may simply have caught him by surprise and he really does need to think about what it will mean. Let him do that. If he doesn't get back to you, talk to him about the proposal and what his concerns are. If he says no, you are going to feel upset and you have every reason to ask him what his reasons are and if will ever change his mind. It could simply be that there is too much going on at the time (school, a big move, his parents are ill) and he can't think that far ahead, or it could mean that he doesn't want to get married. Whatever the reason is, you're going to have to make some choices about your future, as well. It could be that the two of you aren't compatible and don't have the same life goals.  "], "Getting Creative": [" Set up a treasure hunt . You could have it be a treasure hunt of all the places around your city that are important to you, or a treasure hunt that plays on some of his hobbies. There's no wrong way to do a treasure hunt (unless it's too hard and he can't complete it). He'll be having a great time and be in fun mood for the last clue (the proposal). ", " Do a food proposal. Lots of people like a good proposal that has to do with food (as long as he doesn't end up eating the proposal by accident!). There are lots of ways to use food to make a fun marriage proposal. There are ways to have personalized fortune cookies made. You could have one made that says 'Will you marry me?' and make sure it gets mixed in when you get take-out (or if you make some lovely Chinese food). Hide a note and symbolic engagement gift (not necessarily a ring) amid a box of delicacies and give them to him. Again, make sure he doesn't eat the note or the gift by mistake.  ", " Propose through pumpkin carving. Around Halloween go to the pumpkin patch and challenge your guy to a pumpkin carving contest. While he's diverted, carve 'will you marry me?' on your pumpkin and present it to him when you're both finished carving. You'll probably win the contest then. ", " Proposing with extreme sporting. Obviously, this one isn't for everyone, but if you and your guy are super into extreme sports, it's a great way to pop the question. You'll probably need the assistance of your friends or instructors, so make sure they don't give away the game beforehand! Go skydiving with your guy and have your friends spread out a sign below the two of you that asks him to marry you. Go scuba diving and have a waterproof sign already planted down on the ocean floor for your guy to find with you as you're swimming around down there together.  "]}}, "How to Propose to Your Boyfriend": {"description": "Figuring out how to propose to your boyfriend can be a little daunting. Fortunately, there are steps you can take to plan the perfect proposal for your boyfriend.", "content": {"Deciding on the Basics": [" Make sure he's ready for marriage. Before you decide to propose, make sure marriage is on the table. While you do not want to ruin the surprise, you need to at least make sure your boyfriend is interested in marrying. Work marriage into your conversations to get a sense of whether proposing is a good idea.  You can bring it up directly. For example, say something like, \"Do you think we'll ever get married?\" When discussing marriage, bring up the topic of a proposal. Say something like, \"Do you like the idea of a formal proposal?\" Some people prefer to get engaged together as a couple. Try checking with a close friend of your boyfriend's to see if he has ever brought up the idea of getting married.   ", " Figure out what his dream engagement is. See if he wants a surprise engagement, if he wants you to propose to him, or if he'd rather have a conversation first. You can bring this up casually well in advance of your actual proposal, so that it is something you both know about one another. You might say, \"When you imagine getting engaged, what do you picture?\" or \"Do you have any friends with really great engagement stories?\" If you don't think your boyfriend would love a traditional surprise engagement, think about ways the two of you could mark the occasion together. For instance, he may want the two of you to pick out engagement rings together.  ", " Add a twist to what your boyfriend would want. Think about what your boyfriend would want in terms of a proposal. Maybe your boyfriend has brought up the subject before. Try to honor his wishes, but provide a small twist. This will help keep the surprise and add something extra to your boyfriend's dream proposal. This can be especially nice if the proposal is not entirely a surprise. If you agreed to get engaged within a certain timeframe, for example, your boyfriend may be expecting the proposal.  For example, maybe your boyfriend always dreamed of getting engaged on a romantic vacation. Take him on a trip but do not propose on the trip. Instead, pop the question on the airplane on the way there. Maybe your boyfriend admitted he would like to be proposed to at the coffee shop where you first met. Instead of simply asking him there, surprise him by having a group of friends meet the two of you there holding a sign that says, \"Will You Marry Me?\"  ", " Pick a location. To start, think about where you want to propose. Think about what your boyfriend would want and find a place that's special and meaningful for both of you. Where is somewhere that was or is special for the two of you? You can also define your boyfriend in a couple of words to get an idea of what would suit him, such as traveler, adventurer, romantic, philosopher, etc. This can help you to narrow down your options to identify something that will be meaningful to him. Would your boyfriend want a public or private proposal? If he wants something private, think about a special place to propose without onlookers. You can propose at home and decorate your house with things like candles and photographs of the two of you. You can also go some place private together, like a secluded hiking trail where you've gone on hiking dates. If your boyfriend wouldn't mind a public proposal, think about public places you both enjoy. You could propose at the coffee shop where you had your first date. If your boyfriend dreams of a proposal in front of friends and family members, ask him to marry you at a dinner party with friends.  ", " Choose the right time. Think about important dates. You can choose a date that's significant for the two of you. For example, propose to him on his birthday or your anniversary. You can also choose a date that makes logical sense regarding future plans. For example, if you want to be engaged by his cousin's wedding in March, consider proposing some time in January or February.  Try to think of a unique date if you want something memorable. Instead of choosing your anniversary, choose another significant date. For example, propose to him on the anniversary of when you two adopted a kitten together.  ", " Think about whether you want a ring. Do you think your boyfriend would prefer an engagement ring? Many modern proposals do not use a ring, but if you think your boyfriend would like one you can find one in his size.  If you don't want a ring, many people choose another item to symbolize the proposal. You can get him another piece of jewelry, such as a watch, or just give him a gift to mark the occasion. If you can think of a meaningful gift he would really value, such as a musical instrument he's always wanted, go for that. You can use the gift to propose. For example, tape a sign that says, \"Will you marry me?\" on a guitar you got him.  "], "Dealing with Potential Stigma": [" Consider your boyfriend's feelings on tradition. Traditionally, men propose to women with rings. Many people feel men will propose when they're ready and women should wait, and that breaking this tradition is a bad thing. If you're a woman proposing to a man, you're breaking tradition slightly. Think about how much your boyfriend cares about you taking the lead. Many people worry they will be stealing their boyfriend's thunder, or pressuring him into something prematurely. If your boyfriend is truly ready to get married, and is not big on traditional gestures, it is probably okay to propose. However, if your boyfriend or his family are more traditional, bring up the issue in conversation. Ask your boyfriend how he feels about women proposing to gauge his potential reactions. You can also think about his attitude about gender roles and consider whether he is more traditional or open-minded about proposing.  ", " Think about how to adjust the custom as needed. An engagement follows a traditional narrative. The man proposes to the woman, usually with a ring. If you're in a same sex couple, or if you're a woman and proposing, you do not have as many set customs and traditions. Think about how you can alter custom to make things work for you. There is nothing wrong with getting a man a ring to propose. You can select something cut in his style and opt for the tradition down on one knee proposal with a ring. However, some men do not like jewelry. You can choose another object to present him, or you can simply ask him without an object. One of the benefits of a non-traditional proposal is there are less expectations. See this as a positive rather than a negative. You are following your own narrative and can propose on your own terms.  ", " Accept you may be nervous. Most people get nervous before proposing. However, when you're breaking custom or tradition, there may be an added layer of anxiety. Go into the proposal expecting you will be a little uneasy. Remind yourself why you've made the decision to keep yourself calm.  If your boyfriend's traditional family is causing nerves, remind yourself of how happy you and your boyfriend will be after the proposal. This is about the two of you deciding to spend the rest of your lives together, and when you two are alone enjoying your engagement there will be little judgment or stigma attached.  Rehearse what you want to say several times until you know it by heart and then remember to keep breathing when you speak these words.  ", " Prepare for a range of reactions. In any proposal, there will be a range of reactions. However, with a non-traditional proposal, you may find reactions are even more varied. Some people will be shocked that you proposed to your boyfriend. Others will applaud you for breaking tradition. When you choose to announce your engagement, prepare for a range of comments.  People have more opinions on non-traditional proposals than traditional ones. While some opinions will be positive, as many enjoy it when others break tradition, other comments will be confused and judgmental. Try to remember you made the decision that was right for you and your boyfriend. Some comments may be offensive. For example, if you're in a same sex couple, people may feel the person who proposed is more dominant or masculine. It's okay to correct people if they say something hurtful. For example, \"Me and my boyfriend are equal partners. I just happened to have a great idea for a proposal before he did.\" Prepare ahead of time for what you might say if someone says something hurtful to you. This will help you to feel more confident if someone does say something hurtful to you. Also, keep in mind that you do not need to explain yourself to anyone. You can ignore rude comments or give short answers.  ", " Recognize the decision is yours. Remember, you made the decision for the sake of your relationship. Even if there is outside judgment, you did what was right for you and your boyfriend. The two of you are happy and going to spend the rest of your lives together. That is what matters, not any outside judgment you receive.  "], "Proposing Successfully": [" Set the scene. Think about how you want things to look. Talk through your ideas with a friend to help you make sure that you have not overlooked anything. It's also okay to ask your friends for help with executing the proposal. If you have control over the scene, set it as much as you can. Remember, you can't control everything, but you can get things somewhat close to your vision.  If you're proposing at home, it's fairly easy to set the scene. You can dim the lights and light candles. You can also put up decorations, like pictures of you and your boyfriend. If you're proposing publicly, you have less control over the scene. However, there are some things you can do to get the scene you want. If you're proposing on a hiking trip, hike at the right time of day so you'll reach your destination right as the sun is setting. If you're proposing at a restaurant or coffee shop, try to get the right table.  ", " Introduce the ring or object, if you're using one. If you're proposing with a ring or another object, find a way to introduce it. You can hide a ring in your pocket or purse and lift out the box when you're ready. At a restaurant or coffee shop, you can have the ring brought out by the waiter in a drink or item of food. Other items can be introduced creatively, depending on what they are.  For example, if you bought your boyfriend a nice watch to propose, think about having him close his eyes and then slip it on his wrist. If you're presenting a ring, think of a fun way to do it. For example, you can leave clues around your home leading him to the ring.  ", " Ask the question. You can keep things simple. Look in his eyes and tell him something about how much you love and treasure him. Then, say something like, \"Will you marry me?\"  Some people prefer proposing in a letter. You can compose a brief love letter and hand it to him. Have the words, \"Will you marry me?\" written at the end.  ", " Handle a rejection gracefully. Sometimes, things do not go as planned. If your boyfriend declines, do not see this as the end of the relationship. There are many reasons someone may not want to get married, some of which may be rooted in practical concerns. For example, maybe your boyfriend wants to wait until you're more financially stable to marry. If he says no, calmly talk it out and figure out where to proceed from there.  Keep in mind that you don't need to talk things through immediately. You can take some time for yourself. Just make sure to come back to the conversation eventually. Remember, you would rather have your boyfriend marry you when he's truly ready than say \"Yes\" just to make you happy. It's better that he thinks about it first to make sure it's what he wants.  "], "Keeping Things a Secret": [" Tell a small number of close friends. It can be helpful to have people in on your plans. This is particularly important if you need someone to, say, get your boyfriend to the right location at the right time. However, if you want to keep things a surprise, minimize the amount of people you tell. Stick to telling a small circle of friends who you know can keep a secret.  ", " Keep him distracted. In the weeks leading up to your proposal, keep your boyfriend distracted so he doesn't expect anything. Find ways to keep your boyfriend busy so he doesn't notice you're caught up in planning something.  Try to encourage him to try new things. You can even do new things with him, if it doesn't interfere with your plans. For example, take a cooking class together or start a new workout routine. Have your friends help. Ask that the friends who know about the proposal take your boyfriend out more often in the weeks leading up to the big day.  ", " Have excuses ready. Your boyfriend may sense something is up. Be ready to quell his suspicions with stories. Think of ways to excuse unusual behavior. If you're out shopping for rings, for example, have your friends say they're taking you on a spontaneous shopping trip.  ", " Do not plan for too long. Try to minimize how long you plan the event. The longer you spend planning the event, the more your boyfriend will suspect something is going on. Try to only plan the event for a week or two before you pop the question. This will keep things from becoming stressful. A proposal should be a fun event to celebrate your relationship.  "]}}, "How to Tell Your Girlfriend That You Want to Marry Her": {"description": "Have you been going out with a girl so long that you think it might be time to marry her?  Do you know how to tell her or the right time to tell her?", "content": {"Steps": [" Make sure that you know that you love her with all of your heart, otherwise things may not run smoothly in the long run.  If you're not sure that you love her then maybe you shouldn't be looking at this.   ", " Find out if she feels the same way. You don't want to rush things if it is too soon. ", " Find ideas of rings that she might like . You should have a ring to propose.  ", " Buy the ring, but just make sure it is a reasonable price,  not too much and not too little.  ", " Take her out in public. A fancy restaurant is really nice and extremely romantic. ", " Make sure you look nice. It's hard for a girl to say \"no\" when everything is romantic. ", " Finally, at the end of the romantic evening, get down on one knee and say, \"(name of girl) will you marry me? \"  ", " If and when she says 'yes', put the engagement ring on her finger and get up and kiss her if you want to.  "]}}, "How to Get Your Long Term Boyfriend to Propose You": {"description": "It's been a long time coming. You love him. He loves you. However, that magic moment just hasn't happened yet. How can you get him topropose? Just follow these steps to find out.", "content": {"Making Sure He is Ready": [" Make sure he will be ready for the commitment. Though you might have been together for over a year, or even five, that doesn't mean that he's ready to marry you. Some men want to get married eventually, but only when they are ready. The concept of \"ready\" is complicated and often involves a feeling that he has \"played the field,\" had adventure, had independent fun, is financially stable, is mature and now ready to settle down. All of these are valid reasons and you shouldn't ignore him and force him to do something that he's just not ready to do. See if he's committed to you in any way other than calling you his girlfriend. This could mean moving in with you, sharing a pet with you, moving to a new location with you, or even putting himself in the same exact social circle as you. See if he's had other relationships. If he's had significant dating experience before, then you shouldn't be jealous, but fortunate that he's had some experience with women and is more likely to feel less interest in \"playing the field\" and seeing what else is out there.   ", " Make sure that it's the right time in his life. Every relationship is different, and many couples who got engaged after being together for just a year or two can have marriages that are just as successful as those of couples who waited five or ten years to get married. If it's not the right time in your man's life, then it doesn't matter how long you've been together. If he's still trying to figure out his career, if all of his buddies are still single and not even really dating, or if he still has a lot of personal issues to sort out, then it may not be the best for him to marry you. If he's not feeling stable personally, financially, or even physically, then his mind may be on other things. Still, keep in mind that there's no perfect time to get married. If it hasn't felt like \"the right time\" for years, then there may be bigger problems.  ", " Make sure that he can't see a future without you in it. If you want to get your long term boyfriend to propose, then you should make sure that he can't imagine his life without you. Sure, you've been together for three years, but does that mean he wants to be with you for thirty? If every time he talks about the future, he starts with \"We...\" and if he's mentioned moving to a new place with you, buying a home with you, or even starting a family with you, then sure, he's probably thinking of being with you forever. If he never talks about what will happen even six months down the line, even if you're planning to attend a wedding together, or if he's spending a summer studying abroad, then he may be trying to avoid the issue.  ", " Get a feel for his views on marriage. Some men are very nonchalant about marriage—they're fine with getting married, but they'd also be fine with not getting married. If this is the case, don't expect him to be as enthusiastic about marriage as you are and accept that it's something he'd be doing mostly because you want to. You'll have to do a lot of nudging to get the wedding of your dreams. It's also possible the he doesn't want to get married at all, to anyone. Getting a guy who decidedly doesn't believe in marriage to propose to you is pretty much impossible.  "], "Dropping Hints": [" Bring up marriage casually. To avoid overwhelming your boyfriend, you should start by being subtle and build your way up to talking about your own marriage. You should start by casually bringing up a conversation about marriage that doesn't directly involve marriage. You can mention someone else who got married or engaged recently or make a comment on an engagement commercial, for example. A good way to start things is to express confusion or even mild criticism. Here's how to do it: You could say, \"A co-worker just got back from his honeymoon. You know where they went? To the beach. That's so weird to me because we go to the beach about once a month and it's so close by. If I was going on a honeymoon, I'd want to go somewhere new and exotic. Wouldn't you?\" You could also say, \"Can you believe John proposed to Marla on a Ferris wheel? I think that's perfect for them, but I think I'd like something a little different.\"  ", " Mention your future together. Don't say, \"I can't wait to have ten kids with you!\" Just subtly start making comments that allude to you being together in the future, whether you're married or not. If he isn't responsive to the indirect approach, start slowly making it more direct with phrases like, \"if we stay together,\" \"if we live together,\" and later, \"if we get married.\" Watch his reaction when you discuss the future. See if he carries that conversation on or avoids the subject. Remember that even though this may have been on your mind for a long time, this is a new conversation for him and he needs time to sort out his thoughts. Don't expect him to have his answer prepared.  ", " Plan a romantic trip. If you think that your man has been waiting for the perfect time to make the right move, then suggest that it's time that you go on vacation. Make sure that you plan it far enough away -- at least two or three months -- so your man has time to think of it as a potential place to propose. Don't mention anything about how it would be the perfect proposal destination and wait for him to figure it out.  If you don't mention that it would be a great place to get engaged, then he won't feel that you're putting the pressure on. And even if he doesn't propose, seeing you in a romantic setting where many people propose will put his mind on proposing.  ", " Comment that a ring is not important to you. If you don't want an expensive ring -- or a ring at all -- mention it casually in a conversation. This is an important point. Many men don't propose because they're putting off figuring out what kind of ring their woman wants and what her ring size is. Many more men don't propose because they're not ready to shell out thousands of dollars for a diamond ring and think it'll take them forever to save up for it. Well, if you want a fancy ring, or even a ring at all, then you can mention it, however subtly, so that he knows that this shouldn't be a factor in his plans for a proposal. You can even mention your thoughts on the ring by mentioning someone else's ring. You could say, \"Did you see that rock Rick gave to Sheila? I can't believe she didn't fall over with that thing on her hand. I would never want a ring like that -- I'd want it to be small and simple.\"  ", " Describe your idea of a perfect wedding. If you don't want an expensive wedding, mention it. Though a proposal does not mean an immediate wedding, many men are also deterred from proposing because they're worried that they'll never be able to afford an expensive 400 person wedding, or because they don't want to be roped in to the wedding-planning hoopla. Well, if you planned on just having a small wedding in the park with 50 of your closest friends and family and having a casual dress code, you should find a way to mention this too. Though this shouldn't be a factor in a man's decision to marry you for life, it does deter men from wanting to get the ball rolling on the whole marriage thing. Can you blame them?  ", " Let him see you as \"wife material. \" Though he may think you're a ton of fun or a sex kitten, you should also let him see you as wife material -- as the woman who will be his lifelong partner and potentially the mother of his children. So, show him that you'd make a great wife as well as a fun girlfriend. Let him see that you're independent and career-oriented while also knowing how to take care of him when he's sick, how to tastefully decorate your home, and how to cook a healthy meal -- nothing fancy required. If you want him to see you as a wife, then your relationship should be positive most of the time. If you spend most of your time fighting or crying about your insecurities, he won't think you're ready for marriage. Let him see that you have your act together on your own and that you're ready to move towards marriage. If he thinks that your life won't be complete until you get married, he won't want to propose.  "], "Being Direct": [" Address his fears. If you've openly discussed marriage, then you can assuage his fears a bit so he sees that he has nothing to be scared about. Maybe he's concerned that once you get married, you'll change somehow, and settle into a comfort zone . Or, is he worried that after tying the knot, he'll be pressured to start a family right away? It could also be that he feels insecure somehow, and his current self-image doesn't match the role he envisioned as a husband. If he's just worried about the ring or the wedding itself, then you can think of some creative compromises. If he can't afford a ring, can you live without one? If he doesn't want a big wedding, how about eloping or having a small, private ceremony? If he's afraid that marriage will take the luster out of your relationship, have some go-to happily married couples that you both admire that you can point to.  ", " Make a logical argument for getting married. If he's a logical thinker, appeal to that part of his brain. Though it may not be the most romantic approach to take, there are some practical benefits of getting married. Practical and legal benefits of marriage include putting your significant other on your insurance plan, being eligible for more government benefits and filing joint income tax returns.  Marriage is also an effective way to make sure your mate is taken care of if you die suddenly. If you are not married, and one of you dies, the other will not inherit anything unless it is spelled out in a will. And even if it , there will be estate and gift taxes. Also, if you are married you can receive wages, workers' compensation, and retirement plan benefits for a deceased spouse. Though you may not want to go down this morbid line of thinking, it is very logical, and is something to consider -- especially if you've been together for fifteen years and aren't married.  ", " Make him see what he'll miss if he doesn't marry you. If he really sounds like he's unsure about whether he wants to marry you or not, or even says he needs some time to himself to figure some things out, then let him have that time. But make it clear that you're not waiting around forever for him to make the move, and that you're a great catch that any man would be lucky to marry.  While you shouldn't make him feel bad for being uncertain or make him propose because he feels jealous or guilty, you let him know that if you've invested a lot of time and love into the relationship and he still doesn't know what he wants, that you have your limits, too.  ", " Propose yourself . If you think that the time is right and that you're both ready to get married, then hey, it's the 21st century and you can take the matter into your own hands. If you've been waiting around long enough and you're sure that the only thing really holding your man back is the proposal itself instead of the prospect of marriage, then speed things up by asking him to marry you. "], "Knowing What Not to Do": [" Avoid repeatedly bringing up marriage talks. It's a guarantee that if you mentioned wanting to get married once, it's burned into his brain. The more you talk about it, the less he hears it. If you're the one who brings it up and the word \"marriage\" never comes out of his mouth, then you should take it easy for a while. ", " Tell your friends and family to zip it. You may think your friends are being helpful by casually slipping in marriage comments to him, but it will likely make him feel ganged up on. Let him come to the decision on his own, without the advice or urging of those in your life. ", " Do not give him an ultimatum. Though you may think that giving your man an ultimatum is the fastest way to get him to spring to action, giving an ultimatum -- \"Marry me or it's over\" -- will actually make him feel too much pressure and won't make him propose any faster. Saying, \"Propose in the next two months or it's over\" will actually scare him off and will deter him from proposing. However, if you really feel like you've been waiting around forever and are fully ready and think he is, too, then let him know without making a harsh statement.  ", " Do not put pressure on him. If you've only been with your boyfriend for a few months, or have been together longer than that but things aren't serious between you, be honest with yourself. You shouldn't start pressuring him to marry you if he's beyond not ready. Doing this too early in the relationship, especially way too early, can end the relationship quicker than you can say, \"I do.\" Just because all of your friends are getting ready or you can't wait to try on a wedding dress doesn't mean that you should talk about your wedding from your second date -- or there won't be a third.  ", " Do not be desperate. Many magazines may give you the wrong message, making you think that if you want your man to fall in love with you, all you have to do is cook a five-course meal in a pair of hot high heels, stay up late to pick him up when he's on a bender with his buddies, or to generally be at his beck and call so he can see what an \"amazing\" girlfriend you are. This will make him upgrade you to wife status. Men are much more interested in women who are confident and independent than women who serve their every need and will drop everything just to pamper and feed them -- especially if they're only doing it because they think it'll make him more likely to propose.  "]}}, "How to Propose to Her Using a Scavenger Hunt Game": {"description": "Scavenger hunt games are a fun pastime, especially with a large group. Usually played for parties, summer camps or as a weekend activity with friends, did you know that you can also use this activity to plan your wedding proposal to the woman you love? She’ll never see it coming!", "content": {"Steps": [" Plan your wedding proposal to her involving your friends. Make sure that the way that they know about this is discreet, so that the only person who doesn’t know is your beloved. This will ensure that you can can flawlessly execute your plan.   ", " Obtain the necessary materials. For the scavenger hunt, everybody is required to bring a digital camera, mode of transportation and a formal dress, the last of which is required to pull off the proposal at the end of the hunt.  ", " Keep yourself out of the hunt. In order for this to work, you will not be part of the team performing tasks from the list. Instead, you will be included as part of the final task that should lead your wife-to-be to your location. Once you arrive, you can catch her off-guard and ask for her hand in marriage. ", " Start with the end in mind. Think of the best place where your final task will take place. Places to consider include the beach, a hotel room (it’s going to cost you a bit though, but what the heck, right?), a restaurant where you guys often eat together or right in front of a cathedral. Just make sure that the place you choose is somewhere meaningful to both of you or her. ", " Assign your friends to groups. The idea here is that everybody involved in the scavenger hunt, with the exception of the woman you love, knows that you will propose. A team composed of at least three of your friends and assigning each team tasks will help you carry out your plan. Appoint some of your friends to accompany your soon-to-be-fiancé and ask them to regularly inform you of their whereabouts while the scavenger hunt is ongoing. It doesn’t matter how many teams you have assigned, but the more participants, the merrier the hunt should be, right? ", " Give each group a list of the things they should accomplish for the scavenger hunt. Extend your hunting grounds by making them go to unfamiliar territory. This should buy you more time to decorate the place, set up a table of champagne and strawberries, change into your best clothes or other things you need to do before she gets to her final task. Tell each group they can’t move on to the next task without finishing the task before it; of course, the only group who’ll be doing this strictly is the group she belongs to. Instruct them to take pictures or videos of them doing the task so they have proof. Here is an example of a scavenger hunt list: Go to the park and make a stranger tell you you’re beautiful or handsome without telling them you’re playing a game. At least two persons from the group should do this (2/3) to proceed to the next task. From the park, buy two hot dogs and then proceed to the nearest mall with three floors. On the ground level of the mall, find a couple and have them eat the hot dogs. Wait for them to finish eating the hot dogs before proceeding to the second floor of the mall. On the second level of the mall, find a clothing store and have a male member of the group try on a woman’s clothing or a female member try on men’s clothing – it should be whole attire. Ask a saleslady if it looks good on you, if she says “no,” the group may proceed to the next task. If she says yes, change into something else then ask a different saleslady until you get a “no” for an answer. Go to the third level of the mall, look for a girl or a boy wearing pink and have two members in their team take a picture with him or her. Don’t forget to get the photos printed. Go down to the second level of the mall and look for the saleslady whom you got to say “no” and ask her to sign the photos. Go down the ground level and find someone who would be willing to accept the photos and keep them. Outside the mall, all three members of the group should ask a stranger for a quarter. Keep the quarters afterwards as you will need them. At the nearest museum, each of the members needs to ask three strangers for their names and mobile phone numbers. Outside the museum, look for the nearest payphone and use the quarters to call the numbers you gathered. Ask the person on the other end if he/she’s the guy/girl you met in the museum, do 10 push ups in front of the payphone for every fake number you called. Go to the nearest public toilet and change into formal attire. Have your photo taken in front of the public toilet’s entrance, then proceed to the next area.  ", " Tell the other groups to forfeit the game somewhere around item 6 or 7 on their list, but tell them to change into their formal attire. Make everything appear realistic as if they are really playing the game. However, everybody except the group with your soon-to-be-wife should be at the venue before she gets there. While she’s playing the game, you can ask your friends to help you set up everything you need. ", " When she’s finally at the venue, walk to her slowly before telling her what you really feel and how much she means to you. Tell her that compliments like being handsome, smart or funny mean nothing to you if it did not come from her; that hot dogs taste so much better than gourmet meals if you’re eating them together; and that you’d be willing to look like a complete idiot in a woman’s clothing if she asks you to. Most importantly, tell her how much you love her, pull out the ring in your pocket then pop the question “May I have the honor of spending the rest of my life with you?”.  "]}}, "How to Hide an Engagement Ring Box": {"description": "If you are ready to propose, you can easily stash the ring box! Hide it inside of loose clothing, or use a prop to keep it concealed. You can recruit a trusted accomplice to hold the box for you, as well. If you are traveling with a ring box, hide it inside a clothing item and place it at the bottom of your carry-on. In addition, you can use slim-profile ring boxes to easily conceal them in your pocket. With a little planning and careful execution, you can pull off a proposal to remember.", "content": {"Concealing the Box": [" Put the box inside of a pocket to conceal it on your body. If you want to use your engagement ring box when proposing, you can easily hide it in clothing like cargo pants and hooded sweatshirts. Simply slip the box into your pocket, and check on it periodically to make sure it stays in place. Then, pull out the box when the time is right.  Keep tabs on your ring box so it does not fall out of your pocket. Touch your pocket or slip your hand inside every so often to ensure it is still in place. You don't want to lose it!   ", " Use specialty socks to hide the ring box if you want a creative option. You can purchase specialty socks designed to stash the ring box safely until it's time to propose. Order these online 1-3 weeks before your proposal so they arrive on time. Then, place your box inside the pocket before your proposal, and press it down into the sock as deep as you can.  When you are ready to propose, get down on 1 knee and slip your box out of the pocket. Oftentimes, these come with a discreet, slim-profile ring box.  ", " Conceal the ring box inside of a prop to easily place it out of sight. The prop you use will depend on what kind of proposal you want. For instance, if you are hiking and want to propose in the woods, place your box inside your backpack. Think about what props work best for your your proposal, and place the ring inside before you go! Remember exactly where you put the ring, and place it in a secure prop only you will handle.  You can also wrap the box in a blanket or place it inside a box of granola bars. If you are proposing at the beach, you can stash the ring box inside your beach bag or wrap it up inside of a towel.  ", " Ask a friend or family member to carry the ring if proposing in public. This is easy to pull off with a little bit of planning. Recruit an accomplice to carry the ring, and mention your proposal idea and timing. Come up with a discrete signal, like a hand gesture or head movement, so your accomplice is ready when the time is right. Give them the ring ahead of time, get into place, and make the signal! Your partner will not expect the ring to be in someone else’s hands.  For example, maybe you want to propose in the city where had your first date. Arrange to go out to lunch or dinner with a few others, and give the ring to a trusted person before you leave for the meal. Then, make your signal when you want to propose, and they can easily pass you the ring box when your partner is not looking. This is a great option if you and your partner live together.  ", " Hide the ring by itself if you can't confidently conceal the box. If you are worried that you cannot easily pull out the ring box and make a seamless proposal, then simply get rid of the box and hide the ring somewhere else. Sometimes the best proposals don’t involve the ring box at all. However, handle your ring with care so you don't lose it. It's much harder to lose a box than a ring.  You can stash it in your pocket, wallet, or small carrying pouch instead. This is a good idea if you’ve tried to stash the ring box on your person but it is still visible.  "], "Traveling with an Engagement Ring": [" Place the box inside of a sock when packing your items. When you are traveling with an engagement ring box, put the ring in another item so your partner doesn't discovers it. Locate a long sock, and put your box inside. Wrap the box up inside the sock, and tuck the box into 1 of your dress shoes. Then, place the shoe at the very bottom of your suitcase.  Alternatively, you can place the box in a pant pocket.  ", " Keep the ring in your carry-on so you don’t set off a metal detector. If the ring is in your pocket, you can set off the metal detector when you go through security. Place the ring box inside your carry-on to avoid any security issues. It is also best to leave the ring in your carry-on in case your checked bag goes missing.  This way, you will have the ring on you at all times. Always leave valuables in your carry-on bag when traveling. If you are worried about getting randomly searched, write a note saying “Engagement ring inside” and place it around the box. If a TSA agent does search your bag, they won’t blow your cover.  ", " Use the hotel concierge's safe if you think your partner will find the box. If you store the ring in the safe at your hotel, your partner may find it. After you check in, sneak downstairs and mention your proposal to the concierge attendants. They may have a safe you can store the ring box in until the time of your proposal. Be sure to sneak back down to get it!  When you retrieve the ring, you can pretend you are getting directions or asking for recommendations.  ", " Propose early in your trip if you don't want to keep track of the box. If you are worried about losing the ring while traveling, simply propose as soon as you get there! This gets rid of the stress of carrying the ring with you, and it will surely be a trip to remember.  For example, you can propose at dinner on the first night.  "], "Using Creative Ring Boxes": [" Go with a slim-profile engagement box if you want a discreet option. There are all sorts of slim engagement box styles! Search online or visit a local jeweler. Pick out a box that you think your partner will love, and simply slip it into your pocket when you are ready to propose. The slim-profile of the ring box makes it inconspicuous, so you can plan the perfect surprise.  You can place your box inside your front or back pocket. If you’d like, you can place it in the breast pocket of a shirt as well. You can also get a personalized wooden engagement ring box that your partner can cherish forever.  ", " Get a custom engraved engagement ring box for a personalized option. Search online for custom engraving companies, and select a small jewelry box option. Then, choose to write your initials or names and include the date.  Order your box 1-5 weeks in advance if you have a date in mind.  ", " Try a kinetic spinning ring box if you want a unique proposal display. Search online to purchase a kinetic spinning box. These are handmade, wooden boxes that enable the ring to spin around and face your partner when you open it. These easily fit into your pocket and provide a special way to propose.  Use this if you are looking for an nontraditional proposal option.  ", " Repurpose a jewelry box or wooden box if planning a rustic theme. Oftentimes, ring boxes can be bulky. You can use a different jewelry box to hold your ring instead. Use a ring stand to hold your engagement ring, and line the box with stuffing or silk to protect it. This can add a personal touch to your engagement ring box.  ", " Use a plastic quarter machine container if there's sentimental meaning. If you or your partner like quarter machine toys, go with this for an out-of-the-box alternative.  Look for a quarter vending machine display when you are running errands. Insert a quarter, and redeem your prize. Then, use the container to hide your ring. The plastic container is much smaller than an average ring box, so you can easily use it as a diversion. Practice opening and closing the container in advance, so you can easily open it when it's time to propose.  "]}}, "How to Get a Proposal": {"description": "Today, romance has evolved in to various kinds of dating arrangements, not all of which end in marriage. Yet for many people, marriage is the ultimate state for a couple in love. Knowing how to get a proposal from someone who loves you is an important part of achieving wedded bliss and long-lasting happiness, but you need to be honest with yourself and with your significant other to make it work.", "content": {"Finding the Right Partner": [" Meet an eligible guy who is serious about being in a long-term relationship. While you don't want to open your first few dates with \"do you want to get married,\" you should find someone who is comfortable with commitment. Signs to look for include: A willingness to talk about the future. Emotional and social maturity, the ability to have a discussion or argument calmly. Prior serious relationships.   ", " Get to know each other by dating for several months. Make him dinner. Go to movies. Have a picnic in a park. Take the time to get to know each other and develop a solid relationship built on love and trust. Don't rush him with hints about wanting a happy marriage with him until you've been dating for awhile. People change, especially after the wonder and joy of a brand new relationship wear off. You want to see this side of them before you commit \"until death do you part.\" Relationship expert John Molloy, the author of the book, says that women who rush a man with hints about marriage too early in the relationship (first 6-8 months) will likely scare him off.   ", " Know when most people are ready to marry. Men aren't usually ready to pop the question, at minimum, until age 26 if they are college graduates. If you are looking for a proposal earlier than this, you may need to spend some more time dating before someone pops the question. Men getting graduate or professional degrees after college usually marry 2-3 years later. Men who did not go to college generally marry 2-3 years earlier. After age 33, most men become less likely to marry.   ", " Move in together to see how you work in the same house. Moving in together is a great step towards marriage, because you get to see how you function during mundane, day-to-day life. After 6-8 months or more, try getting a place together and make sure your relationship stays strong. Rushing into marriage before you know you can live together can lead to awkward and unfortunate surprises later on. ", " Meet each other's parents and friends. Having the blessing of your family and peers leads to longer marriage satisfaction and lower divorce rates. If you want to hide him from your parents or your friends hate him, there is likely something holding you two back from being truly happy.  Ask for opinions about you as a couple from trusted sources. Do they think you seem happy? Could they see you two together for a long time?  ", " Make sure you want to be with this person for the rest of your life. You can't want a wedding ring because you feel pressured or \"you've been dating long enough.\" You have to want this person as your partner for the rest of you life. Imagine your life in the future and make sure you see this person in it. "], "Getting a Proposal": [" Bring up the idea of marriage after dating and enjoying a strong, loving relationship for 12 to 24 months. Talk about weddings in casual conversation, bring up cute proposal videos, and comment on friends getting married. See how he reacts, from \"I could never do that,\" to something more interested, like \"That's really cute.\" Don't expect this to get the idea across by itself. This is just a comfortable, low-pressure way to begin the discussion early on. Many men do not think much about marriage and will not bring it up unless the women does. Women must bring up the subject and make their wishes known, unless they want to stay in an unsatisfying \"status quo\" forever.  ", " Talk about your future together. You do not even need to bring up marriage at this point. Discuss career goals, places you might want to live together, and future plans. Make sure to emphasize the \"we\" aspect when talking. You want to see how your partner reacts to a life together. If they are excited or involved in future plans, then they may very well be thinking of wedding bells as well. If they don't like talking about the future or making plans then they are likely not interested or ready for a marriage proposal.  ", " Give some obvious hints. Some people are oblivious when it comes to hints and may need a little extra help in discerning your intentions. Remember: though you may want to be proposed to, your significant other may not be willing to make that big of a commitment yet. Don't pressure them too much because it could end up pushing them away. You don't want to force it, just help the situation along. ", " Discuss the subject of marriage and be honest about what you are looking for. Being honest about what you need in the relationship is a critical part of knowing how to get a proposal. If you want to get married, you cannot sit around and hope your partner is a mind-reader. Sit down and talk about marriage in an open, honest fashion. Let him know that getting married is important to you. If he does not want marriage at all, then you need to think about moving on. Having this conversation now, however, can save you months in a relationship that cannot give you what you want. Some men must realize what they will be losing if they are unwilling to make a commitment to a woman who wants to get married. A woman who is willing to leave a man and move on to another relationship to get what she needs is someone who knows how to get a proposal that will result in a happy marriage.  "]}}, "How to Propose on Christmas Eve": {"description": "Christmas Eve might be a time for some people to receive presents that aren't very romantic. However, for some of those lovers out there, Christmas Eve can also be quite magically romantic. If you are wondering if you should propose to someone on Christmas Eve, this article could be for you.", "content": {"Steps": [" Set the scene for the proposal. Hang up Christmas lights, hang up the mistletoe. Wrap a present to yourself (the present should be the ring that you hand to your proposed \"wife\").  ", " Try to keep things quiet. Don't make things seem grandiose or in any way awkward. ", " Kiss your date underneath the mistletoe. But don't make the situation seem in any way like you know that you are expecting to propose to her. Leave this box just a little out of sight, in hopes that she doesn't see it too well. ", " Have her unwrap some of her gifts. Make sure to leave the wrapped ring box to the very end, after all other the boxes have been unwrapped. ", " Tell her that there is one last gift that you want her to open (as you open up the gift-wrapping). As you give the gift to her, keep your hand on the box.  After she's \"unwrapped\" the ring, slide the used wrapping paper out from underneath the box with one of your other fingers on the same hand which is holding the present. ", " Tell her that you love her with all your heart, and that you'd like to spend the whole rest of your life with her. Tell her that Christmas is the time for lovers to get married. ", " Get down on your knee as you open up the ring box. Ask her the most important question that comes with any proposal \"(Mention her name including her first, middle and maiden name), Will you marry me?\" ", " Let her accept the invitation. If she turns you down, the extravaganza might have been too much. Tone things down and try to re-propose to her in a few weeks; just make sure to keep the love in both of your hearts that you've been experiencing over the past few weeks. ", " Give her another kiss under the mistletoe. This will tone things down, but keep the romance going. "]}}}