{"How to Get in Shape for Rock Climbing": {"description": "Rock climbingis a fun but challenging sport, and being fit will help you climb safely. Getting in good shape for rock climbing requires both strength training and cardio, as you’ll need both for climbing. It’s also best to eat a healthy, balanced diet that fuels you and your workouts. With hard work and determination, you can climb higher and longer!", "content": {"Strengthening Your Upper Body and Core": [" Do finger hangs to strengthen your hands and improve your grip. Use a sturdy door frame or a low tree branch. Lift yourself onto your toes and grip the door frame or branch with the top half of your fingers. Lift your legs so that you’re hanging. Let yourself hang for 5 seconds, then release and rest for 5 seconds.  Repeat the exercise for 1 minute, which means you should do 6 reps total. Use the pads on the top half of your fingers to hold you up. This exercise will help you get used to supporting your weight on a ledge.   ", " Perform pull-ups to build arm and shoulder strength. Grip a stable bar with your hands shoulder-width apart. You can use an overhanded or underhanded grip. Bend your legs behind you so that you’re hanging from the bar, then slowly pull yourself up. Raise your chin above the bar, then lower yourself slowly back to start. Make sure your muscles are controlled and engaged the entire time.  Do 2-3 sets of 6-10 pull-ups. To increase the challenge and build more strength, pull yourself up as quickly as you can, then slowly lower yourself for a 5 count. Alternatively, do chin-to-knuckle pull-ups by pulling yourself up to 1 side. Touch your chin to the top of your knuckle, then release. Alternate sides as you do your pull-ups to mimic the movement of rock climbing.  ", " Do planks to build your upper body and core strength simultaneously. Planks help you build the strength you need to hold yourself up and support your own weight while you're climbing. Lie on your stomach, then get into push-up position with your palms directly under your shoulders. Slowly push yourself off the ground, balancing your weight on your palms and toes. Keep your core tightened to support a straight back. Hold the plank for as long as you can or up to 2 minutes.  If you can’t hold your plank for 2 minutes, hold it as long as you can. Then, rest and repeat until you’ve held a plank for a total of 2 minutes. Don’t let your back slouch or stick up your butt while you’re doing your planks.  ", " Perform push-ups for a more intense core and upper body workout. Push-ups help you build the muscles you need to lift and lower your body weight. Lie down on your stomach, then place your hands under your shoulders. Engage your core, then slowly push yourself off the floor. Balance on your palms and toes, keeping your back straight. Hold for 2-3 seconds, then slowly lower yourself down to the floor.  Do 1-3 sets of 10 push-ups. Don’t point your butt up into the air or let your back slouch. To make your body work harder, try putting your hands slightly above your head. Form a diamond shape with your hands, angling your elbows outward. These are called diamond or superman push-ups. To make your push-ups more challenging, do them on an incline. Put your feet on a chair, stair, or sturdy box, but keep your lower body on the ground. Slowly perform your push-ups in this position.  ", " Go to a rock climbing gym and climb the beginner wall. This will help you get practice with climbing while you build up your strength. Tell the employees you’re a beginner and what your goals are. They’ll help you pick the right course for you.  It’s a good idea to visit the rock climbing gym 2-3 times a week as you build up your strength. You don’t need to wait until you’ve built up your fitness to do beginner climbs.  "], "Building Your Leg Strength": [" Perform single-leg pistol squats for strong, flexible legs. Stand with your feet hip-width apart and your arms extended out in front of you. Extend your left leg out in front of you with your knee straight, your toe pointed, and your foot not touching the floor. Slowly lower your body down by bending your right leg. Keep your right knee in line with your foot, not letting it go out past your toe. Hold for 30 seconds if you can, then slowly rise back to your starting position.  Do 1-3 sets of 5-10 pistol squats on each side. Hold the squat for as long as you can. If you need help balancing, hold onto a chair or the wall. Your legs need to be strong and flexible so you can propel yourself up the wall or summit.  ", " Perform jumping lunges to build explosive strength for climbing. Step forward with your right leg, then slowly lower yourself down by bending your right knee. Keep your knee in line with your foot and don’t extend it past your toe. Then, explode off the floor, jumping back into your starting position. Repeat on the other side.  Do 1-3 sets of 8-10 jumping lunges on each side.  ", " Do box jumps to strengthen your legs for propelling yourself upward. Stand with your feet hip-width apart in front of a sturdy box. Lower your body into a slight squat and swing your arms back. Then, swing your arms forward and propel yourself up onto the box, landing in a slight squat. Finally, jump back down to your starting position.  Do 1-3 sets of 3-6 box jumps.  "], "Improving Your Cardio Fitness": [" Get 30 minutes of cardio exercise 5-7 days a week to build endurance. Cardio activity will help condition your body and improve your endurance level. In fact, it’s best to get at least 150 minutes of moderate cardio activity each week to maintain a healthy body. Make sure you do your cardio exercise 5-7 days a week. For instance, you might try the following cardio exercises:  Climb at your rock climbing gym. Take a brisk .  or .  .  .  .  .  ", " Do short sprints to improve your fitness so you can climb longer. Mark off a distance of about 100 feet (30 m), and place additional markers every 10 feet (3.0 m). Sprint from the start to the finish and touch the baseline. Then, sprint back to start and touch the baseline. Turn back around and sprint to your 2nd-to-last 10 ft (3.0 m) marker. Continue sprinting back and forth until you’ve touched each baseline and run back.  Shorten your sprint by 10 ft (3.0 m) on each turnaround.  ", " Walk up and down stairs with weights to simulate climbing. Wear a weighted vest or a heavy backpack or carry hand weights. Walk up at least 1 flight of stairs, then walk back down. Continue climbing up and down the stairs for at least 10 minutes. Go as fast as you safely can.  Try to go for 30 minutes. This will help you build your climbing endurance.  "], "Eating a Healthy Diet": [" Get 50-60% of your calories from healthy carbohydrates (carbs). Choose nutritious, complex carbs for most of your meals to help fuel your body during your workouts and recovery. The best sources of carbs include vegetables, fruits, beans, legumes, and whole grains. Include these foods in each of your meals.  For example, you might eat oatmeal for breakfast, a salad at lunch, apple slices for a snack, and lentil soup for dinner. To figure out how many grams of carbs to eat, multiply your calorie goal by .5 for 50% or .6 for 60%, then divide by 4 because there’s 4 calories in a gram of carbs. For instance, if you planned to eat 2,000 calories a day, you’d multiply 2,000 x .5 = 1,000. Then, divide 1,000/4 = 250. This means you’d eat 250 grams of carbohydrates a day.  ", " Make 30-35% of your calories lean protein. Protein helps your body repair and fuel your muscles, so it’s an essential nutrient. Choose lean options like poultry, fish, low-fat dairy, beans, legumes, nuts, tofu, or veggie burgers. Eat a source of lean protein at each meal.  For example, you might add 1% milk and sliced almonds to your oatmeal at breakfast, grilled chicken to your salad at lunch, and peanut butter to your apple slices. Lentils contain protein, so you’d already be eating protein if you were eating lentil soup. To calculate how much protein you need, multiple your calorie goal by .3 or .35, then divide by 4. For a calorie goal of 2,000, multiply 2,000 x .3 = 600. Then, divide 600/4 = 150. You’d eat 150 grams of protein.  ", " Get 20-25% of your calories from healthy fats. Your body needs fat to stay healthy and recover after your workouts. However, you want to choose healthy fats, such as monounsaturated fats, polyunsaturated fats, and omega-3s. However, eat fewer saturated fats and avoid trans fats . Get most of your fats from fatty fish, nuts, natural oils, avocado, and peanut butter.  For instance, you’d get fat from the sliced almonds on your oatmeal, the salad dressing on your salad, and the peanut butter you ate as your snack. You can add fat  to your lentil soup by sauteing your aromatic soup veggies, like onions and garlic, in oil before you make the soup or by sprinkling cheese over your soup. To figure out how much fat you need each day, multiply your calorie goal by .2 or .25, then divide by 9 because there’s 9 calories in a gram of fat. For a 2,000 calorie goal, you’d multiply 2,000 x .2 = 400. Then, divide 400/9=44.4. You could round this to 44 grams of fat per day.  ", " Eat about 25-30 g of nutritious carbs 30 minutes before a climb. Carbs fuel your body, especially during a hard workout. You don’t want to feel full, but eating a light high-carb snack can give you the power to complete your workout. Stick to healthy, nutritious carbs, like fruits, veggies, and whole grains.  If you’re going on a short climb, choose easy-to-digest carbs like bananas, dried fruit, oats, or sweet potatoes. For longer climbs, opt for complex carbs, such as brown rice, beans, or quinoa. It’s best to avoid sugar packs or processed snacks, as these don’t contain as many nutrients.  ", " Consume protein and carbs within 30 minutes of working out. Choose a snack that’s high in protein and carbs but has less than 5 grams of fat. This will help refuel your body post-workout so your muscles can recover and rebuild.  For instance, you might drink a protein shake, eat Greek yogurt with cut up fruit, or snack on string cheese and a serving of grapes.  ", " Drink at least 8 to 10 cups (1.9 to 2.4 L) of water daily to stay hydrated . Your body needs plenty of fluids to fuel your workouts, maintain your body, and recover post-workout. Sip on water throughout your day, and add in more foods that hydrate you, such as fruits or soup.  If you don’t like water, try flavoring it with sliced fruit. As another alternative, you can drink tea or other fluids instead. Since you’re likely very active, you may need more water every day. Increase your water intake if you feel thirsty or tired.  "]}}, "How to Stretch Rock Climbing Shoes": {"description": "Rock climbing shoes are often sized so they're a size or two too small, in order to best grip the rock. However, if your shoes are too tight, it may be difficult or even painful to climb in them. While you can't stretch the rubber sole of your shoes, you can stretch out the upper portion to make it more comfortable for your foot. Before you try to stretch your shoes, remove any tags or stickers that remain on the shoes from when you purchased them. For a quick solution, heat your shoes with a hair dryer to get a slight stretch. Alternatively, freeze your shoes for a moderate, even stretch. To stretch your shoes a lot, get them wet in a hot shower.", "content": {"Using a Hair Dryer for Quick Results": [" Stuff your shoes with several pairs of socks. For best results, roll the socks into tight balls before filling the toes of your shoes. Then, maintain pressure as you continue stuffing socks into your shoe, until your entire shoe is full. Pack the socks down as tightly as possible to help the shoe stretch.  Try not to leave any room in the shoe. The more tightly you pack the socks, the more your shoe will stretch.   ", " Heat your shoes for about 1 minute using the medium setting on a hair dryer. Hold the hair dryer about 6 inches (15 cm) above your shoe. As you heat the shoe, move the hair dryer continuously back and forth over the shoe to heat it evenly. Turn off your hair dryer after 1 minute, then check that the shoe is warm.  If the shoe feels cool, try heating it up for another 30 seconds to 1 minute. Then, check it again. Although the hair dryer shouldn't damage your shoes, avoid using a high heat to be safe.  ", " Add more socks to the shoes while they're still warm. The heat will have expanded your shoe material slightly, so take the time to push the socks down into the shoe as far as they will go. Then, insert additional socks into the shoe. Pack them down as tightly as you can to help the shoe stretch.  The heat should cause the shoe to expand a little and get flexible, which will allow you to add more socks.  ", " Let the shoes cool down with the socks inside, then check the fit. The socks act as a mold for the shoe to help stretch it out. Leave the socks in place until the shoes feel cool to the touch. Then, take the socks out and check the fit to see if your shoes feel more comfortable.  Check the fit by walking around and wiggling your toes. If your shoes are still too tight, you can try stretching them more. However, it may be best to try freezing or soaking them, which will provide a better stretch.  "], "Freezing the Shoes for a Slight Stretch": [" Fill 2 plastic sandwich bags with enough water to fill your shoes. Get 2 plastic sandwich bags that have zipper seals. Add enough tap water to the bags to completely fill up the inside of your shoes. Then, remove the excess air from each bag before you seal them.  Don't leave a lot of extra space between the bag and the sides of your shoe. The water must fill your shoes completely to stretch them.  ", " Insert the bags of water into the shoes, tightly seal them, and lace your shoes up. Make sure the bags are deep enough that they fill the toe cavity. Then, lace your shoe around the bag of water. Once you're done, the bag should be securely in your shoe, like your foot would.  Use your finger to check for gaps between the bag of water and the side of the shoe. If the bag doesn't fill the shoe, you may want to add more water or possibly a second bag of water.  ", " Place your shoes in the freezer for at least 8 hours. If you can, place your shoes on the top shelf so they get colder faster. Then, leave them in for at least 8 hours, or overnight.  Make sure to remove your shoes after 12 hours so you don't damage them.  ", " Take your shoes out of the freezer, and let them dry for 30 minutes. Though you can try to wiggle the bags of ice out as soon as you remove your shoes, the water will likely be frozen solid. Giving your shoes about 30 minutes to dry will make it easier to remove the bags. However, try not to leave them much longer than that, since the condensation may wet your shoes.  Your thawing shoes may leave a slight puddle, so lay a plastic bag down before letting them thaw, or thaw them in the sink for easy cleanup.  ", " Remove the water bags after 30 minutes. The bags of water should be easier to remove at this point. Wiggle them out carefully, then pour the water down the drain and discard or wash the bags. ", " Let your shoes thaw before putting them on. It will probably take a few hours for your shoes to thaw. Wait until your shoes feel warm before putting them on your feet, then check the fit.  Walk around and wiggle your toes to see if you like the fit.  "], "Soaking Your Shoes for a Big Stretch": [" Slide on your shoes and lace them up. Pull on a pair of socks to add a little padding inside the shoe, which will help stretch them. Then, put on your shoes exactly as you would for climbing, lacing them all the way up.  Wearing a thicker pair of socks might help you stretch out your shoes more because they will take up more space inside your shoe.  ", " Turn the shower on as hot as you can stand it. Warm water will ensure that the fabric expands as much as possible, so wait a few minutes for the water to warm up before soaking your shoes.  Hot water can scald your skin, so be very careful.  ", " Put your feet under the water until your shoes are soaked. It doesn't matter if the rest of your body gets wet, so you don't have to get under the stream of water if you don't want to. Hold your feet under the water for about 1-2 minutes, and make sure to move around so every area of your shoe gets wet.  You should feel the water inside your shoes, soaking through your socks. Keep in mind that the dye from your shoes may run when the shoes get wet. This shouldn't be a cause for concern.  ", " Walk around and wiggle your toes to help stretch the shoes. The longer you keep your shoes on – and the more you wiggle your toes – the better! Wearing your shoes, and moving your feet, are the best way to stretch the fabric out.  Be very careful as you walk around in your wet shoes because it's easy to slip. Try to walk on a towel or rug so that you aren't stepping into puddles.  ", " Climb in your shoes while they're still damp, if possible. The best way to make sure your shoes mold to your feet is to climb in them. However, make sure you're extra careful, and choose an easy climb, since your shoes may be slightly slippery and uncomfortable.  If you typically climb indoors, confirm with the gym that you can climb in wet shoes before attempting to do so. It might also help to bring a towel so you can dry the wall after you're done. Climbing in damp shoes won't feel as comfortable as using dry shoes, but it will help stretch your shoes out quickly.  ", " Remove your shoes, then stuff them with newspaper as they dry. Pack the newspaper tightly in the toe cavity, then fill the rest of your shoes with the remaining newspaper. This will prevent your shoes from shrinking back up as they dry.  As another option, you could use paper towels, washcloths, or socks to stuff your shoes.  ", " Let your shoes dry for 24-48 hours or until they're fully dry. Place your shoes in the sink or on a waterproof surface, and leave them for at least 24 hours. Once they're no longer damp, try them on to see if they fit!  "]}}, "How to Rock Climb": {"description": "Rock climbing is a sport in which participants climb up or across natural rock formations or man-made rock walls. It is physically and mentally demanding, and tests a climber's strength, endurance, agility, and balance. Anyone can start rock climbing though, no matter how much experience you have.", "content": {"Beginning to Climb": [" Head to a rock gym or bouldering gym to safely learn basic skills and safety. You can also boulder outdoors, but you'll need to find out about safe, established bouldering sites before getting on a rock. Moreover, outdoor sites are usually more difficult, and require guides and deeper knowledge of rock formations. Rock gyms are safe, well-designed spaces for a variety of skill levels, and they often have classes and staff to help you learn. In general, you have two options starting out:  are short rock climbing problems that don't require harnesses or ropes, and are a fantastic way to build your climbing skills safely, without complex introductions to belaying or equipment. Since these problems require no ropes certain constraints that come with roped climbing are avoided. Bouldering routes are great for learning to climb and are a fun way to climb although you lack the safety that you would have with a rope.  is what most people think of when they think of rock climbing. You're tied in and scaling a large wall. In order to top-rope you'll need a partner. If you're brand new to the sport, check with the staff about \"belay partners,\" or boulder until you feel comfortable asking for a partner.   is another common type of climbing used largely outdoors to ascend routes of different lengths. In lead climbing two climbers, or the “leader” and the “follower”, are tied in to opposite ends of a dynamic rope. The “leader” ascends first, clipping into bolts or placing their own protection periodically. When they reach the top of that section of the climb, or the “pitch”, the leader sets up their Personal Anchor System, and belays the “follower” up. Lead climbing is a more advanced form of rock climbing and requires detailed training and practice.   ", " Rent a pair of snug shoes and a chalk bag. Rock climbing shoes need to be snug so that you can feel the precise edges of the rock. They may feel uncomfortable at first, as the toes are often pointed in order to help you stay on small chips and edges, but you'll get used to them quickly. Just make sure they don't cut off circulation. It is common to wear shoes a size down from your standard shoe size. Chalk bags, while not necessary, are used to keep your hands dry -- essential for holding onto the rock as you get tired. Simply dip you fingers lightly in the chalk and clap them together so you have a light chalky dusting on your hands. Harnesses, clips, and belay devices are necessary if you're top-roping. The remainder of this section assumes or are bouldering.  ", " Climb to the top of the wall or problem any way you can to get used to the sport. Most walls are marked by routes -- specific sets of rock that you must use to get to the top. While these are more challenging and fun for experts, you need to get comfortable with the height, the holds, and the general feel of climbing first. Ignore the tape marks and just head up the wall, working on the basics of your form. Once you're comfortable climbing, you're ready to start tackling some basic routes. To start, look for routes labeled 5.4 or 5.5 for top-roping or V0 or V1 for bouldering, which are good beginner ratings. (In Europe, Fontainebleau grades are commonly used. These grades start at 2a and goes up each number after each 'c' grade.) The fear of falling and the fear of heights are perfectly normal human instincts. Remember, however, that you have a bevy of safety equipment, padded floors, and a knowledgeable person holding you up. After your first few slips, you'll get used to it. Starting with an expert, even just a friend who climbs often, is a great way to break slowly into the sport.  ", " Push up from your legs instead of pulling up with your arms. This is the number one rule of good climbing, and the hardest thing to get used to. It feels natural to pull your body up the wall because your fingers feel like they're more firmly locked onto the holds. But your legs are much, much stronger muscles, and you'll tire out halfway up the wall if you're trying to do ten consecutive pull-ups. There are a couple of surefire tips to get accustomed to using your legs: Keep your arms extended. Let your weight hang low, gripping the hand holds purely for balance and bending your knees for power. Set your feet before moving your hands. Get good, solid footholds that you can put weight on. Keep your weight on your toes, not on your hands, by dropping your heels lower than your toes.   ", " Plan your moves in advance, putting your limbs in position for each move. If you're struggling to reach a handhold with your left hand, you don't have to become Mr. Fantastic to grab it. You need to move your left foot higher -- elongating your left side and making the reach easier. Climbing is a deliberate, thoughtful sport, and muscling up the wall will only get you so far. Stop to think about the best way up a route, or ask experienced climbers for advice. Learning to read a route from the ground, visualizing where your hands and feet will go in advance, is an essential skill you can never start practicing too soon. The more time you spend gripping the wall, unsure where to go, the more tired you'll get. The set of moves you use to get up a wall is called your   ", " Find good resting points to plan your route and relax your arms. Most routes have 1-2 spots where you can catch your breath and loosen your muscles. A good rest spot is anywhere you can comfortably stand with most of your weight on your feet. You should be able to take one arm comfortably off the wall to get chalk and stretch out. While resting: Plan out your next few moves. Memorize what footholds you have coming up and think about which limb you want to go where. If needed, ask someone at the bottom for advice. Re-chalk your hands. Chalk runs off on rocks, so get some more. Shake out your arms. Let them hang and give them a good shake to dislodge some of the lactic acid that has built up.  ", " Move deliberately up the wall. There are advanced moves that require speed, rapid precision, and even small leaps (called \"dynos\"), but these are for later in your career. For now, you want to focus on fluid motion. The best way to do this is to focus on each limb first, then move your body. Also known as \"static climbing technique,\" you move each limb, get set, then move your body over into the new position. Think of yourself as a slinky, coiling and uncoiling up the wall. Set your feet, knees bent. Shift your body weight the direction you're headed. Step up with a foot while simultaneously grabbing a new hold with the matching hand. Re-set your feet and opposite hand. Repeat.   ", " Know that climbing muscles take some time to build. One of the biggest hurdles for new climbers is that they feel weak after only 1-2 runs. Your fingers will be sore and your forearms will be burning, so much so that you don't feel like you can even hold onto the wall anymore. This is natural, however -- your forearms are not frequently used at this intensity in everyday life. However, if you climb a few routes 2-3 times a week you'll quickly get over this hump and can focus on climbing technique, not how sore your arms are. Take rest breaks in between climbs. Don't get back on the wall until your feel rested again. Stretch your forearms by clasping your palms in front of your chest and elbows out as if you were praying. Slowly rotate your hands down until they point in front of you to stretch.   "], "Tying In and Climbing Safely": [" Learn to tie in and belay with a trained supervisor. Belaying is not a difficult process, but it is an essential one if you're serious about climbing. Most climbing gyms will require you to take a supervised test before you're allowed to belay someone. They usually offer classes or free, quick lessons as well. You should always practice belaying with a trained expert. While belaying needs to be trained in person, however, you should know how to tie into your rope no matter what your skill level. Belaying is when someone stands below the climber with the rope. They catch them if they fall, give them more rope as they climb, and lower them down slowly when they finish.   ", " Attach your harness as snugly as possible. Whether climbing or belaying, your harness should be snug across your waist and thighs. Do no skimp on this -- tighten every buckle as much as your comfortably can. This includes the leg loops, which cannot be skipped.  ", " Create a figure-eight in the bottom of the rope, leaving roughly an arm's length at the bottom. This is frequently done for you at climbing gyms, but you should understand the process if it is not. There will be two identical strands of rope coming down from the top of the wall. Grab the one closest to the wall and measure out roughly an arm's length. From there: Gripping the rope at your \"arm's length,\" drop the bottom of the rope. Holding it up, you should have an upside-down \"U\" shape in your hands. Pinch the two sides of the U to create a \"bite,\" or small 1-2\" loop. Wrap the bottom of your rope around the bite. You'll cross over your hand so that the end of the rope is back on your side of the bite. Thread the end of the rope through your bite hole. Pull the end of the role through to make your figure eight.   ", " Thread the end of the rope into your harness. This is how you tie in. While all harnesses are different, in general, you'll thread the rope through two loops in the front of your harness, also known as “hard points”. Later, you’ll tie the end of the rope into your figure eight, effectively attaching yourself to the rope. Make sure that the rope goes through both loops-- the one on your legs and your waist, before tying in.  ", " Take the end of the rope and trace out your figure eight to make a figure eight follow-through. Once you're figure eight is made and you're attached to the rope, complete the tie-in by doubling up on your knot. To do so, you'll simply take then end of the rope in your hand and follow the shape of your figure eight, threading the end in, under, and over the rope to create a snug, secure double figure eight: Note the path of the rope coming back towards you, from your figure eight. Slide the end of your rope the same way this rope runs so that you have parallel ropes. Trace the rope up and over, then back through the figure eight. Again, you're just trying to follow this rope line, create two parallel ropes for a double figure eight. When you're done, the end of the rope should be pointing forward, following the rope up the wall.  ", " Pull the rope tight and consider making a safety knot. Grip the both sides of the rope, two ropes at a time, and pull the knot tight. Use your fingers to push or mold the double figure eight so that you have parallel lines throughout with no crossing, twisting, or braiding. Most gyms require a simple safety knot as well, tying off the loose end. To do so: Place your thumb on the rope, roughly 2-3\" above the figure eight. Grip the loose end in your other hand. Wrap the loose end over your thumb twice, making an X above your thumb. Wrap the end around one last time, then feed it through the hole where your thumb is. Pull the loose end tight to cinch the knot down.   ", " Check your knot for safety. There will be five pairs of parallel rope -- one before the knot, one after the knot, and three little segments in your double figure eight. Your double figure eight should look identical on the top and bottom, and the safety knot should be tight. There shouldn't be any crossed ropes. If there are, loosen the figure eight slightly and bend or move the ropes so that they are all parallel, then tighten it again. Always have an experienced climber check your ropes when you're first starting out.  ", " Communicate with your belayer before climbing. There is an almost universal code for climbers, and it is used to ensure that everyone is set and the safety measures are in place. Before you climb, you must always follow this protocol. However, some places use different climbing calls. You ask, \"On Belay?\" They reply, \"Belay on.\" You get ready on the wall and say, \"Climbing?\" They respond, \"climb on.\"   "], "Improving Your Climbing Technique": [" Keep your hips close to the wall. Do this by pointing your knees to the side. The more you lean back, the more you rely on your fingers to hold you close to the wall. This drains your energy quickly and will almost definitely hurt your fingers over time. Instead, angle your knees away from the wall, almost like a frog, to keep your hips close to the wall. Whenever you need to push away to survey the route or grab another hold, make the movement quickly, then hug the way again to save energy.  You want as much weight as possible on your feet at all times.  ", " Relax your grip. Frequently, during harder moves or when you get tired, you'll tend to grip the hold tightly. However, your hand holds are generally just there for balance. Remember, you want your feet to do most of the work, so loosen up your fingers. Trust them, almost hanging from them for balance, not to keep your weight on the wall. Your fingers are basically just balance hooks. As you get better, you'll encounter overhangs and moves that require some serious finger strength. However, you'll build this naturally as you progress towards harder climbs.  ", " Find your \"dead point\" when making big moves on the wall. The dead point is the spot when you transition from moving up to falling down. Basically, your momentum is shifting from a \"jump\" to a fall, and as such you don't move at all, making it easier to grab the hold. Not all moves are close enough that you can move slowly from one to the other. Sometimes you'll need to push off with your foot and grab the hold while on the move. Learning to grab it right when you hit your apex will greatly increase your fluidity on the wall. To practice, find a route with several holds just out of reach, or practice on the bouldering wall. Practice grabbing the hold with your arm extended so that you don't feel any drop as you grip it.  ", " Climb with rhythm. While this may change for some routes or crux moves, developing a rhythm is often the best way to conscientiously build good climbing habits. Think of moving with the feet first, going or up the entire wall. Start with some easy routes to get used to this. Because you're moving quickly, with your feet first, you'll naturally come to rely on your leg muscles and stop over-using and tiring your hands.  Quick, focused climbing saves energy, as it prevents hanging on the wall and getting tired. Focus on your breathing as you move. Many people hold their breath as they try hard moves, but that just deprives your muscles of much-needed oxygen. As you develop a rhythm, breath into it as well so that you have regular, rhythmic breathing.  ", " Climb down a few routes. This is a great training exercise for your balance and route spotting. Most importantly, it focuses on landing your feet very precisely, making your footwork exponentially better. If you can use your feet  effectively on the way down, you'll develop the skills needed to place your feet anywhere on the way up quickly.  ", " Increase your climbing pace while staying deliberate in your movements. Skilled climbers move quickly, as this saves energy wasted by holding onto a rock while deciding what to do. While you don't want to try scrambling up the rock, lunging wildly, you want to make your moves quickly. Once you've decided what to do -- do it. Don't wait around or keep shifting as you'll only lose energy and make the rest of the climb even harder.  ", " Watch other climbers to learn new moves and possible betas. The beta, or sequence of moves used, becomes increasingly important the harder the route gets. While beginners generally can choose 4-5 ways up a route, difficult routes (5.10 and up) sometimes only have 1-2 sets of moves that can be used. Frequently, they aren't always that obvious. There are hundreds of moves, techniques, and little tricks that can be used for specific problems, but the rock climbing community is luckily a very inclusive one. Watch other climbers, pantomiming the moves from the ground to get used to hand positioning.  If you're struggling on a route, ask another climber for advice. Your belay partner may have a great view from the ground, for example, of a move or hold you're missing.  "]}}, "How to Dress for Rock Climbing": {"description": "Rock climbing can be a great, tough sport indoors or out. Outfitting yourself right for your climb will improve your experience. It’s important to wear clothes that are loose, comfortable, and protective. If you’re outdoors, you’ll want to dress for the weather. Next, add the right gear to keep you safe. With some good basic clothing and gear, you can really enjoy your climb.", "content": {"Putting Your Outfit Together": [" Wear a loose, comfortable top. Choose a comfortable top that gives you maximum freedom of movement. Consider long sleeves for warmth or to protect you from the sun when you’re climbing outdoors. If it’s really hot, you might prefer a tank top or short sleeves.   ", " Choose long pants for protection. Long pants will protect your knees from scratches and abrasions. This is especially important if you’re climbing in a crack, where your knees will constantly be against the rock. Find loose, comfortable pants.  Pants can get in the way of footwork so don’t get them too long or too loose. Roll up long pants around your feet to be safe.  ", " Stay cooler in shorts or capris. Find a good, loose, comfortable pair of shorts, capris, or three-quarter-length pants for hotter days or if you prefer the freedom of movement they provide. Capris and three-quarter-length pants will keep you cooler than long pants while still protecting your knees. Wear longer shorts. Your harness will go around your thighs. Longer shorts can protect your thighs from chafing and irritation from the harness.  ", " Get your tops and bottoms in synthetic fabrics. Synthetic materials will wick away sweat and keep you dry. You’ll stay cooler in the heat and warmer in the cold when your clothes are dry. Cotton can stand up better to snags from rocks and will hold up for a long time, but it will soak up sweat, get heavy, and take longer to dry. Some go-to synthetic fibers include Tencel, Gore-Tex, nylon, and polypropylene.   ", " Opt for lighter colors in the heat. Wear light-colored clothes on hot days. Light colors will reflect light and heat, keeping you cooler than dark colors. You’ll also be more visible in lighter colors, which can make you safer. ", " Layer in the cold. Dress in layers in cold weather. Thin layers are better than one heavy layer because heat will stay trapped between layers. You can remove layers as your body or the day heats up. You can also add layers if the day gets colder.  Start with a warm base layer in synthetic material that will wick away sweat. Add an insulating layer for added warmth. Top it off with a layer that will protect you from the elements. Make sure your clothes are loose enough to give you a maximum range of motion.  "], "Investing in Rock-Climbing Shoes": [" Find a versatile shoe with a hard rubber sole. Climbing shoes are lighter and smaller than other athletic shoes. Look for a versatile shoe with a hard rubber sole that can handle various kinds of climbs indoors and out. A hard sole can handle all kinds of climbs, will not wear out quickly, and can hold an edge longer than a softer rubber sole.  ", " Get the right fit. All brands are different, so take your time trying them on. A tighter shoe is good for aggressive climbing. Some advanced climbers prefer really tight shoes with their toes bent in the toe box. A softer, looser shoe is suitable for less challenging climbs, climbs with different sorts of pitches, indoor climbing, and for beginners. Unlined shoes are more comfortable, but they stretch more so aren’t as durable. With a stiff sole you can size up a little for comfort and still be safe on all kinds of climbs. Leather shoes will stretch more than synthetics and will gradually conform to your foot. If you choose a synthetic shoe, make sure it fits comfortably when you buy it.  ", " Decide how you want your shoes to fasten. Lace-up shoes are highly adjustable and you can customize how they fit. Velcro shoes are almost as adjustable and are easier to take on and off. This is helpful when your feet get hot or when you’re going between street and climbing shoes. Slippers are the most comfortable style, but they stretch out easily and need to be replaced often. ", " Choose between a soft or a stiff shoe. Soft shoes will let you feel the rock better and are better for areas with slopes because they stick to the surface better. A soft shoe will not be very supportive, so your feet might get tired more quickly than in a stiff shoe. Stiff shoes let you stand on smaller ledges, but your foot won’t feel the rock as well. A stiff shoe will give your feet more support and prevent fatigue.  "], "Staying Safe with the Right Gear": [" Buy certified equipment. Rock climbing requires specific safety equipment. Buy equipment that is certified as the most reliable to protect you. The International Climbing and Mountaineering Association (UIAA) has a database of certified equipment that they update regularly. Certified climbing equipment will say that it is UIAA or CEN-approved.  CEN is the European standard for safety. The website for the UIAA database is   ", " Protect your head with a helmet. Choose a helmet specifically for climbing. Football and bicycling helmets are not made to withstand rocks and debris that might fall on your head. Pick a helmet with a snug, comfortable fit.  Choose a helmet with ventilation if you tend to get hot quickly. A light-colored helmet will keep you cooler in the sun on hot days.  ", " Look for a comfortable harness. A good-fitting harness will keep you upright when you’re hanging or if you fall. Consider the fit of the waist, legs, and rise when choosing your harness. The waist should be tight enough that you can only fit a few fingers between your body and the harness. You’ll spend more time standing in your harness than you will climbing or hanging, so find one that is comfortable when you stand.  Harnesses fit around your waist or your hips. You’ll be most comfortable in a harness that fits around your waist if your hips are bigger than your waist. The leg straps should not be snug, but not tight. The rise is the difference between your waist and your leg straps. You won’t be comfortable if this is too short. Try to find an adjustable rise. Mesh harness are the most comfortable, breathable, and lightweight. Gear loops should be easy to access. Make sure that they aren’t too far forward so your gear won’t bang on your thighs or get in your way while you climb.  ", " Stock up on rope. Ropes are critical for lead climbing, breaking a fall, rappelling, and even hauling gear. There are several considerations when you choose your ropes. Focus first on length, diameter, and whether your rope is dynamic or static.  Get rope that is at least 60 feet long. Longer rope will give you more flexibility. Ropes come in a variety of diameters. A thicker rope is a safe choice for starting out. It’s also highly durable, locks well into your carabiners, and is easy to grab. Dynamic, stretchy ropes are best for lead climbing. Static ropes don't stretch. Both static and dynamic ropes can be used for rappelling and hauling equipment. Make sure to check your rope for “dead spots”, or places where the core of the rope feels soft or damaged.  ", " Pick up some carabiners for holding your ropes and for belaying. Choose carabiners that clearly state they are for climbing and are certified to hold significant weight. Carabiners have locking devices and shapes that are specific to the sport. Start by choosing your carabiners based on these two features. The D-shape is the most durable, lightweight, versatile, and common. All carabiners will have ratings in kiloNewtons (kN) that describe their force-bearing capacity in different positions, including along their spine and across the gate (cross-loaded). A carabiner is most effective when force is distributed along its spine. A pear shape has a larger basket to hold the rope and is usually used for belaying  (holding the rope to stop another climber from falling). Choose between a carabiner that locks automatically when it is shut or one that screws shut (mostly used in wet and icy conditions).  "]}}, "How to Belay": {"description": "Belaying is a climbing technique in which a climber ascends while wearing a harness attached to a climbing rope. A climbing partner – called the belayer – stands below, controlling the tension on the climbing rope and helping the climber stay secure and avoid dangerous falls. In order to belay safely, learn how to tie in correctly and practice the PBUS (Pull, Brake, Under, Slide) system. Use good belaying techniques and proper safety equipment.", "content": {"Tying in with a Figure 8 Follow Through Knot": [" Make a loop in one end of the climbing rope. Most professional climbers recommend tying in the climber with a Figure 8 Follow Through knot. Start by making a loop, or bight, about three feet (one meter) from the end of the rope. This can be measured with one arm length.  ", " Bend the tail around the rope below the loop. While holding the loop you have just made, pass the tail of the rope around the front of the main strand a little bit below the bottom of the loop. You should now have a shape like an ampersand (&).  ", " Pull the tail back through the top loop. Pass the tail end of the rope through your original loop from behind. This will create a loose figure 8 knot. Do not tighten the knot.  ", " Pull the tail of the rope through the hard-points in the climber’s harness. Start the process of connecting the figure 8 knot to the climber’s harness. Pick up the end of the rope where you just made the figure 8, and run the tail of the rope through the hard-points or loops on the front of the climber’s harness. Pull until the knot is 2-3 inches (5-8 cm) from the harness.  ", " Start the “Follow Through. ” Once the tail is fed through both tie-in loops, grab the end of the tail and start to feed it back into the figure 8 knot. Start at the same point where the tail emerges from the knot.  ", " Trace the path of the original figure 8. Carefully feed the tail through the knot, following the strands of the original figure 8, until you have a figure 8 knot that is two strands thick. Take care to keep the strand of the “follow through” parallel to the strand of the original knot.  ", " Dress the knot. Check to make sure all the strands of rope are lined up correctly, and pull the knot tight. Tighten by pulling each of the four strands emerging from the knot. You should have at least six inches (15 cm) of excess tail left over when you are done. Have your partner or instructor double-check the knot to make sure it is properly tied and secure.  If you do not have enough tail left over, untie the knot and retie it further from the end of the rope.  ", " Feed a bite of rope through one of the slots in the belay device. Once the climber is tied in, the belayer must set up their belay device. The most common type of belay device is an ACT, which features two slots for feeding through a bite of rope, and a wire keeper. Make a small bite (not a twist or full loop) in the opposite end of the rope from the one that is attached to the climber’s harness. Make sure the top of the rope bite emerges on the same side as the wire keeper.  ", " Attach the rope and belay device to your harness. Hook a locking carabiner through both the rope and the wire keeper, and attach it to the belay loop on your harness. Lock the carabiner securely.  If you have a horizontally oriented belay loop, make sure the rope is oriented so that the tail end is in your dominant hand. The tail end of the rope is the “brake strand,” which is the part of the rope that you will need to control in order to arrest falls and manipulate the amount of tension in the climbing rope. .  "], "Learning the PBUS System": [" Sign up for a PBUS belay class. It is important to get professional instruction before you begin to belay. Most gyms that have indoor climbing walls offer belaying instructions, and may require you to get a certification or pass a test before you can use their equipment on your own. Most belay classes will teach you the PBUS (Pull, Brake, Under, Slide) method.  PBUS is a basic belaying technique that allows you to safely and steadily control the slack in the rope as your partner ascends. The PBUS technique involves using short, controlled, repetitive movements.  ", " Practice the pull. The first part of the PBUS method is the “Pull.” As the climber moves up, slowly pull down on the guide strand of your rope to take in the slack. The guide strand is the part of the rope that attaches to the climber. At the same time, pull up on the brake strand (the tail end of the rope) in order to feed the excess rope through the belay device.  ", " Put your rope in brake position. The B in PBUS stands for “Brake.” Once you’ve removed enough slack from the climber’s rope, pull down on the brake strand to hold the rope in place. Braking is one of the most important parts of belaying, since you will need to be able to brake quickly in case of falls. Make sure you always have at least one hand on the brake strand at all times.  ", " Put your guide hand under your brake hand. This is the “Under” part of the PBUS technique. Holding the brake strand in brake position, remove your hand from the guide strand and place it underneath your brake hand on the brake strand. This motion begins the process of repositioning your hands so that you have full control of the brake strand after a pull and brake.  ", " Slide your brake hand back up the brake line. The S in PBUS is for “Slide.” During the pull and brake parts of the PBUS maneuver, your brake hand will move away from the belay device, and will need to be moved back into place. Once you’ve put your guide hand under the brake hand, slide your brake hand up the brake line until it is about 3 inches (8 cm) from the belay device. Put your other hand back on the guide strand.  ", " Repeat this process as the climber continues to ascend. Once the climber is ready to move again, repeat the whole process, starting with the pull. Practice going through the PBUS motions until they become natural and automatic.  ", " Practice without tying in. Before you try an actual climb, you and your partner can practice without tying in the climber. Instead, have the climber pull or release the rope to simulate the changes in tension you would experience during a real climb, and practice reacting appropriately. "], "Using Proper Belaying Techniques": [" Keep your hands on the rope at all times. While belaying, you must keep your dominant hand on the brake strand (the “tail” end of the rope emerging from the belay device) at all times. Your other hand should be either on the guide strand (the part of the rope that leads up to the climber) or on the brake strand, depending where you are in the belaying process. Keeping both hands in place will allow you to maintain control of the rope and quickly pull it taut in case of a fall.  ", " Brake if the climber falls or needs to stop. Being able to do a strong brake is vital to safe belaying. If the climber starts to fall, reaches the top of the climb, or needs a moment to rest, pull the brake strand straight down while holding it directly in front of your body.  For an extra stable brake, use both hands. You can also add some extra tension by using your body weight in addition to your brake hand. Keeping your brake hand in place, use your other hand to wrap the brake strand around your hip and just under your butt.  ", " Pay attention to the climber at all times. Whichever climbing technique you use, it is crucial that the belayer stays vigilant and keeps a close eye (and ear) on the climber. Do not listen to music, check your phone, or allow yourself to become distracted by the scenery or other climbers.  ", " Feed the brake line back through the belay device to create slack. If the climber needs extra slack, or is ready to start descending, use carefully controlled movements increase the slack. Put both hands on the brake strand, and use the top hand to slowly feed rope back up through the belay device. If the climber starts to descend too quickly or if there is too much slack, immediately pull the brake strand down in front of you to put it back in brake position.  ", " Communicate with the climber using calls. Being able to communicate with your climbing partner is vitally important during belaying. Before you begin a climb, work out a system and make sure that you both understand what the different calls mean. There are a variety of standard communication systems, but the most important thing is to pick a system that works for both you and your partner. Examples of common calls include:  “Ready to climb,” or “On belay?” when the climber is checking in with the belayer before starting to climb. The belayer may respond with “On belay,” or “Belay on.” “Climb ready,” or “Climbing,” when the climber begins to climb. The belayer may respond with “Climb,” or “Climb on.” Other climbing calls include “Slack” (when the climber needs more slack), “Up rope” or “Take” (when the climber needs less slack), “That’s me” (once enough excess slack has been taken in), “Falling!” (if the climber is falling or beginning to fall), and “Safe” or “Belay off” for once the climber has reached their destination at the top of the climb safely.  ", " Try a top-rope setup for greater stability. Top-rope climbing, or top-roping, is a method in which the rope is attached to a pre-set anchor at the top of the climb. Top-roping offers greater stability and a lower risk of serious falls than lead climbing. The anchor at the top of the climb will help keep the rope taut with less effort required from the belayer. Top-roping is the best technique to use when you are learning how to belay.  "], "Setting up Your Equipment": [" Get rock climbing harnesses with belay loops. The climber and belayer must both wear harnesses designed and tested for rock climbing. Make sure the harness has a waist belt, tie-in point, belay loop, and buckles.  Some harnesses use the same point for tie-in and the belay loop. You can purchase climbing gear at most stores that sell outdoor recreational equipment. You may be able to rent harnesses and other equipment for indoor climbing at your gym. Many universities that offer outdoor recreational programs will allow students, faculty, staff, or alumni to rent climbing equipment.  ", " Put the harness on correctly. Step into the harness as you would a pair of pants. Your legs go through the leg loops, with the pair of elastic straps (called risers) that attach the loops to the belt facing the back. Pull the waist belt up over your hips, with the tie-in point and belay loop facing the front. Use the buckles on the waist band and leg loops to adjust the harness so that it fits comfortably. ", " Use a safe locking carabiner with your belay device. Purchase a locking carabiner that is designed for use as climbing gear. Since the carabiner is the only thing keeping the rope and belay device attached to your harness, it will need to be strong and sturdy. Climbing carabiners are available at stores that sell outdoor recreation equipment. ", " Get good climbing shoes. Climbing shoes are designed to be flexible and to have excellent grip. A good climbing shoe should have soft, sticky rubber soles that offer plenty of friction.  You can purchase climbing shoes from outdoor recreation or sporting goods stores. You may also be able to rent climbing shoes at your gym. If you choose to rent climbing shoes, make sure the soles are in good condition.  ", " Use climbing chalk. Chalk is useful for reducing moisture on your palms and enhancing your grip, whether you’re climbing or controlling the rope. You can purchase climbing chalk at sporting goods or outdoor recreation stores.  Note that some gyms do not allow chalk or have restrictions on what kind of climbing chalk you can use. Your gym may provide climbing chalk. Call ahead to find out whether you need to bring your own.  "]}}, "How to Use a Harness for Rock Climbing": {"description": "A harness is one of the most basic pieces of climbing gear, but that also makes it one of the most important. Your harness is an attachment for your climbing rope and belay device. Before you can begin climbing, you have to fit the harness on your waist. Then you knot your climbing rope to it, along with a belay device if you're climbing with a partner. Before heading out to the rocks,  inspect your harness to ensure you have a safe climb.", "content": {"Putting on a Harness": [" Lay the harness out with the buckles and leg loops in front of you. Place the harness on the ground or hold it in front of you as you prepare to put it on. Your harness has a waist belt with a pair of buckles, which go over the front of your body. It also has a central loop, or belay loop, connecting the waist belt to the leg loops hanging underneath it. Rotate the belt so the belay loop is in front and faces away from your body.  Positioning the belay loop correctly also orients the leg loops. They are all attached to one another, so you don’t need to worry about moving them around individually. Make sure the straps aren’t tangled. Also, note any spots where the straps have come out of the buckles.   ", " Step through the harness by putting your legs through the leg loops. It’s like putting on a pair of pants. Make sure the leg loops are underneath the waist belt so you can step through both of them at the same time. Then, put your left leg through the left loop and your right leg through the right loop. It’s easy, and if you make a mistake, pull the harness down, untangle it, and try again.  Always step through the waist belt first. If you only get into the leg loops, you won’t be able to wear the harness correctly.  ", " Pull the harness up until the waist belt is above your hips. The waistband needs to sit right above your hips so your hip bones hold it in place. After you get the waistband up, adjust the leg loops as needed. Position the leg bands at the top of your thighs, right underneath your groin.  If you can’t get the waistband up, loosen the leg loops by pulling the straps out of the buckles holding them in place.  ", " Tighten the waist loop by pulling the tail ends of the straps. Newer harnesses are adjustable like many other types of clothing. If your harness is adjustable, look for the buckles to your left and right. Pull the straps away from your body until the belt feels tight but not suffocating.  Test the waist belt by taking a deep breath and trying to slip 2 fingers underneath the strap. The belt may feel a little uncomfortable the first time you put it on, but it's necessary for a safe climb.  ", " Double back the belt loop if yours is loose. Older harnesses have loops that come undone and need to be tied manually. To do this, take the strap all the way out of the loop, then pull it toward the center of your body and through the belt buckle. Reverse direction, pulling the strap over itself and back through the buckle a second time. Then, pull the tail ends of the straps away from the belt buckles to finish tightening the harness.  If you see the word “warning,” “danger,” an “O” for open, or something similar, that means you need to double back the loop. These words are only visible when your harness loop isn’t tied correctly. Take care of it before scaling a wall!  ", " Repeat the tying and tightening process with your leg loops. The leg loops function the same way as the waist belt. Many harnesses have adjustable straps, but some older versions have ones you need to tie yourself. If you need to tie them yourself, double back them by pulling the straps through the buckles and back again. No matter what kind of harness you have, pulling the tail ends of the straps tightens them.  You don’t have to tighten the leg loops as much as the waist belt. At the right setting, you can slide a hand underneath each strap. Make sure the straps rest comfortably against your legs.  ", " Feed the tail ends of the straps through the belt buckles. You most likely have some excess material dangling from the front of your belt. Since these distractions get in the way of a climb, tuck the strap ends into your belt buckles. Some harnesses also have secondary buckles or plastic loops on the sides you can use to pin down the straps.  Give your harness one final check before your climb by inspecting it and trying to pull it off your hips. If it's ready for use, you won't be able to pull it off your hips.  "], "Tying a Climbing Rope to a Harness": [" Measure about in (8.9 cm) from the end of a climbing rope. Tying in means knotting a load-bearing climbing rope to your harness. To tie in, you first need to get a climbing rope about 200 ft (61 m) in length. Then, measure the distance from one end. The measurement doesn’t have to be precise, and you can easily estimate it using your arm.  The length of rope you need is a little longer than the length of your arm. Hold out one arm, then stretch the rope from the tips of your fingers to your shoulder. The rope you knot to your harness is what keeps you off the ground if you fall, so it is just as essential as the harness. Climbing ropes and other tie-in supplies are available online and at outdoor sporting stores. Any place that sells harnesses most likely has ropes too.  ", " Twist the rope around on itself twice to form a bend. Pinch the rope at the point you measured, letting the ends hang side by side. Then, twist the ropes around each other to form the loop, also called a bight. The shorter length of rope you measured is called the working end. This is the part you need to finish the knot, so note where it is.  The opposite length of rope is the standing end. This part is the length you tie to an anchor point, such as a solid rock or a suspension system at the gym.  ", " Insert the working end of the rope into the loop you made. While holding the loop in one hand, move the rope with your other hand. Pull it all the way through the loop to create a figure 8 knot. You still need to use the knot to finish tying in, so tighten it just enough to hold it together.  Figure 8 knots can be difficult to undo if you tighten them too much. Keep some slack in the rope and hold the knot in place to prevent this from happening.  ", " Pull the working end under the belay loop on your harness. Once you have the figure 8 knot done, hold it off to the side to begin tying the rope to your harness. Find the pair of tie-in loops around the belay loop on your harness. Bring the rope through the lower tie-in loop, behind the belay loop, and through the upper tie-in loop. Then, pull it through until the figure 8 knot is about 2 in (5.1 cm) away from your body.  Make sure the rope fits securely between your body and your harness loop. It’s a very important part of safe climbing!  ", " Feed the rope through the bottom part of the figure 8 knot. Hold the figure 8 knot horizontally in front of your belay loop to make the process a little easier to visualize. Then, bring the end of the rope down between the knot and your body. Pull it all the way through the bottom loop in the figure 8 to begin the second knot.  Sometimes this part gets a little confusing. As long as you follow the rope from your belay loop to the knot, you can locate the bottom part of the knot.  ", " Pull the rope through the bottom loop a second time. Don’t bring the end of the rope back underneath the knot yet. Instead, hold the knot still and locate an opening between the knot and the pass-through you just made. Push the rope through the loop and underneath the edge of the original knot.  If you’re confused about where to take the rope next, follow the rope length from your belay loop. To complete the tie-in, you follow the steps you did for the figure 8 knot in reverse.  ", " Bring the rope through the top loop to create a second knot. Basically, you’re creating an identical figure 8 knot. To finish the second knot, move the end of the rope toward you and underneath your original knot. Look for a small opening in the top loop of the knot. When you find it, pull the rope all the way through it to tie the double figure 8 and tighten it.  Check your work. If your knots look off, undo the second knot to tie it again. The knots look identical when they're perfect.  ", " Tie the remaining rope down with several overhand knots . Tying the rope leaves you with about 3 in (7.6 cm) of extra length on the working end. Take the opposite length of rope you’ve ignored up to this point, the standing end, and hold them side by side. Knot the working end to the standing end as many times as you can.  The remaining length of rope is for your anchor point, so don't tie the working end to it. Instead, tie it to the length past the figure 8 knot.  "], "Attaching an ATC Belay Device": [" Make a bight in the middle of the climbing rope. Take the standing end of the rope the other climber used to tie-in their harness. Pinch it about 1 ft (0.30 m) from the end, creating a bend like you do when you tie-in. This bight is what you use to attach to the belaying device, so make sure you have plenty of length to work with.  Check online or at an outdoor activity supply store if you don’t have a belay ATC or locking carabiners.  ", " Push the bight into an ATC device. You need a belay device called an ATC if you plan on hooking your rope to another climber. Most ATCs have a wire loop sticking out of one end, which is a guidance system for securing the rope. To use it, push the bight through the metal part of the ATC. When the bight comes out the other end, align it with the wire loop.  The rope loop you make needs to be the same size of the wire loop. When it is the proper size, it rests over the wire loop. Belaying ATCs allow you to hook to another climber. It's like in the movies where one climber catches their falling partner. Each climber needs their own ATC for this to work. If you’re climbing alone, you don’t really need an ATC. Keep in mind climbing alone is more dangerous since you have no one there to catch you or help you if you fall.  ", " Clip the ATC to the belay loop on your harness. The ATC clips to the same loop you used for the tie-in. You connect the loops using a locking carabiner. To open the carabiner, you spin the gate component counterclockwise and push it forward. Then, all you have to do is hook the carabiner around the wire and rope loops you made.  The carabiner locks automatically when you push the gate back into position.  ", " Pull and let out the rope as needed to create slack. When you’re the belayer, or the climber lower on the rock, you’re in charge of the rope. Hold the long end of the climbing rope with your weaker hand and the shorter end with your dominant hand. Pulling down on the shorter end “brakes,” or prevents the rope from moving. Letting it go adds more slack to the line so your partner can move up the wall.  If you are unfamiliar with , sign up for an instructional class to learn some techniques that keep you safe while climbing!  "]}}, "How to Boulder": {"description": "Bouldering is a form of rock climbing that doesn't require any ropes or harnesses. As a result, it usually performed at heights lower than 20 feet (6.1 m). Bouldering can be practiced outdoors, on suitable rocks and boulders, or indoors at artificial climbing walls. Bouldering is a fun, high-intensity sport which appeals to people of all ages, genders and strength levels. Start reading below for detailed instructions on how to boulder.", "content": {"Getting Started": [" Get the right equipment. If climbing outdoors, you will need a helmet. Purchase a good pair of climbing shoes from a local outdoor sporting goods store. Ask a knowledgeable sales assistant to help you. Good-fitting shoes are extremely important, so ask someone who knows what they are doing. A pair of these can range from $40 to $200. As a rule of thumb they should be very snug. Almost too snug. As you progress you will want them tighter and tighter to give yourself more toe control while climbing. Grab yourself some Climber's chalk (magnesium carbonate) on the way out. This will help you dry the sweat on your hands when you climb and keep you from slipping. You might also want a chalk bag to hold the chalk and not make a mess.  You can get all different types and colors but you really only need to stick to whatever works for right now. It's usually about $1.50-2.00 for a block.   ", " Be aware of safety. Bouldering is done at heights below four meters and involves the use of a crash pad. However, this can develop a false sense of security. A four meter jump can incur severe ankle fractures. In addition, you can hit your knees on protruding rock as you fall. This runs the risk of kneecap dislocation. These injuries can take months to heal. You do not want to jump down. Instead, down climb using both hands and feet. Bouldering does not involve the use of a rope, so you can expect to fall a lot when practicing difficult problems. Even though you are not falling from a great height, you will often fall suddenly or awkwardly, so it's important to have a crash pad beneath you at all times. If you absolutely must jump down, land in an upright position with your knees bent (to absorb impact), rolling to the side if necessary. Remove any rings or jewelry before you climb and always have someone to spot you -- that is, someone who is ready to break your fall, guide you onto the crash pad and protect your head from injury.  ", " Decide whether you want to boulder indoors or outdoors. Bouldering can be done outdoors on any kind of rock or cliff face, or indoors at a rock climbing gym. Both provide a fun, engaging climbing experience -- so which one you choose is a matter of personal preference. Outdoor bouldering has the benefit of being out in the fresh air and provides a more natural climbing experience, which some people prefer. However, it is dependent on good weather conditions and requires you to have your own equipment -- such as a helmet, shoes, and a crash pad. You must wear a helmet when climbing outdoors. Rocks can fall without warning off the cliff, tumbling onto the climber and partner below. As a climber, if you see a rock or piece of equipment falling, yell, \"Rock!\" loudly to warn your partner of incoming objects.  Indoor bouldering is a good choice for beginners who want to try their hand at something new without investing in gear (shoes can be rented and crash pads are provided) and for experienced climbers who wish to hone their bouldering skills further. The problems are laid out on colorful walls and can be adjusted to mimic an outdoor climbing experience, across a wide range of difficulties. Indoor bouldering is unaffected by weather, but space is usually limited and the walls can get crowded.   ", " Warm up and stretch. Bouldering is an intense physical activity, which requires power and flexibility. And like any physical activity, it's important to warm up and stretch before you get started, to help you avoid injury. Get your blood flowing by doing a few minutes of cardio before you boulder -- this warns the body that it's about to climb. Try jogging or cycling for ten minutes or doing five minutes of skipping. If you're climbing outdoors, the walk or hike to the bouldering spot will probably do the trick!  Next do some stretches to loosen your muscles, joints and tendons. Concentrate on your upper body by stretching your fingers, wrists, elbows, shoulders, neck and back, but also remember to stretch your legs, hips and ankles.  Finally, start out climbing by picking some easy problems that you are confident that you can complete -- this gets your body used to the movements and helps you to slowly ease into the climbing session.   ", " Understand how the difficulty levels work. Most climbing locations -- both indoors and outdoors -- use the same grading system for marking the difficulty of each problem (this is the bouldering term for route, in case you didn't know!) This grading system is known as the v-scale, and helps climbers to identify problems suited to their level of ability. The v-scale runs from V0 (the easiest) to V15 (the hardest). In addition, each grade can have a minus, normal or plus value, which indicates difficulty level each grade. For example, a V0- is the very easiest problem a climber can do, while a V17 is the very hardest. To help you follow the correct route, all of the holds in a problem are marked with the same colored tape, or in some cases the holds themselves will be coordinated by color. While bouldering, you are not supposed to use any holds that are not part of your chosen problem -- the color system is there to help you avoid doing this.   "], "Climbing Techniques": [" Pick a problem and visualize your path. Before you begin, pick a problem suited to your ability. If you have never bouldered before, start with the very easiest problem and work you're way up. With practice, you can progress very quickly in bouldering, at least initially. One of the major mistakes beginners make is to just jump on the wall and start climbing, without planning their route. This quickly leads to getting stuck or falling from the wall. It's important to understand that bouldering is as much a mental exercise as a physical one -- before you start climbing you need to examine the route and visualize the pat you are going to take. Think about which holds you are going to use and in what order, think about the specific hand grabs and foot positions you will use, and think about how you can complete the problem as efficiently as possible. This is why it's called a -- it's something you need to use your brain to figure out! Of course, some things things won't go as planned once you're on the wall -- a hold won't feel quite like you expected it to, or you won't be able to stretch quite as far as you thought -- so don't be afraid to improvise when your up there. Just stay calm and find a new route.  ", " Use your legs as much as possible. Many people new to bouldering believe that a climber's most important physical asset is their upper body strength, but this is incorrect. A good climber relies far more on their legs, which makes sense if you think about it.Your quadriceps are some of the largest, strongest muscles in your body, so it makes far more sense to utilize them than your comparatively puny biceps. Is it easier to do a pull up or a squat? Keep the majority of your weight on your legs and use them to push yourself up as you move from hold to hold. Remember -- power and stability come from your legs. Your arms, on the other hand, should be used mainly for balance and for pulling yourself up as you push with your legs. Try to keep your arms as straight as possible as you climb -- this puts the load on your bones rather than your muscles.   ", " Use the correct hand holds. As a beginners climber, it's okay to grab the holds in whichever way feels most natural and comfortable for you. But as you progress, you'll need to learn how to use the hand holds in a specific way, using the correct finger and hand positioning, in order to tackle more advanced problems.  Crimping is a method of grabbing an edge (a narrow, horizontal hold) or a sidepull (a vertical or diagonal edge) with your fingertips. Your fingertips should rest flat against the edge with your fingers arched over them. This is a fairly solid grip, but requires good finger strength.   Pinching is a method of grabbing hand holds that protrude from the rock by pinching them between the thumb on one side and the fingers on the other. It can also be used when there are side-by-side pockets in the rock  -- in this case the hold is similar to the finger position when holding a bowling ball.   Palming is a method used when there are no actual hand holds to grip onto, just the flat face of the wall or rock. You simply press your open hand against the wall, with your fingers together and the weight concentrated in the heel of your hand. Palming allows you to change foot position while your body weight is pressed into your palm.   ", " Use the correct foot positions. A lot of first time boulderers tend to focus all of their concentration on their hands and neglect their feet, but foot position is extremely important for balance and stability. Some of the most common foot movements in bouldering include:  In bouldering, you will rarely have a hold large enough to accommodate your entire foot securely, so you need to get used to using individual parts of your feet. Toeing, as the name suggests, is when you grip a small hold with just your toes. This is where those tight shoes come in handy, as they will give you a better grip in small surfaces. In edging, you use either side of your foot to stand on small ledge-like holds.   Smearing is a technique used when there is no clearly defined foothold. It involves pressing your foot (usually the ball) against a rough, sloping surface and pressing your weight into it as much as possible. Smearing can feel a little precarious, but as long as you stay relaxed and commit to the move fully.   Another foot movement that's necessary for more advanced bouldering is swapping your feet. This is necessary when there is no room on a given hold for both of your feet and you need to replace one with the other in order to progress with the problem. There are two methods of achieving this: you can simply hop from one foot to the other, moving the necessary foot onto the hold while the other one is airborne, or you can slowly slide one foot one foot on to the hold while simultaneously sliding the other foot off.   ", " Learn how to fall correctly. Falling is an inevitable part of bouldering -- whether it's an accidental fall after a failed grab or an intentional one from the top of a completed problem. Therefore, it's important to learn how to fall properly, to minimize the risk of injury. If you're climbing outdoors with the use of a crash pad, try to predict the trajectory of your fall before you attempt the problem and position the crash pad accordingly. Don't push the crash pad right up against the rock wall -- you're far more likely to fall out from the wall than straight downwards. Get into the habit of landing upright, bending your knees to absorb the shock and rolling sideways if necessary. Don't rely on the mat to absorb the impact of your fall, even in the climbing gym, as landing awkwardly could result in an injury, no matter how soft the landing. If you're jumping from the top of a problem, remember to spot your landing first and make sure there's nobody directly underneath you that you could land on. As a beginner, stay away from highballing (this is a bouldering term for climbing higher, riskier problems) Falling from a greater height significantly increases your chances of injury. Stick to lower, more horizontal problems and focus on improving your technique.  "], "Becoming a Better Climber": [" Focus on your strengths but don't neglect your weaknesses. The great thing about bouldering is that each person will tackle the same problem in a different way, according to their personal strengths. In fact, bouldering is one of the few sports where men and women can complete on an even footing, as things like flexibility and balance are just as important as physical strength. Try to figure out what your greatest strength is and use it in your bouldering. However, as you progress with your climbing, it is also important to spend time working on your weaknesses, otherwise your overall performance will be affected. Avoid only sticking to problems that suit you and try to challenge yourself every once in a while.  ", " Try not to get frustrated. If you just can't seem to complete a particular problem, it's easy to become frustrated and resort to throwing yourself at it or just giving up altogether. However, both of these approaches are unlikely to help you improve -- remember that bouldering is just as much a mental activity as a physical one. Therefore, it's important to take a deep breath, stay calm and take all the time you need. Examine the problem again and try to figure out if there's a hand hold or foot hold you might have missed, or an alternative way of tackling the problem. It's also important to realize that failure is a part of bouldering -- reaching your physical and mental limit is all part of the fun. If you were able to complete every problem on your first try bouldering would get boring pretty quickly.  ", " Watch other climbers. Watching more experienced climbers tackle a tough bouldering problem can be a great way to learn new skills and help you to understand some of the best ways to approach specific moves. You'll also find that most climbers are happy to offer advice and guidance on how to complete a problem that you've been struggling with, so don't be afraid to ask! However, you should also bear in mind that everyone approaches bouldering problems differently. There is never a single \"correct\" method of doing something, so what works for another person may not work for you.  ", " Work on your balance. Arguably, balance is the single most important factor in being a good boulderer. You should be aware of your center of gravity at all times and shift your weight when necessary in order to maintain your equilibrium. Try to move in slow, controlled, flowing movements, keeping your weight centered on both legs as much as possible. Avoid what is known in the climbing world as \"sewing machine leg\" -- where one leg shakes uncontrollably as it bears your entire weight, while the other scrambles for a hold. When this happens, it's an indication that you need to pay closer attention to body positioning.  ", " Don't forget to rest. Once you get bitten by the bouldering bug, you'll probably want to hit the climbing gym everyday, but this is a recipe for a strained muscle or a pulled tendon. Bouldering is a strenuous activity and your body needs time to recover between sessions -- at least 48 hours if the session was particularly intense.  Always remember to stretch after a bouldering session -- this will help to minimize muscle stiffness and pain the following day.   "]}}, "How to Rock Climb Overhangs on a Rock Wall": {"description": "Rock climbing is a fun hobby on its own, but scaling a huge overhang is one of the coolest things you can do. Overhangs are walls that slope toward you, and dealing with one requires good body strength andsome basic techniqueslike any vertical wall you ascend. Once you have the form down, master additional moves like kneebars to relieve your arms, hooks to boost yourself along footholds, and smearing to deal with flat surfaces. Once you make it up an overhang, you can feel like you’re on top of the world.", "content": {"Mastering the Basic Climbing Technique": [" Visualize your line before you start climbing the overhang. Overhangs don’t leave you with a lot of time to stop and think where you need to go next, so plan out your route before you begin climbing. Look for holds that provide plenty of space for your feet and hands. Also, identify holds or spots on the wall where you can plant your knees if you need to rest and recalculate your route.  The best route is one that allows you to keep your body relatively compact. Overhang climbs are tough work, so avoid stretching toward holds as much as possible. If you’re on the wall, find a stable spot to stop, such as by stepping to a sturdy hold or using a kneebar. Use these spots to rest and consider where you need to go next.   ", " Hold your arms straight and relax your muscles. Overhangs put a ton of stress on your arms and shoulders. Successfully climbing an overhang involves trying to limit that stress as much as possible. Hold onto the wall with a firm, stable grip, keeping your arms out ahead of you. In order to save energy, avoid twisting your arms.  Over gripping is a big problem on these types of climbs, so be alert for tension in your arms, shoulders, and fingers. If you hold on too hard, you end up wearing yourself out. Loosen your grip so you can climb further.  ", " Press your weight into your feet to protect your arms. Footwork is even more important on overhangs than it is on other climbs. Keep your knees bent with your feet firmly planted on the nearest footholds. Also, tense your core, your stomach and back muscles, to shift your weight down toward your feet. Push down into the footholds to relieve any unnecessary weight on your arms.  Overhang climbs take plenty of core strength, which takes some time to . While you’re working out your arms by doing exercises like pull-ups at the gym, also try planks and other techniques that build core endurance. If your feet slip off the wall, plant them on a hold as soon as possible to relieve the pressure on your arms.  ", " Climb at a steady rate with your feet close to your hands. One of the biggest mistakes beginning climbers make is trying to get up an overhang too quickly. When you rush, your feet slip and poor footwork means more stress on your upper body. Keep your knees bent so you don’t reach for holds too far ahead of you, then move at a comfortable but consistent pace.  You’re going to get tired during an overhang climb, but a good climbing technique improves your endurance. Master your technique by practicing on regular climbs and safe overhangs, such as in a gym. Heel holds and toe holds are useful leg techniques to master for overhang climbs. Make them a part of your routine to improve your climbs.  ", " Turn your shoulders and hips whenever you reach for a hold. Instead of twisting your arms, turn your body to face the spot you wish to reach. Even though this may seem like it extra work, it actually saves your strength. Turning your body improves your balance and keeps pressure on your legs instead of your arms. Climbing is a dynamic activity, so use your entire body as much as possible.  For example, if you’re reaching for a hold with your left hand, plant your right foot. As you raise your left foot, turn your left shoulder and hip toward the hold. If you’re uncertain about how to do this, watch an experienced climber.  ", " Move until you reach a safe spot. Because overhangs take so much effort to climb, you don’t have the option to stop whenever you want. Usually, you have to keep moving until you complete the overhang. Stopping and being indecisive costs you precious arm strength. The only exception to this is when you come upon a safe hold to plant your knees on.  Practice kneebars and drop knees to find ways to rest on an overhang. These techniques involve finding comfortable holds or indentations to relieve the pressure on your arms.  "], "Using Your Knees to Move and Rest": [" Find a small hold close to one of your legs. Knee techniques are great ways to take advantage of holds you would otherwise ignore during your climb. Small holds are ones that you can’t rest your entire knee on. Look around the same level as your legs for holds that have enough space for part of your foot. Try to find a hold with a second one nearby.  The drop knee technique allows you to take some weight off your arms before you move on. Drop knees are mainly used to adjust your stance during a climb. Kneebars are similar but are better for resting. You could also plant your knee on the wall. Doing this doesn’t give you time to rest, but it still helps you reach for a distant hold.  ", " Stretch your leg to the hold using the outside edge of your foot. Before moving your closest foot toward the hold, make sure the rest of your body is planted firmly on the wall. Twist your hips in the direction of the hold as you reach for it with your back foot.  Moving to the foothold brings your hips toward the wall. This lowers your center of gravity, which is very important on overhangs. When you’re ready to move again, you can use your strong positioning to reach higher.  ", " Twist your knee carefully toward the wall to plant it. Hold onto the wall, making sure your feet are stable. Once you twist your hips toward the wall, rotate your leg. Position your leg perpendicular to the wall before planting it on a hold or another resting spot.  Be very cautious when performing this technique. If you feel any pain, stop and reverse direction. Dropped knees can lead to injuries if you push through the pain.  ", " Bridge your knee between 2 footholds if you wish to rest. This technique is called a kneebar, and it’s almost identical to a standard drop knee. You need a second foothold close to the first one. After twisting your hips toward the wall, plant your knee on the second foothold. Keep your toes on the original foothold nearby.  Kneebars are one of the best ways to rest on an overhang. Planting your leg takes pressure off of your arms. You could stop and reanalyze your climbing route before moving again.  ", " Reach for the next hold with your free hand. Usually, you reach with the hand on the same side of your body as your planted knee. Leave your opposite hand on the wall for stability. Find the next hold before you start moving again. Then, straighten out your body as you push your way up toward it.  This motion is sometimes called a twist lock. It enables you to reach further without lunging or ever taking your feet off the wall.  "], "Boosting with Heel and Toe Hooks": [" Find a hold you can easily reach with your foot. Heel holds and toe holds are moves that help boost you along an overhang. Search for a hold above your waist, fairly close to your body. Make sure the hold is large enough for you to comfortably plant your heel or toes.  Flexibility helps a lot with holds. If you’re very flexible, you could swing your leg up to reach holds above your head.  ", " Check the hold for a rough surface to plant your feet on. Examine the hold to identify any bumps, dips, or other spots to catch your shoe on. Try to maximize your contact with the hold as much as possible to ensure you get a good grip on it. Before attempting to make your move, thoroughly plan out where you intend on placing your foot. Accuracy is very important, especially if you’re stuck in a difficult spot.  Good shoes are a must for holds. You need shoes that fit you snugly and have stiff patches of rubber on the toes and heels. Tie your shoes well so the laces or straps don’t get in the way of your foot placement.  ", " Swing your foot up to the spot on the hold you picked. Grip the wall tightly with your hands, leaning on your other foot for stability as you move. Keep your hips close to the wall so you don’t accidentally slip backward. Then, engage your core and leg muscles by attempting to pull your foot back toward your body when it lands.  For a heel hook, you plant the rubber patch on your heel on top of the hold. Toe hooks are almost the same, except you position your toes on the side of the hold furthest from you.  ", " Pull yourself up gradually as you reach for the next hold. Think of your leg as a third arm. Your leg is actually stronger than either of your arms, so use its power to thrust yourself up the wall. As your body rises, reach with the hand on the opposite side of your body. Plant your hand on the hold to finish pulling yourself up.  Releasing your heel or toe hold can cause you to slip if you’re not careful. Go at a steady, controlled pace after you have planted your other foot on a secure hold. Keep your core tight to ensure you stay close to the wall as your arms and hands take on additional pressure.  "], "Smearing to Climb without Holds": [" Find a spot on the wall that isn’t completely flat. Smearing means pressing your foot down on a wall for a boost, kind of like squashing a bug. If you can’t find a good hold to plant your foot on, look for indentations, bulges, or other angle changes on the wall. These spots are often very small, so take your time and look carefully around the overhang before proceeding.  Try to visualize your route before you begin climbing the overhang. Stop at a resting point with a kneebar as needed to plan your route further. Smearing is somewhat similar to holds since you depend on your shoe rubber to adhere to a rough part of the wall. The difference is that smearing involves using a part of the wall that appears flat.  ", " Visualize where you plan on placing your feet and hands. Precision is key in smearing and rock climbing in general. One wrong move could mean you lose your balance and slip off the wall. You need a stable hold for one foot and a pair of subsequent holds to boost toward. Also, picture where exactly you intend on planting your other foot on the wall.  ", " Press the upper part of your foot down hard on the indentation. You might be thinking that placing your foot on a flat wall is a mistake, but it does work. Press down hard with your toes and the ball of your foot, or the strong part right below your toes. If you feel yourself slipping, press down harder with more of your weight to create more friction.  As dangerous as smearing appears to be, it’s an essential climbing technique you can use on any overhang. It’s all about combining precise footwork with as much shoe rubber and weight as possible.  ", " Push off of the wall to boost yourself to the next hold. As you press down on the rock, you generate force with your leg similar to heel holds and other climbing techniques. Use your momentum to push yourself up. Keep your body close to the wall with your arms straight as you reach toward the next holds. Follow up by bringing your other leg and arm up to the next holds.  This technique can be a little intimidating at first, so practice it in a safe location. Try using a smooth boulder or visit a gym with big handholds.  "]}}, "How to Learn Rock Climbing Holds": {"description": "Whether you’re rock climbing indoors or outdoors, it’s important to recognize the various types of holds you will encounter. Holds come in a variety of shapes and sizes, and you’ll need to learn how to identify each kind so that you can grip it correctly. Once you know the basic hold types, take some time to learn how to use them.", "content": {"Recognizing the Types of Holds": [" Look for an easy grip to spot jugs. Jugs are holds that you can easily wrap your fingers around. They have a large “positive” (easy to grab) area on top, and are usually wide enough that you can hold them with all 4 of your fingers. Jugs are widely considered to be the easiest hold, and they are the type you will encounter most frequently on beginner climbs.   ", " Identify undercuts by their downward-facing edges. Undercuts are similar to jugs, except that the positive area is oriented downward. They are also known as underclings.  Undercuts look like upside-down jugs when viewed from below. They tend to have strong positive edges that are easy to grab onto.  ", " Check for a sideways-facing edge to identify sidepulls and gastons. Sidepulls are also similar to jugs, but they are oriented perpendicular to the floor, with the positive grip facing away from you. When the hold is oriented like a sidepull but the positive grip faces toward you, it is called a gaston.  Some sidepulls or gastons have relatively small positive edges, making them more like sideways crimps than jugs.  ", " Recognize crimps by their narrow positive edges. A crimp is a small hold, shaped similarly to a jug but with a much smaller positive edge. It’s impossible to fully wrap your fingers around a crimp—the positive edge is so narrow that you can fit only your fingertips on top of it. They are named for the specialized crimp technique that you must use to grab onto them.  Crimps vary in size and shape, with some providing a better gripping surface than others.  ", " Identify a pinch by its paired gripping surfaces. As the name suggests, pinches are holds that are designed to be grasped between your fingers and thumb. They have edges on both sides that you can grip onto.  Pinches can be angled in any direction, so you may have to get creative when using them.  ", " Spot a pocket by looking for holes. Pockets are holds with holes in them that you can insert your fingers into. The holes vary in size and depth, with some of them allowing you to fit all your fingers into the hole and others accommodating only 1 or 2 fingers.  A pocket that only has enough room to hold a single finger is sometimes called a mono.   ", " Check for a rounded surface to identify a sloper. Slopers are some of the most difficult climbing holds because of their lack of lips or edges. They can come in a variety of sizes and shapes, but are typically rounded, with only a rough surface to provide purchase.  While many climbers dislike slopers because they’re so hard to grip, others are quite comfortable with them. Your preferences will depend on your personal climbing style.   ", " Look for a large, angular shape to identify a volume. Volumes are smooth-sided, angular protrusions in a rock-climbing wall. They are considered a type of hold in themselves, but often have other holds bolted to them.  Volumes are typically roughly triangular in shape, but they can come in other shapes as well (such as diamonds or trapezoids).  "], "Learning to Use Holds": [" Grab a jug by wrapping your fingers around it. Climbing on jugs is pretty straightforward. Simply curl your 4 fingers around the positive edge of the jug, allowing your thumb to relax. Use as little energy as possible when grabbing the jug so that you can save your strength for harder holds.  On more difficult climbs, jugs offer a good opportunity to stop and rest, shake out your wrists, or adjust your gear. To minimize wear and tear on your hands, try to resist readjusting your grip after you grab a jug.   ", " Pull downwards instead of upwards to use an undercut. Despite their easy gripping surface, undercuts or underclings are challenging because they require a lot of biceps strength. You’ll need to get a strong, open-handed grip on the hold and pull down with your arms at the same time that you push up with your feet.  Body position is important when using an undercut. They work best if the hold is positioned at chest level and your feet are planted solidly and relatively close to your upper body.  ", " Execute a sideways pull on a sidepull or gaston. Sidepulls and gastons require you to grip the hold from the side and pull horizontally. The difference is in the orientation of the positive edge. To use one of these holds: Keep your arm straight and lean away from a sidepull while using your feet to push in the opposite direction. This will keep you balanced while you reach for the next hold.  Hold a gaston with your thumb facing downward and push against it as if you were opening a sliding door. Use your feet to oppose the motion and propel you toward your next hold.   ", " Use your fingertips to hold a crimp. Crimps are challenging because of their small positive surface. To use a crimp, you’ll need to place the pads of your fingers firmly on the edge and pull up, with your fingers slightly bent. There are 3 basic crimping techniques:  For the open crimp, place your finger pads on the edge of the crimp and keep your fingers extended as much as possible, with your thumb completely relaxed. This crimp is the easiest on your hands, but does not provide much purchase.  To perform a half crimp, place your fingertips on the edge and bend your fingers 90° at the second knuckle. This will help you get a better grip, but it also puts slightly more strain on your fingers than an open crimp. To do a full crimp, put your fingertips on the edge of the crimp and bend your knuckles, then position your thumb on top of your fingers. This is the strongest crimp, but it can also place a lot of strain on your hands.  ", " Maximize your surface contact to use a sloper. Since you can’t wrap your fingers around a sloper, you have to rely on friction to use them. Place the palms of your hands on the sloper with your fingers close together and following the curve of the surface. Lean in so your forearms are close to the rock and keep your arms straight, then pull yourself up while pushing with your feet.  Try to keep your feet spread out and firmly planted while you’re using a sloper. If possible, chalk up your hands before grabbing at a sloper. If your hands are slippery, you’ll have a hard time getting the friction you need.  ", " Grip pinches with your thumb and fingers. To use a pinch, squeeze the hold on both sides with your fingers and thumb. The use of the thumb will make your grip more secure. The pinch grip should feel similar to the act of picking up a book by the spine.  The way you use the pinch will depend on how the hold is oriented. For example, if it’s horizontal, you can use it much like a jug or crimp. If the pinch is vertical, use it more like a sidepull.  ", " Insert your middle and ring fingers into a pocket. Monos and pockets typically require you to pull yourself up using a small number of fingers (e.g., 1 or 2). Because of this, you risk putting strain on the tendons in your hands. You can minimize the strain by using your strongest fingers, which are the middle and ring fingers for many people.  Try to fit as many fingers into the pocket as you can. You may be able to squeeze more fingers in by stacking one finger on top of another instead of fitting them in side-by-side.  ", " Analyze the route before you climb. If you have some idea of what to expect before you begin to climb, it’s easier to plan which holds and grips you will use. Take a look at the climb and try to identify some of the holds that you see. Consider how you’ll use them to complete the climb.  For example, if you know ahead of time that your climb will involve an undercut, you can look for good footholds and handholds beneath and above the undercut to help you navigate past this challenging hold.  "]}}, "How to Use Rock Climbing as a Team Building Event": {"description": "If you’re looking for an exciting and innovative team-building exercise, you’re probably considering rock climbing. Indoor rock climbing is a terrific way to gently push your team members’ limits and encourage teamwork, communication, and trust in a fun and engaging way. Fortunately, no matter how big your team is, there are several exercises team members can do in pairs or in small groups to help build the team.", "content": {"Setting Up the Event": [" Look for a climbing gym that specifically offers team-building events. Using rock climbing as a team-building event requires a lot of specific gear and infrastructure, such as obstacle courses. Although you could theoretically have your event at an ordinary climbing gym, it’ll be much more effective if you hold it somewhere that offers team-building programs as a matter of course.   ", " Make sure all your team members are capable of rock climbing. Those team members who aren’t physically able to participate in the rock-climbing event will feel left out of the exercise. As a result, this will cause more harm than good to your efforts to build a more cohesive team.  ", " Book at least 2 hours for your team to take part in the event at the gym. For most gyms that offer team-building programs, this is the minimum amount of time that such programs require. If you have more time you can set aside for this event, though, book a longer session. This will allow your team to take part in even more team-building activities.  "], "Performing Activities in Pairs": [" Have pairs do basic supported climbing to learn how to climb together. Designate each pair to work with an instructor to learn basic climbing skills such as proper foot and arm placement, how to use each piece of their gear, and how to communicate with each other to be effective climbers. This way, all of your team members will have equal climbing skills, while each pair of team members will have a shared learning experience.  During the training session, team members can encourage and support their partners to help them learn the necessary skills for rock climbing. This is a great way for the paired team members to build bonds with each other.  ", " Perform blind climbs where 1 partner guides the other from the ground. Once both members of a pair have mastered the basics of climbing, this is the next step toward building a stronger sense of trust between team members. As 1 partner climbs, have the other partner verbally guide them toward nearby holds and grips.  ", " Do trust rappels to help the partners build trust in each other. From the top of the climb, have 1 partner use the rope and harness to slowly rappel their partner down to the ground. This leads the team member in the harness to develop a strong sense of trust in their partner after they arrive safely on the ground.  Make sure the team members switch positions so that each member of the pairing has a chance to develop trust in the other member.  ", " Have each set of climbers choose a contest for their team to compete in. Have the larger group participate in contests surrounding climbing speed, blindfolded climbs, or other assessments of climbing skill. Then, let each pair decide for themselves which competition they’ll take part in. This allows each pair to take ownership of their own success by realizing their own strengths and harnessing them to attempt to win the competition.  For example, if one pair is particularly good at their verbal communication but otherwise aren’t very fast, allow them to choose whether they want to participate in the speed climbing race or the blindfolded climb competition. This will allow the pair to recognize that, as a team, they are better at the latter type of contest and so they’ll feel more confident about their ability to win the competition working together.  "], "Doing Group Activities": [" Divide into groups of 5-6 people who don’t know each other very well. Groups this size will be able to complete group activities while also enabling the members to create more intimate bonds with each other. Having group members not know each other very well also allows for more effective team building, since team members will get to know each other better through the group activities.  For example, if your team is made up of several departments that don’t often interact (e.g., a sales department and an operations team), make sure each group in your team-building event is made up of members from each of these different departments. If your team was only recently created and the members don’t already know each other, randomly selecting the members of each small group will also work.  ", " Have each group perform relay climbs in an obstacle course. To start, 1 member of the group will perform the first portion of the obstacle course. Then, once that member completes their portion of the course, another member will perform the next portion of the course. This will continue until the whole group has completed the course. This type of activity allows the group members to problem solve and work together to complete the course, facilitating collaboration and leadership development.  For example, an obstacle course may consist of a steep vertical climb, a horizontal side climb, and a rappel wall. Once the first member of a group completes the vertical climb, the next member will complete the side climb. Once the second member reaches the end of their climb, the next group member will go down the rappel wall to finish the course.  ", " Do speed climbing races to build confidence and camaraderie. Each group member will climb a section of rock as fast as possible and have their individual time recorded. Then, each group will add all of their members’ individual times together to come up with a total time for the group. Whichever group has the shortest time wins. ", " Try using water balloon drops to facilitate teamwork. Have each group work together to build a safety container that can catch a water balloon dropped from 35 feet (11 m) without it popping. Limit the amount of time each group has to build their container in order to have them quickly design and build their container together.  For example, give each group 1 hour to build their container out of raw materials such as string, straws, paperclips, or other miscellaneous materials.  "]}}, "How to Match and Switch in Rock Climbing": {"description": "Matching is a technique in rock climbing where you bring both your hands or feet to the same hold. Reaching a matching hold gives you an opportunity to switch your positioning and climb in a different direction. Matching and switching are relatively simple maneuvers you can master with a little practice. By pairing these moves together, you can take advantage of smaller, more isolated holds to create new routes up a rock wall.", "content": {"Matching and Switching Hands": [" Visualize your route before you begin climbing. Look up the wall to identify potential holds and tricky areas. Matching and switching happens when you have to use a limited number of holds in order to switch directions. If you’re up on the wall, stop in a secure spot and plan your route before moving again.  You may notice some spots where you have stable footholds but need to reverse direction in order to reach the next hold with your hands. This is when you attempt a match and switch.   ", " Find a large, comfortable hold to grab onto with both hands. Ideally, you will have a sizable ledge available to transition on. Make the most out of what you have available. After you gain experience, you will have an easier time matching on smaller holds.  When you start learning how to match and switch, work with large jug holds first. Use smaller pinches and crimps to switch away from less suitable holds.  ", " Choose solid footholds to rest your weight on as you switch. Try to find a pair of wide holds capable of supporting your weight as you complete the match and switch. These holds need to at least support your toes, allowing you to maintain a stable base. By staying in a proper climbing position, you keep yourself close to the wall, reducing the chances of falling.  Smaller footholds are often safe to use, but make sure you have experience balancing on them first.  ", " Climb to the hold points to get into position for the switch. Begin your ascent, working at a comfortable pace to preserve your arm strength. Plant your feet on the lower holds, then put a hand on each of the higher holds to get into position. Stay balanced by keeping your body spread out with your center of gravity low.  Your legs will bear your weight as you match and switch with your hands. Make sure you’re strong against the wall and don’t need to reach far, since that will throw off your balance.  ", " Move your hands to the same hold to match them. Let go of the hold you wish to move away from. Keep your body close to the wall with your other hand firmly on the hold you are moving towards. To complete the match, plant your free hand on the hold. Position it right next to your other hand, but don’t overlap them, since you need your hands free in order to reach the next hold.  Move at a pace that feels comfortable to you and allows you to maintain your balance. Usually, switches need to be done at a slow or medium pace. Matching calls for a swift, smooth movement only if the holds are poor quality. As long as your feet are planted on some firm footholds, you won’t need much arm strength for the match and switch.  ", " Reach for the next hold to complete the switch. Move the hand you originally placed on the main hold. Look along the wall to find the next hold you wish to transition to. Once you have a firm grasp on the new hold, continue climbing as you normally would.  The hand you match with stays on the hold you use to switch. Use it to keep you close to the wall and balanced as you reach for the next hold. Don’t reach too far away when switching or else you may lose your balance. Use the new hold as a way to climb further up the wall. Usually, you can move your feet to the old holds to continue climbing.  "], "Matching and Switching Feet": [" Search for your route before you begin climbing. Look up the wall to find a secure route with plenty of holds. Find any spots where you will need to match and switch to change direction. For foot matches and switches, this will be anywhere you have a couple of stable handholds but few good footholds underneath them.  If you’re high up and need to examine your route, stop on some secure holds first. When you begin a climb, wait until you get higher up on the wall before attempting to match and switch with your feet. You may find more defined holds the higher you climb.  ", " Choose a big foothold that allows you to place your feet side by side. The best kind of hold for matching your feet is one big enough to rest comfortably on. It isn’t the only type of hold you can use, but it is the easiest to practice on. Avoid any holds that look slippery, flat, or tiny, if possible.  Wide ledges and jugs are common on beginner walls and are the easiest to practice on. As you advance, you may need to work with much smaller toeholds.  ", " Find a couple of stable handholds above the foothold. The more of a grip you have on these handholds, the easier matching and switching will be. Bigger holds are typically better if you have a choice. Make sure the holds are close to the foothold. If they are too far away, you won’t be in a balanced climbing position, increasing your chances of slipping.  Remember that smaller holds put more pressure on your fingers. When you match and switch with your feet, your grip strength may be all that is left keeping you on the wall.  ", " Step to the hold you plan on matching on. Scale the wall until you reach the hold you selected. Move your body above it so it is in range of your feet. Situate your hands on some holds higher up in the wall. Then, plant your first foot firmly on the foothold to set up the match and switch.  Keep your body close to the wall to preserve your balance. Make sure you have a steady grip on the handholds.  ", " Move your foot to match on the hold. If you found a wide hold, plant your foot next to your other foot. Move at a steady pace that feels comfortable to you and allows you to maintain your grip on the handholds. Switching with your feet does put a little pressure on your arms, so be prepared for it.  This “stepping besides” method works best for wide holds that provide plenty of space to rest on. If you have to work with small, rough, or poor holds, you may need to move a little faster to take the weight off of your hands.  ", " Switch by reaching your foot out the next hold on the wall. Lift up the first foot you planted on the hold. Quickly identify the next hold you need to move to in order to continue your climb. While holding yourself close to the wall with your hands, reach your foot out to step onto the next hold. Plant your foot to steady yourself and continue on your climb.  Identifying the next foothold before you start the match and switch is important, especially if you’re uncertain about your arm strength. Remember, your legs are stronger than your arms and you are more stable when you have both feet on the wall.  "], "Switching Feet on Bad Holds": [" Switch from smaller holds by placing your feet on top of one another. During a climb, you may not find a perfect hold to rest both of your feet on at the same time. When this happens, climb up to a good foothold as you normally would. Plant your leading foot on the hold, then bring your other foot on top of it. Quickly slide your bottom foot out to land your top foot on the hold.  Doing this takes a little more speed and accuracy than setting your feet side by side. Your feet can touch when you match them together. Don’t spend much time with them on the same hold, however.  ", " Perform a jump if you need to quickly switch on tiny holds. Jumping is somewhat similar to a regular switch and hold, but it requires a little extra arm strength. Climb up to the holds as normal, planting your lead foot on a suitable hold. Then, as you move your other foot to the hold, push your first foot off the wall. Use your lead foot to continue climbing as your other foot takes its position on the foothold.  Jumping is necessary when you’re stuck with small holds that can’t support more than the tips of your toes on one foot. It’s a very fast way to switch, so it allows you to climb at a steady pace. When you push off from the hold, you won’t have either of your feet on the wall. Jumping doesn’t take a ton of arm strength, but you may wish to avoid doing it if you’re tired.  ", " Practice friction-based stepping if you have to step on the wall. Taking advantage of flat walls with rough surfaces through friction-based stepping. To perform the switch, plant your foot on the wall. Bring your other foot up next to it, then move your other foot back down to the foothold. This move is very precise, so it’s great for dealing with tiny holds you would otherwise have to do a jump on.  Friction-based stepping is slow and puts additional pressure on your fingers. It is also limited to flat, rough surfaces. You can do a jump almost anytime you have an opportunity to match and switch through friction-based stepping. The method you choose depends on your arm strength and what you prefer doing.  "]}}, "How to Communicate Basic Rock Climbing Commands With Your Belayer": {"description": "When you’re rock climbing, it’s important that you be able to communicate with your belayer. However, it’s normal for them to struggle to hear you in a loud rock climbing gym or out in nature. Fortunately, you can use basic, universal commands that are easy to remember. This will allow you to safely communicate with your belayer during your climb.", "content": {"Beginning Your Climb": [" Ask \"On belay? \" to make sure your belayer is ready. Wait until you are tied in and ready to start your climb. Then, face your belayer and ask them, “On belay?” to make sure they’re in position and ready to belay you. If they're ready, they’ll respond, “Belay on.”  Your belayer may check your knots and harnesses before they respond. Once your belayer confirms that they’re ready to belay you, it’s safe to start your climb.   ", " Say \"Climbing\" to let your belayer know you’re climbing. Approach the rock climbing wall or the summit you plan to climb. Next, get into position to start your ascent. Before you begin, call, “Climbing” to let your belayer know the climb is starting and they need to belay you.  This is short for “I’m climbing.”  ", " Begin climbing when your belayer says, \"Climb. \" After you say “Climbing,” your belayer will likely call “Climb!” This means that they are ready to pay attention to your ascent and properly provide tension to your ropes.  Some belayers may call “Climb on!” Make sure you know which command your belayer will be using before you start your climb. If you get out of earshot and take a break, you need to be able to understand the command based on how the syllables sound.  "], "Ascending the Wall or Summit": [" Call “Up rope” if your rope has too much slack. This tells the belayer that you want them to pull up on the rope to tighten it. Once you give this command, they’ll increase the rope tension.  In some cases, your belayer may call a response to this command, such as “Thank you.” However, they may say nothing.  ", " Use “Slack” to ask for them to loosen the rope. Your rope may get too tight during your climb, so you may need some slack. When this happens, call “Slack” to your belayer. Then, they’ll loosen your rope for you.  Like with “Up rope,” your belayer may respond with something like, “Thank you!”  ", " Call \"Take\" if you want to let go to rest or end your climb. This command lets your belayer know that they need to lock off your line so that you won’t fall when you let go. Once they’ve locked your line, you can safely let go. Use this command to take a break during your climb, end your climb, or when you reach the top of the wall or summit. ", " Use “Off belay” to let your belayer know you’re in a safe position. This means you’re either on the ground or anchored into an upper station or belay. Say “Off belay” to let your belayer know you’re safe and it’s okay for them to take a break.  For instance, you might use this command if you’ve reached a ledge on a summit and want to look around for a few minutes.  ", " Listen for “Belay off” to know your rope is removed from the belay device. Your belayer should give this command in response to “Off belay.” It lets you know that your belayer has stopped belaying you and has detached your rope from the belay device.  Be careful while your rope is detached, as you won’t have any tension on your rope to stop a fall.  ", " Call “Rope” when you're going to drop your rope from above. You might use this command when you need to get back on belay after a break. It lets your belayer know that you’re dropping your rope so it can be attached to the belayer.  ", " Listen for “Clear! ” before you drop your rope. If you’ve been off belay, you may need to drop your rope. Your belayer will let you know when it’s safe to drop it by shouting “Clear!”  Dropping your rope too early could be dangerous, as your belayer won’t be expecting it. The rope may strike someone, or you may mistakenly believe it’s attached when it’s not.  ", " Shout “Rock! ” to warn others of falling items. During your climb, treat all falling items as rocks. If you see something falling, yell “Rock” to warn others, including your belayer.  Even if it’s not a rock, any falling item can harm a person if it strikes them. Anyone can call, \"Rock!\" Be sure to listen for this command during your climb so you can protect yourself if an object is falling.  "], "Handling a Fall": [" Say “Tension” if you’re feeling unsafe and want your rope very tight. It’s normal to get nervous when you’re rock climbing, especially if you’re scaling a very high wall or summit. If you’re worried about falling, you can call out, “Tension!” to have your rope pulled as tightly as possible. This prevents you from falling even a short distance if you lose your footing. Your belayer should keep up the tension once you give this command. If you change your mind, you can call “Slack!”  ", " Shout “Watch me! ” if you might fall. This lets your belayer know that you’re feeling insecure and think you may fall. They’ll make sure your rope is properly tightened so that you’ll be safe if you do fall.  Your belayer will make sure that you are safe at all times, so you don’t need to be afraid during a fall.  ", " Yell “Falling! ” if you are going to fall or are falling. This signals to your belayer to tighten up on your rope and guide you down to the ground. You won’t fall down the wall or summit, so try not to be scared.  An experienced belayer is trained on how to make sure you fall safely.  "], "Coming Down": [" Say “On rappel” when you’re ready to start your rappel. Before you descend, give the command “On rappel.” This warns your belayer and other climbers that you’re about to come down. Once the command is given, it’s safe to slide down your line.  If other climbers are on the same wall or summit, it’s best to check below you before you start your rappel. Use this command when you're in control of your descent.  ", " Use “Rappel off” to signal you’re on the ground and off the rope. Once you safely reach the ground, detach your rope from your harness. Then, call “Rappel off” to let your belayer know that you’re finished.  This will end your climb.  ", " Call out \"Lower! \" when you’re ready to come down from a wall. Use this command when you reach the top of the wall or if the climb is too difficult for you to finish. It will signal to your belayer that you want them to slowly lower you back to the ground. During your descent, lean back in your harness and relax.  Use this command when your belayer is controlling your descent. Once your belayer starts to lower you down to the ground, it’s safe to let go of the wall. Your belayer won’t let you fall. In some gyms, you’ll call “Ready to be lowered!” or “Ready to Lower!” Check with your belayer before you begin to make sure you’re using the right command.   ", " Expect your belayer to say “lowering” when your descent begins. When you hear this command, you’ll know it’s safe to relax. Let go of the wall or summit and lean back in your harness. Your belayer will safely guide you down to the ground.  "], "Calling Your Commands": [" Face your belayer when call your commands. The sound of your voice will go in the direction you’re facing. That means your belayer might have a hard time hearing you if you are facing away from them. Do your best to direct your commands in the direction of your belayer.  For instance, look down and turn your head away from the wall or summit. Try to spot your belayer before you make your call, if you can. This may not be possible if you’re climbing a high summit with ledges or blind spots, but do your best.  ", " Adjust your volume to fit your environment. In an empty gym, you might be able to use a moderate volume. However, speak louder if you’re in a busy gym or are climbing outdoors. Otherwise, your belayer might not hear you.  It’s common to shout your commands to your belayer.  ", " Say the command correctly every time so the meaning is understood. Using simple commands makes it easy to communicate with your belayer even when you’re far apart and it’s hard to hear you. In some cases, your belayer won’t actually hear the words you say, even if you’re yelling. However, using the same exact phrasing each time will help your belayer know what you mean even if they can’t hear you.  For instance, let’s say you’re ready to rappel down. Your belayer may not hear “On rappel!” Instead, they may hear “Un ah-el.” If you use your commands consistently, they’ll still know what you mean.  ", " Use a handheld radio device if the area is loud or you’re going a long distance. It may be impossible for you and your belayer to hear each other if you’re climbing a very high summit, the weather is very windy, or your indoor gym is very busy. When this happens, it’s best to use a handheld radio so that you can communicate with your belayer. Wear the radio in an easy-to-access location, like your waist or chest.  Turn up the volume so you can hear your belayer over the noises in your environment.  ", " Stay up-to-date on safety requirements for belaying. Rock climbing is generally safe, as long as you follow basic safety requirements. For instance, make sure you always wear a harness and properly-fitting climbing shoes. Tie your climbing rope with a figure-8 knot to keep it secure. Additionally, make sure your belayer is belay-certified and experienced.  If your belayer isn’t very experienced, you may want to have another belayer or rock climbing expert supervise your climb.  "]}}, "How to Start Rock Climbing": {"description": "Rock climbing is a fun and physical activity that is great for those wanting to spend time outdoors, to challenge their mind and body, or to get involved in a challenging sport. If you're interested in rock climbing but you have no experience doing it, there are several ways to get involved. You can learn how to rock climb at a gym or outdoors. Once you learn all of the basics, you can specialize your skills and figure out what type of climbing you like to do.", "content": {"Gaining Knowledge and Strength": [" Learn common rock climbing terminology. There are a variety of terms you will need to know in order to start rock climbing. There are terms for different types of rock formations, types of gear, types of climbing moves, and various other specialty lingo. A few terms to start with include:  Anchor - A high point on your climb where your safety ropes are connected.  - The term for the person who holds your safety rope as you climb. There is also a belay device that locks your rope if you start to fall. Bolted route - a climbing route that has permanent anchors that you can hook into.  - A type of climbing that is done close to the ground without ropes. Cam - A type of anchor that fits into small cracks and holds your rope in case of a fall. Carabiner - The connection device between your ropes and the safety gear on your body.  - A type of knot that is often used to connect your climbing rope to an anchor. Crux - The toughest part of your climb. Face - A smooth part of a rock formation that can be difficult to climb. Free climb - Rock climbing without a rope to help you up. You may still have a rope for safety. Jam - Wedging a piece of your body into a crack to get a hold. Rand - the rubberized edge of your climbing shoes that is often used for gripping.   ", " Find an outfit that will work for rock climbing before you get started. You won't need an entire climbing rig right off the bat but you will need the right clothing and shoes. Get fitted but stretchy clothing so that you can move easily but your clothes won't get stuck on the rock wall. You will also need climbing shoes, as they are specialty shoes that are lightweight and flex easily.  For example, many people climb in gyms wearing clothes they would wear to a yoga class, such as spandex shorts and a fitted t-shirt.  ", " Study basic climbing techniques. Read and watch videos about rock climbing online so that you have a very basic understanding of what each move entails. Look into technical aspects of how its done and the different types of techniques you could use. This will help you narrow down the type of rock climbing you would like to do and will get you ahead of the curve once you go to a class or get one-on-one instruction. For example, you will need to learn how to use your feet to get a grip, how to maintain balance while climbing, how to hold on to a hand hold, and how to use your energy efficiently while climbing difficult routes. When studying climbing, focus some of your time on learning about safety. This is an important factor that should always be at the forefront of your climbing.  ", " Build up your strength with daily workouts . Rock climbing requires a lot of strength in order to lift your body weight and move it into awkward positions. Do strength training with free weights, weight lifting machines, or without equipment every day, focusing on a different region of the body each day. Rotate between working on your legs, arms, and core. Also do cardiovascular endurance training so that you have the stamina to keep going up the wall.   by doing exercises like squats, calf raises, and leg presses. Increase your by doing exercises like bicep curls, dips, pull downs, loaded carries, and wrist curls. Build up your with exercises like plank, situps, bridge pose, lunges, and squats. Your strength training needs to include your hands because you will need to use them to pull yourself up the rock. Do hand strengthening exercises, such as using a gripper or resistance balls, before going rock climbing for the first time.   "], "Going to a Rock Climbing Gym": [" Take an introductory class if you have no experience at all. If you have never been rock climbing before but you want to find out if it's something you would enjoy, sign up for a class at your local indoor rock-climbing facility. An introductory class will teach you the basics, including what gear you will need and what techniques rock climbers use to get up a rock wall. Most rock climbing gyms and recreation centers will allow you to take an introductory class without signing a long-term contract to join their facility. Just tell them that you want to learn about rock climbing before committing to doing it on a regular basis.  ", " Join a rock climbing gym to get regular practice. The easiest way to get a lot of practice rock climbing is to join a rock climbing gym. This will allow you to climb regularly without having to buy your own equipment and you won't need to travel long distances to get to an outdoor climbing spot every time you want to climb. To join, simply go to their office, fill out their application, and pay their membership fee.  Most cities have private rock climbing gyms but you can also find rock climbing walls at many public and college recreation centers.  One of the biggest perks of joining a rock climbing gym is that you can climb even when the weather is bad outside. If you live in an area with months of bad weather, consider joining a gym so that you can climb more often.  ", " Sign up for a specialized class once you have the basics down. Once you have learned the basics in a general class, you can specialize in the type of climbing you want to do. The main types of climbing done in climbing gyms include bouldering, top roping, and lead climbing. Introductory classes will teach you the basics about these types of climbing but you will need further training to master the type you are drawn to the most.  Bouldering: This type of climbing doesn't use ropes and harnesses. You climb short rock and use spotters and padding to protect you in the case of a fall. This is a very accessible type of climbing to do, as you can do it in a gym or on short rock faces outdoors. Top roping: This type of climbing employs a rope that is anchored at the top of the climbing route and is tied on one end to the climber and on the other to a belayer, which is a person holding the rope on the ground for safety. This is a common type of climbing in rock gyms and is done on predetermined routes. Lead climbing: This is an advanced form of rock climbing the requires you to create your own path up a rock face. You still have a rope and a belayer below you but you set anchors as you climb and hook your rope into them as you go.  "], "Learning How to Rock Climb Outdoors": [" Search online for outdoor rock climbing classes in your area. Areas where rock climbing is a popular activity have many classes for those wanting to climb outdoors. Do an online search for \"rock climbing classes\" and the name of your area. If there are classes in your area, they should pop up.  You can also ask at your local climbing gym whether they sponsor outdoor classes as well. Many rock gyms have group outings and classes for members.  ", " Hire a personal guide if you don't like group classes. Search online or ask at your local rock climbing gym or climbing spot about experts that might be willing to do individual instruction. Once you find a climber to teach you, agree on an hourly cost and schedule when and where you will work on your climbing.  Paying a professional rock climber to teach you how to climb is more expensive than group classes but they will give you one-on-one instruction and will help you develop your skills more quickly. In some cases, your teacher may want to work with you in a rock gym before taking you climbing outdoors. This will allow them to gauge your skills, which will help them to pick an outdoor climb that is appropriate for you.  ", " Practice with a partner in areas with minimal drops as your skills progress. Once you understand the basics of climbing, you can go out without a teacher. However, you should always have a climbing partner and you should choose relatively easy climbs until you feel confident about your abilities. Your climbing partner needs to be someone that you trust and communicate with well. They will be responsible for your safety and you will be responsible for theirs, so you need someone that takes climbing seriously.  Ask your rock climbing instructor about climbs in your area that would be appropriate for your skills. They should have a good idea about what you can handle and what will build your skills.  "]}}, "How to Move up Overhanging Rock Without Wasting Energy in Rock Climbing": {"description": "Climbing on overhanging terrain is one of the more taxing forms of climbing and can sap up a lot of your energy. However, don’t let this discourage you! Fortunately, there are several active steps you can take to avoid fatigue when you’re climbing and be able to move up overhanging rock without wasting too much energy.", "content": {"Avoiding Fatigue": [" Warm up before your climb to perform your best and avoid injury. Try 10 minutes of walking, jogging, or running to get your blood moving. Then, do some dynamic stretching with rotational movements to best simulate the type of strain muscles experience during climbs.  Stretching will not only help you avoid fatigue but is also one of the best ways to prevent injuries in climbing. Some good examples of dynamic stretches include head rolls, windmills, side twists, and walking lunges.   ", " Make sure you have taken a 20 minute break since your last climb. If you try to climb the rock too soon after a previous climbing attempt, you’ll be too tired to climb efficiently. Do some stretches and light cardio during this 20 minute period to keep your muscles loose and warmed up.  ", " Be sure you’ve had enough to eat and drink before climbing. Dehydration and not having eaten enough food to fuel strenuous physical activity are 2 of the most common causes of muscle fatigue. Eat a balanced meal containing carbohydrates and protein and drink at least 16 fluid ounces (470 mL) of water 1-2 hours before climbing.  For example, eat a light meal of whole wheat pasta with red sauce, vegetables, and chicken to give your body a healthy balance of carbs, protein, and fats.  "], "Using an Efficient Technique": [" Scan the rock ahead of time and plan out the route you’ll take. Look at the climb and make sure you know what you are going to do before you begin. Find any spots that look like good spots to rest while you’re making the climb.  Look for the crux (hardest part of the route). Once you have identified it, try to figure out the best way to move past it.  ", " Keep your arms straight for as many of the moves as possible. Bending your arms will engage your biceps and tire your muscles out more easily. Straightening your arms will help you conserve energy as you move into overhanging moves.  Instead of pulling yourself up the route with your arms, focus on using your legs to push yourself up. Use your arms to keep your body tight against the rock.  ", " Utilize your legs and feet to take weight off of your arms. Essentially, use your legs and feet in tandem to pull and push the rest of your body as needed. Techniques like heel hooking and toe hooking can be very helpful.  To heel hook, position your heel so that it’s caught against a bump or dip in the rock. Then, pull your heel toward your butt, engaging all the muscles in your leg. This will increase your body tension and take part of the weight off of your arms. To toe hook, perform these same steps, except with your toe on a lip or ridge instead of your heel.  ", " Keep your hips close to the rock and above your legs. This will help keep more of your weight over your legs and minimize fatigue in your arms. Avoid having your body sag away from the rock which will conserve energy and make it easier for you to move your body upwards.  "]}}, "How to Build a Home Rock Climbing Wall": {"description": "Building a rock climbing wall can be a great way to get a workout and prepare yourself for climbing without having to get out of the house. Many climbers use their home rock climbing wall to build strength and to train. Home walls are so great because you don't need to have a climbing gym near by to climb and train.", "content": {"Steps": [" Decide exactly what you want out of your rock climbing wall.  Do you want the wall inside or outside? What shapes, features and size do you want your wall to be? You will also want to begin drawing out the type of wall you want.   ", " Plan on the construction method you will use for your wall. You must use a structural method of building your wall to support the weight of a climber, and if it is outdoors, to resist wind loads in severe weather. Post and beam construction.  This is the most structurally sound building method.  Set 8 inch (20.3 cm) diameter treated poles in the ground about 48 inches (121.9 cm) deep.  Fill the holes with ready mixed concrete, or bags of premixed concrete mixed in a wheelbarrow.  Bolt 4X6 inch beams horizontally across the posts with to inch (1.6 to 1.9 cm) galvanized bolts.  Nail or screw inch (1.9 cm) plywood sheathing over the beams, and finish with paint or textured paint. Wood framed, wood covered.  This consists of lumber framing members, attached to a \"mud sill\" or framed up from a concrete base.  2X6 inch (nominal) lumber at 16 inch (40.6 cm) centers is suggested, with a inch (1.9 cm) exterior plywood sheathing attached with 2 inch (5.1 cm) number 8 wood screws 8 inches (20.3 cm) on center.  You will need to attach diagonal bracing solidly anchored to the back of the wall and the earth behind the structure to keep it upright. Wood framed, stucco covered.  Frame the wall the same as the above, then attach wire plaster lath with inch (3.2 cm) roofing nails, 8 inches (20.3 cm) on center.  Bed the lath with 1/2 inch (5.1 cm) of masonry cement plaster, scoring this \"coat\" (the scratch coat), so that the finish coat will bond.  Apply a masonry cement or synthetic plaster finish coat after the scratchcoat has dried thoroughly. Concrete block (CMU).  Place a concrete footing, a minimum of 8 inches (20.3 cm) thick, 24 inches (61.0 cm) wide, with reinforcing rods, 2 or 3 feet (0.6 or 0.9 m) below grade (ground level).  Stick number 5 rebar dowels 16 inches (40.6 cm) on center into the concrete, with 48 inches (121.9 cm) projecting upwards for block cell reinforcement.  Lay up your block (8X8X16 inch, typical), filling each cell that has a reinforcing rod with mortar as you go.  Add rebar with a 32 inch (81.3 cm) lap so that the rebar is continuous to the top of the wall.  Backfill the lower part of the wall, to the normal ground level, and compact.  This earth fill at the base will help support your wall from high winds and tipping over.  ", " Calculate exactly how much the wall will cost, exactly what supplies you will need and all the technicalities. Begin to figure your specific cut angles, your framework, joints and other important features of your wall.Decide what kind of effects the elements will have on your wall if it is outside. Will your wall suffer from being rained or snowed on? One way to sustain the life of your wall is to use marine board. This is more expensive but if you live in a rainy area, you will find the board to be well worth it. ", " Build your wall. If you enjoy building, this will be the best part. The reality of your wall will slowly come to life through this process. ", " Finish the wall surface, paint, and apply texture.  ", " Consider what your fall zone is going to be. Are you going to have padding such as mattresses or gym pads? ", " Crank your holds on and build your routes. If the wall is outside, be prepared for your bolts to rust over. If you don’t plan on rearranging holds very often, you will typically not have much to worry about. If you do want to move holds around, it may be difficult unscrew them once they have become rusted. You can also find holds pretty cheap if you hit your local climbing gyms. Many times they replace their old holds and will give you or sell you their old holds at a pretty low price. You may also be able to find holds from manufacturers that are clearing out old styles. Once you get your wall up, you will be excited and can climb whenever you want. There will come a time when you get used to the wall and it’s not as thrilling as it was once before. Keep yourself motivated by adding to the wall and developing new routes. The more challenges you can give yourself, the more apt you are to continue training on your wall. "]}}, "How to Improve at Indoor Rock Climbing": {"description": "Indoor rock climbing is a challenging sport, but it is also lots of fun. If you are new to indoor climbing or if you just want to improve your skills, there are several things that you can do. You can work on mastering basic climbing skills, enhance your skills with specific techniques, or increase your strength, balance, and flexibility to prepare your body for more challenging climbs.", "content": {"Improving Basic Climbing Skills": [" Warm up before you climb. Taking time to warm up and stretch your muscles before you start a climb can help to prevent injuries. Warming up and stretching may also help to improve your performance, so it is important to start every climb with a few minutes of cardiovascular exercise and some good stretching.  Try walking briskly or jogging back and forth in the gym for a few minutes to get your blood flowing.  your arms, shoulders, core, and legs before you start your climb.   ", " Read the route before you climb. Before you start climbing, look at the wall and try to analyze your route. Identify the best footholds and handholds, consider how you will handle difficult transitions, and plan the direction that you will take.  Taking time to read your route is a great way to improve your climbing skills. If you do not take time to plan your route, you may end up wasting energy by having to backtrack or by having to take extra time to consider your moves.  ", " Maintain a medium grip. Gripping too hard with your hands can wear out your forearms quickly, which may mean that you will not be able to complete your climb. To ensure that you will have enough grip strength to complete your climb, try to maintain a lighter grip on handholds.  Try to keep more of your weight on your footholds than on your handholds whenever possible. Try to stay close to the wall. Keeping your bodyweight closer to the wall will help to keep your body weight centered and reduce strain on your forearm muscles. If you need to lean back to check your route, try to do so quickly.  ", " Make more foot movements than hand movements. Using your feet and legs to move your body upwards is more efficient than using your hands and arms, so try to make most of your movements with your feet. You should try to make three foot movements for every one hand movement.  For example, you could reach up to a high handhold and then use your feet to move your body closer to the hand hold by changing your footholds three times.  ", " Rest when you need to rest. Take a few moments to rest and regain your strength whenever you become fatigued. To rest, lean in close to the wall and use your feet to support your body weight while maintaining a light grip on your handholds.  Keep in mind that if you become fatigued, you have a higher chance of falling. Pay attention to how you feel to determine when you should rest during your climbs.  ", " Be ready to fall at any time. It is normal to falls sometimes when you are doing a climb. If you never fall, then you may not be challenging yourself enough. When you do need to fall, you will probably know and you should do certain things to make your fall as safe as possible.  Do not loop your rope around anything or any part of yourself. Push yourself out and away from the wall if you fall. Pay attention to potential holds below you. Put your feet up towards the wall to avoid hitting your head.  "], "Increasing Physical Fitness for Climbing": [" Build up your forearm muscles. Your forearms make it possible for you to grip and hold onto your handholds. If your forearms are weak, then you may not be able to hang on for long. To strengthen your grip, do exercises that target your forearm muscles.  Try getting a grip exerciser. These are handheld training devices that you squeeze with your hands to improve your grip.  ", " Train your arms and shoulders. Having good arm and shoulder strength can also make it easier for you to hold onto your handholds. To increase your arm and shoulder strength, include some pull ups and chin ups in your exercise routine.  If you can’t do a chin up or pull up yet, then include some weight training exercises that use the same movements, such as pull downs and presses.  ", " Improve your core strength . Your entire core will be engaged while you are climbing, so it is important to strengthen these muscles. You can do crunches, side crunches, planks, and other core strengthening exercises to build up your core strength.  Try holding a plank pose for 30 to 60 seconds once or twice per day.  a few times per week.  ", " Work on your balance . If you have poor balance, then this may make it harder for you to make certain transitions or stick on certain points as you climb. Incorporating some balance exercises into your routine can make it easier for you to handle balance-testing moments in your climbs.  Try standing on one foot in front of the climbing wall and lifting one foot in front of you. Then, point your toe and touch the tip of your toe to different footholds on the wall. Make sure that the moves are slow and controlled. Then, repeat the exercise with your other foot.  ", " Stretch your muscles. Being flexible will also help you to be a better climber, so always take time to stretch your muscles after you have trained them. You can sue a combination of yoga poses and traditional stretches to improve your flexibility. Some good stretches to use in your training routine include:  . Forward bend. Cobra pose. Shoulder and arm stretches.  "], "Learning New Skills": [" Use static climbing technique. Static climbing technique emphasizes fluid movements and even weight distribution. Rather than using momentum to propel yourself upwards, you position yourself close to the wall, position your arms and legs, and then shift your body weight to the new position.  ", " Incorporate dynamic climbing techniques. Dynamic climbing technique emphasizes propelling your body upwards towards a specific point that you could not otherwise reach. You will need to have strong footholds and handholds to start, but then your will use these holds to spring up towards a higher handhold.  After using dynamic techniques, you may need to dangle from the new hold for a few moments until you can steady yourself, and then find footholds to maintain your position.  ", " Try lead climbing. Lead climbing is a step up in difficulty from top rope climbing, so you may want to give it a try. With lead climbing, you do not have a rope attached to anything when you start. Instead, you clip a rope that is attached to you to different bolts along your route.  Many gyms offer classes in lead climbing that can help you to develop skills in this area. Check your local gym for upcoming classes.   ", " Observe experienced climbers. By watching experienced climbers while they climb, you can see how they handle difficult obstacles and transitions. You may also learn about new climbing techniques that you can try during your next climb.  Spend some time before or after your climbs to watch experienced climbers and make mental notes about what they do. Think about how you can incorporate these techniques and strategies into your own climb. Keep in mind that you may need to modify some of these techniques to suit your skill level. For example, if you want to include a dynamic technique, then you might need to start with a small leap rather than trying to launch yourself to a spot that is a few feet away.  ", " Take your training outside. Climbing on an indoor rock wall is quite different from climbing outside. After you have mastered some basic skills, you'll probably be itching to try climbing outside. The experience may provide you with some new skills that will help you with your indoor climbs. You may very well become addicted to the outdoor vistas and adventure of it all. "]}}, "How to Start Indoor Rock Climbing": {"description": "Rock climbing can be a great and fun way to get a full-body workout. Kids and adults can gain muscle from rock climbing. However, climbing outdoors can be a little scary. Try starting out at an indoor rock climbing gym. They are safe places to practice, build strength, and ultimately become an expert rock climber, ready for the outdoors.", "content": {"Picking the Right Indoor Location": [" Find a rock climbing gym. There are many rock climbing gyms in your area and around the world. Look for a gym with top roping, which is when the rope is already set for you. If there are many gyms, look at reviews. Consider the facilities as a whole, what materials they offer, their general location, their operating hours, and their size.  Also, make sure there are a staff members available to belay you. Otherwise, you might be bouldering or on auto-belays all day.  ", " Try another gym. You won't know what you like or if a rock climbing gym is a good fit, unless you visit several facilities. A different gym could be better, more beginner-friendly, or a nicer place to spend your time. ", " Get a membership. If you like the gym, consider getting a membership. If you get a membership and go frequently, you’ll save money in the long run. Sometimes, memberships have other rewards too. They might offer exclusive climbing opportunities, access to additional gear, or the use of private facilities. ", " Find a partner. Although at the start, you can climb alone on auto-belays or with a staff member, a partner will soon become important. Make sure your partner knows what they are doing and they must be belay certified. Whether it is simply supporting you or belaying you down the side of the rock face, you want someone you can trust. If you don’t trust them, you will be more likely to panic if you get stuck at a difficult spot or angle.  ", " Take a lesson. Most indoor rock climbing gyms offer basic and advanced lessons for climbers. Not only will they teach you how to use the equipment properly, to climb safely, and to develop efficient techniques for scaling certain obstacles, but lessons can be great places to make contacts, find partners, and learn from each other. Technique is more important in the long run than building strength. Think about each move, how your hands should grip around rocks, and what your feet can do for you as you propel up the side of a rock face. Get to know what works for you and what is comfortable. Not everyone climbs the exact same way, but lessons will get you started.  ", " Get the necessary equipment. Make sure your gym offers harness and rock shoe rentals. If it doesn't, you might want to choose another gym if you aren't ready to purchase your own gear. Depending on your level of commitment and available money, you should consider getting your own gear. Purchasing a harness, rock shoes, and belay device might seem expensive right now. However, in the long run, you'll have better gear to work with than what is normally offered by a gym. Make sure to get the belay device you learned with, along with a carabiner. A harness should be safe, comfortable, and fit you securely. The rock shoes should probably fit you fairly comfortably, lace-up, and have a flat, not down-turned, sole.  ", " Join a climbing club at your  gym. There are normally clubs for novices and experts. Some clubs mix the two groups, which gives the beginners a great opportunity to learn from more experienced climbers. Joining a group is a great way to motivate yourself and to learn. Join online groups as well. Learn about new techniques, equipment, rock climbing locations, and rock climbing events.  "], "Getting Fit for Rock Climbing": [" Learn how to stretch. Rock Climbing will stretch your limbs in ways you didn’t even know about. Make sure you stretch thoroughly before each climb. You don’t want to pull a muscle or have a muscle tense up at a crucial point. There are many different kinds of stretches in standing and sitting positions. Use stretches with a lot of motion to stretch several regions. Stretch your upper body. Focus on your triceps and lateral muscles the most. These are the muscles that will help pull you up the rock face most.  Stretch your lower body. The most important parts of your legs to stretch are your ham strings, quads, and calves. Your legs will do the heaviest lifting. These three areas are the most likely to be pulled.   ", " Build strength. Climbing requires both technical skill and a minimum level of strength. If you sacrifice one for the other, you won’t be a good rock climber. Workout. Focus on both your upper body and your lower body muscles. Rock climbing is a full body sport.  ", " Strengthen your grip. Work out your upper arms, forearms, and wrists/hands. We’ve all heard the phrase, you’re only as strong as your weakest link. Make sure that every part of your arm is strong. Don’t just focus on biceps. If you do, you’ll be able to lift yourself up faster, but your hands will tire before you even get a chance to fully use your upper arm strength. Use a squeeze ball regularly to strengthen the wrist and hand region. Lift small weights frontwards and sideways to improve overall arm strength. Try to do exercises that replicate rock climbing. Do static hangs on a bar to strengthen those muscles needed for static hangs while climbing.  ", " Strengthen your shoulders and upper back. Do pull-up exercises and use simple arm rotations with basic weights to strengthen these muscles. As you become stronger, look into more sport-specific training exercises like hang boards, campus boards, and system boards.  ", " Workout your core muscles. Take time to focus on your abdominal and lower back muscles. Your goal is not to have huge core muscles, but to develop a highly flexible and stable core. As with other exercises designed to build strength for rock climbing, focus on exercises that replicate rock climbing movement. Sit-ups, crunches, dumbbell side bends, and back bridges are all great exercises for strengthening these muscles. ", " Don’t forget your legs. Last, but not least, focus a lot of your time on your legs. Many people forget to work out their legs, but when it comes to rock climbing, your legs will propel you up the rock face and will be integral to repelling back down. Be sure to not overdo your legs. Keep them flexible. You might get in tight spaces, where “cumbersome” leg muscles will reduce your mobility. Run on a treadmill, swim laps in a pool, lift leg weights, or walk around with training weights attached to your calves. Emphasize mobility along with strength. ", " Practice balancing. Balance is very important when climbing. You need to be aware of your center of gravity in order to properly assess your next move. A slack-line is a great way to improve your balance and there are many exercises you can do with it.  ", " Practice breathing. This may sound silly, but you need to be able to control your breath while climbing. Breathing too quickly is a great way to wear yourself down. This isn’t what you want. Practice breathing with a stopwatch. See how regular you can make your breaths.  "], "Starting Indoor Rock Climbing": [" Wear the right gear. Don’t wear clothes that will limit your mobility. Wear shorts and a tight t-shirt. Wear shoes with excellent grips or shoes designed for rock climbing. Many people like to wear gloves with grips on them. This will save you from building up calluses and will improve your performance overall. If you don't want to wear gloves, be sure to use rock climbing chalk. This fine powder sticks to your hands and adds more to your gripping power.  ", " Warm up. Take your time. Warm up your muscles before you start climbing. Run in place. Try climbing just a few steps up and then lower yourself back down. This will tell your muscles that you’re ready to climb. Do your stretches too.  ", " Visualize your route before you start. Climbing is just as much mental as it is physical and knowing where you will go beforehand will help improve your climb. Think of the wall like a maze with the floor as your starting point and the top of the wall as the finish line. Trace a path from hold to hold with your eyes and then follow that path.  ", " Start climbing. Start slow. Take your time. Don’t push yourself far beyond your limits. Start with easier climbs first. Only after you’ve mastered these, should you advance to more difficult walls. Ask staff members for advice on routes to take, walls to climb, and techniques to try. They’ve been on these walls a lot longer than you and are a great repository of knowledge. ", " Rest on the wall. When you find good rests or places that you can easily hold onto, take a minute to catch your breath. You know it is a good resting place, if you feel comfortable hanging one limb off the wall. Learning how to rest is an important part of developing good technique. This is also a good time to reassess your route. If you found one part of the course more difficult than you originally thought, you may choose to take a moment and trace out a new path. This is what you would do when rock climbing outdoors, so practice this indoors.  ", " Concentrate on the wall in front of you. People who are afraid of heights tend to look down, which triggers their anxiety. Beginners who aren’t afraid of heights tend to keep their eyes fixed on the top of the wall. This leads them to overestimate their abilities and to not concentrate on their next hold, which can have disastrous effects. Start off slowly if you are afraid of heights. Only go as high as you are comfortable, and slowly work on going a bit higher each climb. Remember that you are completely safe. The weakest piece of equipment (the carabiner)can support almost 2,500 lbs if used properly and about 1,000 lbs if not.  Falling injuries are rare in a gym.   ", " Gauge your next move carefully. Most rock climbers tell you not to overreach. Sometimes, you might feel the need to reach beyond your normal radius. Avoid this whenever possible. Reach for the closest rock. Secure your foot in a comfortable position. This will maximize your own safety and ensure that you make it to the top. ", " Use your upper body and legs. Beginners tend to overcompensate with one or the other. Keep your body over your legs as much as possible and use your arms to guide yourself up. The goal here is to minimize the amount of effort placed on one muscle group. This is how you strain muscles. By using both parts of your body and paying close attention to how you use these muscles, you’ll be a much more efficient climber. ", " Take safety seriously. A rock climber's worst enemy — indoors or outdoors —  is overconfidence. You might think that you are an advanced climber  and that you can take chances. Don’t do it. Make sure you are always secured to the rock face. There are thousands of factors to consider with each grip and foothold. You never know if you’ll need to adjust at the last second or not. "], "Taking Care of Your Body": [" Don’t climb too often. Every other day is a good rule of thumb for most beginners. Just like with other sports, it is necessary to rest your muscles and to review your technique, in order to improve. Rock climbing is no different. Don’t climb with pulled muscles. You’ll need all of your strength to climb rocks successfully. ", " Fuel your body. Eat healthy and pick foods that will rejuvenate lost energy and help build muscle, like protein-rich meats, nuts, and soy beans. Eat complex carbohydrates after your climb. Eat green vegetables, like grains, starchy vegetables, beans, and peas. Some people like to eat dark chocolate as well. ", " Drink a lot of water. Drink water before the climb and between climbs. Cramps are caused by dehydration. Your hands and feet are the first parts of your body to start cramping when you become dehydrated. You don’t want to cramp up on the wall. Always replace the fluids you lose through sweating from the climb.  ", " Get enough rest. If you are tired, your brain won’t function well enough to properly assess each step. You’ll be more likely to fall, which can be discouraging and hurt your overall motivation. "]}}}