{"How to Make a Bridal Shower Fun": {"description": "A bridal shower is traditionally planned by the maid or matron of honor leading up to the wedding day, although mothers, bridesmaids and other family members often get involved. The bridal shower is meant to be an enjoyable party where the bride is showered with love, well-wishes and gifts by the bride's best female friends and family. Mistakes are sometimes made in the planning process that can take the levity and enjoyment out of the event for the bride and the attendees. There are some bridal shower ideas that reduce stress to making planning more enjoyable and make the shower more entertaining and memorable. This article will tell you how to make a bridal shower fun.", "content": {"Reducing Stress": [" Speak to the bride before you begin planning . Traditionally, the bride is not involved with the shower, but if she is hard to please, it will be easier to talk through any worries or ideas she might have at the beginning of the process and avoid confrontations that could ruin the day.  ", " Decide if a couple's shower would be more fun. You can co-plan with the best man and reduce the formality of the event, leading to a more enjoyable time. ", " Determine the budget for the shower to reduce any financial worries. Make sure that anyone who has a large say in what goes on at the shower, is also giving money toward its creation. Collect money in advance, if possible, to pay for reservations, catering or party favors.  ", " Do not schedule a shower that is more than 2 hours long. It is hard to keep a fun atmosphere for a long period of time.  ", " Invite the bride's closest friends and family. Make sure that everyone who is invited to the shower is also invited to the wedding. It can be a cause of resentment if people believe they are being solicited for gifts for a wedding that they won't be attending.  ", " Decorate early on the day of the event, so that you and the other helpers are not rushed. Set up the shower layout to encourage mingling between friends and family of the bride.  ", " Decide if there will be gifts. This is often a cause for worry. If the bride does not want gifts, be sure to say \"No gifts\" on the invitation. If the bride does want gifts, it is a good idea to create a theme around the gifts she most needs, like kitchen wares or lingerie. The bride can also register for gifts, in which case you should include that information in the shower invitations.  "], "Selecting a Fun Theme": [" Determine a theme for the shower based on the bride's personality or lifestyle. Possible themes include a tea party, craft night, picnic, wine and cheese tasting, bowling event, dance class, cooking or canning party, a hike, spa day, in-home yoga class or tiki party. You can also theme your party around the type of gift the bride needs to receive. For example a kitchen, bar or entertainment shower.  ", " Pick a fun location. For most weddings, the traditional home or hotel restaurant reception may not fit the bride's preferences. Fun locations include the park, the beach, the library, a backyard barbecue, a gallery, a garden, mini-golf course, pool, museum, boat or sporting activity.  "], "Choosing Enjoyable Entertainment": [" Provide plenty of snacks. Guests will enjoy themselves more if there is something to munch on. If you decide to serve alcohol at the shower, the appetizers are even more important in making sure the shower doesn't get out of hand.  ", " Play background music to lighten the mood of the shower. Make a list of the bride's favorite songs or make a wedding playlist in the theme of the shower, like beach music.  A great wedding-themed playlist can include songs like \"Chapel of Love\" by the Dixie Cups, \"White Wedding\" by Billy Idol, \"Let's Get Married\" by the Proclaimers, \"Band of Gold\" by Freda Payne, \"With this Ring\" by the Platters,  \"Not Too Young To Get Married\" by Bob E. Soxx and the The Blue Jeans, \"Wedding Bells\" by Hank Williams, \"Hotel Yorba\" by the White Stripes, \"Forever in my Life\" by Prince and \"Love and Marriage\" by Frank Sinatra.  ", " Choose an icebreaker for the beginning of the event, so that friends and family will get to know each other. Using the R.S.V.Ps that you received, make bridal shower bingo. Give everyone a card that has squares referring to people the bride knows, such as a colleague, childhood friend, sister or aunt. A guest gets a bingo if she meets people from different areas of her life and fills in the names of those people. You can also do an icebreaker in the style of a scavenger hunt. Make a list of interesting facts and give it to the guests. They have to find who traveled to Mexico with the bride in 2000 or who gave her her first hair cut.  ", " Pick games that reflect the audience that will attend the shower. For example, do not play bawdy games with the bride's mother in attendance. Do not play games that make people talk about their relationship, if you have invited many single people.  If your bride does not seem like the type to enjoy indoor games, play croquet or bocce ball instead. This is a great idea if she is sporty. Popular bridal shower games include making a wedding dress out of toilet paper for the bride or for each guest, playing trivia about the bride's life, write poetry or limericks. Play purse bingo, where you get points for common items found in a purse, like a hairbrush, safety pin or pen. Each person allots themselves points according to what they have in their purse and the one with the highest score wins. Make recipe cards and have each of the guests write down their idea of a recipe for a perfect relationship. Bind the cards together with pictures afterward and give them to the bride.  ", " Ask guests to sign a guestbook and include their favorite memory with the bride.  "]}}, "How to Plan a Bridal Shower": {"description": "Planning a bridal shower is a fun and creative endeavor that will create a lasting memory for the bride. The shower can be as simple or as elaborate as you want, and you don’t have to spend a ton of money to create an impressive and unforgettable event. Create a guest list, decide on a date, time, and location for the shower, then send out the invitations. Select decorations that tie into the wedding theme or colors, and plan a few fun activities for the guests. Provide simple refreshments and send each guest home with a small favor to remember the day by.", "content": {"Deciding on the Details": [" Speak to the bride about the guest list. Unless the bridal shower is a surprise, you should get the bride’s input on who she wants to attend. Write a list of everyone she wants to invite, and ask for the guest’s addresses so you can send them invitations, as well.  Remind the bride that anyone invited to the shower should also be invited to the wedding.   ", " Determine the budget. Typically, the hostess pays for the bridal shower. If you aren’t sure you can manage tackling the cost on your own, consider asking a few of the bride’s close friends or family members to co-host the shower with you. The cost of the shower can be split evenly between the hostesses.  You don’t need to shell out a ton of cash to have a nice shower. Consider splurging on a beautiful location and keeping decorations and refreshments to a minimum. Alternately, host the party in someone’s home to save money and purchase cute cupcakes and simple floral arrangements for a fancy feel.  ", " Select a date and time. Typically, bridal showers are held on the weekend. Speak to the bride well in advance to find a date and time that works well for her. She’ll be busy planning the wedding and may have other engagements, like cake tastings or dress fittings, to work around.  Opt for a mid-afternoon shower if you want to avoid serving a full meal.  ", " Choose a location or book a venue. If possible, give the bride a choice of several locations and let her decide which she likes best. For example, you could offer to host the party at your home, at a local restaurant, or at an outdoor event venue in town. Once she’s selected a location, book the venue, if applicable.  ", " Choose a theme for the shower that matches the wedding theme or colors. Speak to the bride about what she envisions for the shower. Oftentimes, the wedding colors will work for the shower as well. Or, you can choose a theme based on the bride’s interests or plans for the marriage.  For instance, if the duo plans to honeymoon in the Caribbean, go for a Caribbean-themed bridal shower. Decorate with seashells and tropical flowers, play reggae music, and serve island cocktails. Alternatively, if the wedding has a roaring 20s theme, decorate the invitations and space with feathers and bling, play 1920s music at the shower, or even request that guests come in flapper dresses.  ", " Send out invitations 1 month before the event. To ensure that guests can make arrangements to attend, party invitations should be sent out no less than 1 month before the event. You can hand-make invitations, buy invitation templates to fill in, or have invitations printed specifically for the event.  Include information about where the bride is registered for the bridal shower, if applicable. Keep track of the RSVPs so you know how many guests to expect, and make a point to reach out to anyone you don’t receive an RSVP from.  "], "Designing the Event": [" Plan the menu. Ask guests to let you know of any allergies or dietary restrictions ahead of time so you can plan accordingly. The menu can be as simple or elaborate as you want: you can serve appetizers or a full meal, or even have the event catered. Don’t forget to provide a selection of refreshments, like water, lemonade, tea, coffee, and soda—and wine or cocktails, too, if desired.  A cake is the typical dessert for a bridal shower, but don’t be afraid to change it up and serve something like chocolate mousse, instead.  , fruit and cheese plates, or a bruschetta bar with different toppings would make great appetizers. If the party is themed, try to incorporate the theme into the menu. For instance, if the theme is “travel,” choose dishes and from various countries to give an international feel.  ", " Choose the decor. Consider the bride’s theme or colors when planning the decor. You’ll likely want linens, flowers, centerpieces, balloons, confetti, streamers or banners, wall art, or even photos of the couple. Not only do flowers make beautiful, high-impact decorations, they are also great take-home gifts for the bride and groom, so if you have a chance to splurge, do so on flowers.  It’s often cheaper to rent tables, chairs, and linens for an event rather than purchase them, so look into that option if desired. If the colors of the shower are navy and white, for example, choose navy tablecloths and white napkins. Opt for navy and white floral centerpieces or add navy and white streamers or banners to the space. If the theme is “travel,” for instance, laminate maps for placemats and use globes as centerpieces. Put posters or photos of exotic locales on the wall and stack several travel guidebooks on end tables.   ", " Decide on activities or party games. It’s a good idea to choose music to play during the event. And while it’s nice to chat and mingle, you may want some activities or games to liven up the party. Do an Internet search to find ideas for fun and modern games.  For instance, have guests write date night ideas on small Popsicle sticks and put them in a jar for the bride and groom to choose from later. You could also make or buy custom bridal shower mad libs and have guests fill in the blanks to give marriage advice or tell the story of how the bride and groom met.  ", " Select favors to send home with guests, if desired. The favors don’t need to be elaborate or expensive. Small jars of jam or honey, pretty bottle stoppers or wine charms, and small potted plants or succulents make great gifts. You could also give out chocolates or other edible treats. Tie in the theme of the shower too, if you want.  For instance, if the shower has a spay day theme, send the guests home with candles, face masks, bath salts, scented soaps, or nail polish.  ", " Shop for supplies and make reservations. Purchase any decorations, props, paper goods, plates, cups, flatware, serving utensils and party favors ahead of time. You’ll also need ingredients for any dishes or drinks you plan to make. If you are renting a space or any equipment, ordering flowers or a cake, or having the event catered, make those arrangements as soon as possible.  "], "Setting Up the Day of the Shower": [" Arrive early to make sure everything gets done. On the day of the shower, you’ll need to arrive at the venue well before the bride and guests. Ensure the space is clean and that you have everything you need. Depending on how much you have you do, you may need up to several hours to set up.  ", " Decorate the space . Arrange furniture, if necessary, to make enough room for the guests and set up any equipment that’s needed. You should also make a spot for gifts and arrange any supplies for games or activities. Add linens and place settings to the tables, if applicable. Display any photos or art and hang banners or streamers. Set out centerpieces or floral arrangements, too.  ", " Arrange food and drink stations. It’s a good idea to prep the food the day before the shower if you are cooking yourself. Make any last-minute dishes or drinks the day of the party. Set out food on serving platters or use chafing dishes or bowls of ice to keep your dishes hot or cold, as appropriate. You’ll need to arrange plates, cups, flatware, serving utensils, and napkins, too!  ", " Set out the favors and make a gift-opening area. Arrange a space for the bride to open her gifts. Make sure there’s enough seating for the guests to be comfortable during this part of the shower. It’s a good idea to arrange the favors on a small table or bench near the door. That way, you’ll remember to hand one to each guest on their way out.  ", " Greet the guests as they arrive. Smile and introduce yourself to anyone you don’t know. Thank each person for coming, and point out party necessities or let them know what to expect.  For instance, say, “Hey, Marsha, thanks for coming! Go ahead in and grab a drink. We’re going to eat in about 30 minutes.” Alternatively, say, “Nice to see you again Joan! I’m so glad you could make it. Please set your gift by the stairwell and grab a mad lib from the table on the right.”  ", " Stay after the shower to clean up. Since you’re the host, you’re in it for the long haul. Plan to stay late to ensure the bride takes home all her gifts and favors. You’ll need to make sure the catering crew gets paid, if applicable, and arrange pick up for rental items, like linens, tables, and chairs. Decorations will need to be taken down and the space will also need to be cleaned after the party.  "]}}, "How to Decorate for a Bridal Shower": {"description": "Decorations for a bridal shower can be as simple or as extravagant as you want them to be. Take the time to talk to the bride about her own vision, and don’t be shy about asking for help. With so many options to choose from, make decisions about the theme and style of the shower early on so your creative efforts have a focus. This will help you relax and truly enjoy the process!", "content": {"Creating a Plan": [" Talk to the bride about the guest list. Unless the shower is a surprise, it is a good idea to get as much input as possible from the bride. Traditionally, a bridal shower is for the bride, her bridesmaids, and other close female friends and family. She may want to stick to this tradition or she may want to include older family members, children, or even partners of her friends. This is valuable information when choosing a theme and deciding on your decorations. If there are going to be children there, for example, you will want to avoid decorating with precious, breakable items within their reach. You might also consider creating a designated space for them to gather and play.   ", " Determine the shower's location. The bride may feel strongly about hosting an event-style shower like a spa day or a horseback riding trip. Decorations for this type of shower are minimal and need to be portable and simple, so this is an important distinction to make up front. An event shower will save you money on decorations, but they are generally more expensive all around. The host is responsible for organizing the details, but the cost is generally split evenly between all of the participants except the bride.  ", " Select a theme for the shower to give your decorations a focus. This is optional and depends on the interests, style, and desires of the bride. Unless the shower is a surprise, ask the bride about her thoughts on a theme. When you discuss the theme with the bride, watch for her level of interest and enthusiasm when you discuss certain ideas. For example, she may not care very much about the colors you choose, but she suddenly becomes passionate when you talk about the flowers or a make-your-own cocktail bar. If the bride-to-be is stressed out, consider a spa day or a less expensive at-home self-care day that includes pedicures, facials, and yummy smoothies. For a movie buff, choose a film-inspired shower that includes champagne, popcorn, and several great movies.   ", " Choose colors or a décor style as an alternative to a theme. Even if you and the bride decide you don't want to adhere to a theme, designating colors and/or a particular style of décor can help keep your choices focused and coherent. Think of visual styles like shabby chic, rustic/nature, or modern art. If the bride is a French wine enthusiast, consider a French country look for your decorations. When in doubt, choose the colors of the wedding for the shower decorations. Alternatively, you could pick the bride’s favorite color and create your look using different shades of that color with splashes of white mixed in.   ", " Stick to your budget. It is easy to go overboard on spending, especially when the party is for a beloved friend on a special occasion. That’s why it is important to decide on an amount you are comfortable spending on decorations at the outset. Make sure you take into consideration any additional costs: food, alcohol, invitations, catering, or housecleaning just to name a few. It is perfectly acceptable to ask several other guests to co-host with you and share the expense.  Pick one thing that you think the bride would really appreciate and splurge on that. For instance, if the theme is Marie Antoinette, go for it on the tarts and cakes, but commit to keeping other costs down.  Look around your home to see if you already have things that might fit the theme. For example, if you are hosting a Kentucky Derby-themed shower, use your horse-head bookends to decorate the food table or bar.   ", " Make or borrow some of the decorations to save money. Handmade decorations tend to be more personal as well as less expensive. Enlist some of the other guests to get crafty with you. And don't be afraid to reach out and ask for items that you need. You may not have the perfect cupcake platter, but the bride’s best friend from high school might!  Banners, signs, and are great items to make by hand. Have each guest make a flower out of decorative paper with a note on the back. String these together to make the perfect banner for a garden party.  of the bride and groom to glass votive candles to create personalized ambiance and a bonus take-home gift. Stick with a time-honored tradition and of the couple's history together. Get friends and family to donate to your collection of memories.  "], "Adorning the Space": [" Decorate the outside of the location with an eye-catching sign or banner. Outdoor decorations can set the tone for a festive occasion and help guests find the party.  Attach helium balloons to your sign, the mailbox, or the porch for extra visibility. Match the balloon colors to the colors you’ve used to decorate inside. Consider making a sign that fits the theme. If you’ve chosen a film theme, for example, make your sign look like a marquee. A banner on the door could say the bride’s name plus the groom’s name or something simple like “love” or \"amour.\" If the party is at night, consider creating some ambiance with a string of outdoor lights around the door or the sign.  ", " Adorn the walls and ceiling to transform the space. Rely on your theme or the style and colors you’ve chosen to help decide on the mood you want to create. You don’t need to do a complete overhaul of your usual décor. A few well-placed decorations can transform your space. Choose from balloons, streamers, fabric swaths, banners, or theme-specific images. Soften the space with swaths of light or sheer fabric hung from the ceiling with upholstery tacks, tape, or ceiling hooks. For a Roaring Twenties theme, create a festive mood with strands of shimmering beads in the entryway.  ", " Create a gift table that is functional but beautiful. Place the table close to the front door so the guests can set down their gift first thing. Cover the table with a pretty tablecloth that ties into the rest of your décor. Place a sign on the table to let your guests know it is for gifts. Resist the urge to add anything else to the table because it will just get moved!  Use a tall, wire picture holder for your sign so it can still be seen once there are some gifts on the table. Make a banner or sign to designate the gift table. Hang it on the front of the table to save the space for gifts.  ", " Make the food table the party’s centerpiece. Since everyone eventually congregates around the food table, make it the highlight of your shower’s decorations. Splurge on the bride’s favorite flowers to adorn the table. Choose platters of varying heights to make the most of your space and to create an eye-catching composition of the food. Add a framed photograph of the bride and groom. If you are hosting a potluck style shower, plan on re-plating the food so the plates, bowls and platters create a coherent look. Avoid having any commercial jars or packaging on the table. Plating everything will maintain the elegance of the table. Consider a menu board or labels for the food items, especially if your theme is food related. For an English tea party theme, use dainty, old-fashioned floral stationary to make your signs. If the decorations are French country, choose a chalk board to list food items. Choose flowers or candles that are mildly scented. You always want the food to be the star of the olfactory parade!  ", " Create a separate space for drinks and drink-making. A create-your-own-cocktail bar can be a fun addition to the party. You may want to put it in the kitchen and refrain from using a tablecloth, making clean-up easier. Don't forget to include some festive non-alcoholic options for the non-drinkers. Soda water mixed with cranberry juice or fresh-squeezed grapefruit juice look good and taste good. Drinks can also be tied into a theme. If you are having a inspired party, serve prohibition-era cocktails.  ", " Decorate a chair for the bride-to-be. Have fun creating a throne for her to sit on while she is opening her gifts. Make a sign or banner that says her name or simply “bride-to-be.” Provide a tiara, flower crown, or traditional veil for her to wear while she is opening her gifts.  Don’t forget the practical items that gift opening can require: several pairs of scissors, a trash bag for discarded wrapping paper, and tissues. As hostess of the party, count on providing yourself with a notebook and pen so you can jot down who gave what so the bride can send out thank you notes later.   ", " Make or buy take-home party favors for your guests. Choose a small, inexpensive memento that ties into the theme or mood of your shower. The best take-home gifts from a shower evoke memories of the day. Avoid kitschy gifts that will likely be thrown away and add a personalized decorative touch to store-bought items. For a spa-themed party, send your guests home with a pouch of herb and flower scented bath salt, a scented votive candle, and/or a beautiful bar of fragrant soap. Consider creating mini-bouquets out of the party’s floral arrangements. Purchase mini-vases and send each guest home with fresh flowers. If the shower was a brunch time event, send guests home with a selection of gourmet teas and coffees.  "]}}, "How to Throw a Couple's Wedding Shower": {"description": "Having a couple’s wedding shower, where the bride and groom are both honored at the same shower, has become a popular trend. A couple’s wedding shower allows the soon to be married pair to celebrate with friends and family together. Both the bride and groom are showered with gifts, get to play games together, and have a chance to socialize with their entire wedding party. To throw a couple’s wedding shower, start by selecting a theme for the shower. Then, prepare for the shower so it goes smoothly and both the bride and the groom have a great time.", "content": {"Choosing a Theme for the Couples Shower": [" Do a beach or pool theme. If the bride and groom like to be outside in the sun, go for a beach or pool theme. If you have access to a pool, plan a pool theme with poolside games and activities. You can also turn the pool into a beach complete with fake sand and beach umbrellas.  You can then have guests bring pool toys, tropical drinks, and their swimsuits for the shower.   ", " Go for a sports theme. If the bride and groom are into sports, go for a theme that focuses on their favorite sport. For example, you may host a basketball themed shower for the couple, complete with bride and groom basketball jerseys and basketball themed decorations. Or you may have a sports shower that features the favorite sport of the groom and the favorite sport of the bride.  A sports theme is a good indoor option for the shower, as you can easily host it in your home with a television playing a sports game in the background and a long table set up with sports themed snacks.  ", " Try a bon voyage theme. If the couple enjoys travel, you may throw them a bon voyage themed shower. This may be a good option if the couple has a honeymoon planned in a far away destination. Decorate the space with images of the couple’s favorite travel spots or their honeymoon destination. Prepare snacks that are from the destination for guests to have during the shower.  Have guests bring travel themed gifts, such as travel supplies. They can also get experience gifts for the couple’s planned honeymoon destination, such as a voucher for dinner at a restaurant in the destination or money for an excursion.  ", " Go for a garden party theme. If you are looking for an outdoor shower theme, try a garden party theme. Host a garden party outside on a sunny afternoon for the couple, complete with high tea and croquet games. This may be a good option if the couple enjoys hanging out outside and the weather is usually nice in your area..  Tell guests to dress up in their favorite garden party attire, such as linen suits or floral dresses. You can also have them bring a light beverage or drink for the party that everyone can sip while they play garden themed games.  "], "Preparing for the Couples Shower": [" Make the guest list. You may work with the bride and groom to create the guest list or make the guest list on your own. Make sure you invite everyone in the bridal party on both sides of the aisle as well as the friends and family of the bride and groom.  You may have a limit on the number of people you invite, based on the size of the space available for the shower. Start with a long list and cut the list down until you hit the maximum number of guests you can accommodate.  ", " Create a budget for the shower. To ensure you can afford the shower, make a budget. Determine if you will be paying for the shower on your own or as part of the overall wedding budget. You may pool your money with the bridal party to pay for the shower. Often, bridal showers are low key and do not cost nearly as much as the actual wedding. You may factor in the rental of the shower space, if applicable, as well as the shower supplies, such as decorations and food costs. You may have a cap on how much you can spend on the couples shower and work to fall within your budget when shopping for the supplies for the shower.  ", " Determine the shower supplies. Make a list of items you will need to decorate the space for the shower. This may include decorations for the walls or for the guest tables as well as seating and tables for the guest. You may also include food, snacks, and drinks as part of the party supplies.  Sit down and create a list of supplies. Then, determine how much you can afford to spend on the supplies based on your budget and cut down the list as needed.  ", " Send out invitations. Send out invitations for the shower at least two to three weeks before the shower date. The earlier you can send out the invitations, the better, especially if you have a lot of people on the guest list for the shower. Try to send invitations to guests who are out of town or who may have to fly into to attend the shower, as they may need more notice to plan their travels. You may online using an online shower design site, or make them on your home computer. You can also order invitations through an online service.  ", " Create a schedule for the shower. To ensure the shower runs smoothly, draw up a rough schedule for the shower so you are organized. Break down the shower by hour and block off time for each activity. Keep the schedule on hand during the shower so you stay organized and the shower runs smoothly. For example, you may start the shower with a get to know you activity, followed by toasts for the bride and groom, and then the opening of the shower gifts. You may then end the shower with a final activity and the distribution of the goodie bags.  "], "Throwing a Good Couples Shower": [" Set up early. Reduce stress on shower day by setting up the space early. Ask people in the wedding party to help you set up. Delegate tasks to others so the space is ready for the shower before the guests arrive.  For example, you may have a few people tackle putting up the decorations while someone else prepares the snacks and drinks.  ", " Do toasts. It is traditional that the host or hostess gives a toast during the shower. You may have one toast for the groom and one toast for the bride, or do a couples toast. You can also do a roast of the bride and the groom as part of the toast, especially if they are fun-loving and good humored.  You may also ask certain guests to give toasts during the shower, such as short anecdotes about the bride or the groom. The shower is also a good opportunity for those who are not doing toasts at the rehearsal dinner or the wedding to get their moment at the podium during the shower.  ", " Play games. Have games ready so everyone has something to do and can interact with each other. You may set up a games area outdoors so everyone can try different games. Or you may announce games time during the shower and instruct everyone on which games will be played.  Easy, fun games like charades are often fun. You may organize teams based on the bride’s side and the groom’s side of the wedding party. You can also organize games that fit the theme of the shower, such as lawn bowling for a garden party theme or a sports trivia guessing game for a sports theme.  ", " Have the couple open the shower gifts together. Usually at bridal showers, there is time set aside for opening gifts. Have the couple open the shower gifts together as part of the shower. Arrange a table and chairs for the bride and groom so they can open each gift in front of everyone.  You may organize the gifts based on whether they are for the bride or the groom. Or you may put joint gifts together so the couple can open them together.  ", " Hand out keepsakes at the end of the shower. Often at the end of bridal showers, it is tradition to hand out keepsakes or goodie bags. You may create keepsakes that recognize the couple and that include both the bride and the groom. Or you may make goodie bags to reflect the couple, rather than just the bride or the groom.  For example, you may get custom sugar cookies made with the names of the bride and groom for the goodie bags. Or you may design t-shirts or mugs with the couples’ faces on them as keepsakes from the shower for the guests.  "]}}, "How to Know Who to Include in a Wedding Shower": {"description": "Wedding showers have been around forever and originally stemmed from dowry practices: if a woman couldn’t afford a dowry, her family and friends often rallied around her to provide gifts to help get her marriage started off on the right foot. These days, wedding showers are an excuse to celebrate the bride and get excited for the big day.", "content": {"Prepping a Guest List for a Bridal Shower": [" Check the wedding invite list. The first thing to do when planning a bridal shower is to consult the official guest list for the wedding. One of the biggest faux pas people make when planning a bridal shower is inviting people who are not already invited to the wedding.  Showers generally consist of people getting excited for the wedding, so inviting people to the shower and not the wedding will make them feel both excluded and uncomfortable. Showers are also centered around receiving and opening gifts, so inviting guests who are not invited to the wedding sometimes comes off as a gift grab.   ", " Invite the bride’s attendants. The bride’s maid of honor and bridesmaids are oftentimes some of her closest friends and relatives, so it’s important that they are included in the shower. Invite all female attendants, even the ones who live out of town.  Attendants who live out of town may not be able to make it, but it’s still considered good etiquette to include them. Make sure to include the flower girl and anyone else who might be playing a role in the ceremony. Ask the bride for a complete list of all her attendants to make sure you don’t accidentally overlook someone.  ", " Invite the bride’s closest friends. Ask the bride to make a list of her closest friends, outside her bridal party. These are the women who should be included in the bridal shower. If the bride is having trouble narrowing this down, ask her to go through the list and point out her best friend(s) from growing up, her closest friends from college and her current group of closest friends.  You should not invite every female on the wedding guest list, so feel free to be picky in selecting the friends invited to the shower. Choose whether or not you want to invite close friends who live out of state. It’s a nice gesture to do so, but they may feel compelled to send a gift, even if they can’t attend, which might make them feel put on the spot.  ", " Invite local relatives. If there are any female family members who live close to where the shower is being held, feel free to invite them as well. This can include mothers and stepmothers on both sides, grandmothers on both sides and close female aunts and cousins on both sides.  Do not go overboard with the relatives. Aim to keep your guest list below 35 people, tops.  Don’t double up on invites. Sometimes, different groups of people throw different showers for the bride; for instance, the bride might get a family shower and a shower held by close friends. Avoid overlap between the guest lists, as this just puts more pressure on guests to spend more money and buy more gifts.   ", " Invite the bride. Unless the shower is a surprise, make sure you invite the bride. And if the shower is a surprise, make sure you save an invitation and give it to her later; she’ll appreciate the thought and the souvenir of the special day.  If the shower is a surprise, make sure that is clearly communicated on the invitations. You don’t want someone accidentally spoiling the day! Depending on the shower and who is throwing it, you may also choose to invite the groom. If you do choose to do this, stagger the groom’s arrival so he shows up after the party is well underway.   "], "Prepping a Guest List for a Couples Shower": [" Invite both the bride's and groom’s attendants. Couples showers are co-ed, so you’ll need to invite all the attendants across both sides of the aisle. This should include the maid of honor, best man, bridesmaids and groomsmen, flower girl and ring bearer, any readers or ushers or any additional positions that have been assigned.  If the person officiating the wedding is a close friend of the bride and/or groom, invite them as well. Feel free to invite out of town attendants, but be aware they may not come.  ", " Invite close friends of both the bride and groom. Similar to a traditional bridal shower, you’ll want to invite those who are closest to the couple, without going overboard. Just because you’re celebrating both the bride and groom, doesn’t mean the shower should be twice as big.  Make sure guests know ahead of time that the shower is co-ed so they aren’t caught off guard. Do not invite the bride or groom’s work friends, unless the relationship is especially close.  ", " Decide if you want to invite local relatives. Couples showers are generally far less traditional than the typical bridal shower, and some older relatives may not be comfortable with that. Choose whether or not you want to include local relatives, but know that you are not required to do so.  At the very least, invite parents and siblings on both sides. If your list of attendants skews more towards family, you might want to err on the side of inviting more family, so no one feels excluded.  ", " Invite the bride and groom. Oftentimes, couples showers are planned by the couple themselves, but if you're planning the shower for them, don't forget to include them when you send out invitations. Some planners prefer to use different invites for the men and women. This is not necessary, but it is a nice touch if you're so inclined. If the shower is a surprise for the couple, do not send the invite in advance. Save it and present it to them at or after the shower as a keepsake.  "], "Prepping for an Office Shower": [" Invite the bride’s friends. Office showers are a little tricky because there’s no clear cut rules for whom you should invite. Depending on who is throwing the shower, you may want to keep it small and invite only the bride’s closest colleagues.  If the bride has worked at the office for a long time, try reaching out to former co-workers who have already left, who the bride has strong relationships with. If the bride has good ties to vendors or other partners of that company, consider inviting those people as well.  ", " Invite the bride’s team. If the bride’s boss or a member of her work team is throwing the shower, invite everyone else on that team as well. Make the shower into a team bonding experience and make sure everyone feels included.  Make sure the team goes in on one gift, so nobody feels obligated to buy something independently. If the shower is being held off-site, consider inviting the groom to show up half-way through the event.  ", " Invite the whole office. If the bride has worked at the company for a long time or holds a very visible position, consider making the invite open to everyone. This way, no one feels excluded, but no one feels coerced into attending either.  If the office is springing for a gift, make sure people are aware they are not required to contribute. This can be awkward for people who don’t know the bride well. Office showers do not need to be restricted just to people who are attending the wedding. Many co-workers will not be invited to the wedding, but should still be included on the shower guest list.  "]}}, "How to Throw a Surprise Bridal Shower": {"description": "Your best girlfriend is getting married, and you want to do something special for her. She may have protested against having a bridal shower, but you know that she really wants one. She just doesn’t want you to go through all the hassle of planning and throwing it. So, you’re doing this bridal shower under the radar. In this day and age, however, it’s hard to keep a secret. The question becomes how do you throw a surprise bridal shower without the bride-to-be knowing about it?", "content": {"Steps": [" Get Everyone on Board. Select a date when all the important people can make it, including the bride-to-be. So, know everyone’s availability and plan accordingly.  ", " Fool the Bride-to-be. You love your girlfriend, but it will be to her own advantage if you lie to her in this situation. Your friend will figure out that you’re planning a party no matter how hard you try to hide it (or no matter how many people on Facebook you tell not to say anything). So, tell her it’s a party – just don’t say that it’s a bridal shower party. Make up a birthday, anniversary, going-away, etc. party. ", " Order a Rental Projector. A rental projector is the perfect way to showcase home videos or collages of photos of the bride- and groom-to-be. Order the rental projector as soon as you know the date of the bridal shower. This way, you’ll ensure that the company has one reserved for you and that it gets to your house on time. ", " Get the Groom-to-be Involved. The groom-to-be is the perfect person to help you plan the bridal shower. He’ll have those sought-after pictures that you want for your rental projector collage. Plus, he’ll be in on the conspiracy to help you avoid having the bride-to-be find out about the bridal shower. ", " Make Sure Everyone is Early. Regular party guests should have an earlier invite time than the bride-to-be. Make it at least 1 to 2 hours earlier since you know that most people are going to be late. This shouldn’t be too much of a problem since your guest of honor still thinks she’s going to some type of party. Everyone, however, will want to see her face when she walks in. While everybody's waiting have them help put together some quick to set the mood.  ", " Capture those Memories. Have all the cameras and video cameras ready for when the happy couple walk through the door, and capture as many memories of the day as possible. You can always use these for your next projector collage, for example, their first anniversary party. "]}}, "How to Throw a Wedding Shower": {"description": "When wedding bells are ringing, the time for a wedding shower is nigh. Whether those bells are for you, a good friend, or a relative, one of the fun lead-up events to a wedding is the bridal shower. Here are a few tips to throwing a great one.", "content": {"3 Months Before": [" Check to see if the coast is clear. No, you're not sneaking out of the house; you're checking with the bride's friends and family to see if a shower is already planned. It isn't a good idea to throw two parties if the same people will be at both! Consider these possibilities: If you are the bride-to-be's co-worker and would like to throw an bridal shower, you're less likely to run into interference. If you're the bride's mother, feel free to plan a shower for your daughter; however, be aware that in some parts of the world it is considered to be general wedding etiquette that the bride's mother does not plan a bridal shower as it is thought better left to others to plan and that it lacks taste to have the mother doing this. Note, however, that more people are ignoring this little \"rule\" and doing it anyway. It's up to your discretion.   ", " Talk to the bride. That is, if you don't want a shower that's a complete surprise. With all the general fuss of a wedding, it may be best to talk to the bride, though. You want to avoid inviting people to the shower who aren't invited to the reception and you want to make sure the shower is in line with the bride-to-be's wishes. Does she want a co-ed shower? What dates and times are best for her? Where would she want it at? If you like the idea of the bride being minimally involved, just ask about the guest list and date -- she probably figures she's having a shower anyway. The theme and details can be up to you and the rest of the bridesmaids or close family.  ", " Choose a location. Now comes the best part! Whether it's the beach , a restaurant, or fancy hotel, the location of the shower can change everything. If you do decide to go with a specific theme, your location should reflect this. You probably wouldn't want to bring the bride's elderly aunts to a smoke-filled bar and grill. Sometimes the shower is held at a relatives' home, or the maid of honor's, or even the bride's place. Consider a nice area, a yacht, or a bonfire/cookout in the backyard. Your location should match both the bride's personality and your budget.  ", " Decide on a date. Traditionally, the wedding shower isn't held until a month before the wedding, but these days people are less inclined to follow this norm and choose a date to suit their own needs. Just be sure that the couple has had the opportunity to tell everyone about the wedding first. You don't want to step on anyone's toes! Make sure that all the necessary people will be available for this day. Once you have found a day that works for everyone, call the venue, if you're not having it at someone's home, to make reservations.  ", " Compile the guest list. Ask for some names from the bride herself, as well as from the mother of the bride. If another shower is being planned, try not to invite those same people to yours. It's ridiculous to expect someone to buy two -— and sometimes even three -— gifts for one person! Also, beware of inviting those who aren't also invited to the wedding itself. Just because you the bride was still friends with Laura from second grade, does not mean that she is. You will only offend people if you're not careful.  "], "2 Months Before": ["Send a preliminary \"save the date\" email and/or call important guests. This does not serve as the invitation -- it just lets everyone know the plan well ahead of time (those coming from distant lands will appreciate it). Contact guests you know the bride there -- her best friend for college, favorite extended family, and females from the groom's side to see if they all can make your date. As you're doing this, compile a list of addresses to send the real invitations out to. In your email, request their information if you don't already have it.  ", " Pick a theme. It will help direct both the mood of the shower party and can even impact the gifts. Consider a classic \"Round the Clock\" shower, where every guest gets a certain time of day to buy their gift for. Those with 7 a.m. could give the bride breakfast items, whereas those with 6 p.m. may gift the couple with dinner plates and napkins. Another idea is to have a location theme: Hawaiian, French, Chinese, or Spanish works well. Or, tailor your theme to the location: if the shower is at the beach, an obvious choice is to have a luau or theme. Choose a theme. Ask that guests not bring gifts but donate money to charity instead. This in consideration of the reality that you will receive wedding gifts anyway and a shower seeking gifts is akin to double dipping and can irritate potential wedding guests.  ", " Set a budget . Bridal showers can run from the very inexpensive to the extremely pricey, depending on your location and number of guests. Enlist a few of the bride's friends to help plan (and pay!) for the shower. Be sensible, however, as most of the money should go to the wedding and reception and not be eaten up by a wedding shower party. If you're a bridesmaid or maid of honor, consider asking all the girls to pitch in. A group effort will not only lessen the limits of your purse strings, but it will also help the shower itself run much more smoothly. Get together with the girls to decide on the decorations, menu, party favors, flowers, activities and the like. Give each person a specific to-do list to make all the duties manageable. If any of the team has connections (or is particularly crafty), the details can be sorted out. You don't necessarily need a theme now, but knowing what is and is not reasonable will help lessen the burden on your shoulders.  ", " Purchase the invitations and order special menu items, if applicable. The invitations do not have to be store-bought or otherwise ordered -- you can make them yourself! wikiHow has a plethora of sources for this! Often personalized, hand-made invites are even more meaningful. Once you've gotten the invitations taken care of, think about special items you'd like for the shower. Do you have to rent any equipment? Get anything intricately designed? Some companies may ask you give them 8 weeks to complete your order.  "], "1 Month Before": [" Assemble, address, and mail the invitations. Include information about the couple's registries and, if it's a theme party, make sure to provide proper gift-giving instructions. Give your contact information for those that have questions. You may want to include an ending time. Some people will be more won't to come if they know their entire day won't be taken up by watching an old acquaintance open gift after gift after gift.  ", " Shop for decorations, dining ware, and other party necessities. After all, what's a theme without decorations? If you're throwing a beach-themed shower, pick up some tiki torches, palm trees, and grass skirts. Balloons, crepe paper streamers, banners, table centerpieces, plates -- the list of available items goes on and on. Abandoning the feel of the shower entirely is also a legitimate option. If you know the bride would be totally turned off by an hour of opening presents and drowning in crepe paper, dedicate the afternoon to a wine tasting or a spa treatment. As long as friends are relaxing and having a good time, success will be had.  ", " Decide on a menu. Bridal showers have been known to produce quite a few tears as well as laughter , both of which make for some hungry tummies.  Keep the time of your party in mind when creating your menu; a morning shower would be perfect for a brunch. Some food ideas for your shower: finger sandwiches, cookies, cold salads, veggies and dip, , crackers and cheese, etc.  If guests have offered to bring desserts and other treats, call to confirm what they plan to bring -- adjust your recipe plans accordingly.  ", " Plan some games. Silly games are essential to any good, traditional shower. The naughtier, the better! Try one of these:  Before the party, sit down with the groom and ask him a list of questions, preferably ones the bride may not know. Then, at the party, pass the questions around the room, having each guest ask the bride one. If she gets it wrong, she must stuff a piece of bubble gum in her mouth. Her answers will become so messy, you'll have the whole room laughing.  If the mother of the bride or groom is present, take caution (depending on her personality).  Before the party, obtain a picture of the groom. Buy balloons. Also gather photos of sexy, hunky men. Roll the pictures up tight and tie with a ribbon or rubber band. Stuff one into each balloon and blow up. At the party, each woman has to grab a balloon and pop it. Whoever gets the hunk—the groom—wins a prize!  Don't go into overkill. The gals (and maybe guys?) will be totally content eating, drinking, and being merry.  ", " Pick up some favors. Speaking of bridal shower games, you may want to reward your loyal jesters with a gift. Make up little gift bags and place small trinkets inside. Shop the dollar stores if you have to: photo albums, picture frames, fancy pens, coffee mugs, dish towel sets, candles, and nail polish will all do the trick. It’s the hostess’s job to send all the party-goers home with a little favor. Make sure your favor is small but meaningful and tie it in with the theme of your party as best you can.  "], "2 Weeks Before": [" Take care of the basic details. Place your flower order (if desired) and pick up any goods friends or neighbors have offered to lend -- CDs? Baskets? Cake dishes or punch bowls? Tea trays? Sound equipment? A pre-rolled red carpet? Make a grocery list for the food and drinks. Buy any hard-to-find ingredients now in case you foresee having any trouble. Grab the alcohol now, too, if you're having cocktails.  ", " Buy your gift for the bride. As long as it's meaningful, it doesn't have to be large -- especially since you're throwing her the dang party! If she's a bit on the OCD side, ask the other bridesmaids and attendants what they've gotten her. They may have valuable input or you could join forces to purchase a larger gift. You could always offer to pay for part of the honeymoon! Hey, that's one less gift to open in the stream of gifts that will dominate (and possibly put the snooze button on) the party.  ", " Pick out your outfit. Finally, a moment for you! Since you're the hostess, you have to look good, too! Here's the excuse to buy that new dress you've been looking at. "], "The Days Before": [" Confirm, confirm, confirm. Hope you can take a break from your day job, because you'll need to spend a hefty amount of time making phone calls. But once it's done, it's done! Lock yourself in the living room with a list of phone numbers and get on it. Confirm reservations. If you're not using an outside venue, skip this. Confirm orders and delivery times. This goes for flowers, friends taking care of pick-ups, food, and equipment. Confirm RSVPs. This is possibly the most important. Call the guest list to make sure your numbers are correct and the bodies you have to help this go off without a hitch.  ", " Create a mental floor plan. You may think one table is enough for gifts, but 28 blender-sized boxes ends up taking a large amount of room. Consider the guests, the space needed for activities, and how to arrange the flowers, decorations and food. Have the games fully prepared before you go about designating space for them.  ", " Buy any last-minute groceries and do the prep work. If you can prepare anything beforehand, do so. You'll need to allot your time masterfully. As the clock ticks, get the other bridesmaids or family members to help you get going. ", " Set up the equipment and decorations, and assemble the favors. Set up the tables and chairs according to your floor plan. Have everything as ready as possible before the actual time. Once you do, . Is there anything you've forgotten? Take these last hours to run any errands. Has anyone forgotten to bring or pick up anything that they said they would? If a friend is free, can they run the errands for you?  "], "When The Day Arrives": [" Stay organized . The day of the party, keep a checklist in hand and designate others to help. If you have extensive decorating to do, arrive at your location bright and early. Remember all your items and remember to pick up your balloons and the cake as well. Keep your phone on you! Businesses or friends may be calling for directions or other questions.  ", " Think of the outside. If people are coming to an area you are unfamiliar with, you may want to put balloons on the mailbox or little arrows along a walk. Or you may have to end up sending someone outside to flag wanderers down! If you're doing it at a public place, ask what signage you can post and where to assist your guests in finding the appropriate area.  ", " Be a good assistant. When the bride opens her gifts, have a pen and paper handy. Sit next to her and write the name of the person who gives her each gift. This will be a huge help to the bride when she writes her \"thank you\" notes. In fact, many brides can't thank anyone without this list! ", " Help clean up. Don't leave your location dirty after the party. Even if the party was thrown at the beach or a picnic area, you still need to pick up your mess. Send the bride home with the leftover cake and be sure the women have their favors. Hopefully a few other people will be kind enough to help. "]}}, "How to Make a Wedding Shower Towel Cake": {"description": "This will cost you a few dollars and an hour or so of your time.  It will draw raves from the bride to be and all of the shower attendees.", "content": {"Steps": [" Take note of the Things You'll Need, as shown below.   ", " Lay the bath towels out with ends slightly overlapped . Pin towels together and fold to a six inch width.  Roll towels into a tight coil.  You can roll the towels around an empty paper towel tube to add some stability.  Fold the end of each coil under and pin closed.  Ribbons can hide pins. ", " Repeat step 1 with the hand towels (other directions use 2 hand towels, but 3 makes a more realistic looking layer. ) ", " Repeat step one with the wash cloths.  ", " Spray a pizza pan white to use as a base for this cake but you can use a cake stand if you prefer.  ", " The next step is to decorate the cake. Here is where the fun begins.  Give your imagination free rein. ", " Arrange the flowers around the bottom of each layer. Take one or two flowers apart and spread them over the cake. ", " Then attach the pearls and use them to create a scalloped look from the top of each layer. Take a tiny stitch to anchor the top of each loop.  Narrow lace can be used here.  Attach a wedding ring to the center of each loop. ", " How should you top your towel cake creation? A traditional bride and groom, gloves, a bell or you can get creative.  A single large flower or a mound of smaller ones also work well.   A hand towel fan with pearls attached looks wonderful.  A large bath puff looks great here.   Dangle strings of pearls from the puff. ", " If the bride has chosen a rectangular cake you can still use this cake or you can wrap cardboard boxes or foam blocks like gift boxes then stack and decorate.  ", " Striped towels when rolled will give the appearance of horizontal striped icing, which is unique.  ", " use kitchen linen cakes for housewarming gifts but have also made them for showers.  ", " You may be surprised to find your friends or the shower guests asking you to make one of these exquisite shower cakes for a party they are attending or asking for the instructions how to make wedding shower towel cake.  "]}}, "How to Plan a Backyard Barbecue Wedding Shower": {"description": "Planning a wedding shower is always a challenge, but when you're in charge of a backyard barbecue style event, it can be even more difficult. In addition to ensuring that you have enough space in the yard to accommodate all of the guests, you must come up with a plan in case it rains. Planning the barbecue menu and coordinating all of the time necessary to grill the food is also key for a successful shower. But you can't forget all of the details that are required for any well-done wedding shower, such as the desserts, decorations, and personal touches that celebrate the happy couple.", "content": {"Arranging the Yard": [" Evaluate the size of the backyard. Before you can plan the layout for your wedding shower, it’s important to determine how much space is available in the yard. In a smaller yard, it may be easier to set up one large table for all of the guests. In a larger yard, you may prefer to set up several smaller tables throughout the space for guests.  In addition to the table(s) for guests, you may want to include a table for the gifts and one for the cake or desserts. At a backyard wedding shower, it’s also a good idea to set up a so guests can help themselves to cocktails and other beverages. You can use a table or a kitchen cart depending on the size of the yard. It’s also important to make sure that there’s enough room for the grill at a barbecue wedding shower. Verify that there will be enough space around it for the cook(s) to work comfortably.   ", " Add adequate seating. In addition to tables where guests can eat, you’ll want to include some other seating options so guests can mingle throughout the shower. Simple benches work well, as do folding lawn chairs.  More formal outdoor furniture, such as a wicker chair or loveseat, is also a nice option. If you want the barbecue shower to have an informal, picnic-like feel, lay down some blankets in the grass and add large pillows or cushions for guests to sit on.  ", " Consider adding umbrellas or other sun covers. Depending on the time of day that you hold the shower and how shady the yard is, you may want to consider adding some type of sun coverings to protect guests from the harsh rays. Simple outdoor umbrellas work well, but you can also purchase small portable tents that you can place in extremely sunny areas in the yard.  If the yard has no shade at all and you’re holding the shower in the middle of the day, you may want to rent a large tent to cover the entire area. Make sure that the areas where you plan to keep the food and beverages are properly shielded too. Food can spoil more quickly when left out in the hot sun.  ", " Create a backup plan for inclement weather. Hopefully, you’ll have beautiful weather on the day of the shower, but it’s important to plan for poor weather just in case. Moving the shower indoors in the event that it rains is usually the easiest option if your house is large enough.  A large rented tent can be an effective option if you want to hold the shower rain or shine. You may decide that you want to postpone if the weather is bad. If that’s the case, list the backup date on the invitation so friends and family can keep that day and time available too -- and set a specific time for when you’ll decide to cancel the event, such as the night before or the morning of.  "], "Planning the Menu": [" Consider having the event catered. Barbecuing food can be a time consuming process because you have to stand over the grill to ensure that the food doesn’t burn. You may want to hire caterers to handle the barbecuing so you can enjoy time with your guests and the guest(s) of honor.  Many catering companies or barbecue restaurants are equipped to handle barbecues. They will supply the food, and in most cases, the grill equipment, so you only have to worry about having the room to accommodate them. Catering the shower will obviously cost more than preparing the barbecue yourself, so it’s not the best option if you’re on a budget. If you don’t want to pay extra for catering, consider asking a friend or family member who isn’t on the guest list to help with the grilling.  ", " Arrange the food buffet-style. No matter what type of shower you’re hosting, it’s usually easier to serve the food buffet-style. However, at a backyard barbecue event, it’s an especially good idea because serving guests one by one takes a long time. Set up a table or two to place the food, plates, and cutlery on, and allow the guests to help themselves.  If you’re concerned about the food from the grill getting cold, use chafing dishes to keep the dishes warm. You can find chafing dishes, racks, and fuel at any party supply store.  ", " Keep the hors d'oeuvres simple. Because barbecuing the main course will take some time, it’s best to choose simple hors d’oeuvres or appetizers that don’t require much -- or any -- cooking time. For example, simple skewers with fresh vegetables, fruit, and cheese can be a tasty appetizer that you can prepare ahead of time. Your favorite dip or spread with an assortment of crackers or breadsticks also works well.  Make a simple antipasto platter with fresh cheeses, salami, olives, and roasted red peppers, and serve it with crackers or bread. If you want hot appetizers, consider making a couple of pizzas that you can cook right on the grill. Add your favorite toppings, and cut them into bite size pieces for guests to enjoy.  ", " Go for “fancier” barbecue options. Instead of the usual barbecue fare of burgers and hotdogs, opt for more sophisticated dishes, such as barbecued chicken, steak, brisket, or seafood. Kabobs that alternate meat with vegetables are ideal options too. If you’re going for a more casual shower and the guest of honor is a fan, you might even consider barbecuing some ribs.  Any grilled meat dish can be simple but delicious if you find the right marinade. Search online for some recipes that the guest(s) of honor is sure to enjoy. Make sure to have a vegetarian option on hand. Grilled vegetable skewers are usually the easiest way to go, but you can also grill whole portobello mushrooms to serve as “steaks.” Tofu steaks are another option.  ", " Consider buying pre-made sides. Because grilling the meat or other main course will require most of your attention, you may want to get some help with the side dishes. Visit your local grocery store or deli to purchase premade sides that are traditionally served at  barbecues, such as coleslaw, potato salad, or pasta salad, so you don’t have to worry about making them yourself.  If you want to make the side dishes yourself, prepare them the day before so you don’t have to worry about finishing them when you’re manning the grill. If you want to have some warm sides, think about options that you can easily toss on the grill so you don’t have to run inside to the kitchen. Grilled corn is a classic barbecue side, as are grilled potatoes.  ", " Make a signature cocktail with iced tea or lemonade. It’s always fun to choose a signature cocktail for a wedding shower -- and rename it to celebrate the guest(s) of honor. Keep up the barbecue theme by choosing an iced tea- or lemonade-based option. Make sure to have a non-alcoholic option available as well, though.  If you want the guests to mix their own cocktails, make sure to print out instructions and leave them at the drink station where they’re easily accessible. You can get the best of both worlds by making an Arnold Palmer, which is a mixture of lemonade and iced tea, and adding your favorite spirit, such as bourbon or vodka. Mix up a batch without the alcohol too.  ", " Substitute pie for the usual cake. You’ll want a special dessert to celebrate the guest(s) of honor’s upcoming wedding, but it doesn’t necessarily have to be a cake. Consider playing up the fun barbecue theme by opting for a pie instead. You can go classic with a cherry or apple pie, but it’s best to choose the guest(s) of honor’s favorite.  If you prefer a cake for the shower, you may also want to make mini pies for the dessert table. Heart-shaped hand pies are an ideal option. If the guest(s) of honor isn’t a fan of pies, cupcakes are another sweet option for a barbecue wedding shower. Make a large display of them to present to the guest(s) of honor, and then serve an individual cupcake to each guest. Cookies are another delicious option for the dessert table. Sugar or butter cookies with the guest(s) of honor’s monogram(s) in icing can be a fun touch.  "], "Decorating the Yard": [" Decide whether you want a theme for the shower. You may have decided that the barbecue aspect is the theme of the shower, but you don’t necessarily have to decorate with that look in mind. If the guest(s) of honor has a particular interest that you want to emphasize, incorporate that into the shower’s decor.  A tropical or luau theme can be fun for a backyard barbecue shower.  ", " Create an entrance. To make the backyard shower feel special, it helps to create a defined entrance to the party. You might decorate an arbor or trellis with balloons or flowers, or place a wooden sign with the guest(s) of honor’s name in the ground at the backyard gate to help welcome guests.  Even placing simple potted plants or flowers in an arrangement at the gate can help create a defined entrance for the shower.  ", " Use gingham that fits the wedding’s color palette. To play up the barbecue or picnic feel of the shower, gingham tablecloths and napkins are an ideal option. Customize the look to the event that you’re celebrating, though, by using gingham in a shade that corresponds to the couple’s wedding color palette.  If you want to fully recreate the wedding’s color scheme, incorporate solid pops of the other shades in the palette for the shower decor through plates, cups, balloons, and other small touches.  ", " Opt for simple floral arrangements. With a shower that takes place outdoors, you want to take advantage of the lovely scenery in the yard. Large, ornate floral arrangements aren’t necessary if there is greenery and flowers in the yard. Instead, gather simple bunches of flowers that you can place in small jars or vases on the tables throughout the shower.  For the most elegant, cohesive look, choose flowers that are similar to those growing in the yard.  ", " Add some mood lighting. If you’re holding your backyard barbecue shower in the evening or at night, you’ll need some lighting. Wind strings of twinkling lights through the trees and bushes, or hang them over the area where you’ve set up the tables. Paper lanterns can also add color and light to the event.  For a simple, elegant look, white string lights are the best option. If you prefer a most festive feel for the shower, choose multicolored or colored string lights. Candlelight is also effective mood lighting. Scatter votive candles on the tables throughout the yard.  ", " Incorporate personal touches. To make any shower special, you should include items that celebrate the happy couple. Place photos of them on the gift or dessert table or hang monogram letters on a fence or wall to make the shower feel more personal.  Create a fun garland from photos of the couple by using small clothespins to attach the pictures to ribbon or twine. String the garland across the yard or in specific areas, such as over the dessert table.  "]}}, "How to Choose Bridal Shower Favors": {"description": "At bridal showers, it is tradition for the host to hand out party favors to guests to thank them for coming to the shower. Selecting bridal shower favors can be a daunting task, especially if you want to choose gifts that will be meaningful and fun for everyone in attendance. You can choose bridal shower favors by theme or based on your budget. You may also decide to create custom bridal shower favors for everyone in attendance for a more personal touch.", "content": {"Selecting Bridal Shower Favors by Theme": [" Go for color themed favors. If you are having a bridal shower that has a theme based around a color, such as the bride's favorite color, have favors that match this theme. For example, if the theme of the shower is pink, you may create pink shower favors like a pink candy bag or a pink candle set. Having the favors match the theme of the shower can make it feel cohesive and well put together.  You may try setting a budget around the favor and then looking for items in a certain color for the bridal shower favor. For example, you may have a budget of $10 for each favor and go from there.   ", " Opt for beauty themed favors. If you are having a bridal shower that is all about pampering and relaxing for your guests, have beauty themed favors as well. Go for a manicure set for each guest as a favor or a basket of face masks as favors. Put calming candles in gift bags as favors.  You could also have the guests take home the nail polish they used on their manicures or pedicures during the shower as favors.  ", " Choose holiday themed favors. If you are having a holiday themed bridal shower, holiday themed favors may be the way to go. Perhaps you give everyone a Christmas ornament as a favor for a Christmas themed bridal shower. Or maybe you give everyone a decorated Easter egg as a favor for an Easter themed bridal shower.  You can make the holiday themed favors more personal by writing the names of each guest on them or by writing the names of the bride and groom.  ", " Go for alcohol themed favors. If you are hosting a bridal shower that is focused on the bride's favorite drink, such as wine or cocktails, give out alcohol themed favors. Perhaps you have small bottles of wine as favors for the guests or a cocktail making kit for the guests.  If there are guests who are not drinking, you may create separate favors for them that are virgin so they can still enjoy their favors with everyone else.  ", " Match the bridal shower theme to the wedding theme. If the wedding has a clear theme, match the bridal shower to that theme so it feels more unified. You may then create shower favors based on a unified wedding and bridal shower theme. For example, the wedding theme may be “spring.” You could then use this as the theme for the bridal shower and get favors that conjure up “spring,” such as small fresh flower displays or soaps that smell like spring. If you are not sure how to match the bridal shower theme to the wedding theme, you may ask friends and family for advice. Talk to friends who have gone to showers in the past or . Ask them, \"How did you find bridal shower favors to go with the wedding theme?  "], "Choosing Bridal Shower Favors Based on Budget": [" Spend more on the favors if you have a large budget. You can also choose bridal shower favors based on your budget and how much you can afford to spend on the shower overall. If you have a large budget for the shower, you may spend more on the favors. If you have only a few quests total at the shower, you may be able to spend more on the favors. Make sure you shop for the favors with a budget in mind so you do not overspend. For example, if you have a budget of $20-$30 per a favor, you may go for high end favors or more expensive favors. Typically, the host can spend anywhere from $5-$20 on each favor, depending on their budget.  ", " Splurge on the favors and save money elsewhere. You can also cut back on the other expenses for the bridal shower so you can afford to buy more expensive favors for each guest. Perhaps you make the food for the shower yourself rather than cater it to save money. Or maybe you host the shower at your home so you don't spend money on the venue for the shower. This can then free you up to splurge on the bridal shower favors.  You may write out your budget for the bridal shower and determine where you can cut back or save money. You can then go shopping for the favors with the leftover funds.  ", " Make the favors yourself. If you have a tight budget for the bridal shower favors, try making them yourself, DIY style. This may be a good option if you are crafty and enjoy making small gifts for others. Doing this will also allow you to get creative and put some extra care into each favor. It will make the favors feel more personal as well.  For example, you may or and package them in nice jars to give as favors. Or you may or other baked goods to give as favors.  "], "Going for Personalized Bridal Shower Favors": [" Order personalized favors. A big trend in bridal shower favors is going for gifts that have been personalized. This means the names of the bride and groom and/or the name of the guest appear on the favors. You can order personalized wine glasses or cocktail glasses online. Or you can make the personalized glasses yourself using markers and stencils.  You can also order personalized chocolate and candies as favors, which will feature the name of the bride and groom on them.  ", " Make personalized shirts for the guests. You can also make the favors more personal by spending time making personalized t-shirts for each shower guest. You may write the person's name on the t-shirts and include a photo of the bride. Or you may have a funny saying on the shirts that reflect the theme of the shower.  This may be a good option if you want to save money but still want to give your guests a favor that feels personal and just for them.  ", " Create photo collages as favors. Another personal bridal shower favor could be a collection of photographs of the bride and their guests. You may put the collages together beforehand to showcase all the fun times the bride has had with the guests at the shower. Or you may take pictures at the bridal shower and send each guest a photo collage as a favor in the mail or online. It may also be fun to have a Polaroid camera set up at the bridal shower, where guests can take pictures with the bride and other guests. They can then take the Polaroid photos home as favors from the shower.  "]}}, "How to Choose Wedding Shower Games": {"description": "A wedding shower is the perfect moment to play entertaining games, learn more about those attending, and even bond with guests. If you're planning a wedding shower, you can personalize the experience through the games you choose. Try crafting games that reflect the personality and history of the couple. Or play some classic games and put a nuptial twist on them!", "content": {"Playing Wedding-Themed Games": [" Play wedding shower bingo. Create and print grids of 16 squares on card stock or sturdy paper, and then choose 24 words to randomly write on the cards. These words will answer questions you will ask about the bride or groom. Whoever gets four in a row wins! You can ask questions like:  Where did the couple meet? What did the groom study in college? Where will the couple go on their honeymoon?   ", " Try wedding movie charades. This game works like classic charades, but guests will mime classic wedding movies. Label blank cards with wedding movies and divide the group into two teams. Players take turns choosing a card and then acting out a scene from that film while being completely silent. Their team will have three minutes to guess the film their team member is acting out. You can include movies like:   ", " Play bridal Pictionary. Write wedding-related phrases, like tossing the bouquet, going on a honeymoon, removing the garter, on slips of paper. Place the slips in a bowl and position a whiteboard in the middle of the room. Divide the group into two teams. Each team’s appointed artist will pull a phrase from the bowl and have sixty seconds to draw it. If their own team can’t guess the correct phrase after sixty seconds, the other team gets a chance.  ", " Play the wedding dress game. Divide the guests into three groups. Give each group three rolls of toilet paper. Ask each group to appoint a dress model. Give each group fifteen minutes to create a wedding dress on the model. Let the guest of honor choose the winner.  "], "Creating Couple-Themed Games": [" Create a couple’s crossword puzzle. Create ten to fifteen questions about the couple that guests can answer in one word. Then make a customized crossword puzzle using only those words. Print out a puzzle on card stock for each guest. Schedule time during the shower to allow guests to fill out the puzzles. Grade the puzzles by the end of the shower and announce the winner.  ", " Play a Post-it note memory game. Give each guest a Post-it note and a pen. Ask them to write down one of their favorite memories with the guest of honor and/or couple and post it on a table or wall. It can be a funny, sweet, or embarrassing memory. The guest of honor will then read each memory, guess who wrote it, and then explain the story to the rest of the guests.  You can put all the Post-it notes in a keepsake book or album for the guest of honor.  ", " Give the guest of honor words of wisdom. Place a blank card into each wedding shower invitation. Invite each guest to fill out the card with marriage and/or love advice. Ask the guests to bring their cards to the shower. Shuffle the cards and then read them aloud. Let everyone guess who wrote what.  "], "Trying Out Other Games": [" Play a purse raid game. Prior to the shower, make a list of items guests might have in their purse like lipstick, tampons, condoms, credit cards, or keys. During the party the shower host will call out the items on the list. The first guest to pull each item from their purse wins a small prize.  ", " Try the lingerie game. On the shower invitations, ask each guest to bring a lingerie gift that reflects their own style and personality. During the shower, distract the guest of honor and hang the lingerie around the room. Then have the guest of honor guess who gifted what piece of lingerie.  ", " Try a scavenger hunt. Break the shower attendees into groups and give them a list of things they need to find by the end of the party. Ask the teams to search for the items over the course of the wedding shower. Your list can include things like a stranger’s business card, a condom, a particular shade of lipstick, or a shoe of a certain brand.  "]}}, "How to Organize Bridal Shower Games": {"description": "Planning to throw abridal showerand looking out for some bridal shower games. Check out below for some fun games to impress the bride of honor and have your guests go Ga Ga over your party planning skills.", "content": {"Steps": [" The First Kiss Fun Game: This is a fun game and can be a great icebreaker for the guests who do not know each other. You can start this game by asking the bride-to-be to tell the story of the first time she was kissed by her finance'. The other guests can contribute as well. To make it fun you can have a panel of guests who will rate the best kiss story. The one who gets the highest points turns out to be the winner. Here you need to keep in mind that the bride-to-be should not feel embarrassed.  ", " Paper Bag Peek-A-Boo Game: For this game you will need some paper bags. Hand out one bag each to your guests and ask then to cover their face with the bags. Then the host will start by asking the guests to remove one thing at a time. You can start it with a watch,an earring..etc. Then move on to clothes and other things. The smart ones will be smart enough to take off their bags over their heads and see what others are up to and have a hearty laugh on those who innocently keep removing their accessories and clothes. The one who does not take the bag off, will get a nice gift for her innocence. ", " Love Will Melt Your Heart Game: Prepare ice cubes by placing a heart-shaped candy in each cube before they freeze. Then drop each ice cube into a Dixie cup and distribute to guests. Instruct them that, without touching the ice cube itself, they can use any body part to warm the cup to try to melt the ice. The first person to melt their ice cube enough to retrieve their candy wins the game. Hilarity ensues as guests use various body parts to try to get their ice to melt. Game can run simultaneously while food is being served, etc. ", " Toilet paper Bridal Shower Games : This is yet another fun game to impress the bride to be. This game could be well played with higher number of guests group say 50. First make teams of 10 to 12 members each. Then hand out toilet papers rolls to each of the team.  Ask them to select a bride from amongst their team. Then within 30 minutes they are supposed to dress their bride. After 30 minutes the real bride can select the best dress. The team who wins get small party favors as prizes. ", " Safety Pin Bridal Shower Games: Though it sounds easy but its not. For this game you will need a bag of rice, some safety pins and a blind fold. First fill a large mixing bowl half full with rice (long grain works best) mix in about 50 or so small to medium safety pins with blind fold on have each person try to grab as many pins they can in a 30 second time frame. It’s amazing how competitive everyone gets at the bridal shower. "]}}, "How to Throw a Bridal Shower on a Budget": {"description": "Although it’s wonderful to know the bride trusts you to plan her shower for her, throwing a bridal shower can be an expensive undertaking. Luckily, you can still throw an amazing shower for the bride on a limited budget. Start by reaching out to other people who the bride trusts and asking them to co-host the shower with you. Together, you can figure out how much you have to spend and how you want to spend it. Reduce costs on big ticket items like the venue and food first. Then, look for ways to cut costs on the shower’s details, such as invitations, decorations, games, and favors. With some careful planning and bargain hunting, the bride-to-be will never even know you were on a budget in the first place!", "content": {"Establishing Your Budget and Priorities": [" Invite the bride’s friends and family to co-host the shower with you. If you’re currently planning the shower on your own, this is an easy way to cut way down on the cost. Co-hosting with one or more people will also make throwing the shower even more memorable and fun. Try asking the bride’s sister, bridesmaids, aunt, grandma, or anyone else knows her well and might enjoy having a hand in planning her shower.  Try saying or texting something like, “Hey, Sydney. I was wondering if you would be interested in co-hosting the shower with me?” Or, you could send a group text to the bride’s friends or bridesmaids and say something like, “I think Rebecca would be extra excited about her shower if she knew that we were all planning it together. Would you all like to be my co-hosts?”   ", " Determine how much each person can contribute if you’re co-hosting. Don’t assume that your co-hosts will be willing to kick down a certain amount. Ask them directly what their spending limit is for the shower. You could even consult with each of them individually if you want to take some of the pressure off to contribute the same amount.  Try saying something like, “Hi, Cara! I’m trying to get an estimate of our budget for the shower. Are you able to contribute something? And if so, what amount?” Another option is to itemize the expected cost of each item for the shower, such as decorations, good, drinks, venue, etc. and create a spreadsheet so that each of your co-hosts can sign up for something.  ", " Discuss what the bride might like for a shower theme. Having a theme will help to narrow your choices for decorations, food, and activities when you’re planning the shower. Talk through the options with your shower co-hosts to determine what the bride might like and what is feasible for your budget. Some budget-friendly themes might include: Garden party Parisian-inspired Beach party Backyard barbeque  ", " Limit the guest list to close friends and family members only. While it might be tempting to invite everyone who will be at the wedding, this really isn’t necessary. To keep the cost of throwing the shower down, stick to close friends and family members for the bridal shower.  The average number of people invited to a bridal shower is usually between 30 and 50, so try to keep your guest list within this range. Identify who you think the bride would most like to see at her shower, or ask her if you’re unsure.  "], "Choosing an Inexpensive Location and Menu": [" Plan to have the shower at someone’s house or at an inexpensive venue. If you have a large enough house or backyard or one of your cohost’s does, then this is a great way to cut costs. You won’t have to worry about paying for a venue or abiding by their rules regarding caterers or purchasing food from them. If you do decide to go with a venue, look into low-cost options. Some good choices in your community may include:  Community centers Churches Fire halls Clubs that one of your co-hosts belongs to, such as an American Legion or YMCA  ", " Keep the menu light and avoid pricey food options if you buy food. If you decide to have the shower catered or if you host it at a venue that requires you to buy their food, choose light meal or appetizers for food instead of a sit-down or buffet meal. You could even have the shower in the mid-morning or late afternoon so that people will be less likely to expect a full meal.  For example, you could opt for a cheese and fruit platter along with a couple of hot appetizers if you’re having an afternoon shower.  ", " Make the food yourself or with your co-hosts to reduce the cost. Select a couple of easy appetizers you can throw together and pair them with a main dish. Then, serve cupcakes, cookies, or a simple sheet cake for dessert. You can make the food a day in advance and heat it up on the day of the party, or ask your co-hosts or even your guests to bring a dish to share.  Try making a fruit, cheese, and cracker tray for a simple, low-cost appetizer. Cook spinach and artichoke dip, pizza dip, or chicken wing dip in your slow-cooker and serve with tortilla chips for something more decadent. Prepare a baked pasta dish for an easy, filling meal on a budget.  ", " Make a large batch of 2 different low-cost beverages. Try making one non-alcoholic and one alcoholic beverage if you want to have alcohol at the shower. Alternatively, you could omit alcohol from the menu entirely to keep your costs even lower. Some good beverage options include:  Iced tea Lemonade Sangria Fruit punch Mimosas Water flavored with lemon wedges, berries, or cucumber slices   "], "Keeping the Cost of Details Down": [" Send electronic invitations or purchase cheap invites. There’s no need to send physical invites if you have electronic addresses for everyone who will be attending the party. Try distributing the invitations via social media for a free way to invite your guests. Or, if you want to have paper invitations, purchase some at a dollar store or online or make your own using blank cards or cardstock.  Make sure to indicate whether guests should bring anything to the shower, such as a dish to pass or a beverage to share.  ", " Decorate simply with streamers, balloons, and a photos of the bride. Don’t blow your budget on expensive decorations! Stick with the basics to keep the décor classy and to stay within your budget. Try putting up streamers and balloons in white and the bride’s wedding colors, and then put out a few framed photos of the bride and groom beside a guestbook or other keepsake for the shower guests to sign.  You could also get a few potted plants to place on tables as centerpieces. These could even double as prizes for party attendees who win games.  ", " Choose games that don’t cost anything to play. There's no need to purchase any games for the party. Some of the best bridal shower games are free or very affordable. Some popular free or low-cost games you can play with at the bridal shower include:  Groom trivia: Ask the groom questions before the shower and then quiz the bride in front of everyone. Have everyone guess how many questions she will get right and give prizes to the people who guessed correctly. Bridal Bingo: Make your own bridal bingo cards that each include 25 squares in rows of 5 with a different item that the bride might get as a gift in each box. The first person to fill out their whole card declares “Bingo!” and gets a prize. Toilet paper couture: Divide the party attendees into groups and give each group a few rolls of toilet paper. Have them choose a model and ask each group to create a wedding dress using the toilet paper. The bride chooses her favorite dress and all members of that team get a prize.  ", " Make a playlist on your phone and connect it to speakers. DJs and live music are expensive, so it’s best to skip this altogether if you’re working within a budget. Instead, create a playlist of songs that the bride will enjoy or built around the theme for her party. Then, connect your phone to speakers at the party and let the music play!  This is also a fun option since you can always play additional songs on a whim or by request by the bride and her guests.  ", " Purchase a few inexpensive items to give as prizes for game winners. There’s no need for elaborate prizes at the shower. Instead, be on the lookout for clearance items and low-cost items that you could use as prizes for the shower. Check out bargain stores and sales to find good deals. Some good, low-cost options for game prizes include:  Candles Small, potted plants Coffee mugs Candy bars A box of tea or hot cocoa Scented hand lotion  ", " Pass out low-cost favors to guests at the end of the party. The cost of bridal shower favors can add up quickly, especially if your guest list is on the long side. Keep the cost down by making or buying something low-cost to send home with your guests. Some examples of low-cost favors include:  Small potted plants Individually wrapped cookies or cupcakes A hand-written thank-you note Homemade soaps or candles Homemade bath bombs  "]}}, "How to Plan Your Own Bridal Shower": {"description": "Planning your own bridal shower isn't as bad as it may sound. In fact this is something I plan to do when I get married. The best thing about it, is you get to have whatever you want, without anything being left out.", "content": {"Steps": [" Get a very large dairy 3months before you plan on throwing the shower.   ", " Create your invitation list. ( Ensure you have, Email addresses, Telephone numbers, Home addresses, Social network links, i.e Facebook, Twitter, Myspace, as these are great ways to keep everyone updated at the exact same time, with just one post). ", " Work out a budget. You should consider doing this with your partner, so you don't overspend, which may cause uncomfortable disagreements before your big day. ", " You can move on to the venue. You will need to ensure the venue can accommodate all your guest comfortable, so remember to check with the owner the capacity amount. ", " Sort the food arrangements. You can decide on home made finger foods, places such as your local frozen food supermarket has wide varieties of finger food, which is easy to make, as most is just a case of putting it in the oven. This option allows you a wide variety of dishes on a very low budget. Places such as Ice-Land, Liddle, Asda, Aldi, will provide you with dishes such as, prawns, samosas, sausage rolls, spring rolls, mini cake delights, ice cream delights and many more. You can prepare the meals with your girlfriends, braids-maids, family members or on your own. ", " Search local cater companies in your area, this way you can view ratings, find exact locations along with telephone numbers and check out their specialties.  ", " Move on the the entertainment/s. It is common practice for a bride to be to have a male stripper or few at their Bridal shower, however should you wish to take a more socially acceptable route, you may wish to have a local band play at the shower or hire a singer and or D.J. ", " The decoration, you should decide if your shower is a seated event or standing, ensuring enough seats for everyone, including accommodating baby chairs if needed.  ", " Choose your favorite colors, flowers, or theme,i.e. 60s theme,  to use as inspiration when decorating. "]}}, "How to Plan a Bachelor Party": {"description": "You’ve been selected to be the best man at your friend’s wedding. You’ll be responsible for holding the rings, making sure the groom arrives at the church on time, but you’re also responsible for the bachelor party. This can seem like a stressful party to plan, but don’t worry – as long as you approach the bachelor party with a clear set of goals in mind, it will go off without a hitch.", "content": {"Taking Care of the Basics": [" Pick a date. Choose a date for the party that works for the groom, groomsmen and yourself. You should choose a date in the two weeks before the wedding if possible – choosing a Friday or Saturday will make the bachelor party easier for anyone who has to work on weekdays.  Keep in mind locations for the party and how busy they’ll be at the time of year you’re going to visit.   ", " Talk to the groom about what he wants. Make sure you have clear ideas about what activities the groom prefers and where he wants the party to be. Understand what tone he wants the party to have and what his future spouse wants.  As an example, find out if he wants to go to a strip club, or if he wants to avoid that sort of activity altogether. If the answer to this is no, then you need to make it extremely clear to all the guests that the party will not involve strippers or other women.  ", " Set a budget. Everyone but the groom should contribute to the party, but as the best man you will be responsible for booking and paying for a lot of the party. Figure out what’s affordable for you and for the groomsmen and other friends to contribute, and set a number.  For example, the groom may really want to go on a flight in space, but this is likely beyond your budget, and you could downgrade to something like skydiving instead. Keep in mind that travel costs like flights, trains or driving should be included in the budget. Once you’ve worked out what each person and you can afford, you can set a price per head for the party, for example $300 dollars per head.  ", " Choose the main activities. Make a list of possible activities and narrow them down to budget-friendly options that the groom would prefer. Try and avoid anything insanely dangerous or activities that will go wrong if you’re drinking.  Your list could include activities and sports such as golf, waterskiing, beach volleyball, wine tasting, paintballing, white water rafting, a large dinner, a night out on the town, or a camping trip. Unreasonably dangerous activities might include things like base jumping, cave diving, wild boar hunting, or a night out in a very dangerous part of a town or city. Try to avoid activities like go-karting, riding motorcycles, chartering a boat or shooting if you are going to be drinking.  ", " Make a guest list. Include all the groomsmen as well as the groom’s good school buddies, friendly male coworkers, and male relatives such as brothers and close cousins. You should also invite younger male family members on the future spouse’s side.  If you’re not sure whether it’s appropriate to invite someone, for instance the groom’s father, then check with the groom before doing so. You should run the final guest list by the groom for approval before sending invitations.  ", " Send invitations. Send out invitations to the party. Make sure the invitations include where the party will be, when it will be, and a mandatory RSVP to you.  Keep an organized record of who you’ve invited and who RSVPs so that you have numbers for the party. You can do this handwritten or keep a typed spreadsheet or word document of the information.  "], "Planning for Food and Accommodations": [" Make travel plans. Figure out how easy it is for people to get to the party location, and make travel plans for yourself, the groomsmen and the groom. Check on travel plans for close family members and friends so you can remind them to book – as the best man it’s your responsibility to make sure the core wedding group gets to the party, even though you’re not paying for all of them.  For example, if you’ve invited friends or cousins from out of town, or if the party itself is out of town, you’ll need to book flights and remind others to book them too.  ", " Make reservations for accommodation and transport. Large groups need to book in advance for hotels and cars or buses. Consider how many people are in the group, how long you will be staying for, and how often you’ll need transportation as a group.  Transport for large groups can be booked through limo companies, who offer cars, minibuses or larger vehicles to take big groups around town. This is also a good way to ensure nobody needs to drive if you’re going to be drinking. When you book a hotel, consider how far it is from activities, how easy it’s going to be to get from one to the other, and who wants to share rooms.  ", " Make reservations for activities. Some activities will not require reservations, such as going to a water park or playing mini golf, but golf, camping, snorkeling, paintballing, going to nightclubs and most other activities require reservations for large groups.  ", " Plan for food. Decide when and where you’re going to be eating dinner, and if the party is going to last for more than a day or two where you’ll get breakfast and lunch. Decide if you’re going to eat out or hire a catering company.  Plan food according to your activities and where you’re going to be staying so you have time to do everything. Check if anyone in the group has food allergies or special diet requirements before booking so you can accommodate them.  ", " Plan for alcohol. Figure out how much and what kinds of alcohol you need to order in advance and how much you expect to buy at restaurants, clubs and bars, or during activities. Make sure you and others are going to be able to pay in cash or by card for the planned drinks when you get there. Decide if you need a catering company for drinks.  Decide how much beer, wine and spirits you’ll be getting, and the amount of cocktail mixers you’ll need. Check if there’s anyone in your group who isn’t drinking so that you can provide alternatives like soda for them.  "], "Making Sure Everyone Has Fun": [" Keep everything well organized. Stay in control by not having too much to drink, and make sure you know where all the members of the party are. It’s your job to make sure no one gets lost, and that meals, activities and drinks have been paid for before you leave a place.  Keep a copy of bookings for activities and restaurants on your phone or as a printout to make sure there are no problems, and you’re not confused about where you’re going next.  ", " Communicate well. Speak with the groomsmen, friends and relations at the party and make sure that everyone is happy and having a good time. Help people or groups who don’t know each other start conversations and get on.  Do rounds of the party at each activity and place you visit as a way to check in with everyone frequently.  ", " Stay safe. Ensure nobody drives when the party has been drinking, and that party members don’t wander off alone in nightclubs, city streets or other potentially dangerous areas.  A good way to do this is to have a buddy system – everyone in the group should pair up with someone else, that way if anyone goes missing it will be immediately obvious who it is. Check where the potentially dangerous areas in the city you’re visiting are so that you don’t end up there by accident. These could include places where gangs spend time or even buffet restaurants with a terrible reputation.  ", " Handle problems. Take care of any mishaps, arguments or accidents. Make sure you pay attention to party members who’ve had too much to drink or feel ill from food, travel or activities. If they need to go back to the hotel or home, make sure they get there safely by checking their transport options and calling or booking it for them.  Other problems could include sorting out transport if you end up in the wrong place, cancelling credit cards if someone loses their wallet, calming down an argument in a nightclub, helping someone who gets injured during an activity, and stopping drunk people getting tattoos. Know the phone numbers of hotel concierge, local limo and cab companies, and emergency services in case of an accident.  ", " Pay attention to the groom. He may have last minute requests for you at the party, or he may need your help to avoid situations he thinks are inappropriate. It’s your job as best man to make sure he is having a really great time.  Many bachelor parties involve making fun of the groom or taking pictures of him in amusing or compromising positions – as the best man it’s your job to make sure none of this gets out of control, or happens without the groom’s consent.  "]}}, "How to Throw an Engagement Party": {"description": "An engagement party is a once-in-a-lifetime event to celebrate a couple's plans to marry. It is the opportunity for people to congratulate you and introduce the bride and groom’s friends and families to one another. Throwing the engagement party can be a lot of time and effort but if you follow a few steps and keep organized then you should have a blast!", "content": {"Planning and Budgeting for the Party": [" Agree on a host. Traditionally the parents of either the groom or the bride will host the engagement party, but it is also common for the couple themselves to host the party. Other options include a friend of the couple, both families co-hosting the party or even the groom planning the celebration. Since it is not always customary to have an engagement party, the couple may not even know that there is interest in giving them one. It also isn't the type of party that a couple could ask someone to do for them, so letting them know you are interested in throwing the party will open the door for them to talk to you about what type of party they are interested in. This will help you to get a tentative guest list from them. While the best man or maid of honor can throw the engagement party, it is usually better for the families or the couple themselves to throw the party since the maid of honor and best man will have to organize other parties later on. If the couple is announcing their engagement for the first time, then they likely will host the event.   ", " Pick a date and time. The engagement party is usually held one to three months after the proposal but this will depend on the individual circumstances of the bride and groom. If the couple plans to have a short engagement then the party should be sooner rather than later. If it is too close to the time of the wedding then it can feel like an early wedding shower and this is not what you want. Nine to eleven months before the wedding is a good time for the engagement party. Holding the party on a weekday rather than a weekend can significantly reduce the cost of the celebration.  While many parties are held in the evening, the engagement party could also be a breakfast or brunch event, a mid-day pool party or held during happy hour at your favorite bar. Be creative.  ", " Determine a budget. The engagement party does not have to be costly. It should be a fun and happy celebration so it can be as relaxed or high-energy as you choose. Some prefer to hold just a small get-together while others prefer to hold an evening filled with dancing and music. A formal dinner party would be more expensive than a backyard barbecue but either are acceptable for an engagement party. Set a budget that includes all aspects of the party: invitations, food, drink, entertainment, decoration, venue and favors.  ", " Create a guest list. The purpose of the engagement party is to bring together the bride and groom’s friends and family so that they can all meet one another. The engagement party is usually an intimate occasion and it is usually inappropriate to invite anyone who will not be invited to the wedding. Get lists from the bride and groom of close family and friends. If you are on a tight budget, reduce the guest list by inviting only immediate family members and close friends. Sometimes you can invite people to the engagement party that are not invited to the wedding. This is especially true nowadays when many couples live and/or host their weddings far from friends and families. If the engagement party is going to be a surprise, make a guest list including the family members and close friends. Ask two or three other people to review the list to make sure you don’t forget anyone.  ", " Determine a venue. The venue can be anything you choose: your own home, a park, the beach, a restaurant, a hall or a bar for example. Remember your budget and the theme of your party when deciding on a venue. Consider having the party at a place that is special to the couple. For example the location of their first date, a park they enjoy going to or some other location.  ", " Decide whether or not you will be accepting gifts. Gifts can be a source of confusion for guests and it is important to inform people ahead of time if gifts are accepted or not. Many do not accept gifts at their engagement party and the invitations should read “no gifts please” to clarify this fact. If you do choose to accept gifts then you should expect low- to mid-range priced gifts and can register for these. The location of registration should be marked on the invitations in this case. If you have requested no gifts yet guests bring them, wait until after the party to open them so that other guests do not feel uncomfortable.  ", " Find others to help you organize the party. Throwing a party can be a lot of work so try to find a few other people in the planning and preparation. If you already know the members of the wedding party then you can involve them in the engagement party. ", " Send invitations. These should be sent out around one month to six weeks before the party. Invitations can be elaborate but it is also perfectly acceptable to send email or another kind of electronic invitation. This will also reduce the cost of the party. They should be kept with the theme of the party. Invitations should be sent out four to six weeks before the party. The invitations do not have to match the rest of your stationary, especially if you have not decided on a theme or color palette yet. You can include a return card for RSVPs or not depending on your preference.  ", " Decide on party favors. It is not necessary to provide party favors but if you do want to then you can choose something small like baked goods or treats. You may also choose to give a small gift to your wedding party to show your appreciation. ", " Create a back-up if you plan to have the party outdoors. If you choose an outdoor location like the beach or a park for the party, make sure you have a back-up plan if the weather does not agree. You do not want to wake up to rain and have nowhere to host the party! ", " Go shopping in the week before the party if necessary. If you are hosting the party at your home or another outdoor location, make sure you give yourself enough time to buy the food, drinks and any other goods you might need such as plates and cups. ", " Prepare the venue. Ensure that there are places for the guests to sit and eat. If the party is hosted at a private residence then make sure the yard is tended to, the house cleaned and that the AC/heating system is working.  If you are accepting gifts, make sure there is an area to put them.  ", " Make sure there is space for vehicles to park. Depending on the size of the party and the venue you may need to arrange special parking areas. Make sure there is space for the guests to park their vehicles to avoid traffic jams. "], "Handling Food and Entertainment": [" Decide on a theme. Pick a theme that excites you and makes you want to party and have fun. The theme can go along with the theme of the wedding (if you know it already) or it can be different. The engagement party is meant to be fun so choose a theme that means something to the couple or reflects the two families being joined together. An example is a manga-inspired party for a couple who share a love of anime. If you plan a low-key wedding then you do not want your engagement party to upstage your wedding. Keep it low-key as well. Even if you plan a laid-back engagement party, having a theme and coordinating color palette can help keep things together.  ", " Decide on decorations and centerpieces. Keep the decorations simple such as streamers and balloons. Photo boards of the couple are also great decorations and a fun way to show off the couple. Flowers are great centerpieces and can be as simple as a sunflower or hydrangea. If you have a theme then you can tailor the decorations according to the theme.  ", " Plan a menu. Whether you will host the party at a restaurant or private home, you can plan a menu according to the theme and preferences of the couple and their families. Be careful of any allergies or food specifications of your guests. ", " Choose a cake or other dessert. You do not have to have a cake but if you do want one, putting a picture of the proposal on the cake can be a great idea. Alternatives include ice cream sandwiches, assorted baked goods or seasonal treats like candy apples or cotton candy.  ", " Decide on the entertainment. Most engagement parties will have music and this can come from either a playlist you create on your computer or hiring a DJ for a few hours. The entertainment does not have to be expensive or extravagant; remember that the party is meant to introduce your families and friends together so they should be able to talk to one another. You could also hire alternative entertainment such as a slideshow or video of the proposal, magicians, circus performers, or live music. Better yet, you can host the party in a location that already has such entertainment.  ", " Prepare a few games to play. A fun idea would be to prepare a few games to play. The games should be fun, simple and get everyone involved. For example, you could hold a “team scavenger hunt” to get the two families acquainted. ", " Create a song list for the party. If you are not having a DJ, which isn’t necessary, create a playlist of songs to play during the party. Think about what people might like to dance to, or what would be most fun for the party. You can also include songs important to the couple. ", " Ask for marriage advice from guests. Ask for marriage/relationship advice from the guests. Leave out a book for all the guests to write their advice in. This is a nice keepsake for the couple to read through after the party. "], "Hosting the Party": [" Get plenty of rest before the party. Throwing a party takes a lot of energy and work. Make sure you get enough sleep the whole week before the party- you want to be able to enjoy the party once it happens!  ", " Introduce guests to one another. The engagement party is an opportunity for friends and family from both the bride and groom’s side to meet one another. Make sure you introduce people to one another to help people mingle and interact. Don’t let forgetting someone’s name prevent you from introducing the guest. Just politely ask for their name and apologize for forgetting. It is better to ask then to not introduce the guest.  ", " Create space for an informal receiving line near the front door. Everyone will want to greet the lucky couple and give them their congratulations. Make a little space near the entryway so that everyone can have their time to speak to the couple. ", " Take lots of photos. As the host you may be very busy organizing things at the party so ask someone else to take photos for you. Alternatively you can ask all the guests to take pictures and post them on social media using the same hashtag so that you can download and share them. Another idea is to leave out disposable cameras for all the guests to take pictures with. If you have the budget, hire a professional photographer to take pictures during the event.  ", " Share stories about the couple. When everyone is happily eating food and have had a chance to mingle a bit, ask for stories about the couple. These stories can be funny, romantic or surprising. Even the couple can share a few stories, for example how they met or the proposal story. ", " Be prepared to give a toast. As the host you would usually be expected to welcome everyone and give a toast to the couple. Others may also be interested in making a toast so try to find out ahead of time if others would like to do so. It is traditional that the father of the bride gives a toast although this is not required.  ", " Be able to conclude any uncomfortable or negative remarks or long-winded speeches. Some people may make inappropriate remarks about the couple, exes or other topics. Similarly if someone is making a very long speech then you should be prepared to encourage them to finish. Prepare a few alternative topics or conversation starters to avoid these situations. ", " Enjoy the party! The most important part is to enjoy the party. An engagement party should be a happy and fun celebration of the couple beginning their wedding preparations together. Make sure you have energy and are not too stressed to have fun during the party. "]}}, "How to Plan a Bachelorette Party": {"description": "Bachelorette parties are a fun and cherished wedding tradition that the bride and her guests always look forward to. If you’re the one in charge, that pressure can make the planning process daunting. By setting a date, location and budget early on and making sure to choose activities that the bride will love, your party planning will be a fun and rewarding process.", "content": {"Checking in with the Bride": [" Go over dos and don’ts with the bride. Avoid involving the bride in the planning details, but do check in early on to make sure that her party is what she wants, whether that’s a relaxed dinner out or the stereotypical, raunchy bash. Ask her what she expects and feels comfortable with.   ", " Set a date for the party a few months in advance. Consult the bride, unless you’re planning a surprise party. Decide whether it will be just one night or a weekend-long affair. About a month before the wedding date is a good timeframe to aim for, but work around the bride’s availability.  ", " Make a guest list with the bride. Unless she specifically delegates this job to just you, ask her who she wants to invite. Give her suggestions but defer to her judgment if she feels strongly about inviting someone or not.  The amount of guests will have a big impact on the feel of the party. A smaller group will be more intimate and easier to keep together, while a larger one will feel more hectic but also potentially more exciting. It’s a good idea to invite the bride’s future sisters-in-law, even if they’re not very close. Consider inviting the bride’s and/or groom’s mother, depending on their relationship to the bride and the feel of the party.  Avoid inviting anyone who’s not invited to the actual wedding.   "], "Deciding on Budget and Location": [" Budget carefully for the party. You and the guests will all be sharing the cost, since the bride typically doesn’t pay for anything (it’s her party, after all!). This means you’ll be splitting costs for a hotel, food, drinks, decorations, and anything else you might want. If the guests are younger and not financially stable, you probably won’t want to make them foot a $1,000 bill.  Reach out out to some of the other guests or bridesmaids to get their opinion if you’re concerned about setting a fair budget.  ", " Set a location. Find out where your guests live and what will be most convenient for the majority, as well as what the bride would like. A weekend in Vegas might be inconvenient and expensive if most of the guests live on the East Coast or abroad, but New York City or New Orleans might work. If your guests are spread out across the country or world, try to choose someplace in the middle. You may not be able to pick somewhere convenient for everyone and still fun for the bride, so invite far-flung friends to Skype in or send gifts or activity suggestions to keep them included.  Consider a “staycation” if most guests are local. Renting a couple of rooms in a hotel or Airbnb makes it easy for guests to leave if they don’t want to stay the night or have other commitments that weekend.  ", " Send invitations as soon as the date and location are confirmed. Request that guests RSVP as soon as possible and send you an email or text if they have any questions. E-vites are a good option for younger guests.  Include details the guests may need to know. Is it a surprise party? Is there a suggested  dress code? Should they bring gifts? Mention the tentative cost per person, but remind guests that it might change based on the final headcount.   "], "Choosing Party Activities and Confirming Details": [" Choose activities for the party. Decide on this at least two months in advance so you can start planning the smaller details. Take into account the preferences of the bride and guests. While a night on the town can be fun, you can also consider a wine-tasting event, karaoke, a sports game or a weekend cruise. Scavenger hunts or picnics are family-friendly options for parties that include older guests or guests with kids.  Ask the other bridesmaids for their ideas. You may not end up using any of them, but you’ll avoid drama if everyone feels like their voice has been heard. Set a weeklong window for their contributions so that you don’t have ideas trickling in too late.  If you’ll be catering or making food, make sure to check with guests for food allergies.  ", " Map out a timeline for the night or weekend of the party. Ask guests when they’re arriving and if they have transportation from the airport. Decide on a time for dinner or cocktail hour, or approximately when you should head from the first winery to the second. Your plans may change during the night, but having a schedule rules out the possibility of awkward downtime.  ", " Set up transportation at least a month before the party. Pay particular attention to this detail if the group will be drinking alcohol. Call for bus or limo rates for a larger group, or plan to split Ubers throughout the night. Even if alcohol won’t be served, a bus will make it easier to keep together a bigger group. ", " Buy decorations if the party is themed or hosted at a house. Stick to your budget and look in party stores and online for the best deals. Start looking at least a month in advance so you’ll have plenty of time in case anything is out of stock or being shipped. Buy the bride a fun wedding-themed accessory, like a tiara or a fake veil. The guests may also want something to make them stand out from the crowd, like matching shirts or feather boas.  ", " Confirm the guest list and any outside services a week or two before the party. Make sure caterers know when, where and what they’ll be serving, or re-confirm a restaurant or concert reservation. Most importantly, double-check with the guests to make sure there aren’t any last-minute cancellations.  ", " Be a point person at the event. Since you organized the party, guests will probably look to you to solve any problems that come up at the party, like guests who have drank too much or an issue with the food. Relax and have fun, but make sure to be alert so the bride doesn’t have to stress. "]}}, "How to Select a Venue for an Engagement Party": {"description": "An engagement party is a fun way to share the news of your engagement with family and friends. It’ll kick off your wedding planning with a bang and allow all your friends and family to get to know each other better. To choose a venue for your engagement party you’ll first need to determine some basic parameters, such as your budget and how many people you plan to invite, before you can decide what type of venue will best suit your needs and style.", "content": {"Visiting Different Venues": [" Check out a restaurant, bar, or pub. Look at your neighborhood restaurants, bars, or pubs as a venue if you’re looking for a place that can take care of your drink and food needs.  Most bars and pubs can arrange for appetizers if you’re not wanting a sit-down dinner.  You can also have a more formal seating arrangement for a dinner or one that promotes mingling for appetizers.   ", " Look at a reception hall. If you want one-stop shopping where you can find in-house catering, bartenders, and waitstaff, go for a venue that’s known for receptions.  Check out your local country clubs or hotels as they can often provide these services in a banquet room. This will take the stress out of your special day.  ", " Consider using your own home or someone else's home. This might be a great option for you if you’re looking for a more budget-friendly venue. Or if you’re the homebody sort, this would be a good venue in which to feel comfortable. If you don’t have a large home, no problem! Throw an open house party over the course of a day or evening so your guests can come in and out as they please.  Utilize any large, open spaces in your home, such as a big backyard. You can always move some extra furniture to another room to make your home more spacious for your guests. Throw up some fun decorations to make your home more festive for the occasion. Bunting and garland make for simple and easy decorations. You could even string up photos of you as a couple to add to the mood.   ", " Head outdoors for a casual environment. Look for an outdoors venue if you’d like to have lots of space in a more relaxed setting.  Outdoors parties can make for great fun barbecuing on the grill, playing croquet or bocce ball, or just kicking back and relaxing on a picnic blanket.  You can look to see if your local park has shelters or see if a friend’s backyard is available. Jazz up the outdoors space with tea lights or twinkle lights.  ", " Go for an unusual setting if you want to express yourself. Don’t be afraid to think outside the box and look something that’ll reflect your personality. Scope out a beach setting, boat, bowling alley, vineyard, or a rooftop for a memorable party your guests will be sure to never forget.  "], "Determining the Logistics": [" Set a budget for your venue. Determine how much money you want to spend on the venue, and engagement party as a whole, as this will help you know what you can or cannot afford. Other monetary commitments you’ve made for the wedding may determine how much you want to spend on the engagement party. The price of an engagement party will range significantly depending on your guest numbers, venue, and food and drink you offer. For an average engagement party, however, you can plan on spending about $15-25/per person.  You may not want to throw an extremely lavish engagement party if it means skimping on the wedding and honeymoon!  ", " Find a venue that’ll accommodate all your guests. Knowing how many people you’d like to invite to your party will help you know how small or large of a venue you require. Want to invite loads of people? Etiquette nowadays allows you to invite people you might not invite to the wedding. So long as you can find a venue large enough, the sky’s the limit!  Some venues will require a minimum amount of guests so this is good to know before beginning your search.  ", " Check to see if the venue is available for your date. Pull out those calendars and find a date that will work best for the engagement party as this will also help you determine which venues are available. If you simply must have a certain venue, you should arrange your date around their openings. Engagement parties are typically thrown within a few months of the proposal before things get hectic with wedding planning.  Keep in mind that you’ll want to invite guests about a month before the party, so don’t drag your feet for too long before booking a venue!   ", " Consult with the bride and groom on the venue if they’re not hosting. If you’re hosting an engagement party on behalf of the bride and groom, be sure to ask them what venue they’d like since it’s their party.  Be conscious of financial costs of venues when you’re not the one in charge of throwing and paying for the party. If the couple is providing financial backing, but not hosting, the host should be aware of their budget. Likewise, if a couple asks someone to host a party for them they should be aware of the financial burden they are asking the host to shoulder.  Be sure to also run other logistics by the couple, such as the guest list and food options.  "], "Figuring out Your Style": [" Let your theme inform the venue. If you decide to have a themed engagement party, this will help you decide what kind of venue you’ll want for the party. You could do anything from an ocean theme at a beach to a simple vintage party in an old warehouse.  If you’re going for for a backyard theme, have the party at someone’s house or at a park where you can enjoy outdoor games and grilling. If it’s a more fancy affair, you may choose to book a formal garden at an estate.  Take advantage of seasonal themes. For example, a clambake on the beach might be great for the summer or a rustic ski lodge might be perfect for the winter.   ", " Choose a venue that’ll fit your decoration style. The type of decorations you want will determine what kind of venue you book. Some venues will allow you to bring in your own decorations and others will have a staff that will decorate the space for you. Decide how much you want to be a part of the process before looking for venues.  Your decorations for your engagement party don’t have to match your wedding theme.  ", " Select a venue with room for activities. Do you like to get your guests moving around? Some engagement parties might include games.  If you want something like a scavenger hunt or lawn games, you’ll need to have a venue that has enough space for these activities.  If you want to have yard games, for example, make sure your venue has an outdoors space.  ", " Check to see how your venue provides food and drink. Your style of party will determine your food and drink needs. You’ll want to make sure your venue can accommodate those. If you’re into making your own food, you should consider making your venue a private home.  If you don’t want to be bothered with figuring out food and drink, make sure your venue accommodates caterers.  Some venues, for example, may not allow for alcohol.  "]}}, "How to Arrange the Best Hen Party": {"description": "So the time has came, your best friend is about to get married and you have being given the fantastic of putting together a wonderful hen party! Can you sense the sarcasm? To be honest you have nothing to worry about, countless numbers of women just about every year are laden with this task and somehow manage to pull it off. We will go through the steps it is advisable to take to create the celebration hassle-free and really enjoyable.", "content": {"Steps": [" Talk to the bride-to-be. She might just want a soothing time at a spa, or maybe something a bit more exciting! She will tell you the people to contact. Remember, she will invite people whom you may not know, so really don't take it upon yourself to complete this. The sooner you do this the better - 2 months before the hen party will be okay.  ", " Get a rough calculation of the number of people that will probably be joining the hen party. From the early stages of planning, do not get caught up in trying to acquire the precise amount, a rough idea is more than enough. A budget from each man or woman will help a great deal with the next step. ", " Look around for various prices and choices that are available for the celebration, search on forums and look at deals with hotels, get several different alternatives.  ", " Show the rest of the girls the choices and decide on a package that will suit all people. Once your package is picked you'll want to confirm the number of people invited. ", " Make a reservation for the preferred deal using the hotel or activity. Don't forget to generate a valid booking nowadays you'll typically be necessary to book having a valid credit card. Once booking is confirmed they may need a deposit from each person. Get hold of the deposit from the party and send for the hotel/activity. "]}}, "How to Decorate Cookies for a Bachelorette Party": {"description": "If you or one of your girlfriends is having her Bachelorette party soon, why not bake and decorate some cookies? You can make wedding-related cookies or honeymoon-related cookies. Either way, they'll be a sweet treat that are sure to be enjoyed by all of the guests.", "content": {"Steps": [" Gather the cookie cutters. Look through your cookie cutters and see if you have wedding-themed cookie cutters, such as a wedding gown, an engagement ring, a tiara, or a wedding cake. You may prefer to make more \"adult\"-themed cookies, such as margarita glasses, bras, etc. If you don't own any of these cookie cutters, consider buying them or borrowing from a friend.  ", " Roll out the dough. Buy or make sugar cookie dough . Once made, roll out the dough using a rolling pin. Press the cookie cutters into the dough to form your cookies. ", " Bake the cookies. Once all the cookies have been cut, put them on a cookie sheet and bake as the recipe directs (or until they're golden brown). Once they're done, put them on a cooling rack and let them cool completely. ", " Divide the icing. Divide the royal incing into three bowls. Use food colouring to make each bowl of icing a different colour. You may want to use the bride-to-be's favourite colours, the wedding colours, or colours that are relevant to the shape of the cookies (ie: an engagement ring would be yellow/gold (the band) and white (the diamond). ", " Frost the cookies. Ice the cookies with one colour of icing using a butter knife or an offset spatula. Allow the icing to dry completely so as not to smudge it. ", " Pipe your designs. Fill up a pastry bag with a different colour of frosting. Use a fine tip to outline the cookies and create details. Some suggestions would be rosettes, flowers, names, initials, etc. "]}}}