{"How to Use Starting Blocks": {"description": "This is the absolute best way to set up and properly use athletics starting blocks.", "content": {"Setting Up the Blocks": [" Hold the unit in your hands.   ", " Face the opposite way that you are going to run.  ", " Put your heel on the inner edge of the start line.  ", " Position the blocks firmly onto the track at your toe (the flat piece of metal on the tip of the main body).  ", " Stamp on them to embed them into the track to prevent slipping.  ", " Find your strong foot: it's the foot you kick a ball with. This is the foot that will drive you out of them (the one closest to the line).  ", " Adjust the strong foot block angle using the spring loaded thing on the back so that it is at either it's lowest or second lowest incline (personal preference).  ", " Adjust your weaker rear foot block angle so that it's either up to the highest incline, or second highest. It's personal choice. "], "Getting Into Position": [" Begin with the strong foot block: face away from the direction you're going to run. Put your heel on the line. Put your other heel against your toe. You should be two foot lengths out now. Place the block so the part of your spikes that have pins are resting flat on the tartan surface of the block. If you sit into your blocks at this stage, your knee of your front leg should just touch the line.  Weak foot block: do the same, only instead of two feet out you are going 3 feet (0.9 m) out from the line.   ", " Know how to sit into the blocks properly. Your toes should not touch the ground- they should be well up the blocks. Make contact with the complete block with your foot for maximum power transfer.  At the \"on your marks\", you should be in a kneeling position, with your hands shoulder width apart, on the tips of your fingers just behind the line.   ", " Lock your elbows straight until you hear the gun. This will help your arms leave the blocks as fast as possible. Twist your arms outwards so your palms and elbows are facing outwards. Then twist only your hands back so your palm is now facing inwards. Your elbows should still be facing outwards. ", " Lean forwards and shift most of your weight onto your hands, and be sure not to bend your back too much, as you want a straight line through your body at all times to maximize energy transfer.  "], "Go!": [" Listen for \"Set. \" When you hear it, raise your backside as far as you comfortably can, while still remaining \"coiled\",  while inhaling sharply. Hold your breath in anticipation, and when you hear the gun, forcibly exhale as you explode off the blocks. You should be aiming for long, powerful strides rather than quick, short ones. ", " On your first stride, swing your arm straight back, extend your other arm right over your head in an exaggerated fashion, and make sure your lead knee comes right up as far as you can. This will ensure a long, powerful first stride. "]}}, "How to Win a Running Race": {"description": "Competing in arunningrace? Nervous? Afraid of not winning? Read  the article for advice.", "content": {"Steps": [" Warm up before the race. Practice steadily every day with good workout routines that make your muscles hurt. The day before the race, work out a little and then rest up well.   ", " Choose your best starting position. Once the ref says \"set\" breathe in air. It helps you last longer in a sprint as you should breathe in your nose and out your mouth, it keeps you from cramping up in a longer race.  ", " Keep a steady start. If you get a shaky one you won't get a good position. ", " Swing your arms. The faster the better, your legs will go faster as well.  ", " Don't sprint at the beginning of a distance race. This is a waste of energy and it tires you out. Just sprint a bit for a couple of seconds to help you keep in a good position, then just jog to not get tired and on the last laps, sprint hard to come in a high position.  ", " Stay humble. If you are very proud of yourself then you think it is too easy and you will come in a fairly low position. But keep your self confidence saying \" I can do it\". But don't have \"false humility\" and think you are a terrible runner; that will make you do worse. ", " Don't get distracted. This will throw your rhythm off. Don't be startled by the pistol if one is used. ", " If you are running in an oval racetrack, try to be in the lane closest to the center because it takes you the shortest time to complete the track.  ", " If you'd like, drink an energy drink or eat chocolate before the race. It will give you extra strength, but do not do it in a marathon!  ", " Keep your hands loose in a long distance run. Clenching them will tighten your muscles and make it harder to run. If you get tired during a long distance race, just speed walk using your arms. "]}}, "How to Start a Race": {"description": "The shorter the distance, the more important the start is. There are different starting positions for sprints and longer races, and a whole new set of concerns if you're competing in a long distance run. For all races, dedicated training is the best way to improve everything from your starting technique to your finishing record.", "content": {"Starting a Competitive Track Race": [" Use a starting block for sprints . Blocks are encouraged for the 100m, 200m, and 400m races. Practice with them during training so you know how to use them for the race. If you've never used them before, read this article or talk to a track coach or teammate. Do not use blocks when running 800m or farther. The starting position for longer races is covered later in this section.   ", " Stand behind the block. If you are using a starting block, stand behind it once you're satisfied with its position. This lets the starter know you are ready to begin. ", " Get onto the block after the first whistle. When the starter blows the first whistle, get in front of the block, get down on all fours, and back onto the block. Make sure your fingertips are touching the starting line, but not quite. Stay on your knees with your butt on your heels.  If you like, you can jump, shake your legs, or prepare as you prefer before stepping onto the block.  ", " Lift your butt at the second whistle. This is your cue to get into the proper starting position. Lift your butt as high as you can. Do not make the mistake of raising your head; you should be looking down at your hands or the ground, not at the track ahead of you.  ", " Race at the sound of the gun. After one or two seconds, the starter will fire the pistol and the race will be on. Novice sprinters will need some practice before they learn to go on the \"B of the bang,\" so to speak. ", " Get in position for longer races. If you are running an 800m race or longer, do not use blocks. Stand behind the start line in a running position, with your elbows at a 90º angle, your chin up, and your eyes looking at the horizon. ", " Get ready on the first whistle. Since there are no blocks, there is only one whistle before the pistol is fired. You should already be in the starting position, so the whistle is just a heads up to be mentally prepared. ", " Run on the pistol. Unlike a sprint, it's important to pace yourself. If you are not the fastest person in the race, you should not be in the front. Pick a speed you can maintain for the whole race, so you do not slow down until you've crossed the finish line. "], "Starting A Long Distance Race": [" Learn to pace yourself in advance. Letting other runners determine your pace is a common mistake. If you try to overtake the other runners right out of the gate, you'll wear yourself out and hurt your finish. Finding your pace and learning your strengths and weaknesses has to happen during training, not when you're already racing: Breathe in deep, calm breaths through your nose for as long as you can. Avoid short, sharp, shallow breathing as long as you can.  Find a stride that you can keep up comfortably for most of the race. Get used to the rhythm of this stride, learning the pattern of your strides and breaths.  Set a goal for yourself before you attend the race, based on this pace.  ", " Warm up before the race. Light jogging or other dynamic stretching is the way to go; static stretches will set you back by relaxing your muscles. Jog at a moderate pace for about to mile (0.16–0.4 km), about half an hour before the race begins. ", " Position yourself with others at your skill level. Don't stand at the starting line unless you're aiming for a top result. New runners often feel intimidated if all the people nearby zoom right past them. If this is one of your first races, start further back and you'll realize there are people of all skill levels competing. ", " Avoid congestion early in the race. You'll want to run as soon as the gun fires, but pay attention to the people around you. You may need to slow down for the person ahead of you before you can maneuver to a better position. ", " Think about your pace after 30 seconds. This is a good tactic for new racers, who often lose their rhythm in the excitement. After 30 seconds, think about your rhythm, breathing, and any pain you're feeling. If you're pushing too hard, take it down a notch. If you think you have the capacity, you can try to push yourself slightly harder than your regular pace, to get your (slightly painful) \"race pace.\" It's easy to burn out this way without practice, so don't do this unless you're feeling very comfortable.  ", " Stay focused. Some runners say running is 10% physical and 90% mental. Stick to your goal pace, and don't let nerves cause you to run too fast or disrupt your rhythm.  If you're competing in a large race, don't worry about the people around you. They're all working on their own goals, and what they do or think doesn't affect your race.  "]}}, "How to Win a Race": {"description": "Training for a race can be a very exciting and satisfying endeavor--winning that race is even more satisfying. To prepare for a race, you'll need to train well, create a race-strategy, and know some insiders tips to winning a race. Scroll down to Step 1 for more information.", "content": {"Training for the Race": [" Invest in a good pair of running shoes. As silly as this may sound, a good pair of running shoes will get you through a race; a bad pair will give you blisters and kill your determination. Go to a shoe store and have your gait measured so that you know what kind of running shoes will work best for you.   ", " Ease yourself into running. If you are starting from scratch, do not jump head first into running or sprinting to train. You need to acclimate your lungs and the rest of your body to the motion it will be doing. Begin with two or three days of workouts each week, with the first few workouts being a mixture of walking and running. From there you can build up to running the full length of your race. ", " Stick to your training schedule. There is no secret, perfect formula for training for a running race--everyone is different, and as such, each training schedule is different. However, your training routine should consist of long distance running where you work on your pace, interval training to build up your strength, cross-training (like biking, swimming, strength training), and shorter runs.  ", " Train at the pace you hope to run during the race. Your goal should be to reach a pace that you can fall into immediately and that you can keep up throughout the race. Different race lengths will call for different paces. For instance:  For a 5K: You will want to find the fastest pace that you can run at maintain for the entire 5K. For a 15K: Find a pace that you can maintain throughout the entire race without slowing down at all in the second half of the race, which is when most people lose speed.  ", " Prepare mentally. While you are racing against other runners, you are actually fighting a battle with your own mind. Part of your may want to call it quits halfway through. What you need to do is prepare your mind for the struggle ahead. First, you must overcome your desire to sprint as soon as the race begins--patience it a virtue, particularly when running a half or full marathon. #*While working out, practice maintaining your pace as you get tired--don’t let yourself let up. While running longer runs, keep yourself from slowing down in the last miles--this will help you get in the mindset of not letting up during the race, even when you are exhausted.  ", " Check out the course. Run or walk the course a couple of times to get an idea of what it will be like when you are actually in the race. Plot out port-o-potty locations and hydration stations. You may even want to map out how you will approach each mile. Will you need to save up energy for an uphill mile two-thirds of the way into the race?  ", " Form a routine before your race. Many avid runners say that it is important not to try anything new on race day. Practice your routine with a few long runs late in your training. This means waking up when you will wake up on race day, put on the outfit you will wear and the shoes you will race in, and eat the breakfast you plan on eating for race day. Figure out what works before for you and plan to stick to it on racing day.  Good breakfast items to eat before a race include: A bagel with peanut butter, oatmeal with milk, toast, dried fruit, and yogurt. If you tend to feel nervous or nauseous before a race, stick to smoothies or juices.  ", " Form a plan before the race. It is important to have a plan going into the race. Will you stick with the fastest runners the whole way? Maybe you’ll stay with the second pack and slowly work your way past them. Whatever your plan, have a rough outline of how you will face the race. At the same time, stay flexible--often situations arise that you didn’t plan for. Maybe you feel like you can outrun the second pack quickly so you head up to the group of runners at the front.  "], "Running and Winning": [" Run at an even pace. Keeping your pace steady will help you to use oxygen the most efficiently. It also helps to reduce lactate build up. An even pace is especially good for long races when it becomes imperative to keep your body working at the same level of strength for a great distance.  ", " Hold back in the early stages of the race. It is important to keep your pace steady, even at the beginning of the race when your pace feels easy, and at the end when it feels like a struggle to keep the same speed. Holding back and falling into your groove, rather than sprinting away at start of the race, will help you to conserve the energy you will need to finish first at the end of the race.  Staying at a steady pace will allow you to catch up to other runners who started the race off too quickly. You’ll be sure to get a boost of confidence every time you pass another runner.  ", " Keep your mind relaxed during the first parts of the race. This is particularly important if you are running anything longer than a 5K. The second half of the race will be a challenge--you will be tired and your body will start rebelling. Keeping your mind relaxed during the first half of the race will help you to focus and find determination in the second part of the race.  ", " Stick with a specific racer if you are trying to beat him or her. While it is generally best to try to keep your pace even, if you have a person in mind that you really want to beat, you will want to keep a bit closer pace with that person. If he starts out quickly, make sure that you keep him within your sights without exerting all of your energy. If he gets a little ahead, switch back into your steady pace and plan to catch him later on--his burst of speed at the beginning will probably weigh heavily on him later.  ", " Know how to pass someone and keep them behind you. When you have someone in front of you and you want to pass them, its important to feel and appear strong. To do this, stay directly behind them until you are ready to pass them. When you do pass them, increase your speed slightly and keep at that pace until you are at least 30 yards (27.4 m) ahead of that runner. That person will mentally write you off as someone who they will either have to catch up to later or who will be finishing before them. ", " Keep the weather in mind. Your environment can play a large part in whether you win or lose a race. In particular wind and heat are two factors that can really bring a runner down. If it is very windy on the day of your race, plan to stay in a group. When you run in the middle of a group, the other runners will act as a barrier for the wind, which will help you to conserve energy since you won’t be fighting against the breeze.  To combat the heat, start out at a conservative pace that is a little slower than you would normally run. Many other runners won’t do this and you will be able to pass them as the fade away from heat and exhaustion.  ", " Keep your eyes on the prize. No matter how tired you are or how concerned about the proximity of other runners you might be, it is important to keep looking forward. If you look back and other runners see you doing so, it will give them a mental boost because they will know that you are tired and that they can pass you when they choose. "], "Other Race-Winning Techniques": [" Hone your sprinting skills. If long distances aren’t your thing, sprinting might turn out to be a great option for you. Of course, sprinting is taxing on the body, but with tips and tricks, you’ll be speeding your way across the finish line. ", " Win a cross country race. Whether you are on a high school, collegiate, or city team, you will need to train hard for your cross country race. ", "Walk across a finish line first. If you are more into walking than running, you can still cross a finish line first. Prepare for a walking race and beat your competitors. ", " Bike your way to first place. Cycling is a challenging, fun, and incredibly satisfying endeavor. Make it more satisfying by coming in first. ", " Win a swim race. Splash your way to gold by following these tips and preparation techniques. "]}}, "How to Put on a Race Bib": {"description": "Race bibs are the number tags that identify you during a race. They’re typically meant to go over your abdomen and are secured with four or more safety pins. Clips, running tape, and toggles may also be used to hold the bib in place without puncturing your shirt. By properly securing the bib, it will stay with you during the race without serving as a distraction.", "content": {"Pinning the Bib": [" Pin the bib after putting on your shirt. For the optimal fit, wait until you put on the shirt to pin the bib. The fabric rests differently on your body than it does against a flat surface. When you’re wearing the shirt, you’ll be able to make sure the bib feels comfortable against you. Make sure you're careful when using safety pins. Always pull the shirt away from your body before piercing the fabric with a safety pin!   ", " Crumple the bib if it doesn't have a chip and race rules allow it. A crumpled bib will conform to your body better than a flat one, thus decreasing air resistance. However, if there's a chip on the bib or it's against race rules, avoid crumpling it. Crumpling a bib can damage the chip and interfere with the recording of your time. ", " Center the bib on the front of your shirt. Generally, the bib should go right below your chest. Set it in the middle of your body and straighten it out as you pin it in place. Do your best to flatten it against you. This ensures the bib is visible to onlookers and doesn’t get in the way of your arms and legs. ", " Move the bib when race organizers direct you to do so. Some race organizers have different requirements for bib placement. For instance, some cyclists have one or more bibs attached to the back of their jerseys. Usually though the bib goes on the front for the sake of clarity and preventing damage to the timing chip many bibs now contain. You can ask the race organizers for advice on bib placement.  ", " Center the bib on your body. Again, unless otherwise directed by race officials, put the bib square in the middle of your body. Do your best to even it out. This ensures the bib is visible to onlookers while also keeping it out of your way. It’s more secure and less distracting when it’s away from your arms and legs.  Even if the bib is on your thigh, it should be centered on the front of your pants and visible.  ", " Secure one corner of the bib with a safety pin. Start at one corner of the bib. Open up the safety pin and push the point through the bib fabric. Next, pass the point through your shirt and back out again. Finish by pushing the point back through the bib and securing it to the safety head.  Some bibs have holes in the corners. Push the pin through these if they are available.  ", " Pin down the remaining corners. You’ll need at least four pins total in order to secure the pin, otherwise it’ll flap as you run. Repeat the pinning process for each corner. Your bib should feel flat and secure against your body. When you move, it should stay still. Add more pins or redo your pinning as needed.  "], "Using Alternative Securing Gear": [" Get race clips to replace safety pins. Safety pins put holes in your clothing. To avoid this, some racers began using clips. Some clips have plastic backs that secure the bib corner and your shirt together. Others have magnets that hold the bibs in place. They’re more expensive than safety pins, but they may be more comfortable for you.  Look online to order these or check a running shop near you.  ", " Use running tape to avoid poking holes in your shirt. Another safety pin replacement is double-sided tape. It can be ordered online and is easy to apply. Place a strip of tape on the top and bottom of your bib. Pull off the tape backing and stick the tape to your clothing. You’ll be able to wear a shirt you like without poking holes in it.  Ordinary tape won’t secure your bib enough. However, you can place electrical tape over pins for extra security.  ", " Fasten bibs to a race belt with toggles. Race toggles can also be ordered online. You’ll need to wear a race belt on your waist and hang the bib from it. Attach the toggle to your pack, then slip the toggle cord into the bib hole. Wrap cord back up to the pack to fasten it inside the toggle. Repeat this by securing the other side with a toggle.  The bib hangs from toggles in the top two holes. It’ll be secure, but the bottom part staying loose can be a distraction. Electrical tape or pins can be used to hold it down. Using toggles may require you to attach the bib to your thigh or a location other than your abdomen. Consult the rules or race officials to make sure this is legal!  "]}}, "How to Improve Your 5K Race Time": {"description": "Since a 5K race is just over 3 miles (4.8 km), you'll need to run your best to improve your 5K race time. To start, practice regularly. Use a combination of long runs and interval training to improve your endurance. Work on amping up your workout by incorporating things like hill training and increasing the duration of your regular workout routine. Make sure you talk to a doctor before starting any new training program. You want to make sure you avoid injury when trying to improve your 5k speeds.", "content": {"Amping Up Your Routine": [" Engage in hill training. Hill training is a form of training where you run up and down hill. This can help build endurance and muscle, resulting in faster speeds. Also, you may encounter a hill during a 5k, so hill training can help you prepare.  Find a steep hill in a safe area near you. Make sure it's at least 80 to 100 meters long. Start at the bottom of the hill and run up it at a consistent and fast pace. Then, slowly jog back down. Start slow. Do hill training once a week, engaging in 4 to 5 repetitions. Gradually work your way up to 8 to 10 repetitions. Do what feels right for your body. When 4 to 5 repetitions begins to feel easy, add a one or two more.   ", " Perform workouts that build your leg muscles. Strong legs are essential for a fast pace. Squats and and lunges should be a part of your regular workout routine. Start slow with weight training. Only engage in weight training twice a week, doing a small number of repetitions. Never weight train two days in a row.  To do a squat, stand with your feet feet hip length apart and your arms at your side. Lower your body as far as you can by pushing your hips down and bending your knees. Raise your arms for balance. Pause for a moment and then lift your body back up.  To do a lunge, stand with your upper body straight and your shoulders held back. Step forward with one leg and bend your knee and lower your hips. Keep lowering until both knees are bent at a 90 degree angle. Then, keeping your weight in your heels, push yourself back to the starting position.   ", " Increase the duration and amount of regular exercise. You can increase endurance and strength by adding a bit more to your regular fitness routine. If you usually ride a stationary bike for 45 minutes a day, add an extra 10 minutes to go a full hour. If you usually do 5 to 10 repetitions of sit-ups or push-ups, add an extra 10 to 20 repetitions.  ", " Visualize success. You need to build your mental toughness in addition to your physical toughness to increase your 5k speed. Running fast requires a lot of endurance and dedication. Use visualization to imagine success. Before a run, spend some time imagining yourself successfully finishing the run at a faster speed than normal.  Take some time just before you start to run. After putting on your running gear, take a seat for a moment. Close your eyes and imagine. Make sure to use all your senses. Think about the smells and sounds you'll hear outside. Imagine how your body feels during a run. Think about the sensation of sweat, and the dry taste in your mouth. Think about the smells of cement or the nearby woods you run past. Imagine finishing the run in record time. Imagine pushing yourself without faltering or growing tired. Then, once you've finished visualizing, exit and take on your run.  "], "Practicing Regularly": [" Incorporate a single longer run each week. Building endurance can help you run faster. This will increase your aerobic capacity, giving you an extra push to run faster during a 5k. Strive for one 30 to 45 minute run each week. Make time for a run of this length in your schedule. You do not need to push yourself to run at extraordinary speeds during your longer run. Strive for a steady, sustainable pace. The point here is to build up endurance.  ", " Interval train once a week. Interval training is training where you alternate between a steady pace and bursts of intense speed. Interval training, much like longer runs, can help you build the endurance necessary to sustain a faster pace during a 5k.  To start, spend 5 to 10 minutes warming up with a brisk walk or a slow jog. When you start running, go at your regular pace for a certain distance or time period. There are no set rules for interval training. You can try running at a regular pace for 400 meters, and then speeding up for 100 meters. You could also try jogging at a steady pace for 4 minutes, and then pushing yourself as hard as you can for one minute. Continue switching between steady paces and quick paces for the normal length or time of your run.  ", " Run outside regularly. Running on a treadmill works in a pinch if weather is bad. However, you should mostly stick to running outside when trying to boost your speed in a 5k. A 5k will be held outdoors. Your body should be used to the atmosphere of the outside to adequately prepare. Avoid the treadmill unless the weather is too harsh for an outdoor run.  Make sure you choose a safe area to run. If you're running after sunset, make sure to wear bright colors so you're easily spotted by drivers.  ", " Have one easy running day to recover. If you're doing a long or fast run multiple days per week, your body needs time to recover. You need at least one slow run day per week, where you do a slow jog or a brisk walk in lieu of a long, intense run. If you push yourself too much for too long, you'll end up straining your body and crashing.  "], "Taking Precautions to Avoid Injury": [" Talk to a doctor or trainer before starting a new fitness plan. You should never engage in a new fitness plan without talking to a doctor or trainer first. You want to make sure your body is ready for the added strain of extra, harder workouts. A qualified doctor or licensed trainer can help you come up with a training plan that works for your specific needs. ", " Warm up prior to workouts. You should always warm up before a run. This can help prevent muscle strain, soreness, and injury. Take 5 or 10 minutes to engage in a solid warm up before you jump into your regular run.  To start, walk for two to five minutes. Then do a slow run for about half a mile, taking frequent walking breaks. When you begin running, go slowly for the first 10 steps to help your body warm up. Then, increase to your regular pace.  ", " Cool down after workouts. Never stop abruptly after finishing a run. You should always transition from running to light jogging and then to walking. For 10 minutes after your run, jog slowly with walk breaks. Then, walk for about three to five minutes to allow your body to cool down.  "]}}, "How to Participate in a Virtual Race": {"description": "Running is a great stress relieving hobby that can help you stay in shape. Races are the competitive form of running and challenges racers on a physical and mental level. However, not everyone wants to be a competitive racer. Virtual races allow anyone to participate in a race at their own pace without the pressure of running in a traditionally organized race. If you've ever wanted to run in a race but don't have the time for a conventional race, you should consider signing up and running in a virtual race.", "content": {"Organizing Your Race Details": [" Determine your goals. Determine if you want to jog, run, or walk. Virtual races will sometimes designate a specific length for you to run, such as a 5k (3.1 miles). Knowing how much you're able and willing to run will help you find a virtual race that's perfect for you. Think of what your personal goals are and strive for them. The most common virtual race distances are the 5K (3.1 miles), 10K (6.2 miles) and half marathon (21K or 13 miles).  Look for a race that you can realistically run based on your physical ability. Consult a doctor before racing if you have any health conditions.   ", " Decide where you want to run your race. You can run your race anywhere you want. Determine if you want to run your race on a treadmill, along with a racing path, or on the sidewalk. Plot out a racing route that fulfills the requirements for the virtual race. If you have other people who want to do the race with you, you can organize a day where you can all do the race together. Think of the weather. If it's extremely cold or hot out, you may want to run your race indoors.  ", " Research your options. Search online for virtual races that you're eligible for. Virtual races often donate a portion of their proceeds to a charity, so take a look at the race company's website to see which charity they are giving to. Look for virtual races that donate to a cause that is close to you. Take down a list of all the virtual races that you're interested in so that you can choose the right one for you. You can also type \"virtual race\" into online app stores to find virtual race apps. Some virtual races, like The Race for Awareness, donates much of their proceeds to disease and virus research.  "], "Signing Up For the Race": [" Determine which race you'd like to run. Once you have a list of different race options, figure out what is important to you. Weigh If you're looking to interact with other people, as some virtual races have a closely knit community and leaderboards. If you'd rather use an app, there are virtual race apps that can help track your progress using your smartphone.  Traditional virtual races rely on the honor system when reporting racer results. For cyclists, Zwift Virtual Training Platform is a great virtual race app that can track your progress and has an online community that you can compete with.   ", " Choose a race package. Once you've decided on what kind of goals you want to meet on your race, you can choose an available package that most closely fits what you're looking for. Some races allow you to designate your own personal goals, rather than setting a distance to run. If you aren't used to running a lot, look for a race that allows you to set your own goals. Races that allow you to set your own goals include the Civil Rights Awareness Race and the Empowering Girls Virtual Race.  ", " Register for the race online. Once you've figured out exactly what race you want to run, find the sponsoring virtual race company and fill out the registration page online. The race sponsors will usually need payment, as well as an address, to send you your medals or rewards. A virtual race is at your pace, so there's no pressure to complete it, but some races have registration deadlines. On average, races cost $25 to $30.  ", " Select a time and location for the race. Once you register for the race, figure out where and when you'll be racing. You can set whatever time and place is most convenient for your schedule. If you plan on running on an indoor track or a treadmill at a gym, make sure that the track's operating hours coordinate with your schedule. Choose a route that you're already accustomed to, and map out the distance on a map. Places to run include the sidewalk, trails, parks, and the beach.   "], "Running the Race": [" Stay safe while running the race. A dynamic workout that includes pushups, jumping jacks, and lunges will get your heart rate up and prepare your muscles for a race. Make sure to stay hydrated and to drink plenty of water before and after the race. Being dehydrated during a race will reduce your performance and is harmful to your health.  Plot your race in a neighborhood or path that you are comfortable and familiar with.  ", " Prepare properly for the race. Preparing properly for the race means doing some test runs to see how your body feels when running long distances. In addition to practicing for the race, you should also make sure that you get enough sleep and to maintain a healthy diet leading up to the race. Make sure that you get enough sleep leading up to the race, as being tired can be a major contributor to decreased performance. A balanced diet is a good balance of proteins, fruits, vegetables, and grains.  ", " Run the race . Take your time and run the race at a comfortable pace. There are leader boards in virtual races sometimes, but there are no time requirements, in most cases, to receive a medal or reward. If you feel tired during the race, slow your pace down until you feel rejuvenated enough to go back to your regular running speed. Don't exert all of your energy in a short period and try to keep a healthy jogging pace. Do your best to meet the goals of the race and push yourself to finish.  Remember to while you run.  ", " E-mail the virtual race company with your results. Many virtual race companies will request that you send them race results to receive your medal. This is typically in the form of a picture of you finishing the race and celebrating your victory. Other companies will have you partake in social media and share your results with other virtual racers. Follow the directions for your virtual race once you've finished. Places like Disney Virtual Running Shorts rewards runners of the 5k with special Disney medals.   "]}}, "How to Complete an 800 Meter Race": {"description": "This is an article that gives the necessary steps to do well in and complete an 800 meter race in track.", "content": {"Steps": [" Know your competition and know your pace. When the gun goes off, do NOT sprint your hardest. It may seem tempting to do, especially if others around you are doing it. But this will cause you to burn out quickly, and by the time you reach 400 meters, you'll be burnt out and done for. It doesn't matter how good or experienced you are at running. Keep an even, natural pace. Don't worry, you'll soon pass the others who used up all their energy with the first lap.   You see, an 800 meter dash is a pure mix of stamina and speed. You need both if you want to succeed. During the first lap, keep a steady and even pace. Not to fast, but definitely not to slow. When you reach your second lap, pick up the pace about 30%. And when you get to the last 200 meters, push yourself forward and use up any energy you have left. Don't spare one drop. If you haven't used up all your energy in the first lap, then this shouldn't be too difficult, and you'll be able to zip right past the stupid person who sprinted half the way.   ", " Maintain pace with relaxed form. Once you get in your rhythm for the first 200 meters, try not to slow down, although inevitably you will. Focus point to point (every 100 meter line works, and at the end of the race, 50 meter markers or even 10 meter markers) to work your way around the track.  ", " Pay attention to your 400 split and act accordingly. By the time you reach the starting line again you should feel tired, but relaxed. If you can't accelerate after 400 meters (not that you should), you went out too fast. Your 400 split should be NO FASTER than 5 seconds compared to your second 400, and ideally more like 1-2 for the distance runner and 3-4 for the 400/800 runner. If the 400 split is slow, plan to make a strong move at 300 to go in order to maximize passing on the straights.  ", " Keep pressure on the gas pedal, but again, keep the shoulders relaxed and focus on good form with 300 to go. This is the time to put yourself into appropriate position for the last 150. Put yourself in a position that you are not boxed in (i.e. have a person directly on your shoulder preventing your moving around a runner slowing). Again, know your race (should I be near the front, did the leaders go out too fast, is this going to be a negatively split race, etc.).  ", " As you make the turn, an elephant will feel as if it jumped on your shoulders as the lactic acid shuts down more and more muscle fibers in your legs. Rock your pelvis forward, make sure your wrists are cocked to make yourself more springy, and focus on really driving that knee forward to compensate. (When on the final sprint focus on your arms and not your legs. Pump your arms faster and your legs will follow. Trust your legs to know how to keep moving.) If you want to decelerate, do so, but most of the time, the person who wins is the one who slows least. Pick your lane, and just continue driving until you crossed the finish line.  ", " Afterwards, make sure you immediately drink a sports drink and consume some carbohydrates to assist in proper recovery. A light jog also helps pump blood, and thus increase removal of the lactic acid from muscles, especially if you are racing again that day. The first hour is the most crucial to recover, just like for lifting. "]}}, "How to Win a Cross Country Race": {"description": "Running a cross country race can be challenging, but it’s also very rewarding! Just finishing a long race can feel like a big win, but there’s nothing like crossing the finish line first. If you’re ready to take your cross country racing to the next level, start by creating a race plan for your success. Then, pace yourself during your race so you can have a strong start, use hills to your advantage, and finish fast.", "content": {"Planning for Success": [" Train for the race so you’re physically ready. If you’re serious about cross country , you’ll need to train every month of the year, even during off-season. In addition to running 5 days a week, cross-train by doing a different sport on the days you do short runs. Additionally, lift weights or do bodyweight exercises to keep your muscles primed.  For instance, you might swim, dance, or shoot hoops on the days you do short runs.   ", " Create a positive mindset to help you push through the pain. Running a race is hard because your body will start to hurt and the course may get challenging. Staying positive is the best way to keep yourself motivated to finish. Practice staying positive while you’re training for the race by trying the following:  Visualize yourself winning the race. Tell yourself you’re a success. Say, “I’m a fast runner,” or “I always finish strong.” Adopt a mantra to keep you going, like “Run strong,” “I’m a winner,” or “Go champ.” Counter your doubts with positive self-talk. Say, “I can do this,” or “I get better with every run.”  ", " Get to know your course before the day of the race. Find out how the course will be marked, and see what the terrain is like. Additionally, look for hills and make a note of where they are in the course.  Look over the course map provided in your race packet. Walk the course before race day. Do a training run on the course, if you can. Preview the course using online mapping tools, such as Google Maps. Talk to someone who’s run the course before.  ", " Eat simple carbs the day before your race and for breakfast on race day. Normally, simple carbs aren’t the best foods to include in your diet, as your body burns through them quickly. However, quick energy is exactly what your body needs to finish a long, challenging race. Build your meals around simple carbs on the day before and the morning of your race to make sure your body gets the fuel it needs.  Simple carbs include foods like fruit, milk, vegetables, pasta, and bread. You can also find simple carbs in processed foods and desserts, but these foods aren’t the best choice for your body, as they lack nutrients.  For instance, on the day before your race, you might eat egg whites with sauteed veggies and a side of fruit for breakfast, a sandwich with fruit for lunch, and spaghetti for dinner. On the morning of your race, you could eat cereal with a chopped banana and milk.  ", "Sleep at least 8 hours the night before your race. You need to be well-rested before a race, so get in bed early. Additionally, use a bedtime routine to calm yourself down, such as reading before bed, turning off screens, and cooling down your room.  Ask your friends and family members not to bother you after a certain time, such as 8:00 p.m. That way, you can ease off into sleep without any stress.  ", " Drink 16 fluid ounces (0.47 L) of water the morning of the race. You don’t want to get dehydrated during your race, and it might be hard to replenish your water stores while you’re running. Start sipping on water when you wake up in the morning, and try to drink about 16 fluid ounces (0.47 L) before the race actually starts.  In the days leading up to the race, make sure you’re drinking plenty of fluids. It’s also helpful to take sips of water during the race, even if you’re just getting your mouth wet.  "], "Making a Strong Start": [" Warm up about 30 minutes before the race with a light jog and stretching . Warming up before a race helps you give your best performance and prevents injury. Jog for about 10 minutes to warm up your muscles, then do some light stretches.  As part of your warm up, do some dynamic stretches, such as , , squats, , and .   ", " Start the race at a steady, moderate pace. It’s tempting to sprint out of the starting line so you can secure the lead, but that’s a mistake. Running too fast at the beginning of the race will tire you out sooner, leaving you little energy to finish the race. Instead, pace yourself so you are able to finish the race at a faster pace than the other runners.  Don’t let other runners psych you out if they choose to start off fast. Remember, they’re going to burn through all of their energy before the end of the race, so you can always pass them later.  ", " Keep a quick, even pace rather than alternating between a sprint and a jog. At the beginning of the race, you’ll need to manage your energy levels so that you don’t run too fast, which may tire you out too soon. As you progress through the race, you can increase your pace occasionally to pass other runners. However, save your sprint for the end of the race.  ", " Relax your shoulder and face muscles so you don’t waste energy. It’s natural to want to run faster to finish first, but tightening your shoulders and face won't accomplish this goal. In fact, clenching these muscles costs you energy that you could be using for a strong finish. Instead, keep your face and shoulders neutral and relaxed.  Check in with yourself when you reach race landmarks and release any tension you're holding in your face or shoulders.  ", " Run with your teammates for encouragement. Sticking close to your teammates can keep you motivated during the race, so try to run as a pack for most of the race. However, don’t slow down your pace if you’re much faster than your teammates.  Practice sticking together when you go on practice runs. When in doubt, ask your coach for advice about where you should be running in the pack.  "], "Running Hills": [" Shorten your stride and use your arms to push yourself up hills. Hills are the most challenging part of a race for many people, but you can use them to your advantage. Take shorter steps, but keep your pace quick as you surge up the hill. Additionally, pump your arms to help drive yourself forward. This will help you keep your speed up on the incline.  Don't be afraid of hills because worrying about them will slow you down. Instead, view them as a chance to pass other runners who are struggling up the hill. Keep your back straight as you go up the hill, rather than hunching forward.  ", " Continue running as you crest the hill, rather than letting up. Don't slow up or take a breather when you reach the top of the hill. Instead, power forward over the top of the hill. Then, let the momentum propel you down the hill.  ", " Speed up as you go down the hill, but maintain control. Once you crest the top of the hill, you can speed up for your descent. Go as fast as you can without losing control of your body and speed. That way you can make up for your slower pace going up the hill and hopefully use the momentum from the hill to gain some ground.  ", " Keep your momentum going when you come off the hill for as long as you can. You’ll likely come off the hill fast, and that’s a great way to gain some ground on the other runners. Let the momentum from your descent continue as you return to the flat surface. Then, fade back into your comfortable, steady pace.  Remember not to strain to push yourself forward. If the momentum is fading, let it go and return to a comfortable pace.  "], "Finishing Fast": [" Pass as many people as you can so you can get out front. If you pace yourself correctly, you should have enough energy to pass your competition as you progress through the race. As the other runners lose their stamina, you can take advantage of their slowed pace to pass them.  Pay attention to the people around you. Just as you’re trying to pass people, you’ll have other people attempting to pass you.  ", " Push yourself as hard as you can during the final 1/3 of the race. As you come into the finish, you’ll likely need to work hard to maintain your pace, since your energy levels will be low. Plus, you’ll need to pick up your pace and sprint for the finish line.  Don't forget to use your mantra or positive self-talk to keep yourself going through the pain. Don't give up!  ", " Sprint as fast as you can toward the finish line for the last .25 to .5 miles (0.40 to 0.80 km). Sprinting toward the finish line is how you finish strong. Run as fast as you can, keeping your eyes fixed on the finish line. Don't slow down until you've crossed it.  It’s best to plan when you’ll begin your sprint, based on how long the race is and how far you can typically sprint. You'll likely want to sprint at least the final .25 miles (0.40 km). However, you can adjust this to fit your personal endurance levels.  ", " Cool down with a slow run to flush out the lactic acid in your muscles. One you cross the finish line, you’ll likely want to collapse on the ground. However, doing so will make you very sore the next day. Instead, do a quick cool down to bring down your heart rate and allow your body the chance to flush the lactic acid from your leg muscles. Otherwise, you’ll be very sore the next day.  For instance, you might do a light jog for 5 minutes, followed by a 5 minute walk.  "]}}, "How to Run a Cross Country Race": {"description": "People usually get nervous when running in a road race or a cross country race. If you do, it's OK, because then most people get extra boosts of adrenaline; however, confidence is the ultimate key to success. There are ways to keep yourself thinking positive when running, especially if you're not a good runner. Keep on practicing until you are better than before.", "content": {"Steps": [" Remember that preparation is crucial. Hydrate very well and eat healthy the days before the race, and get some good nights' sleep. Prepare yourself psychologically in bed the night before- envision the course in your mind.  ", " Eat a good breakfast (full of fibre, protein ,carbohydrates and sugars) , but make sure you have several hours to digest it or else you'll get a stomach cramp . Be sure to eat a moderate meal 2-4 hours before the race. If you have a slow digestive system, eat light. The objective is to not get a stomach cramp, but also to not be hungry and devoid of energy. Keep hydrating the day of the race, but again, make sure you have time for it to go through your body or you'll get one of those nasty side-aches. Don't drink Gatorade before a race!  ", " Double tie your running shoes so when you're running your shoes will not come untied. Wearing Racing Spikes is a good idea in the race since they are lighter and have more tread than normal running shoes. Make sure they feel good and not too tight. Having them too tight is just as bad as not having them tied at all.  ", " At the start of the race, stay with the pack. Once you lose sight of them, it will be psychologically hard to get back up to them, as you don't know how far ahead they are. But also remember that most Cross Country runners take off too fast, and don't intend to hold their first half mile pace the whole way.  ", " Move through the first 800 meters pretty fast to make sure you get everything out of yourself - then you can tap into your full potential. Also, you will have the added  benefit of running with the adrenaline still in you, so you might as well use it. It not wise to sprint early in the race, rather start with a brisk 3/4 pace to get a good position in the pack. As the runners thin out you will begin to gain on those ahead of you.  ", " Look for key \"landmarks\" on the race. (e.g. a mile mark or a downhill), you may want to try the surge. To do this, run about 60 to 90 seconds faster (per mile pace) for about 50 meters. Then, settle back down to \"normal\" pace. This strategy helps break out of the natural \"slow-down-without-even-knowing-it\" obstacle in a race by overriding the chemical in the brain that automatically shuts down your muscles \"without your permission.\" ", " If your legs start to hurt, don't slow down. As this will make them hurt more. If you run, you actually can't feel them anymore. But if they don't stop hurting, you might want to stop and ask one of the paramedics there if there are any. ", " When your legs get tired, pump your arms; remember that your legs cannot outrun your arms. Obviously, since they're attached to your body. You might notice your arms getting a little sore. If they get very sore (your arms), swing them, but minimally. Pump your arms as hard as you can going up a hill, since your legs will be very, very tired going up and pumping your arms will help them go up faster.  ", " Make competitive goals during the race like \"I'm going to catch the kid in the red\". After you catch that kid, make a goal about the kid in front of you and so on. ", " Keep your pace strong. When there are people cheering you on, use it as an advantage to boost your self-esteem. Don't ever talk negative to yourself, or you race will end up terrible. ", " On downhills, you should let gravity bring you to a sprint. You may end up passing a couple people and leaving them behind this way. Uphills and other difficult places in races are also good places to leave people behind in races. ", " Finish strong. When you are at the last 100-200 meters, sprint and use the rest of your energy to finish.  ", " Never slow down before you get to the finish line! Try to do everything you can to get there as fast as you can. Sometimes your legs already know how to do this, especially if you have implanted brains in them that have your legs self-programmed to kick at the end. ", " Sprint past the finish line so you don't slow down before the line and get a slower time. Also, If you don't, the kids behind you will probably run into you and begin to scream obscenities. ", " Congratulate your team even if they had a bad race, team spirit makes all the difference!  ", " If you do not come first, that's totally fine. There can only be 1 winner, and your personal goals and times are the things that really matter. Good sportsmanship goes a long way. "]}}, "How to Run a Mile Race": {"description": "Have you ever wanted to run that school mile faster? Or wanted to run your track mile faster? Maybe you are racing someone in the mile, and you want to win. Below are some tips to help you with this.", "content": {"Steps": [" Get ready mentally. If you think you can't run a fast mile, then you probably won't. Think positive thoughts, especially while you're running, and have someone in your family, or maybe just a friend, tell you positive things. (i.e \"this race is all yours!\" \"That kid in the red is your only competition, but you can leave him in the dust.\") You will be surprised how much faster you will run with positive thoughts in your head.  ", " Take care of yourself. Your mind is most of it but your body is important too. If your muscles are tight, your legs are hurting and you didn't stretch, you are probably not going to do very well. Always stretch before the race! This is important for any race. Your legs are one of the most important parts to stretch, but make sure you stretch your whole body before the run. You'd be surprised at how tired and sore your arms could get while running! ", " Have a plan. As stated before, your mind plays a huge part in the race, so tell yourself what you are going to do. The mile is considered distance running so tell yourself your plan (i.e, \"I'm going to sprint the first 150 meters to get ahead, and keep a solid pace the rest of the race.\" or \"I'm going to take it easy in the beginning and pass people during the race, then sprint the last 200 meters or so.\" ", " Stay hydrated. Water is one of the most important part of race preparation. Do not drink Gatorade before a race; the sugars will cause your body to slow down in the middle of the race. You should drink water throughout the day of the race, but not too much or you will get a  cramp. Generally drink about 30-35% of you daily water needs before a race or about 3 or 4 cups of water. ", " Once the race starts, stick to your plan. If you decided to sprint out at the beginning and someone passes you, tell yourself, \"He will die off before the race ends.\" Or at the beginning if you take it easy and pass people and a few are too fast, say to yourself \" I'll catch them at the end.\" ", " In the middle of the race, stick to passing people one at a time. Have a place and a time goal for yourself. If you wanted to finish 3rd at the worst with a time of 6:00 or better, and you are at 5th and you're at a pace for 5:50, you should keep your pace until the end then sprint to get to 3rd. ", " If there is a little lead on  you and the person ahead of you , take some time, run a little faster in the straight areas and where off some time in between you, because the guy in front of you is going to take it easy thinking you'll never catch up. Don't kill yourself though, because if he isn't running hard he is saving energy for the end. So you'll need some energy to pass him. ", " Regardless of your plan, the last 200 meters should be your fastest, use all the energy you have left and go for it. Just remember, when you're running and you begin to get tired, just keep going, remembering that you can do it. At the end, as soon as you see the finish line in front of you, sprint towards it. You can do this! "]}}, "How to Prepare for a Race": {"description": "Deciding to run a race is a big step. And thinking about everything involved with the preparation of that race, especially if it's your first, can almost make you feel like you've already run it. But fear not – a big part of following through on your goal is to prepare yourself physically and keep yourself centered.", "content": {"Obtaining the Right Gear": [" Get the right shoes. The correct shoe will support your ankle, lock your heel into place, and give your toes enough room to wiggle around. Long-distance running shoes – anything over a 5k – are heavier because of added comfort. If you’re training for a shorter race, look for lighter-weight racing shoes to increase speed. Each foot is made up differently. Experts can help you determine your unique foot characteristics to find shoes that support weaker areas. Your shoe should not just be on your foot, but part of it. Feet grow and change in small but significant ways with age, so don’t presume that a 3-year-old pair will fit even if they’re still in good shape.    ", " Invest in comfortable clothes. Activewear fabrics like Dri-FIT are designed to move sweat away from the body, whereas traditional cotton absorbs it. By using lightweight, sweat-resistant clothing, your endurance will grow as you stay comfortable. You don’t need an entirely new wardrobe, either; just get a couple of the right products to cycle through. ", " Carry a water bottle. If you plan to train with the water bottle in hand, opt for something smaller and with a nozzle for easier drinking on the go. If you can, plan a route that has water stations so you can refill it if you need to. Additionally, water-pack systems like those from CamelBak keep plenty of water in your reach without becoming tedious to maneuver. Plastic bottles can contain harmful chemicals, so when in doubt, opt for a stainless steel one.   "], "Preparing Yourself Mentally": [" Write down the date of your race. Studies have found a link between writing down goals and following through with them. Make sure you do not stress yourself out too much, and try not to focus upon the crowd. Write down your race on something you will see each day, like a calendar or a sticky note on your desk. You want to prevent this goal from becoming an abstract concept for you. ", " Develop a training schedule. The most successful training schedules incorporate consistency and variety harmoniously. The purpose of creating a schedule is to give yourself time to master a distance and then challenge yourself to raise it slowly until you’ve hit your distance goal.  Start by determining how far you can already run. If you can do an eight to ten mile run every week, you should train for a marathon for 18-20 weeks. If you cannot, you may need to train for longer or you might consider a shorter race.  Use the 10% rule when creating your schedule, which says that you should not increase your mileage by more than 10% from week to week.  If you’re new to running long distances, give yourself extra time to train so you don’t hurt yourself. If the average 5k training program is 3 weeks, give yourself 5 or 6 weeks. If the average marathon training program is 16 to 18 weeks, give yourself 18 to 20.   ", " Hold yourself accountable. Finding someone to train with can be a huge step in manifesting your goal. If you want to train alone but still need motivation, find a friend to check in with on a weekly basis. The point is that you want to create an outside source to bolster your motivation. Fitness apps like Zombies, Run! and Fitocracy use a reward-based system for the work you do so you can see something tangible for being diligent. Remember why you made this goal in the first place. A big motivator will be finding the in your training.  "], "Preparing Yourself Physically": [" Mix up your exercise routine by cross training. Rest your running muscles from time to time by doing exercise that focuses on different muscle groups. Swimming, yoga, and pilates can keep your muscles warm while preventing possible burnout from focusing on a single activity. Gentle stretching helps soothe sore muscles, but overstretching can cause injury. Try some yoga poses, but do not do poses that are too deep. Lizard pose or inverted plank pose are great for runners.   ", " Drink lots of water. Without proper hydration, your training schedule can quickly fall off-track. Your recovery time will take longer, your muscles will burn deeper, and your drive and dedication will most likely falter. When running long distances during training, you should drink water at least every 20-30 minutes, or more if you need it.  ", " Eat a well-rounded diet. Limit the number of processed foods you eat, like candy and fast food. Instead, focus mostly on fresh foods that don’t have a nutrition label – things like fruits, vegetables, and fish.  Good sources of healthy complex carbohydrates include quinoa, brown rice, and whole-grain pasta. Chicken, fish, eggs, and legumes are all great sources of protein. Healthy fats consist of all kinds of nut varieties (pistachios, peanuts, almonds) as well as avocados and olive, canola, and coconut oils.  Eat a snack high in carbs and protein within an hour after finishing a run to replenish energy quickly.  "]}}, "How to Prepare for a Cross Country Race": {"description": "Being prepared for a cross country race means that you are more likely to race better and enjoy yourself on race day. Eating and hydrating well, as well as preparing yourself mentally for the race ahead, means that you can put your training into action, which may help you perform better. Preparing for a cross country race also involves sorting out details to make race day go smoothly, and knowing what to do when you arrive at the venue.", "content": {"Training for Cross Country": [" Follow a training plan for the race. The key to being prepared for a cross country race is to consistently train in the months leading up to it. A training plan for beginners usually involves running 2 - 4 miles (3.2 - 6.4 km), 3 - 4 days per week, for 3 weeks. Then increase your mileage after 3 weeks by increasing your weekly distance by 10%, and running 5 days per week.  Start doing some hill work and fartleks after you have increased your mileage, around 2 times per week. Make sure that you don’t do 2 hill work or fartlek workouts back-to-back though. Continue building up your mileage slowly until you reach 6 - 7 miles (9.7 - 11.3 km) on your longest run for the week. Continue training until you begin to taper off for the race, and focus on speed intervals once you have increased your mileage to the maximum. If you are working, you could use lunchtimes to squeeze in brief training runs. Before and after work can be used for longer runs, and the weekend can be used for full-distance runs. There are many training plans for cross country available freely online for you to use. Talk to your coach or look online to find one that is geared towards your running ability.   ", " Run on the same or similar terrain that you'll encounter during the race. If the race is situated away from your home city or state, look up the terrain using Google Maps or read about the place using local websites. Then, try to match the terrain with what you have at home. This helps your body to get used to what will be expected of it on race day. If part of the race involves road running, then do some training runs on roads. If a different part of the race involves running in the woods, then do the same during training. There are often reviews online for larger cross country races. Use a search engine to find reviews, and to read about the experience that other runners have had with the same race.  ", " Run on hills to train for cross country. Hill training is very useful in cross country races, as it’s unlikely that the gradient will remain the same during the whole race. Pick a small hill to begin with.  Hill training once or twice a week works well. Run at an easy, jogging pace up the hill, and then run downhill at your target pace. Make sure that you stay in control and aren't overstriding, and repeat 6 - 10 times.  ", " Complete fartleks to build your aerobic strength. Fartleks are runs which include both fast and slow segments. Jog at an easy pace for 5 minutes, then pick up the pace and surge for 20 seconds, before returning to your original pace.  Your surging pace should be either as fast as you can go, or your top target pace that you are aiming for during the race. By slowing down periodically, you’ll improve your ability to run at consistent speeds during longer runs.  ", " Use ladder workouts to train your speed. Run at a slightly faster speed for increased time intervals, before working your way back down the “ladder” again. Ladder workouts are versatile, can be done on treadmills, roads, trails, or tracks.  An example of a ladder workout is running slightly faster than your target pace for 1 minute, then jog at an easy pace for 1 minute. Next, run slightly faster than your target pace for 2 minutes, then jog at an easy pace for 2 minutes. Repeat this up to 4 minutes, and then work your way back down the \"ladder\", ending with 1 minute again.  ", " Taper down your runs in the lead up to the race. Tapering is when you decrease the frequency and duration of your training runs as you approach a race. This helps your body to recuperate and be ready to go on race day.  Taper by exponentially reducing your weekly mileage for 1 - 2 weeks before the race. Also reduce the number of intervals and duration you are doing during your training.  Although it can feel wrong to stop training as much as race day comes closer, don’t replace the absent runs with other forms of exercise, as this time is necessary for your body to rebuild.  "], "Eating and Drinking for the Race": [" Eat a consistent, nutritious, carbohydrate-rich diet during training. Running requires a lot of energy from food, and eating enough will mean that you can run to the best of your ability, without feeling faint or too tired. Complex carbohydrates such as whole-wheat pasta, whole-grain bread, vegetables, and brown rice are all ideal for runners.  A ratio of 4:1 carbohydrates to proteins is generally recommended for runners. Within 1 hour after each run, make sure that you refuel with a carbohydrate and protein rich snack. Some options are a piece of whole-grain toast with peanut butter, or some yogurt with fruit. If you are having trouble feeling fueled for running, book an appointment with a sports nutritionist or dietician, as they can give you tailored and specialized advice.  ", " Drink plenty of water throughout your training. Having an adequate amount of fluids throughout the training process will help your body to perform to the best of its ability. Water is crucial for your muscles and brain to train and perform.  Although everybody requires a different amount of water, 60 oz.(1.7 L) of water daily tends to work well for most people. For every cup of coffee, soda, or alcohol that you drink, match it with a glass of water. Your urine is the best indicator for how well hydrated you are. The more dehydrated you are, the darker it will be, so aim for light yellow.  ", " Find out the type and brand of sports drink which will be provided. Most races offer a sports drink to runners, and many larger races are sponsored by a particular brand of sports drink. If possible, incorporate this drink into your training so that you can make the most of it on race day.  Don’t drink the featured drink if it wasn’t part of your training. Each drink has differing levels of carbohydrates, proteins, and electrolytes. Suddenly introducing these to your system on the race day can cause digestion issues.  ", " Eat plenty of complex carbohydrates 3 days before the race. Meals such as a tomato based pasta dish, or peanut butter sandwiches using whole-grain bread are ideal. A good proportion to follow is 70% carbohydrate, 20% fat, and 10% protein.  Carbohydrates give both your brain and muscles the energy and nutrients that they need to run the race most efficiently. For more variety of complex carbohydrates, try oatmeal or tabbouleh too.  ", " Consume simple carbohydrates 2 days before race. Fruit, white pasta, or white bread are good options during this time. Avoid simple carbohydrates which are high in saturated fat, such as cookies or doughnuts, as they can slow down your digestion.  If you haven’t eaten much fruit throughout your training, now is not the best time to start. All of the extra fiber from the fruit could hinder your digestion.  ", " Stick to easily digestible, simple carbohydrates on the day before. Foods that have worked well for you during your training, and which don’t make your digestion feel sluggish will work best during this time. Ideally, have your last big meal 12 - 15 hours before the race start time..  White pasta with a simple marinara sauce usually works well the night before a race.  ", " Hydrate the day before the race without overdoing it. Drink water whenever you are thirsty, and with every meal the day before the race. Avoid drinking too much water on the day before the race.  Each hour, drinking 4 - 8 oz. (0.1 - 0.2 L) is a good amount to aim for. Make sure that you eat some salty carbohydrates on the day before the race, such as pretzels, to make sure that your body isn’t flushing out electrolytes that you will need for the race.  ", " Have a light breakfast before the race begins. A meal 3 hours before the race starts helps to slightly replenish your energy stores that you have built up over the previous few days, without feeling too heavy. Some light suggestions are cereal or oatmeal with low-fat milk, or half a bagel with low-fat yogurt.  These are general guidelines, and sticking with what has worked for you before running in the past is best. Never experiment with new foods on the morning of the race. Although coffee isn’t generally recommended before a race as it can harm your digestion, if a cup of coffee is part of your daily habit then definitely include it on race morning too.  ", " Drink 16 oz (0.5 L) of water two hours before the race begins. Drink water on the morning of the race to ensure that you are well hydrated for the running ahead. Don’t drink water too close to the start time however, as the water needs some time to pass into your system and properly hydrate you. "], "Preparing Mentally": [" Sleep for 8 - 10 hours per night during training. Sleep is a vital part of running training as it allows your body to rest and recuperate from the difficult workouts. It also helps you to feel mentally fresh and prepared.  If you have trouble sleeping the night before the race due to excitement or nerves, having this consistent sleep schedule will help your body to cope well without any adverse effects.  ", " Choose a mantra for your runs. Having a mantra that you can rely on will help you to keeping going when running is tough. This will be especially useful on race day as you face hills or difficult stretches.  A mantra is both something to focus on, and something to help you keep going. Repeat the mantra in your head calmly and steadily, to create a rhythm for your pace or for your breathing. A useful mantra for strength is “Run strong. Be brave.” A mantra for enduring the tough times is “The pain of discipline or the pain of regret.”  ", " Form a race plan for your race. A race plan determines what your target pace is for each part of the race. A race plan helps to make your running consistent, and means that there aren’t any surprises on race day.  Check the elevation and terrain of the course before making a race plan so that it can be as accurate as possible. Race plans generally start off patiently and conservatively during the beginning, and focus on speed during the final mile.  ", " Get a good sleep the night before the race. This will help you to feel well-rested and prepared on the morning of the race. If you can’t sleep for this long however, whether this is due to nerves or an early start, don’t worry as having a consistent sleeping pattern during your training will help to balance any negative effects.  If possible, don’t go to bed too early, otherwise you may wake up too early on the race morning and not be able to get back to sleep.  "], "Sorting Out the Details for Race Day": [" Pick up your race pack as early as possible. Race packs are usually available to be picked up the day before the race. This will help you to feel calm, collected, and prepared, rather than feeling rushed and stressed trying to pick up your race pack at the last minute.  Picking up your race pack early means that you are also more likely to get a t-shirt size that fits you best. Race packs are often picked up from a health and sports expo. Take part in the expo, but try not to walk around too much. You need to save your energy for race day. Also don’t use anything that you purchase at the expo on the day of the race. Save it for your future training and races.  You can pick up your bib on the day for many smaller races. See you race details or contact the organisers if you are unsure.  ", " Lay out your clothes and gear for the race the night before. This will help you to feel prepared and ready on the morning of the race, and will help you to avoid misplacing any gear. Stick to gear that you have trained in, as your body and running style will be used to it, and will run best in it.  Dress for 15°F (9°C) warmer than it actually is, as it will feel as though your body is heating up by this much anyway. This will help you to wear clothes that are a comfortable temperature during the race. The gear which you will need to lay out the night before are short, top, race bib, socks, shoes, hydration belt (if you are using one), ID, car keys, and anything else you will need on the day of the race. Pin your race bib to the front of your top, using a safety pin in each corner to secure it. If there is a timing device on the back, make sure that it isn't bent in any way.   ", " Finalize the logistics for the race day. Make sure that you double check the start time of the race, and how you will get there. Also check where you can park, and if any roads on your route will be closed due to the race. Having all of the logistics sorted before the day of the race will help you to feel calm and confident on the day. Studying the race course map is also an important aspect of the logistics. All races will provide a map outlining the race that you will run on the day. Many of these include where the bathrooms are, where food and fluids are provided, and where the first aid station is. The course map will also show the distances and elevations that will occur during the race.  If you live near the course and are allowed access to it, go for a walk to get a feel for it beforehand.  ", " Check the weather for the race day in advance. If the forecast is warm and sunny, make sure you plan to have a hat and sunblock with you. If the weather looks like it will be wet and cold, make sure you wear layers and bring along a warm blanket for afterwards.  Make sure that you have practised running with a shorter stride and watching your steps, if you think that the ground might be icy on the day.  ", " Arrive at the race venue at least 1 hour early. This gives you enough time to find a carpark, pick up your race pack if you haven’t already, and to use the bathroom. It’s better to have too much time rather than too little, and this will help you to feel relaxed before the race.  ", " Use the bathroom at the race venue. Digestion issues are common with running, so make sure you use the bathroom before the race to avoid feeling uncomfortable during the race. The lines for the bathroom might be long, so make sure that you have enough time to spare.  Many longer races have bathrooms located along the route.  ", " Warm up with by jogging for about 10-15 minutes. Warming up is essential for getting your muscles ready to run efficiently, as you want to begin the race ready to run your best. A quick walk and light jog sequence will warm you up well.  If it’s cold out, you may want to spend a little longer warming up. Doing your regular pre-running stretches during this time will also help your muscles to stretch and warm up. Even if you’re feeling very warm, try your best to keep pants and a shirt on over your racing outfit while you’re warming up. It’s actually ideal to be sweating a little when you shed your outerwear and get on the starting line.  ", " Head to the start line 15 minutes before your start time. Make sure that you have plenty of time to spare, and that you don’t feel rushed or stressed before the race, and this could harm your running. Having enough time to take in your surroundings and your fellow athletes will also help. This is a great time to do dynamic stretches and stride-outs to finish warming up.  "]}}, "How to Dress Well for a Running Race": {"description": "How you dress for a running race can make a big difference on your performance. If you run regularly or are just starting out, your needs are the same: comfortable clothes in the right material, appropriate shoes, and dressing for the weather. There are not many differences between the clothes you regularly run in and race-day clothes, but a few tips can make your race more comfortable, and hopefully make you more competitive!", "content": {"Getting Your Basic Gear": [" Invest in lightweight, technical clothing. When you race, your clothes should not weigh you down or restrict your movement. Technical running clothes are the most lightweight and least restrictive. Technical clothing will also wick sweat away from your body, so it stays light and dry.  You can get shorts, long and short sleeve t-shirts, pants, tights, running skirts, bras, jackets, socks, hats, and gloves in these materials. Avoid running races in cotton clothes. These can get heavy and damp with sweat and rain.    ", " Find a supportive sports bra. A supportive bra will limit the movement of your breasts. This will help you run more comfortably. It will also prevent stretching of the Cooper’s ligament, which causes your breasts to droop. Your bra should cover your entire breast and hold it firmly in place.  Sports bras come with a shelf that holds both breasts or with cups that hold each breast separately. Cups are more supportive. Racerback bras provide strong support because they pull the bra close to your body. Find a smaller bra if the band pulls away from your body or if it rides up when you lift your arms. If the band rides up in the back, the bra is too small.  ", " Opt for running socks. Running socks are a good choice for racing. These socks do not have seams, which can cause blisters. Some running socks have double layers that can also prevent blisters. Others have padding on the soles for comfort. Socks with double layers might shrink significantly in the wash. Padded socks can get very warm. You can find very thin running socks in technical materials to help you avoid sweaty feet.  ", " Stay cool in the heat. You should wear minimal clothing in hot weather. Shorts and a short sleeve t-shirt or tank top are the basic clothes for hotter temperatures. Men can wear light-weight shorts that have a built-in brief. For women who want to cover more, there are running skirts and capri-length tights.  You may chafe more in hotter weather. Wear longer shorts or a sports bra with wider sides to prevent chafing.  ", " Layer in the cold. Dress in layers for races in cold weather. Thin layers are better than one heavy layer because heat will stay trapped between layers. You will warm up as you run, so dress for slightly warmer weather. You can also remove layers as your body heats up.  Start with a warm base of snug-fitting tights and a fitted long sleeve t-shirt. The next most basic layer is a shell or jacket. If it is windy, add a layer of wind-resistant pants. In freezing temperatures, wear a hat or thick headband, gloves, and neck warmer or balaclava.  Cover exposed areas with Vaseline to avoid frostbite. Layer your socks.  ", " Race comfortably in the rain. You can race comfortably in the rain with a few good wardrobe choices. Choose lightweight technical clothes that will not get heavy from sweat and rainwater. Wearing tighter clothes will help prevent your wet skin from chafing. Just make sure your clothes are not too tight or you may chafe even more. Wear a visor or baseball cap to keep water out of your eyes. Bring an unused trash bag with you and then cut holes in the bottom and sides. You can wear the trash bag like a poncho and it will help to keep you dry. Wear your thinnest technical socks so they don’t become heavy with rainwater.  "], "Choosing Running Shoes": [" Get the right fit. You want to make sure that your shoes fit properly and are comfortable. This will prevent injuries and blisters. Try on several pairs and run around the store to test the fit. Some specialty stores will even let you test them outside.  Be flexible about sizing. Shoes sizes can vary between manufacturers or even between models made by the same company. Your feet swell when you run, so try on shoes at the end of the day when your feet are more swollen.  Find shoes with a little space in the toe box, so they do not rub and form blisters or black toenails.  Heels and laces should fit snuggly, but neither should be tight.  ", " Choose a supportive shoe. The way your foot falls when you run can tell you how much support you need from your shoe. If your foot falls inward, choose a supportive shoe. This will help stabilize your body and can prevent knee pain and injury.  You can tell that your foot falls inward when you run if your arches and the insides of your knees tilt inward when you bend your knees. A firmer midsole provides more support.  ", " Look for a flexible shoe. If your foot rolls outward when you run, your weight is concentrated on the outside of your foot. This means your foot does not receive much natural cushioning when it hits the ground. Find a shoe with a very cushiony, flexible sole that will balance your weight.  The soles of your shoes will show more wear at the outside of the foot if your foot turns outward when you run.  ", " Find a shoe that can absorb impact. When you run, you land on your feet with a force greater than your body weight. This can make your legs tired and lead to injuries. Run in a shoe with extra cushioning in the sole.  Be sure that the shoe allows easy flexing in the ball of your foot. Super cushioned shoes provide more shock absorption.  ", " Select your shoe based on the type of race. You should also select your shoes based on the types of races you run. If you run on trails or in slick conditions, find a shoe with more traction. Look for a shoe with a highly breathable mesh upper if you run in the heat. In a rainy climate, you might prefer waterproof shoes. ", " Break them in. Do not run a race in new shoes. On race day you want to be sure that your shoes are comfortable and properly supportive. If you plan to buy a new pair of shoes for the race, run in them for a few weeks before the race. You will want to break them in even if the new shoes are a model you have raced in before.  "], "Accessorizing for Your Race": [" Grab your water bottle. Run with a water bottle to stay hydrated during your race. This is important in any kind of weather. Water bottles with hand-straps, runners’ belts with water bottles, and CamelBaks are designed to make carrying your water easier.  You can also place water bottles along your route. Most races have stations where runners can grab a cup of water, but you may want to check in advance to be sure. If the race does not have water stations, then you will need to bring your own water for the race.  ", " Secure your hair. Hair that flies around can be distracting during a race. Headbands, ponytails, and clips keep hair off of your face and out of your eyes. For longer hair, find a ponytail holder or braid style that will keep your hair in place.  Keeping hair out of your eyes helps with your visibility. A ponytail or braid also keeps long hair off of your neck, which can get uncomfortable and sweaty. A slipping ponytail or braid can be a distraction. If your hair is long and the ponytail is heavy, then this may also lead to problems, such as neck strain. Make sure your hair is comfortable and will stay in place.  ", " Take your technology. Runners accessorize with all kinds of electronic gear. Headphones and watches are common gear for races. The best headphones for running are waterproof, light, and comfortable, with a secure fit. Watches help runners keep track of time, show different splits for intervals, and can even come with GPS.  All of the technology you race with should be lightweight and comfortable so it does not distract you.  ", " Apply sunscreen. When you are running outdoors, it is important to protect your skin from the sun. Make sure to apply an SPF 30 or higher water resistant sunscreen about 15 to 20 minutes before the race begins. Apply the sunscreen to any areas of your skin that will be exposed to the sun. This will help to protect you from getting a sunburn while you are running. Use a lip balm with SPF protection as well.  ", " Use a lubricant to prevent chafing. Some areas of your body may chafe and this can cause discomfort. To prevent chafing in sensitive areas, apply a bit of lubricant, such as Vaseline or Body Glide. Some areas that may be susceptible to chafing include: Nipples Feet Testicles  "]}}, "How to Run a One and a Half Mile Race": {"description": "Do you find yourself trudging behind all the other competitors in a mile and half race? This article will show you how to improve and, with enough practice, make it to the top three!", "content": {"Steps": [" Make sure you have a schedule planned. For example: Monday- 3 miles (4.8 km) on the trail, Tuesday- 2 miles (3.2 km) on the bleachers, Wednesday- mile run and weight-lifting, Thursday- timed mile, Friday- condition for meet, Saturday- run your heart out!, Sunday- rest, do 200 crunches minimum.  ", " Follow your schedule strictly, do not become lazy as this will only hinder your goal in making it to the top three. Do not skip a day of training and make sure it varies. ", " In the actual race, start at a pace fast enough to keep up with the first group, but not so fast that you are sprinting.  ", " Try to maintain a good pace, only speeding up in the last two laps. You should not let too many people pass you, especially near the end of the race. The fifth lap (or after 1.25 of a mile) pass the majority of people in the first group. ", " Sprint as fast as you can for the last lap, speeding up to 100% in the last 100-200 metres. You should be so tired you cannot speak! "]}}, "How to Participate in a Themed Race": {"description": "Themed races, also called “fun runs,” have risen in popularity in recent years. At a themed race, there is often a fun theme or idea that you participate in during the race, such as eating donuts while you run or getting splattered with colored powder. Themed races can be a good way for you to raise money for a worthy cause and get some exercise, even if you are not a professional runner or athlete. To participate in a themed race, you should first select a race that fits your needs and that appeals to you. You can then dress appropriately for the themed race so you are ready to run and have fun on race day.", "content": {"Selecting a Themed Race": [" Search for themed races in your area. Start by looking for themed races that you can participate in on a local level. Maybe there is a themed race in your city or a race a few hours away in a different town. Look online for themed races that are coming up and still open for registration. You may also go for themed races that are popular on a national level and decide to travel to participate in the race.  For example, the Color Run is a 5k themed race that has spread to 50 states. You may search for a Color Run happening in your town or city and sign up for it.   ", " Support a particular cause. You can also select the themed race based on the cause it is raising money for. If you are passionate about a particular cause, you may go for a themed race that will raise funds to support the cause. Many themed races will donate a portion of the proceeds from the run to a charity or nonprofit organization.  For example, you may pick a themed run that supports breast cancer research or research on ALS. Or you may pick a themed run that raises money for local homeless shelters or for afterschool care programs in your area.  ", " Choose a race based on theme. Look for a themed race that has a fun theme or idea that you want to experience. Maybe you have always wanted to get splattered with colored powder while you run or you want to try to eat donuts or hot dogs while you are running. Go for a themed race that will be entertaining and allow you to try something you’ve never done before.  You may look for a themed race that supports a cause you believe in and that has a fun or exciting theme that you are into. Having both elements could make running the themed race feel worthwhile. Try picking a themed race that feels festive and appropriate for the time of year, such as a holiday themed race. This could be the Santa Claus themed run or a Thanksgiving themed run.  ", " Select a race based on the degree of difficulty. Some themed races will be longer or more strenuous than others. If you are new to running, go for a themed race that is short and easy. Races that are 5 kilometers (3.1 mi) and under are often ideal for beginner runners. If you are a more experienced runner, try a more challenging themed race, such as a 10 kilometer (6.2 mi) or 20 kilometer run.  Most themed races will note if they are meant for beginner racers or new runners. Often, themed races are tailored to runners who are less experienced.  "], "Dressing for the Themed Race": [" Choose a costume to fit the theme. To get into the spirit of the themed race, pick a costume. Wearing a costume that fits the theme of the race will make the experience more fun and help to promote the race online and on social media. Go shopping for a costume or make your own at home. Making your own costume can be a fun way to get creative and have fun with the theme of the race.  For example, if you are participating a themed superhero race, you may dress up as your favorite superhero or make up your own superhero costume. If you are participating in a Thanksgiving themed race, you may dress up as a turkey or have other Thanksgiving related images on your clothing.  ", " Get dressed as a team for the race. Some themed races allow you to participate in the race as a team. To make the event more fun, you and your team can get dressed up together. Maybe you make up a team name and choose team colors to wear for the race. Or perhaps you all pick a team mascot and dress up for the race by wearing shirts with the mascot.  For example, the Tough Mudder themed race allows you to compete in teams and encourages participants to dress up together under a team name or theme.  ", " Wear comfortable running shoes. Though themed races are often centered around having fun and running for a good cause, you should still be prepared to race. Make sure you wear comfortable running shoes and comfortable running clothing.  If you are wearing a costume to the race, make sure you are still able move comfortably while you run. Try combining the practical elements of running with the more fun elements of a costume. This way, you can still compete well in the race and have fun.  "], "Participating in the Themed Race": [" Register for the themed race. Many themed races require you to register in advance so you have a spot on race day. Sign up for the race online through the race’s website before the deadline. Call ahead of time to reserve a spot for the race. If you are competing as a team, make sure you register your team for the race before the cut off date so you can all participate.  Depending on how large the themed race is, the deadline for registering may be strict or a bit more lax. A local themed race with a small number of participants may allow you to drop in and participate rather than sign up. A bigger themed race with hundred or thousands of participants will likely require you to sign up in advance.  ", " Raise money for the race. If you are running a themed race to raise money for a worthy cause, do your fundraising before race day. The themed race organizers should give you a fundraising packet or an online donation page that you can use to help raise money for the race. You may have a target amount of money you would like to hit or leave it open and encourage loved ones to donate as much as they can.  For example, you may have a target amount of $500 that you would like to raise for the themed race. You may then promote the themed race on social media and direct friends, family, and loved ones to your online donation page or the themed race’s website to make a donation in your name.  ", " Show up early on race day. Try to arrive 15 minutes to 30 minutes early on race day to prepare. Make sure your costume is secure. Stay hydrated and eat a good meal before the race so you have enough energy to run. If you are racing with a team, confirm all of your team members are present before the race begins.  You may also want some time to snap pictures of the other participants in the themed race, especially if there are a lot of fun costumes. You can then promote the themed race on social media and share the images with friends and family.  "]}}, "How to Complete the Race for Life": {"description": "Race for Lifeis a 5 kilometers (3.1 mi) race which takes place in various locations across the UK. The aim of the race is to raise money for cancer research.", "content": {"Steps": [" Visit the Race for Life website to find races near you. Don't be discouraged if none are listed yet. Just check back at a later date.  ", " Sign up for the race you want to take part in. This can be done on the website by following a simple form. You can enter on your own or as a team. ", " Develop a training program, as 5 kilometers (3.1 mi) is a long way if you are not used to it. You can train on your own or with friends. ", " Get your running kit sorted out. You should have a good pair of trainers and loose fitting tops and trousers. Also, remember to buy safety pins so that you can attach your name tag onto your clothing. ", " Raise sponsorship money. Ask your friends and family to sponsor you. ", " Make sure you have arrangements to get there and back on the day. If you can, share a lift with somebody else as the venues can get quite crowded and parking can be a nightmare! ", " Once you get to the race, warm up. There is usually a group warm up but you can do your own warm up exercises if you choose. ", " Get into place to start the race. Make sure you are in the correct section as runners will be in a different place than walkers. ", " Run the race! All that hard work and training is about to pay off. ", " Once you have finished the race, remember to collect sponsorship money and send it in.  "]}}, "How to Win at Horse Racing": {"description": "Horse racing is one of the only sports that allow fans to participate in the game directly, through wagering. Millions of dollars are bet each day on races in North America, enticing players to put their handicapping skills to the test. It truly is an art form, and getting great at it will take time – but it may pay off.", "content": {"Decoding the Racing Form": [" Hone your handicapping skills. Handicapping is the process of determining which horse has the best chance to win a race. It is a test of your creative intelligence, not systematic computation. To do this, you’ll need the Daily Racing Form, which you can buy upon entering the track. The DRF is full of a whole bunch of stats and figures, which we’ll be discussing below. Once you know how to decode the racing form, you’ll have a pretty good idea of which horses will (or at least ) do well.   ", " Look at the Beyer Speed Figures. Beyer numbers often serve as a starting point in the handicapping process. They are the bold numbers found in the middle of each DRF, indicating the horse's past performances. Handicappers often use the horse with the highest last-race Beyer as their focus and eliminate horses that have never run a figure close to this horse's figure. There are two numbers: pace and speed.  . By scanning the past performances, handicappers try to estimate the pace of the current race and determine which horse will benefit most from it. The first bold-face number, pace, shows whether the horse likes to be on the early lead or not.  This is not the same as pace. Speed (the 2nd bold-faced number) shows the horse’s ability to pass other less-speedy horses as they near the finish line. Speed does not equal consistency (which pace can).  ", " Look at that race’s distance. Distance is one of the biggest factors when it comes to betting. If you’re looking at a horse that tires out around six furlongs and you’re at the Belmont Stakes where it’s a whopping furlongs, you probably don’t want to bet that horse. How has your horse run in other races of this similar length? Distance, pace, and speed are very powerful in tandem. Looking at how your horse runs (and, as importantly, how she finishes) in different distances will clue you in to how she’ll perform in races of different lengths.  ", " Take into account the track and the weather. This is called “track bias”: no single factor in handicapping can change the complexion of a race like a track bias. If wise bettors detect any kind of bias in the racing surface, they incorporate it into their decision-making. What is track bias? Every horse has their preferred surface, whether it’s turf or dirt. You want to know how your horse will perform on whatever your track is. Don’t forget the weather! A little rain quickly turns that dirt into mud. Take into account how your horse has performed in this type of weather, not just the type of track.  ", " Consider “form cycles. ” Handicappers must ask themselves questions about each horse. Is her last race a true representation of her ability? Is she likely to improve or regress on race day? Which horses raced against a bias last out and can be expected to offer a peak performance today? Horses, just like humans, are never 100% consistent. One thing to consider is the size of the purse and where the horse is coming from. If the size of the purse is large, this is one classy horse – she’ll probably be pretty consistent (she didn’t get to the big leagues for nothing). And if she got flown in from somewhere, her owners paid a pretty penny to get her there, so they’ll probably break out all the stops to see her win.  ", " Look at the horse’s post position. In the list of the horse’s previous races, you’ll see her previous post position. Sprint races around one turn usually favor outside posts, while route races (races with 2 turns) at longer distances often favor inside post positions. What’s this race? And what is your horse’s post position? Has she run a race like this in the past and done well? You may want to consider other horse's post positions, too. If a certain horse seems to be speedier on the inside and for this race is on the inside, this horse will be serious competition.  "], "Placing Your Bets": [" Get familiar with your track, the tracks being simulcast, and get your papers. With your umbrella and binoculars in hand, get going to your track. Step out onto the track before the races begin – what’s it like? Find the bettor’s window, and sit down to read your DRF. There are a few other pieces you can get for purchase, too:  ’’A racetrack program.’’ This has information on all the horses, jockeys, trainers, and owners. The cost is usually $3. ’’Public handicapper selections.’’: If your racetrack or OTB (off-track betting) is covered by the local newspaper, they may pay a handicapper to make daily horse selections. The cost is usually 50 cents. ’’Handicapping tip sheets.’’ These are daily selections published by handicappers at the racetrack. The cost is usually $2.  Tracks often simulcast from other tracks, too. This means you can watch the races live in one track and watch ‘’and bet on’’ races at other tracks being simulcast on TV. Imagine the bank you’d make if you won both!  ", " Buy a Daily Racing Form. This form is the most important weapon in a handicapper's arsenal. It provides detailed information on each horse running in the day's races. It costs $4 at most race tracks and is outlined in the above section. At first glance, it’s quite intimidating – but once you learn what all the numbers mean, it’ll be your best friend.  Give yourself some extra time to sit down and study it. As you get better and better you'll need less and less time, but for now work at least a few races in advance. Being patient and doing your homework will increase your odds like little else.  ", " Familiarize yourself with different types of bets. When you go up to window, you need to know what you want! Here are your basic options: Show – your horse can get 1st, 2nd, or 3rd and you win Place – your horse can get 1st or 2nd and you win Win – your horse must get 1st to win Quinella – bet 2 or 3 horses to finish 1st or 2nd, in any order Exacta – bet 2 horses that must finish in 1st and 2nd in exact order Trifecta – bet 3 horses that must finish in 1st, 2nd, and 3rd in exact order Superfecta – bet 4 horses that mush finish in 1st, 2nd, 3rd, and 4th in exact order  ", " Know your odds and payouts. Let's say you bet $2 on a horse to win (which is the standard minimum bet). To determine how much you would win if she wins, take the odds of your horse and multiply the first number by 2 (your bet), then divide that by the second number, and then add $2 (again, your bet).  Let's say your horse has 3/1 odds. You multiple 3x2 to get $6. Divide that by 1, which is still $6. Then you add $2. You would make $8 on a $2 wager. Let's take a bet where lots of people are betting, like on a horse with 1/9 odds. You multiply 1x2 to get $2. Then 2/9, which is about 20 cents. Plus $2, and your winnings is $2.20.  ", " Consider each horse’s individual characteristics. After you’ve gotten down all the big numbers, you also want to look at other tidbits of information in the DRF. There’s some information on there about each horse that can give them the edge to win. Consider: If a horse was recently claimed, or bought. If someone is willing to shovel out a chunk of change for a horse, they probably have potential. If there are any recent equipment changes. The owner is zeroing in on how to improve their horse's chances. Look at her workout speeds. Are they consistent? If she's running at the same speed every day, she's probably in top form. Consider the gender and breed. Generally speaking, males are faster than females. Only three fillies (females) have ever won the Kentucky Derby, for example. And better-bred horses will outperform others, too.  ", " Consider working out of two pockets. Any good bettor sometimes bets big and sometimes bets small. To keep yourself going and to keep from being bored between races you're very excited about, have a smaller pocket to work out of. You'll be $2 here, $2 there, and then when that big race comes up, you'll turn to your other pocket, and bet $20. Betting, quite frankly, in any arena, can be dangerous. It's always important to know when to stop. Having 2 separate pockets can help you keep your head above water, too.  ", " Place your bets at the window (and later collect your winnings). Remember this order: racetrack, race, dollar amount, bet type, horse number. So when you walk up to the window to talk to an actual human, this is the formula you follow. Here's an example: \"At Saratoga, I'd like to bet on the 5th race – a $4 exacta on horses 3 and 7.\" Make sure to do this the 5th race, of course. Check your ticket before you leave the window, just to make sure it's correct.  The racetrack is specified as many tracks are likely simulcast at the track you are currently in.  "], "Improving Your Game": [" Track your own records. Just like you would if you were playing poker, keep track of your own performance. Where do you seem to be making assumptions that aren't correct? What tidbits are you missing, resulting in betting on the wrong horse? What are you strong points? Knowing how you bet can help you overcome any personal weaknesses, too. When you go to the track, bring a pen and paper with you or a type of scorecard, just like avid fans of other sports do. Keep track of the results in addition to how you bet to jog your memory later. Establish what types of bets produce the highest returns for you and make them the focus of your wagering. Determine what types of races you have the most success with and which you can't decipher. If you conclude that you seldom pick winners on turf, avoid betting on grass races until you improve your handicapping.  ", " Read books on the subject. You don't have to depend all on your own ingenuity and ability to see outside the box – this is a very established field, so take advantage of it. Read reputable books about the art of horse racing. Knowing the strategy behind it like the back of the hand is one of the best things you can do for your odds. Of course, a lot of what's out there is just a giant scam to get your money. Research the author and preview the book before purchasing. Some people are out to make a dollar however they can.  ", " Attend workshops or seminars. Some tracks hold monthly (or even more regularly) seminars or workshops on horseplaying. They'll be full of tips and tricks, where you can meet other aficionados, too. To find this information, just inquire at your track. You're likely get put on an email list for their newsletter that will be full of the necessary information.  ", " Bet with friends. There's such a thing as a \"parlay bet\" and it can make betting on the horses even more fun. If you're with a group, get everyone to chip in, say, $5. Then, each person picks 1 horse to show on a certain race. Place the first bet, and then if you win, place the next bet including the winnings. If you hit a streak, that $5 can add up very quickly. Make sure the winnings (and the losses) get split evenly. Have everyone agree to a basic set of guidelines before participating in any betting. Some people may argue that they won while others lost – establish protocol before this happens.  ", " Become a high-roller in the National Thoroughbred Racing Association’s annual National Handicapping Championship. Of course you have to qualify, but if you do you could win $1 million dollars. To get to this level, this basically has to be your job. But don't quit your day job just yet! Again, any type of gambling can be dangerous. Try to set yourself a limit – if you hit that point, you'll walk away. It's to easy to get into trouble in situations like this; always be looking out for yourself. Remain dispassionate when betting. Increasing the size and scope of your wagers to try to recoup losses often only results in more losses. Even the best horse players sometimes lose; they accept it as part of the game. What winning horse players don't do is wager recklessly when their emotions get in the way.  "]}}, "How to Win in a Sprinting Race": {"description": "Achieving first place in a track & field sprint requires not only being faster than other competitors. Other things are required for you to receive the gold medal.", "content": {"Steps": [" Train hard mentally and physically. The worst thing that could happen to even the fastest runner is when he or she suddenly feels less confident, is stressed out, gets out of control, etc. As well as jogging and stretching daily, sleeping well, and eating good food, try exercising your mental aspects by meditating, viewing appropriate media, socializing more, etc.  ", " Have good sportsmanship. Practice sportsmanship before, during, and after a race. Treat others the way you want to be treated. ", " Set yourself up in a good position at the starting line so you can start ahead of the others. See how to position your body in the Tips section below. ", " Remain focused. While running, stay focused at what's ahead of you (the remaining distance and the finish line). Swing your arms hard, directly forward and back, enough to give yourself momentum. Move your legs fast and far apart. If you look towards the audience/onlookers or anyone behind you, you will lose your focus on what's ahead of you. ", " Celebrate after you cross the finish line. Whether you are in first place or not, don't stop running all of a sudden. You may accidentally get hit by anyone that may be behind you, or you would injure your legs from \"braking\" too fast. Gradually slow down once you pass the finish line, from a run, to a jog, and finally to a walk. "]}}, "How to Increase Your Chances of Winning a Freestyle Swimming Race": {"description": "Many people would like to win races and competitions. There are many factors involved in winning a swimming race. Doing well in a race requires training, dedication, and confidence in yourself. If you have already mastered the basics and want to try going to a race, then this wikiHow is for you!", "content": {"Practicing for the Race": [" Learn the basics of the freestyle stroke. Freestyle usually means doing front crawl. In order to do front crawl, follow these steps: First, This is how your legs will move during freestyle. Point your feet and move them up and down in a pattern just below the surface of the water. Next, learn what to do with your arms. Position one hand in front of you and one hand in back. Move both hands in a circle, front, then back again. Lastly, know how to breathe during the stroke. Generally, you breathe to the side during freestyle. When one hand is in the air during the circle, the other hand should be cupping down in the water. During this time, breathe the opposite direction to your hand. You should generally breathe every 2-3 strokes.   ", " Practice as often as you can. Practicing will make you ready for the race. Try to swim freestyle as often as you can while you practice. Practicing more often will help you to master the stroke. Don't practice too much in the days directly before the race or you could be tired for the race.  ", " Prepare for certain conditions. Race conditions are different than lap swimming. These steps will help you to prepare for the race:  This will give you the momentum to start the race.  As soon as you enter the water, you should do at least 3 dolphin kicks to propel you back up to the surface. To do dolphin kicks, bend your legs and move your body in a wave-like fashion.  if you'll be swimming laps during the race. A quick summary of how to do a flip turn:  Once you reach the wall, use your hands to propel you forward. While turning, be sure to touch the wall to mark that you have completed the lap. When done turning, your head should be facing up. Kick off the wall and rotate your body so that you are on your stomach. Be sure to breathe out while doing the flip! Prepare for a fast start. Most people will start off very fast in a race. You should prepare for this. You should also practice jumping off a diving board as far as possible. At the end of the race when most people get tired, you should keep going and end it as fast as possible. In order to train for the ending, try swimming or running for a long distance. This will help your stamina. Practice touching the wall in order to mark your placing. This is very important. Touch it as soon as you reach it. It helps to keep straight arms to touch the wall, rather than taking another stroke. On your last stroke, don't breathe. Simply pull and touch the wall.  ", " Improve your technique. Technique is important as it will let you swim without getting too tired. The following tips will help to improve your technique: Breathe sideways. Don't breathe by lifting your head forward first. Always breathe to your side. Roll your body sideways a bit every arm movement you make. This will keep your hips from falling. When in the water, breathe out. That way, you won't have to breathe out when you're lifting your head out of the water! Simply, breathe in when your head is sideways out of the water, and breathe out while your head is in the water. Learn to take a breath every third stroke. Every third stroke you make with your arms, take a breath to the side. Basically, the next breath you take will always be on the opposite side than your current side. This is called bilateral breathing. Don't look at the bottom of the pool or forward either. Look at the middle of those two. Use strong kicking. A good kick will keep your hips from falling and therefore is important. Try doing leg strengthening activities. Improve your pulls (arm technique). Arm technique is one of the most important things while swimming freestyle. Practice using straight arms then curved arms. See what works for you. Make sure to spread your fingers apart a little. They shouldn't be clumped closely, but they shouldn't be too far either.  ", " Train efficiently.  Stretch before and after practices. Work on your weaknesses. For example, if your technique is good but you don't have enough stamina, try swimming long distances to build stamina. Practice with a buddy if you wish. This can help motivate you. End all your practices with stretching. This will keep you flexible and reduce injuries.  ", " Know that it will all be worth it in the end. In the end, everything is based on how well you practice. Know that your hard work will surely pay off! Have a positive mindset while practicing. Know that you can do this! Try to enjoy all the practices.  "], "Being Healthy": [" Eat nutritious foods . When you're feeling healthy, you'll be able to show your best in the race. You must get enough of every vitamin and mineral. The following foods will help you get a variety of nutrients: Avocadoes. This great fruit has a lot of essential minerals that will improve health. It also tastes creamy and buttery! Different kinds of fruits. Many fruits are beneficial to your health. Some examples are apples, pears, grapes, oranges, and kiwi. Vegetables. These can include broccoli, spinach, and beets. Meats and protein. Some good foods in this category are beef, salmon, and pork. You may want to limit red meat.  ", " Sleep well every night . Make sure to get at least 8 hours of sleep, as then you'll feel fresh to practice every morning. Go to bed and wake up at the same time each day. This will help you to get used to the schedule and can prevent sleep issues. Make your bedroom cozy to sleep in.  ", " Keep hydrated. Water is essential to your health. Keeping hydrated will improve your overall health, especially when training. Keep a water bottle with you at all times.  ", " Steer clear of sugars and energy drinks. They can cause many health problems , and eating too much sugar can even cause diabetes. Sweet fruits are a great alternative to sugars. Drink water instead of energy drinks.  "], "Swimming your Best the Day of the Race": [" Get a good sleep the night before. This is crucial, as then you'll be bright in the morning and ready to go. In the morning, try to wake up as fast as possible to get ready for the day. You don't want to be late for the race!  ", " Eat a nutritious breakfast. Breakfast starts your day off right and gives you fuel for the day to come.  Try having oatmeal with fruits along with some orange juice. Choose whole grains if you want to eat cereal.  ", " Get to the race on time. Remember to bring essentials, such as a swimsuit, swim cap, and goggles. These will help you to perform at your best. Don't rush too much, as that can affect your race.  ", " Start the race! Kick off the diving board/wall as fast as possible and perform your dolphin kicks which will fuel your whole race. Start to swim the stroke at the best pace to last the whole race. Refrain from swimming too fast at the beginning, as you don't want to tire out near the end. Make sure to start swimming at the right time, as you don't want to get disqualified for a false start!  ", " Swim as you normally would during the race. Now that you have trained and mastered the freestyle stroke, swim naturally exactly how you have practiced it. Use the same techniques and move gracefully forward. Don't look at the other competitors and how they are doing as this will distract you from swimming. Swim as fast as you can even if you're tired.  ", " End the race as fast as you can. Know that this is the race you spent a lot of time preparing for, and give it your best shot. Know that the end is near and finish it off gracefully. It will pay off in the end! Sprint to the finish line and hit the board to mark your time and placing.  ", " Have good sportsmanship! If you didn't win, congratulate the winner. If you won, avoid bragging too much and win gracefully. Know that you did your best and that there's nothing to change that. "]}}}